{"document": {"bbox": [1368.71, 248.21, 1836.97, 982.72], "bbox_id": "e93f0023f9", "file": "AppomattoxNewspapers_1926-1933a_0376.pdf", "page": 1, "text": "youre going to be modeto see the llM E S -V IK G I N I A N It might be remarked that no- bo.iv dissents from the propo sition that aliens should be counted for the purpose  f the census. Among senators who strong ly urged the unfairness of counting aliens in the ascer tainment of congress district populations was Senator Ty son, of Tennessee. He quoted at lengthj from Mr. Tuckers house address. In introduc ing these quotations, Senator Tyson said I would not Have had the temerity to present this mat ter to the senate but for the fact that I took up this matter with the Hon. St George Auck- er, of Virginia, a member of the house of representatives, who is considered one of the greatest constitutional lawyers of the country, a man who is looked upon in the house as perhaps the outstanding con stitutional lawyer in that body. After concluded the quota tions, Senator Tyson added Mr. President, I have read ex tracts from the address ofRep- resentative Tucker, who is, I know, one of the greatest con stitutional lawyers in the United States, and it is his con sidered opinion that the aliens in the United States should not be counted for the purpose of apportionment of represen tatives. Senator Sackett, of Kerf-  tucky, also made similar use of the Tucker speech and ex tolled the Virginian as one of the nations foremost author- ties on the constitution. Though it does not appear in the record, it is a fact that Senator Moses, Republican, of New Hampshire, approached .Mr. Tucker some time ago and asked him to give him the benefit of his opinion on the question.  This led Mr. Tuck er into an. examination of the constitution, and finally to the preparation of of the speech. It is probable that congress will not heed the Tucker argu ment.. But it is undoubtedly a fact that the address has en gendered doubt in many minds and the debate on the bill is appreciably lengthened in con sequence. Until this measure and the farm bill are out of the way, the administration lead ers ftll not dare to agree to a summer recess."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of represen tatives. Senator <mark>Sackett</mark>, of Kerf-  tucky, also"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of represen tatives. Senator <mark>Sackett</mark>, of Kerf-  tucky, also"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [461.05, 539.81, 600.6, 893.69], "bbox_id": "fb5516c5a2", "file": "AppomattoxNewspapers_1974-1975a_0246.pdf", "page": 1, "text": "years, delights in telling her i story of the surrender which , took place here April 9, 1865, j just 77 years ago Thursday. Aunt Millie, quaint, timid, and full of interest in her white and negro friends, was active for her age until last spring when she was struck by a bolt of lightning while in bed. She now walks with the aid of a eane, keeps house for her only son. Uncle Bob Craig, who has served as janitor at Appomattox High School for several generations. Aunt Millie was 13 at the time of the surrender and was the nurse maid of Charlie Sackett Peers, six month old son of Mr. and Mrs. George T. Peers. Mr. Peers was at the time clerk of the Court of Appomattox and was living near the scene of the surrender. I was walking de floor, patting my baby to sleep, when those yankee soldiers came bustin in Marse Georges house. The soldiers hollered for everybody to leave de house cause the worst battle ever fought was starting right den. Marse George fetched Miss"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "nurse maid of Charlie <mark>Sackett</mark> Peers, six month old"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "nurse maid of Charlie <mark>Sackett</mark> Peers, six month old"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.74, 205.09, 1000.52, 444.58], "bbox_id": "640bcc5a5d", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "Wm. A. Moses true bill. Ann Maria Wheeler  true bill. Alexander Christian  not a true bill. Will of Mrs. L. A. Owen admitted to record. A. H. Clement on motion allowed  to practice the law in this court.  F. W. McKinney qualified as con stable for Clover Hill district, with J. W. McKinney. C. II. Sackett, and Geo. T. Peers as suretiesbond  2,000 D. P. Ferguson, Overseer Poor m Clover Hill district, qualified, with w S. L. Ferguson as surety, bond 500. Fnris, O. W. Blanton, ir., W. _. W. II. Ligon, Supervisor for  Jackson, B. A. Wilson, W. A. W Clover Hill district, qualified with S. C. Stratton as surety, bond 1,000. S. C. Stratton, Supervisor for"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "W. McKinney. C. II. <mark>Sackett</mark>, and Geo. T. Peers"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "W. McKinney. C. II. <mark>Sackett</mark>, and Geo. T. Peers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1710.67, 1216.32, 1954.97, 1758.41], "bbox_id": "83a489b13b", "file": "TimesVirginian_1976_0053.pdf", "page": 1, "text": "WILLIAM S. ADAMS Retired B. C. BALDWIN, JR. Attorney, Edmunds, Williams, Robertson, Sackett, Baldwin  Graves W. H. BURRUSS, JR. President, Burfuss Land  Lumber Company R. A. CARRINGTON, III President, Consolidated Shoe Company ALVIN R. CLEMENTS President and Chief Executive Officer, Fidelity American Bankshares, Inc. E. R, ENGLISH, SR. President, Englishs, Inc. JAMES B. FOREHAND, JR. President, J. B. Forehand and Company, Inc. T h o m a s r . gla ss Co-Publisher, The News and The Daily Advance LEWIS B. GOODE, JR. President, Fidelity National Bank WILLIAM M. GREENWOOD Wiley  Wilson Consulting Engineers  Architects C. LINWOOD HOLT Executive Vice.President, Marks-Reunions Company, Inc. MINNIE BASSETT LANE Domestic Executive MAURICE R. LARGE Andrews, Large  Whidden, Inc. ROBERT S. LOCKRIDGE President, Craddock-Terry Shoe Corporation V. J. LUSARDI President, H  L, Inc. JAMES E. McCAUSLAND Partner, Snead-Pavne  McCausland, Inc B. FRANKLIN MOOMAW, JR. President, A. B. Burton Company, Inc. W. H. OVERBEY Attorney, Overbev and Overbey WILLIAM S. PATTERSON Investments NANCY B, POLLOK Vice President  Senior Trust Officer, Fidelity National Bank GEORGE M, SPAULDING President, Spaulding. Lumber Company C. RAINE S.YDNOR Retired President, James A. Scott Insurance Company W. RO LAI WALKER Kenbridge Construction Company, Inc., Kenbridge Manufacturing and Supply Company, Inc. KENNETHS. WHITE Attorney, Edmunds, Williams, Robertson, Sackett, Baldwin  Graves"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin  Graves W. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin  Graves W. H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1360.51, 1060.08, 1504.15, 1155.51], "bbox_id": "e9492766a5", "file": "AppomattoxNewspapers_1926-1933a_0452.pdf", "page": 1, "text": "What prohibition laws have he Republican party of Virginia ver given you ladies? Grati- de to your Democratic party our saving grace if nothing ore. H. M. Sackett"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "What prohibition laws have he Republican party of Virginia ver given you ladies? Grati- de to your Democratic party our saving grace if nothing ore. H. M. <mark>Sackett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "What prohibition laws have he Republican party of Virginia ver given you ladies? Grati- de to your Democratic party our saving grace if nothing ore. H. M. <mark>Sackett</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1351.65, 1041.84, 1495.01, 1137.59], "bbox_id": "071154358e", "file": "AppomattoxNewspapers_1908-1909a_0452.pdf", "page": 1, "text": "What prohibition laws have e Republican party of Virginia ver given you ladies? Grati- de to your Democratic party our saving grace if nothing ore. H, M, Sackett"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "What prohibition laws have e Republican party of Virginia ver given you ladies? Grati- de to your Democratic party our saving grace if nothing ore. H, M, <mark>Sackett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "What prohibition laws have e Republican party of Virginia ver given you ladies? Grati- de to your Democratic party our saving grace if nothing ore. H, M, <mark>Sackett</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2028.68, 1129.93, 2244.4, 1225.83], "bbox_id": "018e57b420", "file": "TimesVirginian_1978_0038.pdf", "page": 1, "text": "WALTER A. VOSS President, Meredith-Burda, Inc. W. ROLAND WALKER Chairman and Chief Executive Officer, Kpnbridge Construction Company, Inc,, Kenbridge Manufacturing KENNETHS. WHITE Attorney, Edmunds, Williams, Robertson, Sackett, Baldwin  Graves"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "WALTER A. VOSS President, Meredith-Burda, Inc. W. ROLAND WALKER Chairman and Chief Executive Officer, Kpnbridge Construction Company, Inc,, Kenbridge Manufacturing KENNETHS. WHITE Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin  Graves"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "WALTER A. VOSS President, Meredith-Burda, Inc. W. ROLAND WALKER Chairman and Chief Executive Officer, Kpnbridge Construction Company, Inc,, Kenbridge Manufacturing KENNETHS. WHITE Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin  Graves"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1299.36, 1182.48, 1595.69, 1281.58], "bbox_id": "86dfc708e4", "file": "AppomattoxNewspapers_1902-1905a_0525.pdf", "page": 1, "text": "WAHT WALKER, Pres. 3. M. SACKETT, V.-P. A.W. MOSBLSec. t Treas PIEDMONT LAND CO. Inc. fti SELL YOUR FARM"}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "WAHT WALKER, Pres. 3. M. <mark>SACKETT</mark>, V.-P. A.W. MOSBLSec. t Treas PIEDMONT LAND CO. Inc. fti SELL YOUR FARM"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "WAHT WALKER, Pres. 3. M. <mark>SACKETT</mark>, V.-P. A.W. MOSBLSec. t Treas PIEDMONT LAND CO. Inc. fti SELL YOUR FARM"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.91, 983.51, 1646.71, 1030.21], "bbox_id": "d7dcb8e960", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "W. G. Franklin and Gh. II. Sackett, Ooihrs., will sell at August court a valuable tract of laud situated on Appomattox river."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "W. G. Franklin and Gh. II. <mark>Sackett</mark>, Ooihrs., will sell at August court a valuable tract of laud situated on Appomattox river."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "W. G. Franklin and Gh. II. <mark>Sackett</mark>, Ooihrs., will sell at August court a valuable tract of laud situated on Appomattox river."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.9, 1020.26, 1922.89, 1044.18], "bbox_id": "e1a4980699", "file": "AppomattoxNewspapers_1922-1923a_0576.pdf", "page": 1, "text": "W F, Smith has returned to herl This tra c t of land lies in Buckingham fo r any fu rth er inform ation th a t m ay 1 de-  L . o ulli u9 iiia ic I if. I r all in vounar tim ber th e laud is I gjred, CHARLES H. SACKETT, borne in Tenneesee."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "I gjred, CHARLES H. <mark>SACKETT</mark>, borne in Tenneesee."}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "I gjred, CHARLES H. <mark>SACKETT</mark>, borne in Tenneesee."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1019.3, 388.67, 1169.52, 937.5], "bbox_id": "46ea65e3fa", "file": "TimesVirginian_1976_0125.pdf", "page": 1, "text": "VIRGINIA In the Circuit Court oi Appomattox County the 29 day of March, 1976. RE WILLIAM W. BURKE, Deceased SHOW CAUSE ORDER It appearing to the Cpurt that a report of the accounts of The Fidelity National Bank, Lynchburg, Virginia, Executor of the Estate of William W. Burke, deceased, and of the debts and demgpds against his estate has been filed in the Clerks Office of this Court and that more than six months nave elapsed since the qualification of said Executor, upon motion of the said personal representa tive. IT IS ORDERED that the creditors of, and all others interested in, the Estate do show cause, if any they can at 9 oclock, A.M., on the 9th dfy of April, 1976, before this Court at its courtroom, against the payment and delivery of i the Estate of William W. Biirke deceased, to the legatees without requiring refunding bonds. It is further ORDERED that a copy of this order be published once a week for two successive weeks in The Times-Virginian, a newspaper published in the County o Appomattox and having genjer al circulation in said Coilhty. Edmunds, Williams, Robertson. Sackett, Baldwin  Graves By Robert D. Richards 916 Main Street P.O,Box958 Lynchburg, Virginia 24505 ENTER 3-29-76 George Abbitt, Jr., Judge A COPY. TESTE BARBARA R. WILLIAMS, Clerk 4-l-2t"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Coilhty. Edmunds, Williams, Robertson. <mark>Sackett</mark>, Baldwin  Graves By Robert"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Coilhty. Edmunds, Williams, Robertson. <mark>Sackett</mark>, Baldwin  Graves By Robert"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [594.95, 1030.56, 918.43, 1152.81], "bbox_id": "e4a44d9e1d", "file": "AppomattoxNewspapers_1902-1905a_0138.pdf", "page": 1, "text": "Virginia In Campbell Circuit Court Clerks Office, June 10,1903. I hereby certify th at H. M. Sackett, com missioner in the chancery suit of Henry M. Sackett, Trustee, vs. L. H. Clay and othdrs, has executed bond in the penalty of 1,000. as required by decree in said ease. March term, 1903. JOHN E. WITHERS. Clerk. 8-2 wks. rying there slate of an excellent! ..i  1 c - i i TN THE CLERKS OFFICE OFTHE CIRCUIT guide. A huge foies of hands will ! i Court of the County of Buckimrham. on the L Court of the County of Buckingham, on the soon he put into this quarry, and itlJ?t!l1?,yoi i ulyT9lii  .. ... . f - . 4 ..  C, It Fontaine, J. Maury Fontaihe, William Lloyd Fontaine, Clement N. Fontaine, B. Wa Jo Fontaine, M. Belle Fontaine. Marga ret B. Fontaine, Annie E. Fontaine, and Selden, Jannette, Lena, and Abner Fon taine the last four hging infants, suing by their next friend and father, C. R. Fontaine"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "th at H. M. <mark>Sackett</mark>, com missioner in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "th at H. M. <mark>Sackett</mark>, com missioner in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1993.44, 201.43, 2137.0, 814.31], "bbox_id": "b846af2f93", "file": "TimesVirginian_1976_0405.pdf", "page": 1, "text": "Virginia Department of Vocat ional Rehabilitation and the American Heart Association. Charles Elliott, Executive Director of Baptist Hospital, formally signed the mutual agreement, which states that selected staff at the hospital will receive intensive, special ized training in cardiac rehab ilitation. The physicians who will coordinate the program at Virginia Baptist Hospital are DRs. Charles Sackett and Joseph Pond, both of Lynch burg. The Lynchburg facility is the fourth center to be opened in a proposed statewide network of 10 to 12 programs targeted for completion by June 1978. Its purpose is to assist victims of heart attack in returning to optimal life styles. The Virginia Baptist Hospital center will be the first in this Virginia network to be operat ed in conjunction with AMSCO. REHAB, a division of American Sterilizer Company, which services over 70 such cardiac rehabilitation centers in the United States. Dr. Walthall, America Heart Association spokesman, indicat ed that the Comprehensive Cardiac Rehabilitation Project is divided into three phases in-patient, out-patient and home program. The in-patient program involves patient-fam ily education and a carefully monitored low level exercise program for the heart patient. The second phase allows for a more intensive exercise pro gram, continuously monitored by electrocardiograph, primar ily conducted on a treadmill and stationary bicycle ergometer. These exercise therapy sess ions. The last segment involves physician prescribed home exercise program like walking, jogging or bicycling, patterned to individual capabilities."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Hospital are DRs. Charles <mark>Sackett</mark> and Joseph Pond, both"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Hospital are DRs. Charles <mark>Sackett</mark> and Joseph Pond, both"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1453.14, 1111.04, 1900.09, 1165.37], "bbox_id": "0d22ac0d76", "file": "AppomattoxNewspapers_1922-1923a_0576.pdf", "page": 1, "text": "Vinmo on Rnplrv I crosa-fenced and well watered. There arc I place. CHA8. H . SACKETT, nom e on xtocay I severai good tenant houses. Th- land lies I v . l a l m A n . I well and farm s easy. The m ain residence is Some C la im A n I a j,anjgome one and is beautifully located, even rooms. Good barns, ice-house, chicken I house, corn house and m any oth er buildings. I I can m ake good term s on - his place. I t is  . t t j . , I said to be good m in erallau d . The stock and Mrs. A. J. Harlan, Of Oolorauo, I mpiem ents m ay be had a t  b a rg a in also."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "I place. CHA8. H . <mark>SACKETT</mark>, nom e on xtocay"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "I place. CHA8. H . <mark>SACKETT</mark>, nom e on xtocay"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1159.45, 228.31, 1985.45, 799.58], "bbox_id": "f7ad47093b", "file": "AppomattoxNewspapers_1971-1973a_0195.pdf", "page": 1, "text": "Two new directors were el ected Thursday, Jan. 20 at the annual members meeting of Co- operativeBuilding and Loan As sociation, Lynchburg. Members of the Appomattox Chapter, United Daughter of the Confederacy, meeting Thursday evening at Maudes for their annual dinner honoring Confed erate heroes Lee, Jackson and Maury, expressed disappoint ment that the scheduled speak er could not appear, but they were rewarded, otherwise, in the substitute speakers who presented historical papers and facts of interest. Mr. Jerry A. Burke, Appo mattox businessman and retired superintendent of Appomattox schools, found that he could not be present. Three chapter members volunteered to be a part of the evening  Mrs. Rachel F. Lawson, who read an account of Surrender at Appo mattox on April 9, 1865 M rs. Lucille Ferrell, who read an account concerning R . E. Lees mother and Mrs. Wiley Morris, who dipped even further back into history to read the will of General George Washingtons mother. Mrs. Clifford Plunkett, re gistrar for the Va. Division, was in charge of registration of members and guests for the ev ening affair. Mrs. Lawsons paper was a copy of a personal interview she held with Martha Mildred Ste vens Craig, an interview which was printed about 31 years ago. In the account Martha Mildred  Aunt Millie , told of her en counters with Union troops in the old village of Appomattox on April 9, 1865. She was nurse maid to Charles Sackett Peers at the time. Little Charles father, George Peers, was clerk of court. The faithful nursemaid hid herself and the child until the shooting ceased in the village."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "nurse maid to Charles <mark>Sackett</mark> Peers at the time."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "nurse maid to Charles <mark>Sackett</mark> Peers at the time."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1880.89, 1045.72, 2046.35, 1372.07], "bbox_id": "0fcbecdc28", "file": "AppomattoxNewspapers_1905-1912a_0435.pdf", "page": 1, "text": "TW O f Jcts of Urjd lr N o rifftw i S e c tio n oF p- p o r p  tto  C o u n ty . Pursuant to a decree of the Olroult Court of Appomattox ..County, rendered October Term, 1V11, in tbe ohaneory salt of Scruggs, Ao. vs. Scruggs, Ac., I will offer for sale at public auction iu front of the Bank of Appo mattox at A ppomai tox Court House, at half past 11 oclock A. M. on Saturday, the 18th of November, 1911, the following real estate FIRST. A tract ot land iu two paroels containing ISO sores, upon whioh the late Samuel A. Soruggs resided. There Ison this tract a good dwelling bouse ot C room and basement, 4 tobacco Darns and other out buildings. It is weU watered and baa on It a good orchard of selected ft ult. SECOND. A tract of 109 acres allotted to Wm. A. Scruggs and otbers In tbe division of John Scrugg- Estate. There are no build ings on this tract. About H or li of it is la cultivation. Has a nice lot of seoond growth S ine on It large enough to make good turn er. and a good deal of oreek land. . These lands si e located sbout four miles north of Oakville In N goud neighborhood, convenient to three churobes. TEuMS One-third cash, as to residue of the purchase money on a credit of one and two years, the purchasers to execute bonds in equal installmants for tbe deferred pay- meuts,bearing Interest from the day of sale, Sale subject to ratification by the court. CHARLES H. SACKETT, Commissioner. In the Clerks Office of Appomattox Circuit Court. Oct. 20,1911, 1 hereby certify that tbe Twenty-Five H undred Dollar bond required by decree of the Circuit Court of Appomattox, entered at tbe Oct. Term, 1911, in the chancery suit ot Scruggs Ao. vs. Scruggs sec. has been given by Chas. H. Sackett, Commissioner, witn ap proved security. Teste 10-26-4 J. B. HOBS LEY. Clerk."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "the court. CHARLES H. <mark>SACKETT</mark>, Commissioner. In the Clerks"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "the court. CHARLES H. <mark>SACKETT</mark>, Commissioner. In the Clerks"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [813.37, 673.94, 976.06, 789.16], "bbox_id": "f0630d1ad1", "file": "AppomattoxNewspapers_1912-1915a_0255.pdf", "page": 1, "text": "ToilHHmi it May Concern On the 1st day of the December Term , 1018 of th e C ircuit Court of Appomato x County, wo shall m ove said C ouit to en ter a h o rd e r in th e chancery cause of Sears B zor. vs. soars so. authorising us to collect hnd re m ove to tha State of Texas, where they, and we resido, the share of our respective wards, now on C ertificate of Deposit In th e Bank - A ppom attox an d filed w ith the paper said suit. A. 8 . TWEEDY, G uardian for the children Thos. Dabney Tweedy, decd.  . . .  B. A. TWEEDY, 8R., Guardian for the children of Sue Tweedy Pool, deod. Saokett  Sackett, A ttys. 10 29-4t"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Tweedy Pool, deod. Saokett  <mark>Sackett</mark>, A ttys. 10 29-4t"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Tweedy Pool, deod. Saokett  <mark>Sackett</mark>, A ttys. 10 29-4t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [803.98, 1241.44, 972.91, 1356.28], "bbox_id": "65cc25153d", "file": "AppomattoxNewspapers_1912-1915a_0251.pdf", "page": 1, "text": "To Whom it Nay Concern On the 1st day of tbe December Term, 1918 of the Circuit Court of Appomatox County, 1 we,shall move said Couit to enter an order in the ohancery cause of 8ears Exor. vs. Sears Ac. authorizing us to collect and re move to the State of Texas, where they and weresido, the share of our respective wards, now on Certificate of Deposit In the Bank of Appomattox and filed with the pavers in said suit. A. S. TWEEDY, Guardian for the children Thos. Dabney Tweedy, decd. t E. A. TWEEDY, SR., Guardian for the children of Sue Tweedy Pool, decd.  Sackett A Sackett. Attys. 10 29-tt"}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "Sue Tweedy Pool, decd.  <mark>Sackett</mark> A <mark>Sackett</mark>. Attys. 10"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "Sue Tweedy Pool, decd.  <mark>Sackett</mark> A <mark>Sackett</mark>. Attys. 10"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [492.49, 1109.78, 655.5, 1200.44], "bbox_id": "3beb45e9c2", "file": "AppomattoxNewspapers_1912-1915a_0351.pdf", "page": 1, "text": "To Whom it May Concern On th e 1st day o f the June Term, 1914, ot tbe Circuit Court of A ppom attox C ounty, I shall m ove said Court to enter a n order In tbe chancery sa lt o f Soars Exor. vs. 8 ears o., authorizing m e to collect the C ertificate of D eposit of the Bank ot Appom attox taken fo i th e share of m y ward, Lillian W. Sears In th e fu n d s In said su it, and tran sfer the sam e to th e S tate of T exas, whore sh e and I re side. L illian C ornish , , Texas G uardian of Lillian W. Sears. Sackett A Saokett, A ttorneys. 6-6-1"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Lillian W. Sears. <mark>Sackett</mark> A Saokett, A ttorneys."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Lillian W. Sears. <mark>Sackett</mark> A Saokett, A ttorneys."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [313.86, 890.51, 477.41, 982.56], "bbox_id": "64de85ecb5", "file": "AppomattoxNewspapers_1912-1915a_0347.pdf", "page": 1, "text": "To Whom it May Concern On tbe ist any of the Jan e Term, 19U. off the Cironit Court o l A ppom attox County, 1 shall m ove said Court to enter a n order in the chancery su it o f Sears Sxor. vs. Seura ice., authorizing m e to colleen the C ertificate of D eposit of the Sana ot A ppom attox taken fo i th e share ot m y w ard, Lillian W. n ear. In ta e funds In said sa lt, and tran sfer the sam e t the sta te o f T exas, where sh e and 1 re side. LliXlAN C okhi h , Texas G uardian of Lillian W. Sears. Sackett  Sackeiv, A ttorneys. 6 - 8-4"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Lillian W. Sears. <mark>Sackett</mark>  Sackeiv, A ttorneys. 6"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Lillian W. Sears. <mark>Sackett</mark>  Sackeiv, A ttorneys. 6"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [488.87, 1168.69, 653.19, 1262.64], "bbox_id": "a77d18f2b0", "file": "AppomattoxNewspapers_1912-1915a_0355.pdf", "page": 1, "text": "To Wham it May Concern On tb e 1st day of th e Ju n e Term. 1914. of the C ircuit Court of A ppom attox County, I shall move said C ourt to enter a n . order in the chancery suit of Sears Exor. vs. Sears o., authorizing m e to collect the C ertificate of Deposit of toe Bank of A ppom attox ta k e n foi th e share of m y w ard, Lillian W. Sears hi tb e funds In said suit, and tran sfer th e sam e to th e S tate of Texas, where she and I re  side. L il l ia n O o b n is h , Texas G uardian of Lillian W. Sears. Sackett  Jacket t, A ttorneys. l-M"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Lillian W. Sears. <mark>Sackett</mark>  Jacket t, A ttorneys."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Lillian W. Sears. <mark>Sackett</mark>  Jacket t, A ttorneys."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1833.86, 511.7, 1992.67, 854.03], "bbox_id": "9c3890f45c", "file": "AppomattoxNewspapers_1922-1923a_0534.pdf", "page": 1, "text": "TN TH E CLERKS OFFICE OF THE CIR- 1 cult Court of the county of Appomattox on th e 10th day of September, 1907. Jerry Morris, Addle E. Wall and Cassius T. Wall, her husband, Hetta Manwarring and Jam es Man warring-, her husband. Netta Peer and Robert Peer, her husband. Bessie Bartley and William Bartley, her husband, Pernjelia C. Goodman and Frank W. Mc Kinney. Sheriff of Appomattox CouDty. and as.such adm inistrator of Philadelphia C. Goodman, deceased.................. .. Plaintiff again st A. M. Goodman. Thomas W. Moses. Assignee of R. T. Dawson Co., W. B. Bigbie, su r viving partner of himself and ---- Bigbie, de ceased. late partners under the style and firm of Bigbie Bros.  Co.. 8. W. Nowlin and W. P. Gibbs, late partners under the style and firm of Nowlin  Gibb-?, and Wil liam E. Pugh, Josephine C. Pugh, Calvin Pugh. Jesse Pugh, Charles Pugh and Cot ton Pugh, the last six of whom are infants under the age of 21 years, and the unknown heirs of James Morris, deceased, who are all non-residents of the State of Vir ginia ............................................... Defendants. The object of this suit is to sell two tracts of land situated in the county of Appomat tox, one near Spout Spring, containing 875 acres, held bv tne late D. P. Robertson, as trustee for Philadelphia C. Goodman and her children and tbe other containing 110 acres on W reck Island Creek which was inherited by the said Philadelphia C. Goodman from the estate of her father, Benjamin Day, de ceased, and divide the proceeds amongst the parties entitled thereto. And a r affidavit having been filed that the defendant unknown heirs of James Morris, deceased are not residents of the Slate of Virginia, it is ordered th at they do appear here within fifteen days after due publica tion hereof, and do w hat may be necessary to protect their interests in this suit. And it is fu rth er ordered th at a copy hereof be nublihed oneda week for four weeks in the. Appomattox and Buckingham Times, a news paper published in the county of Appomat tox and that a copy be posted at the front door of the court house of this county on the 16th day of September, 1907, th at being t he next succeeding rule day after this order was entered, A copyTeste J. R. HOR8LBY, Clerk. Sackett  Sackett, p. q. 9 18-4t"}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "J. R. HOR8LBY, Clerk. <mark>Sackett</mark>  <mark>Sackett</mark>, p. q. 9"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "J. R. HOR8LBY, Clerk. <mark>Sackett</mark>  <mark>Sackett</mark>, p. q. 9"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.86, 1267.44, 1724.66, 1310.09], "bbox_id": "7243c5fa79", "file": "AppomattoxNewspapers_1892-1898a_0268.pdf", "page": 1, "text": "tiary- , Mr. Henry M. Sackett, son of Mr. Chas. H. Sackett, of Lynchburg, qualified to practice law in this"}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "tiary- , Mr. Henry M. <mark>Sackett</mark>, son of Mr. Chas. H. <mark>Sackett</mark>, of Lynchburg, qualified to practice law in this"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "tiary- , Mr. Henry M. <mark>Sackett</mark>, son of Mr. Chas. H. <mark>Sackett</mark>, of Lynchburg, qualified to practice law in this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1739.5, 669.71, 2057.14, 966.99], "bbox_id": "b92a0f86f5", "file": "AppomattoxNewspapers_1922-1923a_0558.pdf", "page": 1, "text": "thFIHSTAract of land contain 375 acres guns and rifles. Sin- more or less, situated about two m iles from I Spout Spring Station on the Norfolk and J 1  1 , 1 . ___ _ __ _ f c i S S M A M i g g b 4 double guns tract is the present residence of Alonza M. I  . Goodman and is on the head waters of Wreck V T1 P i V Island Creek, is wel I waterea, has upon it a yJM. V vi J Y  comfortable dwelling house of six rooms, I kitchen and well in the yard, 3 good tobacco I A _ _  4- n j i t G i 1 1 iv barns, stable, corn hou.e, and small orchard. j t V I I l l i l l l L I U II  I l f l l l L I 1 1 U About 76 acres of this tract is in original  growth of fine timber and a publicjroad runs I _ _   through the piace. It is seldom that home  I o r i f I P V P f  V  seekers have such an opportunity to pur- v l U v l i l U g c lllM . Y v l j chuse such a desirable place so well located,! SECONDA tract ot land containing 110 acres, more or less, situated on Elk Creek, a tributary of Wreck Island Creek about x miles from the above mentioned tract. This tract 8 also w ell watered and has upon it two settlem ents, one a house of two rooms, besides a shed room, stable and tobacco barn and the other located on the npper end of the tract, a good two room house about forty aercs o f this tract is in original growth of fine timber, which has never been pillaged to any considerable extent and there is some fine bottom land on the creek.  TEKMSCash as to about 150.00, to be ap- portioned between the two tracts, and as to l the residue on aeredit of one, two and three I tears, the purchasers to execute bonds tr equal installm ents for the deferred payments with good personal 8 curity, bearing inter- I est from tbe day of sale, but if any purchaser I will pay as much as one-third of the purchase 1 money in cash, personal security w ill be I d ispensed with. Sales subject to ratification I by the court. Prospective purchasers are I invited to consult the undersigned Commis sioner at No. 404 Krisc Building, in the city I of Lynchburg, at any time before the sale for any further information that may be do- i sired, CHARLES H. SACKETT, Commissioner, Bond executed according to law. novMt J. R. HORSLEY, Clerk."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "i sired, CHARLES H. <mark>SACKETT</mark>, Commissioner, Bond executed according"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "i sired, CHARLES H. <mark>SACKETT</mark>, Commissioner, Bond executed according"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [534.93, 839.27, 702.33, 981.27], "bbox_id": "a0361ed89b", "file": "AppomattoxNewspapers_1926-1933a_0484.pdf", "page": 1, "text": "The will of the late C. W. Han-1 cock has been admitted to record with H. M. Sackett as executor. 500 is to be invested and the income therefrom is to keep up his vault and square in Liberty t cemetery here. 1000 is devised to Liberty Baptist Church trustees for use of church. 10 C0 0C is devised to testa- tors daughter, Mrs. Lilly Greg-"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "record with H. M. <mark>Sackett</mark> as executor. 500 is"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "record with H. M. <mark>Sackett</mark> as executor. 500 is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [530.16, 818.16, 698.49, 959.96], "bbox_id": "143595c5cd", "file": "AppomattoxNewspapers_1908-1909a_0484.pdf", "page": 1, "text": "The will of the late C. W. Han cock has been admitted to record with H M. Sackett as executor. 600 is to be invested and tne income therefrom is to keep up his vault and square in Liberty cemetery here. ... .. . . 1000 is devised to Liberty  Baptist Church trustees for use of church. . .  1V00.0P is devisee to testar tors.daughter, Mrs. Lilly Greg"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "record with H M. <mark>Sackett</mark> as executor. 600 is"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "record with H M. <mark>Sackett</mark> as executor. 600 is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2357.96, 919.57, 2498.82, 971.07], "bbox_id": "e73a6f1301", "file": "AppomattoxNewspapers_1971-1973a_0346.pdf", "page": 1, "text": "The Virginia Dunbrlk Co., located at Sackett St. off Camp bell Ave. In Lynchburg, phone 846-2766 are producers of the finest in concrete blocks."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "The Virginia Dunbrlk Co., located at <mark>Sackett</mark> St. off Camp bell Ave. In Lynchburg, phone 846-2766 are producers of the finest in concrete blocks."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "The Virginia Dunbrlk Co., located at <mark>Sackett</mark> St. off Camp bell Ave. In Lynchburg, phone 846-2766 are producers of the finest in concrete blocks."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [338.62, 728.67, 659.2, 944.02], "bbox_id": "b586325915", "file": "AppomattoxNewspapers_1902-1905a_0012.pdf", "page": 1, "text": "the purchase money at one and two years the I LhoaonsThere HP,a Scarcity of chickens, purchaser toexocute his bonds for the deter- I ?,ld  J i 11 S rts- Let them red payments, beuring Interest from th j duv  co,me fbfht along whlle demand Is good and of aale and secured by a deed of tru st uuori I Prlce hlgh. See our quotations and ship us the property and to keep the buildings iiisu-1 you,r. llvo ehiokvus, diteks-and geese. As soon red for the benefit ot the present owners un- I U8 ,t,h? weather turns opld, dross all fftwls, til the entire purchase motley Is paid , I and let them cool off thoroughly before puck For further information in regard to this I snlpmentt   property apply to Sackett  Sackett, A ttor I are ?Pa,rceu P ood i? mand a t,   ney-at-Law, No. 87 Law Building Lynchburg, I qH?taiuan8 advise that vou ship promptly. Va.  J K I Feathersscarce. Shfr promptly. F..1J is the time to ship feathers. They are scarce and high. New feathers are scarce. Mid feathers sell at 20 to 8 J cents if in fairly good condition, Hog OffalsI t is nsky to ship dressed meats by freight. For that reason we advise that you ship oy express. Onions-.Very good demand at our quota tions for Urge stock., Ship promptly. They are scarce. PotatoesThere is a good demand for ohoice lurge potatoes at our quotations. Very little demand for small or meuiiun potatoes. We ad vise that you ship promptly PorkDress nicely and cool off thoroughly and put. cloth around all pork to keep clean. TurkeysThere is a scarcity of fowls of ail sorts. Dress your turkeys nicely and cool off before packing to ship. et your fowls my office, at Pamplin City, in Appomattox I aere dot later than the? 8 rd if possible, as we County, on the 27tn day of December, A. I. I expect to see a heavy demand for Xmas trade lBUv. at 11 oclock in the forenoon at which I A fter, looking over this price list if you time the said creditors may attend, pfove I hve dried apples, white or mixed beaus, gin- thuir claims, appoint a trustee, examine the I 8 enS bhiek-eye peas, leathers, onions, laige bankrupt, and transact such other business I Irish potatoes,dried peaches, or any tbit"}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "snlpmentt   property apply to <mark>Sackett</mark>  <mark>Sackett</mark>, A ttor I"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "snlpmentt   property apply to <mark>Sackett</mark>  <mark>Sackett</mark>, A ttor I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [881.99, 434.21, 1043.39, 745.15], "bbox_id": "c47ef8122e", "file": "AppomattoxNewspapers_1898-1902a_0134.pdf", "page": 1, "text": "The Plunket property wq sold in Lynchburg last week as follows Storehouse. No. 1206 Main street, to Carroll Brothers, for 4,950. Two small lots on Pine street, lo W. M. Carroll, at 50 per lot. Lot on Clay and Niu h streets, to I. E. Trotter, for 900. House and lot, corner Monroe aud Eighth streets, to J. W. Goldberry, for 1,024. House and lot, corner Taylor and Fourteenth streets, to H. M. Sackett, for 740. Five lots, Tyree addition, to W. R. M urphr, for 180.. A small framed house and lot in Campbell county, to A. B. Leftwich, for 90. , Two lots on James river, below tin- city, to F. B. Moore, for 180. Two lots in Dearington, R. A. Drerey, for 15. Tract of 160 acres in Appomattox county, to Milton Isbell, for 1,005. Small tract of 45 acres in Appo mattox county, to C. Inge, for 740. Tract of 2451 acres in Amherst county, to E. L. Bell, for 430. Total sales amounted to 10,555."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "streets, to H. M. <mark>Sackett</mark>, for 740. Five lots,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "streets, to H. M. <mark>Sackett</mark>, for 740. Five lots,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [984.71, 643.4, 1147.19, 716.95], "bbox_id": "c227d2f55a", "file": "AppomattoxNewspapers_1912-1915a_0236.pdf", "page": 1, "text": "The Lynchburg Poultry Association will hold its show this winter January 13-16, at which time the association expects to have a 15,000 exhibit. The officers of the association are Presi dent, M. B. Hickson vice-president, H. M. Saçkett secretary, R. H. Ander son, and treasurer, E. M. Wood."}, "highlight": {"text": {"matched_tokens": ["Saçkett"], "snippet": "Hickson vice-president, H. M. <mark>Saçkett</mark> secretary, R. H. Ander"}}, "highlights": [{"field": "text", "matched_tokens": ["Saçkett"], "snippet": "Hickson vice-president, H. M. <mark>Saçkett</mark> secretary, R. H. Ander"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [151.19, 1513.15, 309.64, 1567.3], "bbox_id": "a22ac2f3e3", "file": "AppomattoxNewspapers_1912-1915a_0037.pdf", "page": 1, "text": "The Lynchburg Poultry Association will hold its annual show December 10 to 13. The new officers are Presi dent, M. B. Hickson vice-president, H. M. Sackett secretary, Richard Anderson, and treasurer, H. C. Adams."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Hickson vice-president, H. M. <mark>Sackett</mark> secretary, Richard Anderson, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Hickson vice-president, H. M. <mark>Sackett</mark> secretary, Richard Anderson, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [724.3, 1334.74, 882.26, 1626.52], "bbox_id": "52f11699e6", "file": "AppomattoxNewspapers_1898-1902a_0395.pdf", "page": 1, "text": "The Light of the W orld, or Our Saviour in Art. m Cost nearly l,XXi,000 to produce. Contains nearly IU, enifravings of fur Saviour and His Mother by the worlds greatest painters, true copies of the greatest masterpieces in the art galleries of Europe. Every picture is as beautiful as a sunrise over the hill tops. Contains description of ihe paintings, bio graphy of the painters, the names and loca tion of the galleries iu Europe where the originals may tie seen. Also contains a childs Department, including a Childs Story of the Christ and His Mother, beautifully written to ttt each picture. This wonderful book, matchless in Its purity and beauty appeals to every motherss neart, and in every Christian home where there are childreu It sells itself. Christian men and momen are making money rapidly taking o ders, A Christian man or woman can in this community soon make 1000 taking orders for Christmas presents. Mrs. Waite, our agent in Massachusetts, has sold over 3000 worth of the books In a short time. Mrs. Sackett, our ageut in New York, has sold over 1.510 of the books in a very short time. The book is printed on velvet- tinished paper, beautifully bound in cardinal red and gold, and adorned with golden roses and lillics. It is without doubt..the most beautiful book of this oentury. Write for . erms quickly aud get the management of that territory. You can work on salary or commission, and when you prove your suc cess we will promote you to the position of manager and correspondent at a permanent sal at-v, to devote yonr time to attending to agents and the correspondents. Wanted also a State Manager to have charge of office In leading city of the State and manage all the business of the State, Send for terms. Ad dress THE UK 1 TISH-AMERICAN CO., Cor coran Building, opposite U. 8. Treasury, Washington, D. C.  A i _ A _ A -AAAAA--A--A"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "a short time. Mrs. <mark>Sackett</mark>, our ageut in New"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "a short time. Mrs. <mark>Sackett</mark>, our ageut in New"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [584.62, 1553.76, 742.87, 1996.45], "bbox_id": "45a84d4b79", "file": "AppomattoxNewspapers_1898-1902a_0438.pdf", "page": 1, "text": "The friends of Mr. Charless H. Sackett will be glad to learn that Judge J. IT. Christian has appoint ed him to fill out the unexpired term of the late Judge Wingfield, which term expires in 1906. The pay of the office depends largely on fees and ranges from 3,000 to 5.000. Mr, Sackett is perhi ps as well quali fied as auy man in Virginia to as- sum the duties of the office. He has served under our veteran clerk Geo. T. Peers as deputy, and there uo doubt received competent instruc tion. One of the leading farmers of the county congratulated ye editor on his efforts iu trying to get some in dustries here aud said whenever the promoters got ready for the ware house he wanted a block of the stock, aud that not only would he sell at it, but he would buy every pound offered or make it bring the market price. This sounds like business. How many more of our farmers will aid in establishing a market at home for our leaf. There is no doubt about haring buyers to attend the sales. The merchants here would be greatly benefited, but we doubt seriously whether they will take hold pf tbe enterprise until its success is assured beyopd any doubt, Unfortunately they are not as pro gressive B8 vve would love to see"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Mr. Charless H. <mark>Sackett</mark> will be glad to"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Mr. Charless H. <mark>Sackett</mark> will be glad to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [596.39, 1612.34, 753.77, 1795.39], "bbox_id": "dc56f1334f", "file": "AppomattoxNewspapers_1898-1902a_0437.pdf", "page": 1, "text": "The friends of Mr. Charless H. Sackett will be glad to learn that Judge J . H. Christian has appoint ed him to fill out the unexpired term of the late Judge Wingfield, which term expires iu 1906. The pay of the office depends largely on fees and ranges from 3,000 to 5.000. Mr. Sackett is perhi ps as well quali fied as auy man in Virginia to as- sum the duties of the office. He has served under our veteran clerk Geo. T. Peers as deputy, and there no doubt received competent instruc tion."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Mr. Charless H. <mark>Sackett</mark> will be glad to"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Mr. Charless H. <mark>Sackett</mark> will be glad to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [470.39, 1680.91, 793.29, 1756.06], "bbox_id": "ff2f09fcd1", "file": "AppomattoxNewspapers_1918-1922a_0107.pdf", "page": 1, "text": "the deferred payments of the purchase interest sitai. be ret ined mil the money, bearing interest from the date of sate, which interest hall be payable semi-annually the title to the property to be entire purchase money has been paid __ _ _ . , V HENRY M. SACKETT, I ommissioner, The bond required of Henry il. Sackett, Lomm-ssroner, by the de cree of sale in the above sou has been executed"}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "paid __ _ _ . , V HENRY M. <mark>SACKETT</mark>, I ommissioner, The bond"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "paid __ _ _ . , V HENRY M. <mark>SACKETT</mark>, I ommissioner, The bond"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2002.57, 584.68, 2162.42, 791.22], "bbox_id": "a6f8f3de8b", "file": "AppomattoxNewspapers_1892-1898a_0431.pdf", "page": 1, "text": "The bond required of the Commissioners In the suit of Fore o. vs Fore Ac. by the décret therein of April term 1897. has been given by O. H. Sackett, with security approved by me. G BO. T. P kebs , Clerk. DAVIDS fifilA CertainlS ---- FOR ----- O Siok and Nervous Headache, B ill-I ousness, Torpid Liver, SicK Slomaoli, Giddiness, L obs of Appetite, o Ao. They ara purely Vege table and p e r io d   harmleae. Price 25c a Box Owens A Minor,"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "given by O. H. <mark>Sackett</mark>, with security approved by"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "given by O. H. <mark>Sackett</mark>, with security approved by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1978.31, 974.93, 2138.4, 1053.23], "bbox_id": "5947fca42c", "file": "AppomattoxNewspapers_1892-1898a_0429.pdf", "page": 1, "text": "The bond required of the Commissioners in the suit of Fore Ac. vs Fore Ac. by the d cree therein of April term 1807. has been given by C. H. Sackett, with security approved by me. G bo . T. P bbrs , Clerk. DAVIDS"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "given by C. H. <mark>Sackett</mark>, with security approved by"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "given by C. H. <mark>Sackett</mark>, with security approved by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [300.5, 1031.89, 458.26, 1075.89], "bbox_id": "f7fc8c47ed", "file": "AppomattoxNewspapers_1905-1912a_0551.pdf", "page": 1, "text": "Tbe bond required of H. M. Sackett, Com missioner. under a decree of the Circuit Court of Appomattox County, entered a t its April Term, 1918, in tbe chancery suit of Coleman, Ac., vs. Thomas, Ac., has been exe cuted according to law. J. K. HORSLEY, Clerk."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "required of H. M. <mark>Sackett</mark>, Com missioner. under a"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "required of H. M. <mark>Sackett</mark>, Com missioner. under a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1359.07, 399.77, 1503.57, 430.95], "bbox_id": "8dffcbdef1", "file": "AppomattoxNewspapers_1892-1898a_0211.pdf", "page": 1, "text": "t o  i m p r o v e   . Mr. Chas. Sackett, of Lynchburg was in Town on Thursday."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "t o  i m p r o v e   . Mr. Chas. <mark>Sackett</mark>, of Lynchburg was in Town on Thursday."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "t o  i m p r o v e   . Mr. Chas. <mark>Sackett</mark>, of Lynchburg was in Town on Thursday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1845.58, 891.66, 2005.65, 1003.91], "bbox_id": "a849548f4d", "file": "AppomattoxNewspapers_1905-1912a_0443.pdf", "page": 1, "text": "T E R M S  0nethird eaab, as to the reeidne of the purchase money on a credit of one and two years, the pnreiaser to execute bonds iu equal install ments for the defirrea payments, bearing interest frornTthe day of ale. Sale subject, to ratification by the court. Charle H, Sackett, 10-25-4 Executor of John Sean."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "the court. Charle H, <mark>Sackett</mark>, 10-25-4 Executor of John"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "the court. Charle H, <mark>Sackett</mark>, 10-25-4 Executor of John"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [789.83, 488.11, 1102.73, 1009.8], "bbox_id": "9e18534301", "file": "AppomattoxNewspapers_1918-1922a_0174.pdf", "page": 1, "text": "sp ectre prern net in the order here men MiB8 Odell W oolaridge left itioued, two valuable farms on Falllug River Sunday for Lynchburg, where ! in Appomattox county, Va., about five miles he ha8 accepted a position with  south from Spout Spring, a station on the L . H. Almond.  Norfolk  Western railroad, belonging to For Sale  1 pair large marep, th e estate of the late d r p . m o t t r o b - harnesa and wagon, together i ertson . or separately, at a sacrifice d tub g iodb ok sweenby place , H . BABCOCK, j containing lSI-aacres, upon which there are Appomattox, Va a three-roim log residence, a small stable. Mr. and Mrs. S u n Anderson jtw0 t0httCC0 barns and a two room tenant and children and Miss Helen h0se. Scruggs, of Stonewall, were W thech bath am place , containing gU68tS of MiSS Odrille Wool- 155 acres and upon whcb there are a four- ridge last W ednesday. j room frame dwelling, stable for tour horses Mr. S B. Betts is back travel- r ndol,ier Ui0e88ary outbuildings, two to- m g the county in the interest 9aoco barns and a four-room tenant bouse.    These are exceptionally fine grain and to  bacco farm s and are In a high state of ouitl ration. Each of them has a fair proportion of bottom land, a d the highland is of an unuoually gold quality. At 4 P. M. on the Same Day I will offer tor sale on the premises in the village of Appomattox a desirable residence lot containing 1.43 acres, situated on the Ev ergreen-Lynchburg road, a short distance from the center of the village, adjoining the properties of L Roy Smith, Cleveland Fore and the Methodist parsonage. There is upon this lot a large stable building. POSSESSIONSeeding possession of the two farms will be delivered this fall and complete possession on or before December 31st of the present year. Possession of the lot can be had as soon as the sale is con firmed by the court. TERMSone-fourth cash and as to the balance of the purchase money upon a cred it of one, two and three years, the purchas ers to execute their obligations tor the de ferred payments of the purchase money bearing interest from the day of sale, whleb Interest shall be payable semi-annually the title to the property to be retained until the entire purchase money is paid. HENRY Nl. 5 ACKETT, Commissioner Bond executed by Henry M. Sackett. Com missioner, as required by decree of sale In Mary A. Robertson et als vs Nina Elliott Robertson et als.   3w c. W. SMITH, Clerk."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "executed by Henry M. <mark>Sackett</mark>. Com missioner, as required"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "executed by Henry M. <mark>Sackett</mark>. Com missioner, as required"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1602.02, 1651.86, 1762.04, 1728.58], "bbox_id": "24a15fb41c", "file": "AppomattoxNewspapers_1912-1915a_0102.pdf", "page": 1, "text": "Some thirty-five 35 or forty 40 Acres of thl land are James River low ground, while the remainder S i ? w 3 v of h gh land. There are nobulldfog. OTtte act.except one obaccobun. but ttwre Is s beautiful building He overlooking James River. A Dial of tbe land can be seen at the offices of Sc- kettPfc s J te it.lG lM ifo lld f fi V  h b u jg ,y W  . or st the store ot Mr. E. J. T inner. Gaits Mill, Vs. rER HSCash ........... CM AS. H. SCK til HENRY n. SACKETT. Trustees."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "SCK til HENRY n. <mark>SACKETT</mark>. Trustees."}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "SCK til HENRY n. <mark>SACKETT</mark>. Trustees."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [877.9, 516.44, 1196.51, 623.0], "bbox_id": "dbbd05dc6a", "file": "AppomattoxNewspapers_1908-1909a_0507.pdf", "page": 1, "text": "side of Stonewall Creek artd north side of the old ____________ , ____________ Oakville road, adjoining Per- Card of Thanks dues estate, T. B. Scruggs es- We sincerely appreciate the j tate, Lymus Harvey and others, part you played in making our  and formerly occupied by Pas- sdlver wedding anniversary cel-  chal S. Jones, being the re- ebration so enjoyable. , We imainder of the tract conveyed heartily appreciate thè many j to the late T. B, Scruggs by gifts and remembrances from  Charles H. Sackett, commis-"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "remembrances from  Charles H. <mark>Sackett</mark>, commis-"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "remembrances from  Charles H. <mark>Sackett</mark>, commis-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [512.38, 1061.63, 710.07, 1165.93], "bbox_id": "9b90ba8b0e", "file": "AppomattoxNewspapers_1974-1975a_0017.pdf", "page": 1, "text": "September 23 two new workers arrived at Appomattox Court House National Historical Park having just transferred from George Washington Birthplace National Monument in Westmoreland County. They are both registered Morgan horses with Julianna a four year old mare on the left and Wakefield Denny an 18 month old gelding on the right. Louis Sackett from George Washington Birthplace is holding Julianna and Henry"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "on the right. Louis <mark>Sackett</mark> from George Washington Birthplace"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "on the right. Louis <mark>Sackett</mark> from George Washington Birthplace"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1700.6, 388.3, 1846.89, 421.64], "bbox_id": "7c1aa76241", "file": "AppomattoxNewspapers_1918-1922a_0306.pdf", "page": 1, "text": "See the sales 0f land adver ised in this mile by Oomunsl oner H M. Sackett"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "See the sales 0f land adver ised in this mile by Oomunsl oner H M. <mark>Sackett</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "See the sales 0f land adver ised in this mile by Oomunsl oner H M. <mark>Sackett</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.27, 857.62, 1670.42, 902.85], "bbox_id": "63f81a643b", "file": "AppomattoxNewspapers_1902-1905a_0130.pdf", "page": 1, "text": "See the important sale of real and personal property advertised in this paper by Commissioners Thomas D. Christian and Henry M. Sackett."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "See the important sale of real and personal property advertised in this paper by Commissioners Thomas D. Christian and Henry M. <mark>Sackett</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "See the important sale of real and personal property advertised in this paper by Commissioners Thomas D. Christian and Henry M. <mark>Sackett</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1847.5, 1131.96, 2008.93, 1367.39], "bbox_id": "908c448c7e", "file": "AppomattoxNewspapers_1905-1912a_0443.pdf", "page": 1, "text": "Saturday, the 18th of November, 1911, the following real estate FIBST. A tract of land In two parcels containing 160 acre a upon wblch tbe late Samuel A. Scruggs resided. There is on this tract a good dwelling bouae of S rooms and lasement, 4 tobacco barns and other out- ulidingB. It la weU watered and baa on It a ood orchard of aeleeted1 fm lt. SECOND. A tract of 199k acres allotted to Wm. A. Scruggs and others In the division ol i o h n S p r n o r r r ? R a t a t o T H a m a m n n k n i l r i _ John Scrugg? Estate. .There are no build ihrsi   - Has a nice lot of second gro ine on.lt large enough to make good lum tags on th tract. About H or X of it la ta cultivation. Has a nice lot of second Her, and a good deal of creek land, lands aielooatedsbont four mites north of Oakville in a good neighborhood, convenient to three ehurobes,   TBuMS One third eash, as to residue of the purchase money on a credit of ona and two yearA the purchasers to execute bonds In equal lnstaumants for the deferred pay ments,bearing interest from the day of sale. Sale subject to ratification by tbe court. OHABLBS H. SACKETT. Commissioner. In the Clerks Office of Appomattox Circuit Court. Oct. 20,1911, I hereby certify th at tbe Twenty-Five Hundred Dollar bond required by decree of the Circuit Court of Appomattox, entered at the Oct. Term, 1911, In the chancery suit of Scruggs Ac. vs. Scruggs Ac. has been given by Cnis. H. Sackett, Commissioner, with ap proved security. Testa 10-26-4 J. K. HOKSLBY. Clark."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "tbe court. OHABLBS H. <mark>SACKETT</mark>. Commissioner. In the Clerks"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "tbe court. OHABLBS H. <mark>SACKETT</mark>. Commissioner. In the Clerks"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2050.08, 230.82, 2335.87, 501.67], "bbox_id": "f359e4e64c", "file": "AppomattoxNewspapers_1962-1965a_0303.pdf", "page": 1, "text": "Sackett for a general check-up. A number from here attended the 25th anniversary of Mr. and Mrs. Fred Woolridge Sunday afternoon. Mr. and Mrs. Cecila Lerner, of Lynchburg, visited in the home of Mrs. C. J. Paulette Sunday. Mrs. Mary Sullivan, Mr. and Mrs. S. D. Thompson and Mr. Howard Glover, all of Lynch burg, visited over the week end with their parents, Mr. and Mrs. G. W. Glover. Mr. and Mrs. Z. E. Cheatham, Mr. and Mrs. Kermit C. Pau lette attended a banquet for the has been arganized, and for the! Hre Show Association at Rich- first time in several years it will ,mon Sunday evening, be given. Christmas is soon to be upon us. Let each of us think upon the true meaning of the Season, and find ourselves worshipping in His House  The Church. O. H. Moore Liberty Baptist Church"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "<mark>Sackett</mark> for a general check-up."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "<mark>Sackett</mark> for a general check-up."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1958.87, 1308.61, 2034.47, 1316.61], "bbox_id": "048e3e0418", "file": "AppomattoxNewspapers_1915-1918a_0466.pdf", "page": 1, "text": "Sackett A Sackett, p q"}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "<mark>Sackett</mark> A <mark>Sackett</mark>, p q"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "<mark>Sackett</mark> A <mark>Sackett</mark>, p q"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.55, 1315.98, 2135.26, 1323.48], "bbox_id": "bea575cd6d", "file": "AppomattoxNewspapers_1922-1923a_0538.pdf", "page": 1, "text": "Sackett  Saekett.Ji , i HOitafBYflC,1wC -"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "<mark>Sackett</mark>  Saekett.Ji , i HOitafBYflC,1wC -"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "<mark>Sackett</mark>  Saekett.Ji , i HOitafBYflC,1wC -"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [556.09, 755.63, 713.34, 953.73], "bbox_id": "0356726455", "file": "AppomattoxNewspapers_1908-1909a_0265.pdf", "page": 1, "text": "rrilEDERIC M. SACKETT, American w ambassador to Berlin, created some thing of a sensation In his own ednn- try by an address before the world power conference In Which he at tacked American power companies for their high charges to the consumer, He said I know of no other manu facturing Industry where the sale price of the product tp the great mass of consumers Is fifteen times the actual cost of production. Samuel lusull of Chicago, the utilities magnate, was In Berlin and having seen an advance copy of Mr. Sacketts speech, made objection to parts of It. This the am bassador disregarded entirely. The Incident was meat for Senator Norris of Nebraska, the ever alert critic of utility corporations, and he  ade a speech In the senate scoring Mr. Insull severely."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "rrilEDERIC M. <mark>SACKETT</mark>, American w ambassador to"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "rrilEDERIC M. <mark>SACKETT</mark>, American w ambassador to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1018.11, 1041.73, 1218.21, 1398.94], "bbox_id": "24896b22ca", "file": "TimesVirginian_1980a_0055.pdf", "page": 1, "text": "ROBERTS. LOCKRIDGE Chairman of the Board.  Craddock-Terry Shoe Corp. V. J. LUSARDI Mayor, Town of Brookneal -r JAMES E.MCCAUSLAND Partner, Srfead-Payne  McCausland, Inc. 8 FRANKLIN MOOMAW, JR. President, A B. Burton, Inc. GERALDH. PARKS  Special Assistant to the Chairman of the Board Continental Telephone Company GEORGE M. SPAULDING President, Spaulding Lumber Co. GUSTAV K STALUNG, III President, Stalling. Inc. President, Stalling International Sales, Inc. President, Tomahawk warehousing Services, Inc. Chairman, Virginia Central Processors, Inc. EDWARD C.SUHUNG Owner. Suhling Distributing Company WALTER A VOSS President, Meredith-Burda, Inc. W ROLAND WALKER Chairman and Chief Executive Officer, Kenbridge Construction Company, Inc. Kenbridge Manufacturers  Supply Co.. Inc. KENNETH 8. WHITE Attorney, Edmunds, Williams, Robertson, Sackett, Baldwin  Graves"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin  Graves"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin  Graves"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [424.3, 549.01, 567.3, 1142.18], "bbox_id": "832ada20fa", "file": "AppomattoxNewspapers_1974-1975a_0291.pdf", "page": 1, "text": "Reb at the Courthouse and donated all proceeds to the ladies Memorial Association. Both Joel Flood and John Sears offered land with that of Sears, located upon a beautiful knoll about a half mile west of the Court House, being the one selected. County Clerk George Peers saw to it that this land was properly deeded to the Association. At the September 1866 meeting, storekeeper Francis Meeks who himself lost a son in the Civil War reported that he had cleared the tract of all brush and briers. Messrs. Conner, Rosser, Bryant, Ab bitt, Morgan, Burnett and Laundrum, using contributed lumber, then were employed to make the number of coffins required. Other prominent county citizens also helped. The digging of nineteen graves fell upon George Peers, Charles Sackett, P. N. Meade, J. W. Webb, Robert R. Kyle, George Abbitt, Edward Hix and Wilmer McLean. These men were then assisted by John W. McKinney, John Sears, William Paris, Robert Sweeney, Tho mas Legrand and Thomas Smith in the disinterrring of the various bodies on Novem ber 30, 1866. On December 1 they were reburied in their new, perma- ment plots. In a brief service that day, Judge Lewis Daniel Isbell made the principal address and Presbyterian min ister G. W. Leyburn conducted the religious services. A neat plank fence was later erected around the wooden markers denoting the final resting place of the 18 Confederate and 1 Union soldier. Todays Confederate Ceme tery has changed but little since its establishment 109 years ago. With ten of its occupants"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "upon George Peers, Charles <mark>Sackett</mark>, P. N. Meade, J."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "upon George Peers, Charles <mark>Sackett</mark>, P. N. Meade, J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1044.94, 596.85, 1205.15, 869.81], "bbox_id": "9e6e982d04", "file": "AppomattoxNewspapers_1926-1933a_0507.pdf", "page": 1, "text": "re mainder of the tract conveyed to the late T. B. Scruggs by Charles H. Sackett, commis sioner, Dec. 24, 1891- The land is good, but iso lated, has considerable timber and pulpwood. Only, a small part of it s cleared. Terms One-third-cash, bal ance in two equal installments with interest 6 and 19 months after date of sale, with privi lege to purchaser to pay all cash. Robert A. Russell, Comr. Rustburg, Va. J. Easley Edmunds, Jr., Comr, Lynchburg Va. Bond required has been duly given.C. W. Woodson, Clerk Apr 21 3t.  - ----------- o ----------- Cheerio Corner"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Scruggs by Charles H. <mark>Sackett</mark>, commis sioner, Dec. 24,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Scruggs by Charles H. <mark>Sackett</mark>, commis sioner, Dec. 24,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [595.91, 642.92, 919.92, 959.63], "bbox_id": "24b6c0e0c1", "file": "AppomattoxNewspapers_1902-1905a_0138.pdf", "page": 1, "text": "Pursuant to a decree of the Circuit Court  r Campbell County, rendered a t the March levin, 1903, in the chancery suit of Henry M. Sackett, Trustee, vs. L. H. Clay and others. We wiii, on Tuesday, the 2 isi day of Ju ly , 1903, at 12 Oclock M., offer for sale at public auction, on the prem i ses, th at valuable Farm upon which Mr, L. 1!. Clay now resides, situated in Campbell County, Virginia, on the road leading from  Kd House to Campbell Courthouse, about three miles from the first-mentioned place, and containing 930 Acres, more or less. The dwelling-house upon this property, which contains eight or ten rooms, is attractively situated in a beautiful grove of large oak traes. There are upon the property, in addi .tion to the dwelling-house. numerous tenant houses, some ten or twelve tobacco-barns, stibles. and other necessary outhouses. The entire Farm is well watered and well fenced. The property is in a good neighborhood, con venient to schools, churches, and postotlices. and is considered one of the best tobacco Farms in this section of the State. T erm s one-Xourtli C asfi  balance at one, two, and three years the purchaser to exe cute his bonds, with good personal security, for the deferred payments, bearing interest fr.m date of sale the title to the property be retained until the entire purchase-mo-  ,  .   - i. 1 I , , t, W WUAUVU UUUU IA1V VULiip IJ UL VUUOV f CltulllOHt b ecam e in te n se , a n d b a tu r - niy is paid, and the buildings thereon to be il ,v ll N pw C im tnn turn r.r i L i n s u r e ! ! ns additional security therefor. If u J   INew Until toll tw o o r mice any purchaser shall elect to pay as much as dangerous rows were narrowly avert- One-third of the purchase money in cash, the , . , . . J p . i personal security will be dispensed with, eil. At present the result of the!- thomas d . C hristian , fight cannot be foreseen, but the ad-1 henry m . vocates of local option insist that! ----- the contest w ill never be given HD ! V ir g in ia  In Campbell Circuit Court Clerks , , , . . Office, June 10,1903. until every bar-room 111 the county  T hereby certify th at Henry M. Sackett and Thomas D. Christian, commissioners in the j clmnory sutt of Henry M. Sackett, Trustee, Arvon is unusually i vs L. H.Clay and others, have executed bond i,,.- p il.. w  h  t v A. i t hi tiie penalty of 5,090, as required by decree bilsk, th e Williams and l l t t S slate- V ill Slid case, March term , 1903.  JOHN E. WITHERS, Clerk."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "suit of Henry M. <mark>Sackett</mark>, Trustee, vs. L. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "suit of Henry M. <mark>Sackett</mark>, Trustee, vs. L. H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [191.31, 1736.63, 346.21, 1782.43], "bbox_id": "517deb5e17", "file": "AppomattoxNewspapers_1902-1905a_0370.pdf", "page": 1, "text": "President Sackett, of the Lynch burg Horse Show, promises the best abow of its kind ever exhibited in the city from Ocober 11th to 14th."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "President <mark>Sackett</mark>, of the Lynch burg Horse Show, promises the best abow of its kind ever exhibited in the city from Ocober 11th to 14th."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "President <mark>Sackett</mark>, of the Lynch burg Horse Show, promises the best abow of its kind ever exhibited in the city from Ocober 11th to 14th."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [696.94, 1358.17, 859.79, 1521.52], "bbox_id": "18728afd36", "file": "AppomattoxNewspapers_1922-1923a_0509.pdf", "page": 1, "text": "Preferred Death To Indigestion. Danbury, Ct. Special.Miss May B. Sackett, aged 35 years, daughter of Charles E. Sackett, a wealthy New York business man, who lived alone with her sister here, was found hanging to a beam in the cellar. She had been ill with indigestion, which is the only known reason for her supposed suicide. Gored To Death By A Bull. Augusta, Ga., Special.A spec ial from Covington, Ga., tells of the tragic death of Newton A. Berry, a wealthy farmer, who lived near theire, when he was gored to death by a mad bull. The animal belong ed to a neighboring farm."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Ct. Special.Miss May B. <mark>Sackett</mark>, aged 35 years, daughter"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Ct. Special.Miss May B. <mark>Sackett</mark>, aged 35 years, daughter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [898.08, 993.76, 1060.25, 1326.81], "bbox_id": "1033ce7bb2", "file": "AppomattoxNewspapers_1905-1912a_0426.pdf", "page": 1, "text": "Politics Mixed W ith Picnics A dm itted A t S enatorial Probe. Milwaukee.Touches, a hammer and picnics were brought up as part of the campaign expenses of United States Senator Isaac Stephenson in the investigation before the Senatori al committee here. The details were given by Rodney Sackett, one of the Stephenson campaign managers, after Senator W. B. Heyburn, the chairman, said the total expenditure of 107,793 would have to be explained to over come the presumption that it had been wrongfully used. Some of the general items given to Sackett to explain were General ex penses for organizing State, 46,052 Milwaukee county, 11,600 office ex penses, 4,074 telephones, 256 post age, 11,000 sundry bills, 8,662 nomination papers, 40 one man to attend colored picnic, 50 campaign buttons, 702 trip through Ghetto three men, 35 one man to another picnic, 10 touches by two old sol diers, 2 numerous and various touches, 17, and a hammer, 3. The newspaper advertising in the campaign, Sackett said, amounted to 12,696. In one instance Senator Stephenson gave 1,500 for a list of farmers names, paying for them at the rate of one cent a name and an extra one-half cent for each subsequent use of the same names."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "were given by Rodney <mark>Sackett</mark>, one of the Stephenson"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "were given by Rodney <mark>Sackett</mark>, one of the Stephenson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [633.09, 787.87, 812.43, 1353.71], "bbox_id": "b9b4354c7d", "file": "AppomattoxNewspapers_1908-1909a_0297.pdf", "page": 1, "text": "P ROHIBITION cause what may prove to be the first serious rift between the house of representative  .and the White House. Administration leaders in the house sent word to President Hoover that the resolution proposing a joint congressional pro hibition committee Is not likely to pass. It was passed by the senate  three weeks ago and sent to the house rules committee, from which it has never emerged. Speaker Nicholas Longworth admit ted that the leaders of. the house do not believe such a joint committee should be allowed to usurp the func tions of the Independent house com mittee already constituted. Fifty wet menjbers of the house of both political parties pledged them selves at a caucus to .battle to a finish against the forthcoming program of the drys to put tffgger aSd Sharper teeth to the prohibitioh laws.  HOSE radical senators who call themselves Republicans won a de cided victory by forcing the appoint ment of Senator Robert M. La Follette of Wisconsin as a member of the pow erful finance committee. Senator  Thomaa of Idaho, generally regular, I also was named a member, the vacan cies filled being those left by the resig nations of Edge and Sackett, now am bassadors. The old line Republicans on the committee ou committees fought hard to keep La Follette from the place, but Senator Smoot, fearing to have the contest carried to the floor of the senate, voted with the Demo crats and radicals for the appoint- ment The finance committee now in cludes 11 Republicans and 8 Demo crats. If La Follette and Couzens of Michigan join forces with the Demo crats, the latter will control the com mittee. in any event It Is no longer bossed by the Eastern Republicans, I N THE course of regular business the senate continued Its work on the tariff measure, dealing especially with woolens and  rayon silks. The committee Investigating lobbying heard some more witnesses concerning ef forts to raise or lower the sugar sched ule, and the name of the President was dragged In several times In a way that brought  sharp rebuke fOT the committee from one witness, H. H. Pike, Jr., a New York sugar broker."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "nations of Edge and <mark>Sackett</mark>, now am bassadors. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "nations of Edge and <mark>Sackett</mark>, now am bassadors. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2017.88, 1563.34, 2352.44, 1736.79], "bbox_id": "6a85a07a76", "file": "AppomattoxNewspapers_1960-1962b_0405.pdf", "page": 1, "text": "One f the historic landmarks of Sackett, was moved from old Appo- mattox C. H., and set up, and im proved, as a cottage, beside the main dwelling. Mr. T. A. Smith passed away in 1914, after a most successful busi ness career in Appomattox. In 1917, thte property was acquir ed by Mrs. John T. Rosa Hundley. It was used as a residence, and as a boarding house. Later, the property was sold t0 Dr. W.L. Ould. Chas. T. Moses, Jr. Is the present owner-, and is noiw having this old and -historic residence razed, and in about 60 days, a moderni new car lot will be ready for the public. Time Marches On!"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "the historic landmarks of <mark>Sackett</mark>, was moved from old"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "the historic landmarks of <mark>Sackett</mark>, was moved from old"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [758.18, 819.29, 923.78, 924.54], "bbox_id": "ce60071519", "file": "AppomattoxNewspapers_1936-1939a_0055.pdf", "page": 1, "text": "on the steps of the Court House at Appomattox County, Virginia, offer lo r sale, at public auction to the highest bidder the property briefly described as 35.8 acres, being Lot 4 as shown upon a plat made by W A. Moses, Surveyor, attached to a deed from Henry M. Sackett, Com- missjoner, to A. H. Howerton, and which tract is more particularly des cribed by reference to said deed of trust."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "deed from Henry M. <mark>Sackett</mark>, Com- missjoner, to A."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "deed from Henry M. <mark>Sackett</mark>, Com- missjoner, to A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [371.05, 345.23, 655.54, 808.27], "bbox_id": "ae03df6da8", "file": "AppomattoxNewspapers_1918-1922a_0308.pdf", "page": 1, "text": "ol good lurid I mile of Appomattox a ii cl em en t , Auy i Miss Edna Turnes, of Lynch. S! FiET  a S M JM o T W I i Ur. 6PrtDt he week-end with her sister, Mrs Jessie Turnes. The binders are clicking and the quality of our wheat is good average. Lee the sales of land adver tised in this issue by Cormuis lioner H. M. Sackett See sale advertised of Pankey S ta te at Pamplin by A H Cli-ment, Commissioner. If you have the wages of sic com ng to vou, you may at least felicitate yourself that they can never be cut down. The catalogue of the Appo mattox Fair is now being mail ed out. Dates of Fair October 13, 14, 15 There is a tent show in town this week and all the loose change will be carried away with it. Mrs. Joe LsGrand and chil dren are visiting relatives in Crewe and in Prince Edward county. Mrs. Jack Haden and chil dren, of Goochland county, are visitors at the home of Mr. A. R. Harwood. Mr. Ira Turnes, of Lynch outs , was the week-end guest if his parautp, Mr and Mrs. A E Turnes"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Cormuis lioner H. M. <mark>Sackett</mark> See sale advertised of"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Cormuis lioner H. M. <mark>Sackett</mark> See sale advertised of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.58, 480.04, 1675.07, 748.37], "bbox_id": "dc04b62d1c", "file": "AppomattoxNewspapers_1908-1909a_0376.pdf", "page": 1, "text": "of the country, a man who is ooked upon in thje house as perhaps the outstanding con stitutional lawyer in that body. After concluded the quota tions, Senator Tyson added Mr. President, I have read ex tracts from the address ofRep- resentative Tucker, who is, I know, pne of the greatest con stitutional lawyers in the United States, and it is his con sidered opinion that the aliens Tn the United States should not be counted for the purpose of apportionment of represen tatives. Senator Sackett, of Ken tucky, also made similar use of the Tucker speech and ex tolled the Virginian as one of the nations foremost author- ties on the constitution. Though it does not appear in the record, it is a fact that"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of represen tatives. Senator <mark>Sackett</mark>, of Ken tucky, also"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of represen tatives. Senator <mark>Sackett</mark>, of Ken tucky, also"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.31, 502.36, 1686.27, 536.61], "bbox_id": "359ab40162", "file": "AppomattoxNewspapers_1905-1912a_0439.pdf", "page": 1, "text": "Notice the sales of real state of fered by Ghas. H. Sackett, Gomr., in this issue."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Notice the sales of real state of fered by Ghas. H. <mark>Sackett</mark>, Gomr., in this issue."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Notice the sales of real state of fered by Ghas. H. <mark>Sackett</mark>, Gomr., in this issue."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1775.74, 1073.07, 2090.36, 1301.66], "bbox_id": "501421f98b", "file": "AppomattoxNewspapers_1915-1918a_0474.pdf", "page": 1, "text": "not an issue in the campaign that it is a settled question. He has declared if elected gov ernor he will enforod the law, and that he will approve any reasonable additional legisla tion that may be necessary to render the prohibition law ef fective, as he accepts it as the expression of the majority of the people. We have mention ed Mr. Davis position upon the prohibition question, because we wish to relieve any misgiv ings that honest t h i n k i n  , lan, a newgp.per people may have upon the sub- 1 county on tbe 6th lav of November, 1917, that being the next succeeding rule day at-  ter this order was eutcrcd. A copyTeste J H ROUBLE V, Clerk by C W Smith, D C !Sackett Sackett, pq 10174w"}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "W Smith, D C !<mark>Sackett</mark> <mark>Sackett</mark>, pq 10174w"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "W Smith, D C !<mark>Sackett</mark> <mark>Sackett</mark>, pq 10174w"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [780.7, 215.17, 931.93, 366.61], "bbox_id": "8a4effed1e", "file": "AppomattoxNewspapers_1918-1922a_0488.pdf", "page": 1, "text": "ncessnry buildings. Land.  8ome forty or fifty acres of this tract is woooland The re minder is in cultivation and pas tore The land is well watered and the soil is adapt d to the grow ing of tobacco, grain and ihe usual crops in this section. This prop er y is well located on a good soil road some two and a half to three miles from Appomattox Court House and is convenient to churches and reboots. Terms cash. HENRY M. SACKETT, Trustee"}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "Terms cash. HENRY M. <mark>SACKETT</mark>, Trustee"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "Terms cash. HENRY M. <mark>SACKETT</mark>, Trustee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1484.59, 1125.13, 1643.09, 1281.53], "bbox_id": "3fefb12acd", "file": "AppomattoxNewspapers_1892-1898a_0343.pdf", "page": 1, "text": "Mrs. Geo. T, Peers, who lies dan gerously IU at tbe residence of Mr. Chas. H. Sackett in Lynchburg, is no better. Her death may be ex pected any moment. Mr. and Mrs. Emmet Taylor, and the mother of Mr. Taylor are 1! wih her. Mr. Peers will remain in Lynchburg until some change in her condition is noticed. L ater Mrs. Peers  died this morningaccount of her death will appear in onr next issue."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Mr. Chas. H. <mark>Sackett</mark> in Lynchburg, is no"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Mr. Chas. H. <mark>Sackett</mark> in Lynchburg, is no"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1483.47, 237.77, 1644.93, 259.31], "bbox_id": "0c4b375af1", "file": "AppomattoxNewspapers_1922-1923a_0455.pdf", "page": 1, "text": "Mr H. M. Sackett and wife, of Lynchburgj are fn town to-day."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr H. M. <mark>Sackett</mark> and wife, of Lynchburgj are fn town to-day."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr H. M. <mark>Sackett</mark> and wife, of Lynchburgj are fn town to-day."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [694.56, 433.23, 852.14, 503.43], "bbox_id": "3ba2b4cc86", "file": "AppomattoxNewspapers_1898-1902a_0462.pdf", "page": 1, "text": "Mr. Charles H. Sackett, of Lynch burg, and Mr. W. C. Franklin, ol Pamplin City, hare been in the vil lage for a day or two taking an ac- count in a chancery cause before Commissioner Peers."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr. Charles H. <mark>Sackett</mark>, of Lynch burg, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr. Charles H. <mark>Sackett</mark>, of Lynch burg, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.87, 804.22, 1665.42, 885.77], "bbox_id": "4f321c6b0e", "file": "AppomattoxNewspapers_1892-1898a_0404.pdf", "page": 1, "text": "Mr. Charles H. Sackett and his daughter, Miss Evie were in the village this week. While Mr. Sackett was here he sold the Meg- ginson Mill property to Mrs. El dridge Rnbertson for 2,000, which is said to be a good price."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr. Charles H. <mark>Sackett</mark> and his daughter, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr. Charles H. <mark>Sackett</mark> and his daughter, Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [792.23, 795.93, 953.59, 891.83], "bbox_id": "d2616af33b", "file": "AppomattoxNewspapers_1892-1898a_0030.pdf", "page": 1, "text": "Mr. C. H. Sackett, of Lynchburg, wa in attendance at court yesterday. Mr. E. C. Wooldridige, of Buckingham, attended court yesterday, Drs. Abbitt performed an operation on Mr. William H. Williamson Saturday night. He is said to be improving. Mr. R. H. Bell has moved to Lynch burg. Mr. George Singleton was married to Miss Laura Gilliam Wednesday, Dec."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr. C. H. <mark>Sackett</mark>, of Lynchburg, wa in"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr. C. H. <mark>Sackett</mark>, of Lynchburg, wa in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1339.44, 536.94, 1492.19, 559.19], "bbox_id": "7a4ad5ad22", "file": "AppomattoxNewspapers_1892-1898a_0294.pdf", "page": 1, "text": "Mr. C. H. Sackett of Lynchburg Va., attended our Couuty Court last"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr. C. H. <mark>Sackett</mark> of Lynchburg Va., attended our Couuty Court last"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr. C. H. <mark>Sackett</mark> of Lynchburg Va., attended our Couuty Court last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1608.23, 461.54, 1767.96, 505.84], "bbox_id": "7e1be38284", "file": "AppomattoxNewspapers_1902-1905a_0515.pdf", "page": 1, "text": "Mr. C. H . Sackett passed here this morning en route to North Carolina where goes on a visit to his daughter."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr. C. H . <mark>Sackett</mark> passed here this morning en route to North Carolina where goes on a visit to his daughter."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr. C. H . <mark>Sackett</mark> passed here this morning en route to North Carolina where goes on a visit to his daughter."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1373.53, 942.03, 1524.63, 988.23], "bbox_id": "ec0bc9be1d", "file": "AppomattoxNewspapers_1892-1898a_0254.pdf", "page": 1, "text": "Mr. B. F. Sackett, late of Pam- plins, has taken, up his abode here, and is now one of the guests of Ho tel Appomattox."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mr. B. F. <mark>Sackett</mark>, late of Pam- plins, has taken, up his abode here, and is now one of the guests of Ho tel Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mr. B. F. <mark>Sackett</mark>, late of Pam- plins, has taken, up his abode here, and is now one of the guests of Ho tel Appomattox."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1334.46, 1118.1, 1489.23, 1249.59], "bbox_id": "b5affda451", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "Misses Lucy and Emma Smith gave a very delightful soiree at the Hotel Appomattox, on Tuesday evening, in honor of Miss Annie Belle Sackett, of Lynchburg. There was a large crowd present and the hotel was a scene of gaity and pleas ure. Later in the evening, refresh ments were served in the dining room. Altogether it Was a most en joyable occasion."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "of Miss Annie Belle <mark>Sackett</mark>, of Lynchburg. There was"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "of Miss Annie Belle <mark>Sackett</mark>, of Lynchburg. There was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.68, 362.9, 1824.08, 470.35], "bbox_id": "530b57f561", "file": "AppomattoxNewspapers_1892-1898a_0350.pdf", "page": 1, "text": "Miss Lucy Thornhill, of Manches ter, Va., who is teaching school at Hebron spent last Saturday and Sunday at this place. Miss Annie Belle Sackett, daugh ter of our former countyman Mr. Chas. H. Sackett will be married in Lynchburg Oct. 25tli to Mr. Win. G. Sale, of Wilmington."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "place. Miss Annie Belle <mark>Sackett</mark>, daugh ter of our"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "place. Miss Annie Belle <mark>Sackett</mark>, daugh ter of our"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1335.07, 585.88, 1491.17, 621.08], "bbox_id": "2875507285", "file": "AppomattoxNewspapers_1892-1898a_0310.pdf", "page": 1, "text": "Miss Eva Sackett, of Lynchburg, ifioa a visit to her aunt, Mrs. Peers, at Hotel Appomattox"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Miss Eva <mark>Sackett</mark>, of Lynchburg, ifioa a visit to her aunt, Mrs. Peers, at Hotel Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Miss Eva <mark>Sackett</mark>, of Lynchburg, ifioa a visit to her aunt, Mrs. Peers, at Hotel Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.88, 652.76, 1486.81, 662.3], "bbox_id": "4d37895fea", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "Miss Annie Belle Sackett, of"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Miss Annie Belle <mark>Sackett</mark>, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Miss Annie Belle <mark>Sackett</mark>, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1428.5, 1332.08, 1752.11, 1526.12], "bbox_id": "42ef9f035e", "file": "AppomattoxNewspapers_1892-1898a_0274.pdf", "page": 1, "text": "Miss Alice Sackett, who has been I The Fortnightly L.  f hoarding at Hotel Appomattox for was entomme  priday evening. the past month, was taken ill quite I Dr.    was execu- snddenly last Satnrday night. Her 1 The following p gr father and sister, of Lynchburg were j ted ., -snared bv wired for and she had recovered 1- Drawn quotations, prepared by sufficiently by Wednesday of this Mrs. Nora ice. Mr N A r 7  3 v 2. Humorous speech, by M r. . a . week to return home. Mrs. Geo. T. Peers, met with a duetj Edenland, by painful,though not seriona accident,  and Mr j G Fisher, on Monday of this week. While S ta tio n , How Ruby Played going down to breakfast she tripped Bacbyby Rev. J. C. Leps up, and fell down the entire flight of stairs. We are glad to say how ever, that her only injury was a - j Q Fisher, slight dislocation of her left"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Miss Alice <mark>Sackett</mark>, who has been I"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Miss Alice <mark>Sackett</mark>, who has been I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1539.61, 510.77, 1696.21, 529.91], "bbox_id": "b68090b20d", "file": "AppomattoxNewspapers_1898-1902a_0024.pdf", "page": 1, "text": "Mf? H. M. Sackett is attendm. court."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Mf? H. M. <mark>Sackett</mark> is attendm. court."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Mf? H. M. <mark>Sackett</mark> is attendm. court."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1355.49, 1177.46, 1504.31, 1222.51], "bbox_id": "e06a152d04", "file": "AppomattoxNewspapers_1892-1898a_0246.pdf", "page": 1, "text": "Messrs. J. S. Diggs and 0 H. I Sackett, of the Lynchburg Bar,were I here the early part of the week at-  tending Circuit Court."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Messrs. J. S. Diggs and 0 H. I <mark>Sackett</mark>, of the Lynchburg Bar,were I here the early part of the week at-  tending Circuit Court."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Messrs. J. S. Diggs and 0 H. I <mark>Sackett</mark>, of the Lynchburg Bar,were I here the early part of the week at-  tending Circuit Court."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1317.11, 655.02, 1478.39, 701.02], "bbox_id": "0fb2fa77dd", "file": "AppomattoxNewspapers_1905-1912a_0306.pdf", "page": 1, "text": "Messrs. H. M. Sackett, R. L. Blackford and James Oaskie, at-1 torneys of the Lynchburg bar, were in Appomattox on legal business to- j"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Messrs. H. M. <mark>Sackett</mark>, R. L. Blackford and James Oaskie, at-1 torneys of the Lynchburg bar, were in Appomattox on legal business to- j"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Messrs. H. M. <mark>Sackett</mark>, R. L. Blackford and James Oaskie, at-1 torneys of the Lynchburg bar, were in Appomattox on legal business to- j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.08, 889.81, 1634.37, 946.61], "bbox_id": "04c4f7661e", "file": "AppomattoxNewspapers_1926-1933a_0449.pdf", "page": 1, "text": "M utual Savings Bank and T rust Co., of Lynchburg, quali fied as executors of C. W. H an cock estate in place of H. M. I Sackett, deceased."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "M utual Savings Bank and T rust Co., of Lynchburg, quali fied as executors of C. W. H an cock estate in place of H. M. I <mark>Sackett</mark>, deceased."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "M utual Savings Bank and T rust Co., of Lynchburg, quali fied as executors of C. W. H an cock estate in place of H. M. I <mark>Sackett</mark>, deceased."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [984.03, 430.34, 1237.1, 655.64], "bbox_id": "762ec98a56", "file": "TimesVirginian_1980a_0231.pdf", "page": 1, "text": "LYNCHBURG BLOCK VIRGINIA DUNBRK CO. MC. SgrvfnfTMf Af98F8r0gr46Ygurs A major contributor to the economic growth and development of this region has to be LYNCHBURG BLOCK VIRGINIA DUNBRIK CO. INC. specializing in the best in concrete blocks for all your masonry needs. Located at Sackett Street off of Campbell Avenue in Lynchburg, phone 846-2786. This well-known concern is responsible for pouring thousands and thousands of dollars back into the areas economy. They are one of the leading employers of the region and have made a definite mark on the overall financial picture of the city. They deserve your support. LYNCHBURG BLOCKS many customers are qulck to endor,se the business policies of this fine company. Theyre fair, honest, and above all, concerned with the growth and development of the region. The writers of this 1980 Review are pleased to be able to list them with the other community leaders."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "masonry needs. Located at <mark>Sackett</mark> Street off of Campbell"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "masonry needs. Located at <mark>Sackett</mark> Street off of Campbell"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [743.08, 1505.45, 862.5, 1527.55], "bbox_id": "93fbb48d15", "file": "AppomattoxNewspapers_1974-1975a_0374.pdf", "page": 1, "text": "KENNETH S. WHITE Attorney. Edmunds, Williams. Robertson, Sackett. Baldwin It Graves"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "KENNETH S. WHITE Attorney. Edmunds, Williams. Robertson, <mark>Sackett</mark>. Baldwin It Graves"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "KENNETH S. WHITE Attorney. Edmunds, Williams. Robertson, <mark>Sackett</mark>. Baldwin It Graves"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [472.8, 1771.51, 724.61, 1788.11], "bbox_id": "f476cbc3f1", "file": "TimesVirginian_1978_0332.pdf", "page": 1, "text": "K EN N ETH S. W HITE, s Attorney, Edmunds, Williams, Robertson, Sackett, Baldwin A Graves"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "K EN N ETH S. W HITE, s Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin A Graves"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "K EN N ETH S. W HITE, s Attorney, Edmunds, Williams, Robertson, <mark>Sackett</mark>, Baldwin A Graves"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [410.91, 680.09, 570.92, 726.38], "bbox_id": "77336cd5b1", "file": "AppomattoxNewspapers_1898-1902a_0111.pdf", "page": 1, "text": "Judge Win. II. Mann, Hon. Asa Watkius, T. D. Christian, Ulias. H. Sackett, attorneys, are attending circuit court."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Judge Win. II. Mann, Hon. Asa Watkius, T. D. Christian, Ulias. H. <mark>Sackett</mark>, attorneys, are attending circuit court."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Judge Win. II. Mann, Hon. Asa Watkius, T. D. Christian, Ulias. H. <mark>Sackett</mark>, attorneys, are attending circuit court."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1685.55, 1535.82, 1841.45, 1777.87], "bbox_id": "03260dda25", "file": "AppomattoxNewspapers_1898-1902a_0371.pdf", "page": 1, "text": "Judge liundiy adjourned Circuit Court here last Friday for the term Much Chancery business was dis posed of. Mattie Hubbard was ranted a divorce from her husband, Jobu Hubbard. In the damage suit of Oliver vs. N.  W. lty., the jury failed to agreefour of the jury standing for 5,000. Mr. Olivers friend- here regret the fail ure of the jury to agree upon a ver dict and confidently expect that he will be awarded damages at the next term of court.. Among the prominent visiting attorneys we mention Messrs. J. T. Coleman, 0. H. Sackett, J. E. Edmunds, Ed. S. Brown, ex-Mayor N. C. Mausou, of the Lynchburg bar, J. R. Jefferies, of Farquier"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "T. Coleman, 0. H. <mark>Sackett</mark>, J. E. Edmunds, Ed."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "T. Coleman, 0. H. <mark>Sackett</mark>, J. E. Edmunds, Ed."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1408.1, 1000.37, 1717.53, 1053.07], "bbox_id": "327f5d3d43", "file": "AppomattoxNewspapers_1902-1905a_0497.pdf", "page": 1, "text": "J.STEWART WALKER. Pres. fl. M. SACKETT, V.-P. A.W. M0SBY,Sec.4Treaa PIEDMONT LAND CO. Inc."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "J.STEWART WALKER. Pres. fl. M. <mark>SACKETT</mark>, V.-P. A.W. M0SBY,Sec.4Treaa PIEDMONT LAND CO. Inc."}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "J.STEWART WALKER. Pres. fl. M. <mark>SACKETT</mark>, V.-P. A.W. M0SBY,Sec.4Treaa PIEDMONT LAND CO. Inc."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1317.29, 1244.14, 1620.74, 1297.84], "bbox_id": "bff3f76d18", "file": "AppomattoxNewspapers_1902-1905a_0544.pdf", "page": 1, "text": "J.STEWABT WALKER, Pres. B. M. SACKETT, V.-P. A. W. MOSEY, Sec. ft T re  PIEDMONT LAND CO. Inc."}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "J.STEWABT WALKER, Pres. B. M. <mark>SACKETT</mark>, V.-P. A. W. MOSEY, Sec. ft T re  PIEDMONT LAND CO. Inc."}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "J.STEWABT WALKER, Pres. B. M. <mark>SACKETT</mark>, V.-P. A. W. MOSEY, Sec. ft T re  PIEDMONT LAND CO. Inc."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1320.93, 393.17, 1455.93, 457.42], "bbox_id": "f4fc5ab9f6", "file": "AppomattoxNewspapers_1892-1898a_0169.pdf", "page": 1, "text": "jjyn yesterday. C. H. Sackett, of Lynchburg, Ld in town yesterday fine cigar call o r Isle of W. A. Moses  Co,"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "jjyn yesterday. C. H. <mark>Sackett</mark>, of Lynchburg, Ld in town yesterday fine cigar call o r Isle of W. A. Moses  Co,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "jjyn yesterday. C. H. <mark>Sackett</mark>, of Lynchburg, Ld in town yesterday fine cigar call o r Isle of W. A. Moses  Co,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "Poore and C. H. <mark>Sackett</mark>. An iron mine at"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "Poore and C. H. <mark>Sackett</mark>. An iron mine at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2103.29, 406.85, 2428.84, 1207.39], "bbox_id": "a8e1cd0cbc", "file": "AppomattoxNewspapers_1892-1898a_0130.pdf", "page": 1, "text": "Item s of In te rest From All P a rts x. of the State.  -.I Gordon  Chamber?, a shoe house Lynchburg, made an assignment last week. By an act by the Legislature the name of North Danville has been changed to Neapolis. A. T. Adkerson  Co., of LynofciK burg, made an assignment on Wtdr nesday last with Mr, 0. H Sackett trustee. The ocean steamship New York left Newport News yesterday for ow York. She came out of the -, dry dock on Saturday. Judge William Pope Dabney, of , htwhutan died at his residenoe at Pawhatan courthouse yesterday. B e . ? ladbeen in feeble heedth for some time past. R. W. McFarland, an employe of Re Kindred Coal Company, of Roan oke, was arrested on last Wednesday, charged with forging five checks on the company. Vernon McClure, of Blue Ridge Springs, while jumping on a train at , Bonsacks, fell between two cars and was so badly mangled that he died in a short time. Mrs. Ellen Douglas Wilson,daugh- J ter of the late Douglas Gordon, of redericksburg, and sister of Him, Basil B. Gordon, of RappahannOok county,died last Saturday at her home s in Baltimore. Owing to the passage of a hill by the Legislature providing for State Danks of circulation, in case of re peal by Congress of the ten percent, tax, Virginia bonds were in demand - in New York last week. A bill was passed during foe last hours of the Legislature for the pro tection of boarding-house keepers. t provides that any person leaving such a house and not paying, inten tionally, shall be fined 60 or setttto jail not exceeding six months. A fatal railroad wreck occurred on the Shenandoah Valley Division of the Norfolk and Western early last Thursday morning. The engineer, Jacob Hardy, lost his life, and the? fireman, W. L. Noftsinger, was badly injured. The accident happened about ten miles north of Bnchanan. Joseph T. Picklem, of Ohilhowie, Va., formerly salesman of a Knox ville hardware honse, was found an- concious at his room in the Haucoot House, Withville, Va., on foe 6fo inst., having taken thirty grains of morphine. Ho was resuscitated wifo posse of the sheriff has no right ta considerable difficulty, and is ont of"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "with Mr, 0. H <mark>Sackett</mark> trustee. The ocean steamship"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "with Mr, 0. H <mark>Sackett</mark> trustee. The ocean steamship"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [740.37, 1273.33, 982.88, 1455.38], "bbox_id": "09e591e2c9", "file": "AppomattoxNewspapers_1902-1905a_0130.pdf", "page": 1, "text": "irginia  In Campbell Circuit Court Clerk Office, June 10, 1 j 3. r . _ . , I hereby certify that Henry M. Sackett and j Ot ulS illCDua Thomas D. Christian, commissioners in the I fnr mo chancery suit of Henry M. Sackett, Trustee.  L ys L H.Clay and others, have executed bond I in the penalty of S5.0G0, as required by decree ! in said case, March term, 1903. JOHN E. WITHERS, Clerk. By virtue of authority vested in me by the same decree, I will, at 11 oclock a . m . on the day of the above sale, offer for sale, upon the premises, at public auction, the following personal property 7 head of horses, lb head of cattle, one Deering Binder, and one Deer- in trOHer 111 of which said property is now on the above-described farm, and can be seen at any time before the day of sale. H. M. SACKETT. Commissioner.  n Campbell Circuit Cour Office, June 10,1903L I hereby certify that H. M. Sackett. com missioner in the chancery suit of Henrv M. ackett. Trustee, vs. L. H. Clay and others, has executed bond in the penalty of  1 . 000 , as decree in said case. March term. 1-Mi. JOHN E. WITHERS. Clerk, --4 wjts."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "certify that Henry M. <mark>Sackett</mark> and j Ot ulS"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "certify that Henry M. <mark>Sackett</mark> and j Ot ulS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [750.66, 198.29, 900.31, 290.18], "bbox_id": "d19eebed93", "file": "AppomattoxNewspapers_1918-1922a_0486.pdf", "page": 1, "text": "irg of tobacco, grain andjthe usual crops in this section. This prop ery is well located on a good soil road some two and a half to three miles from Appomattox Court House and is convenient to churches and schools. Terms cash. __ _ HENRY M. SACKETT, Trustee-"}, "highlight": {"text": {"matched_tokens": ["SACKETT"], "snippet": "Terms cash. __ _ HENRY M. <mark>SACKETT</mark>, Trustee-"}}, "highlights": [{"field": "text", "matched_tokens": ["SACKETT"], "snippet": "Terms cash. __ _ HENRY M. <mark>SACKETT</mark>, Trustee-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1825.89, 522.54, 1988.52, 902.43], "bbox_id": "fd3455fac7", "file": "AppomattoxNewspapers_1922-1923a_0530.pdf", "page": 1, "text": "IN THE CLERKS OFFICE OF THE CIR- L cuit Court of the county of Appomattox on the 10th day of September. 1907. Jerry Morris, Addie E. Wall and Cnssius T. Wall, her husband, Retta Man warring and James Man war ring, her husband. Netta Peer anJ Robert Peer, her husband, Dessto Bartley and William Bartley, her husband, Permelia C. Goodman and Frank W. Mc Kinney. Sheritf of Appomattox County, and as,such administrator of Philadelphia C. Goodman, deceased...................Plaintiff against A. M. Goodman. Thomas W. Moses. Assignee of R. T. Dawson Co., W. B. Bigbie, sur viving partner of himself and --- Bigbie, de ceased. late partners under the style and firm of Bigbie Bros.  Co.. S. W. Nowlin and W. P. Gibbs, late partners under the style and firm of Nowlin  Gibb-i. and Wil liam E. Pugh, Josephine C. Pugh, Calvin Pugh, Jesse Pugh, Charles Pugh and Cot ton Pugh, the last six of whom are infants under the age of 21 years, and the unknown heirs of James Morris, deceased, who are all non-residents of the State of Vir ginia .................. . ....................... Defendants, j The object of this suit is to sell two tracts of land situated in the county of Appomat- I tox, one near Spout Spring, containing 375 acres. held by the late D. P. Robertson, as trustee for Philadelphia C. Goodman and her children and the other containing 110 acres on Wreck Island Creek which was inherited by the said Philadelphia C. Goodman from the estate of her father. Benjamin Day, de ceased, and divide the proceeds amongst the parties entitled thereto. And an affidavit having been filed that the defendant unknown heirs of James Morris, deceased are not residents of the State of Virginia, it is ordered that they do appear here within fifteen days after due publica tion hereof, and do what may be necessary to protect their interests in this suit. And it is further ordered that a copy hereof be published once a week for four weeks in the Appomattox and Buckingham Times, a news paper published in the county of Appomat tox and that a copy be posted at the front door of the court nouse of this county on the 16th day of September, 1907, that being the next succeeding rule day after this order was entered, A copyTeste J. R. HORSLBY, Clerk. Sackett  Sackett, p. q. 9 11-41. Jfl H. CLEMENT Attorney-at-Law and Notary Public Appomattox, Va. Practice in the Courts of Appomattox, Buckingham. Campbell and Amherst."}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "J. R. HORSLBY, Clerk. <mark>Sackett</mark>  <mark>Sackett</mark>, p. q. 9"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "J. R. HORSLBY, Clerk. <mark>Sackett</mark>  <mark>Sackett</mark>, p. q. 9"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1847.72, 501.69, 2010.78, 855.64], "bbox_id": "5ce7cc233f", "file": "AppomattoxNewspapers_1922-1923a_0526.pdf", "page": 1, "text": "IN THE CLERKS OFFICE OF THE CIR- 1 cult Court of the county of Appomattox on the 10th day of September, 1907. Jerry Morris, Addie E. Wall and Cassius T. Wall, her nusband, Ketta Manwarrim? and James Manwarring, her husband. Netta Peer and Robert Peer, her husband, Bessie Bartley and William Bartley, her husband, Permelia C. Goodwin and Frank W. Mc Kinney, Sheriif of Appomattox County, and as.such administrator of Philadelphia C. Goodwin, deceased ................. .. Plaintiff against A. M. Goodwin. Thomas W. Moses. Assignee of R. T. Dawson A Co., W. B. Bigbie, sur viving partner of himself and ---- Bigbie, de ceased. late partners under the style and firm of Bigbie Bros.  Co.. S. W. Nowlin and W. p. Gibbs, late partners under the style and firm of Nowlin  Gibb1, and Wil liam R. Pugh. Josephine C. Pugh, Calvin Pugh. Jesse Pugh, Charles Pugh and Cot ton Pugh, the last six of whom are infants under the age of 21 years, and the unknown heirs of James Morris, deceased, who are all non-residents of the State of Vir ginia ..................................... . . .. Defendants. The object of this suit is to sell two tracts of land situated in the county of Appomat tox, one near Spout Spring, containing 875 acres, held bv the late D. P. Robertson, as trustee for Philadelphia C. Goodwin and her children and the other containing 110 acres on Wreck Island Creek which was inherited by the said Philadelphia C. Goodwin from the estate of her father. Benjamin Day, de ceased, and divide the proceeds amongst the parties entitled thereto. And an affidavit, having been filed that the defendant unknown heirs of James Morris, deceased are not residents of the Slate of Virginia, it is ordered that they do appear here within fifteen days after due publica tion hereof, and do what may be necessary to protect their interests in this suit. And it is further ordered that a copy hereof be published once a week for four weeks in the Appomattox and Buckingham Times, a news paper published in the county of Appomat tox and that a copy be posted at the front door of the court nouse of this county on the 16th day of September, 1907, that being the next succeeding rule day after this order was entered, A copyTeste J. R. HORSLBY, Clerk. Sackett  Sackett, p. q. 9 ll-4t."}, "highlight": {"text": {"matched_tokens": ["Sackett", "Sackett"], "snippet": "J. R. HORSLBY, Clerk. <mark>Sackett</mark>  <mark>Sackett</mark>, p. q. 9"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett", "Sackett"], "snippet": "J. R. HORSLBY, Clerk. <mark>Sackett</mark>  <mark>Sackett</mark>, p. q. 9"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [469.9, 1765.91, 795.24, 1825.41], "bbox_id": "d4ef074b0b", "file": "AppomattoxNewspapers_1918-1922a_0107.pdf", "page": 1, "text": "Imihediatelv after the sale by Heory M. Sackett, Commissioner, of the above land, I will off ? fey sale at the same place the following P ional prop-rtv Om poir mo!, oce w-hore wagon, about 200 bash to of wheat, 75 to 100 barrets ot oo n, and about sen stacks of hay.  it ii. ROBEBLbON. Admn, D. Mott Roaertooo, Dicd."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "sale by Heory M. <mark>Sackett</mark>, Commissioner, of the above"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "sale by Heory M. <mark>Sackett</mark>, Commissioner, of the above"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [419.48, 480.34, 572.22, 500.39], "bbox_id": "9e20562941", "file": "AppomattoxNewspapers_1898-1902a_0026.pdf", "page": 1, "text": "iM rfH . M. Sackett is attending nrt."}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "iM rfH . M. <mark>Sackett</mark> is attending nrt."}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "iM rfH . M. <mark>Sackett</mark> is attending nrt."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.45, 1535.19, 1694.65, 1639.03], "bbox_id": "8be620eda2", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "iif that Also the marriage of Rev. G. G. Sydnor, of Campbell county to Miss Evie A. Sackett, of Lynchburg, on the 24th inst. Mr. Wm. OBrien, of Lynchburg, bought the handsome estate known the Morgan farm court"}, "highlight": {"text": {"matched_tokens": ["Sackett"], "snippet": "to Miss Evie A. <mark>Sackett</mark>, of Lynchburg, on the"}}, "highlights": [{"field": "text", "matched_tokens": ["Sackett"], "snippet": "to Miss Evie A. <mark>Sackett</mark>, of Lynchburg, on the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
