{"document": {"bbox": [306.24, 422.48, 454.32, 1760.36], "bbox_id": "e479f14c1d", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "those who know his amiable deportment will admit that none can better deserve them. By Cel. Samuel D. MeDear- men - Gen. Zachary Taylor and his little army As long as our frontier is guarded by such gallant officers and soldiers, as they have proved themselves to be, one may fear no harm, though the Mexicans brag and the British Lion growl. By W. W. Hamner - The memory of Gen. Jackson. By Thomas S. Bocock - John C. Calhoun His transcendent genius, firmness and patriotism have been placed in a clearer light, by his recent course upon the Oregon question - If he is not the next President of the United States, it will be more the Countrys loss than his own. By Thomas 8. Bocock - Genera Taylor, the Hero of the Rio Grande. For his distinguish ed services in the present Mexican Campaign, he de serves the lasting gratitude of his countrymen, and the Presidency of the Union is a civil office and to be bestowed only on those who by a long course of services, show themselves able and faithful. By Thomas I. M. Cheatham - E. James Good May he soar aloft as on the wings of an eagle, in the estimation of his fellow citizens to the highest pinade of fame and pluck therefrom some of those beautiful and never facing wreaths of honor and renown, that has ever adorned the brow of our great, good and intelligent worthies of this our own, our happy America - NousVrons By Lieut. Peter H. Phelps  Wm. C. Rives, the able statesman and accomplished gentleman When will Virginia yea,,, the United States, properly appreciate him? By P B. Pankey  Colonels Benajamin P. Walker and Samuel D. McDearmon As Military Officers equalled by few. As Patriots surpassed by none. By A. H. Cox - The bravery of our soldiers on the plains of Palo Alto and Resaca de la Palma on the eighth and ninth of May prove them the worthy sons of noble sires. By Capt. Richard Perkins an invited Guest - The toast was prefaced by the remark, that it was conceived on approaching the fine barbecue and dinner - - The Whigs and Democrats They united on the Oregon Question to the 49th degree - now let us on this now more important occasion go with 540-40s - the whole hog or none. By R. H. Cox  The Ladies of Appomattox Though not in the, habit of being addressed publicly, their intelligence, modesty and beauty warrant the opinion that they are often addressed privately. By R. J. Wright - America is an island, and should be one and indivisible. By James O. Davidson - May the spirit of liberty which actuated the signers of the Declaration of Independence, be cherished in us and be perpetuated in the hearts of the young generation. By Josiah A. LeGrand - Constitutional liberty May its course be ever onward, till the whole world shall enjoy the blessedness. By John W. West - The Lieut. Col. of the 174th regiment  May his distinguished military talents be duly appreciated by the companies under his command. By Join Sears - Mr. Thomas S. Bocock May he ever continue to shine, a bright star in the affection of his countrymen. By M. C. Porter - The citizens of Appomattox May they ever be united - not consider stage roads, or other highways, as constituting points for divis ions, either in a civil, military or political point of view. By Capt. Wyatt Abbitt - The Fourth of July 1776 The day on which our fathers pledged their lives, their fortunes and their sacred honor for their country. We, this day, feel aware how honorably they redeemed their pledge. By Col. Z. E. Cheatham - The"}, "highlight": {"text": {"matched_tokens": ["Samuel", "D", "McDearmon"], "snippet": "Benajamin P. Walker and <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark> As Military Officers equalled"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D", "McDearmon"], "snippet": "Benajamin P. Walker and <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark> As Military Officers equalled"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Samuel", "D", "McDearmon"], "snippet": "House of Delegates Col, <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark>, Zachariah Cheatham, Crawford Jones,"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D", "McDearmon"], "snippet": "House of Delegates Col, <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark>, Zachariah Cheatham, Crawford Jones,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["Samuel", "D", "McDearmon", "McDearmon"], "snippet": "sheriff of Appomattox, with <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark>, Will iam J. <mark>McDearmon</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D", "McDearmon", "McDearmon"], "snippet": "sheriff of Appomattox, with <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark>, Will iam J. <mark>McDearmon</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["Samuel", "D", "McDearmon"], "snippet": "Appo- Mttox County, and <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark>, Wm. J. McDear- n"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D", "McDearmon"], "snippet": "Appo- Mttox County, and <mark>Samuel</mark> <mark>D</mark>. <mark>McDearmon</mark>, Wm. J. McDear- n"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Samuel", "D"], "snippet": "commissionec the first sheriff. <mark>Samuel</mark> <mark>D</mark>. Me Dearmon, William James"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D"], "snippet": "commissionec the first sheriff. <mark>Samuel</mark> <mark>D</mark>. Me Dearmon, William James"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["Samuel", "D"], "snippet": "th é first sheriff. <mark>Samuel</mark> <mark>D</mark>. Me Dearmon, William James"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D"], "snippet": "th é first sheriff. <mark>Samuel</mark> <mark>D</mark>. Me Dearmon, William James"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2314.31, 1139.19, 2487.29, 1489.79], "bbox_id": "8d24c5ab05", "file": "AppomattoxNewspapers_1949-1952a_0416.pdf", "page": 1, "text": "Mr. James Hudson Cheatham, 86, long-time proprietor of the Hotl Appomattox, died here on Suiday, Septamber 2, after an illness of sev eral weeks. as Born in Appomattox County Jane 7, 1865, he was the son of Thomas I. and Virginia Cawthorne Cheat ham. He and his widow, Mrs. Mollie Cheatham, had been proprietors of the local hotel for some 33 years. He was a member of the Evergreen Baptist Church. Surviving, in addition to his wid ow are a pister, Mrs. Bmmaline Banton, of Lynchburg two daugh ters, Mrs. L. M. Ringham, of Blue- field, and Mrs. Havilah Babcock, of Columbia, S. C. two sons, Tucker T. and Z. E. Cheatham, of Appo mattox and Evergreen four broth ers, Floyd Cheatham, of Birming ham Samuel D. Cheatham, of Pen sacola, Florida Jay Hubbard and Thomas Cheatham, both of Miami, Florida. Funeral services were held Mon day at 400 P. M. at the Ever green Cemetery, conducted by the Rev. Tearle Brown, pastor. Active pallbearers were Harry Johnson, Julian White, Daniel Jennings, A. A. Babcock, E. T. Mitchell and Wil bur McDearmon."}, "highlight": {"text": {"matched_tokens": ["Samuel", "D"], "snippet": "Cheatham, of Birming ham <mark>Samuel</mark> <mark>D</mark>. Cheatham, of Pen sacola,"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel", "D"], "snippet": "Cheatham, of Birming ham <mark>Samuel</mark> <mark>D</mark>. Cheatham, of Pen sacola,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1858.25, 1232.16, 2030.95, 1651.6], "bbox_id": "f3552367fa", "file": "AppomattoxNewspapers_1955-1957a_0230.pdf", "page": 1, "text": "Arrangements of multi-colored mid-summer flowers were used to decorate the home of Mr. and Mrs. Harold Y. Spencer Thursday, when Mrs. Spencer, new president of the Womans Club of Appomattox, en tertained members of the clubs Executive Board at a luncheon. Assisting Mrs. Spencer in car ing for her guests was her mother, Mrs. James D. McDearmon. Attending were Mrs. Shafter C. Drinkard, chairman the American Home Department Mrs. Frank F. Carr and Mrs. Thelbert M. Trent, co-chairmen Public Affairs, Legis lative and Welfare Department Mrs. Frances Cheatham, chairman Education and International Afr fairs Department Mrs. Samuel S. Shouse, chairman Fine Arts De partment Mrs. Joel W. Flood, pres ident Alice Kyle District Mrs. Ra chel F. Lawson, vice - president Mrs. Mildred Alvis, 2nd vice-presi dent Mrs. David M. Trent, chair man Ways and Means Committee Mrs. Charles R. Thomas, correspon ding secretary Mrs. Charles F. P. Crawley, immediate past president and Mrs. C. M. Stratton. Mrs. L. E. Andersen, treasurer, and iMrs. W. E. Ferrell, secretary, were out of town at this time. At this informal social meeting, plans and programs for the club year were discussed. The sponsoring of one major money-making pro ject, a Christmas bazaar, was de cided upon. Club dues are now pay able to Mrs. Anderson, treasurer."}, "highlight": {"text": {"matched_tokens": ["D", "McDearmon"], "snippet": "her mother, Mrs. James <mark>D</mark>. <mark>McDearmon</mark>. Attending were Mrs. Shafter"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "McDearmon"], "snippet": "her mother, Mrs. James <mark>D</mark>. <mark>McDearmon</mark>. Attending were Mrs. Shafter"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2209.72, 409.64, 2384.37, 1196.77], "bbox_id": "79c6f646e3", "file": "AppomattoxNewspapers_1922-1923a_0582.pdf", "page": 1, "text": "and pleasantly. There were som pleasant visitors in the neighbor hood and delightful sooial gather ings among the yonng folks. Miss Lizzie Keeling is the guest of the Misses Cola. Mr. Ran Coleman and family, of Manchester are at his mothers. Messrs. George Plunkett and George Tonny visited relatives and friends here during the holidays. Mr. W. T. Tonny, of Roanoke, was in the neighborhood Saturday- Mr. Conrad Odor, of the Hill City and Mr. and Mrs. Ellis Odor, if Reedy Springs, visited their brother, Mr. T. W. Odor recently. Mrs. W. G. Coleman, of near Reedy Spring is vi iting her daugh- ters, Fannie and Ossie Hunter, of! Richmond. . Miss Vivian Coleman, who is I teaching near Spring Mills, spent the holidays at home. We are glad to learn that Mrs.I Randolph Caldwell is mnoh better. I We were sorry to hear of the I death of MiBS Mary Inge. One who spent her life in helpfulness I  to others has gone to her reward. Miss Etta Ooleman is quite sick I  with LaGrippe. Mr. and Mrs. 0. S McDearmon, Mrs. Samuel Thornton, Mr. Nor man Barrar, Mr. anil Mrs. J, D McDearmon and others from Evfer- greeu, went to lloanoke last Satur day to attend the bauquet given to the employees of the Norfolk and Western Railway, Miss Elvyu Coleman left Satur day for a v s!t to her sister, M r, Paul Warren, of Hoanoke. Mr. George W. Coleman, Jr.,I I visited relatives in Prince Edward I during the holi. ays. Mr. Floyd Mann has moved to High Bridge and has aocepted work with Mr. Obie Manu Mr. Joe OBrien has moved to Mr. Robert Wooldridges. Mr. Linwood Gosney, who has beeu visiting his cousins, Messrs. Ben and O car Cole, has returned to his home iu Danville. We understand there is quite a good school at Cheathams Angle lsnt it wonderful Mr. Editorl bow everything seems to work just right for some people and others have to be satisfied with whatever those iu power see fit to accord them. Well it is said  ev erything o-mes to the man who Wiiits, but some of us just natural ly get tired of waiting."}, "highlight": {"text": {"matched_tokens": ["D", "McDearmon"], "snippet": "Mr. anil Mrs. J, <mark>D</mark> <mark>McDearmon</mark> and others from Evfer-"}}, "highlights": [{"field": "text", "matched_tokens": ["D", "McDearmon"], "snippet": "Mr. anil Mrs. J, <mark>D</mark> <mark>McDearmon</mark> and others from Evfer-"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2070.19, 303.71, 2241.09, 805.0], "bbox_id": "928b7a8960", "file": "AppomattoxNewspapers_1955-1957a_0105.pdf", "page": 1, "text": "come a Presbyterian then a union church because Hanover Presbytery could not furnish a pastor, nor even supplies regularly. However, there Was an organized Presbyterian Church as early as 1833, when it re ported to the General Assembly a membership of 32, with Rev. D. C. Proctor as Stated Supply. The oldest existing Session Book begins its re cord in 1852 as follows A petition from sundry members of Walkers Church showing that, by the removal of the surviving elders, the one to the State of North Carolina and the other to the town of Farmville, said church is now without a church session, having been present ed to the Presbytery of West Han over praying the Presbytery to set in order the things that are lacking in the organization 5f that church, it was resolved by the Presbytery that the prayer of the Petitioners be granted and that Rev. Isaac Cochran, Rev. Benjamin H. Rice, D. D., Rev. Samuel J. Price, and Mr. John W. Moseley be a commit tee to visit Walkers Church and fulfill their request. So on June 29, 1852, this Com mittee enrolled eighteen members in addition to the three eldcT who were ordained on May 30, preced ing. The elders were James Calhoun, Stephen C. Fore, and Dr. Nathaniel J. Terry. The members wens Mrs. Mary McDearmon, Sarah H. Mills, Martha V. Owens, Sr., Martha V. Owens, Jr., Sarah Woodson, Mrs. Mary E. Gilliam, Samuel Wheeler, -Mrs. Mary S. Wheeler, Mrs. Sarah E. Calhoun, Mrs. Harriet J. Fore, Mrs. Sarah Harper, Alice W. Har per, William I. Lewis, Margaret Mathews, Glapha Walker, Dr. Charles Biglow, Mrs. Frances A. Biglow, Obadiah Woodson. Subsequent minutes show the"}, "highlight": {"text": {"matched_tokens": ["D", "Samuel"], "snippet": "Benjamin H. Rice, D. <mark>D</mark>., Rev. <mark>Samuel</mark> J. Price, and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "Samuel"], "snippet": "Benjamin H. Rice, D. <mark>D</mark>., Rev. <mark>Samuel</mark> J. Price, and Mr."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [900.73, 520.6, 1062.82, 1094.46], "bbox_id": "f69d7d019a", "file": "AppomattoxNewspapers_1898-1902a_0331.pdf", "page": 1, "text": "Evergreen. Messrs. Ed. Cawthoru and Jim Hamilton visited Hixburg on Sun day last Mr. Thomas Ferguson, of Lynch burg, was among us last week. Mrs. James Gills and children, of ruchburg, are the guests of Mr. and Mrs. J. D. Cawthorn. Messrs. James McDearmon, John Mann, and Gas. Wooldridge visited the Hill City ou Saturday last. Mr. Jennings Ferguson aud his sister, Miss Virgiuia, spent Saturday aud Sunday iu our village. Misses Sallie aud Madeline Cole- mau, of West Appomattox, were the guests of the Misses Cawthorn ou Saturday aud Sunday last. Mrs. W. C. Farrar, who has been quite ill, is convalescent. Mr. Sam Cralle, of Norfolk, was last week the guest of his parents at this place. Mr. aud Mrs. C. S. McDearmon and children ou Sunday afternoon visited his nncle, Mr. Geo. Coleman, of West Appomattox. Mr. Samuel Marsh, of Lynchburg, is the guest of his son, Mr. Thomas Marsh, of this place. Mrs. Ed. Hamilton and children, of Rices, spent last week with her parents here. Miss Nannie Sims and her uiece, Miss Odelle Inge, spent Saturday and Sunday at this place. There was a sociable given at Mr. J. L. Daviss on Saturday night last, in honor of his uieces, Misses Maye and Jimmie Farrar, of Alabama, it was greatly eujoyed by all present. We trust that they will soon give us auother. Miss Lula Holt died at her home near Rocks Church 011 Thursday eveniug last. She was the daughter of Mrs. Bettie Holt. She had been confined to her bed for several ears. Her mother has the sympathy of us all iu her deep trouble. Mrs. Hudson Cheatham aud Mrs. Sam Ferguson visited your town 011 Tuesday, on business. Mr. Jack Mauu, of Richmond, is up ou a visit to bis  best girl, who lives near this place."}, "highlight": {"text": {"matched_tokens": ["D", "McDearmon"], "snippet": "Mr. and Mrs. J. <mark>D</mark>. Cawthorn. Messrs. James <mark>McDearmon</mark>, John Mann, and Gas."}}, "highlights": [{"field": "text", "matched_tokens": ["D", "McDearmon"], "snippet": "Mr. and Mrs. J. <mark>D</mark>. Cawthorn. Messrs. James <mark>McDearmon</mark>, John Mann, and Gas."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1915.91, 749.97, 2087.51, 1225.8], "bbox_id": "3c4e9893fa", "file": "AppomattoxNewspapers_1933-1936a_0505.pdf", "page": 1, "text": "Mr. Sears, or Tad as he was better known here, was born June 24, 1891, at Hixburg, this county, the son of the late Samuel and Colie Gilliam Sears. He attended the lo cal high school and then went to Fork Union Military Academy. Up on graduation there, he came to Appomattox and began his success ful career as a clerk in the Hard ware store. His abilities earned him promotion and he became vice-pres ident and manager, and thei upon the death of the late W. M. Han cock, he was made president of the firm. He served three years as a mem ber of the town council of Appo mattox and was actively identified with business and social life of the town and county. Ue was a mem ber of Liberty Baptist church. He is survived by his widow, Mr. Winifred Scott Sears one son, Dan iel Scott Sears, 18, a student of Hampton-Sydney college and two brothers, E . Percy Sears, of Hix burg Herman D. Sears, of High Point, N .C ., and by three sisters, Mrs. Pearl Marshall, of Hixburg Mrs. A . R. Harwood and Mrs. W . IS. Taylor, of Appomifttox. Funeral services will be held to morrow, Friday, at 3 P . M. from the Liberty Baptist church, conducted by the Rev. W . M.Thompson. Active pallbearers will be Joel W . Flood, J. A . Burke, W. E . Hancock, Dr. C. H. Swing, W.M. Morris and Dr. L. L. Gayle.Hon orary pallbearers will be J . O. Cole, C. C. Poe, O. W . Martin, T. M. Martin, Dr. D. N. Twy- man, T . J . Ligon, C. F James, Don Moses, C. T. Moses, F . C. Dresser, C. S. McDearmon, W.M. Abbitt, R. L. Burke, Dr. D. A. Christian, A.. J. Reeves, R. D. Bondurant, Harry McClung, and Walter Hunter. His nephews will be flower bearers. Interment will be in Liberty cemetery."}, "highlight": {"text": {"matched_tokens": ["McDearmon", "D"], "snippet": "C. Dresser, C. S. <mark>McDearmon</mark>, W.M. Abbitt, R. L. Burke, Dr. <mark>D</mark>. A. Christian, A.. J."}}, "highlights": [{"field": "text", "matched_tokens": ["McDearmon", "D"], "snippet": "C. Dresser, C. S. <mark>McDearmon</mark>, W.M. Abbitt, R. L. Burke, Dr. <mark>D</mark>. A. Christian, A.. J."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2193.03, 906.62, 2365.82, 1706.71], "bbox_id": "2581e3e160", "file": "AppomattoxNewspapers_1943-1947a_0007.pdf", "page": 1, "text": "The entire community was sad dened by the passing of Edmund Hudson Cawthorne, at his home in the Ould Apartments Friday morn ing. Prior to his death he had been a patient in the Virginia Baptist Hospital for a number of weeks. H-owever, he had recovered suffi- fieienily to come home and walk about the place.. Mr. Cawthorne was born sixty- nine years ago in Appomattox Co unty, the son of the late John Da vid and Mary Phelps Cawthorne.He was for a number of years a val ued employee of the Virginian rail road. In his later, years he was connected with various mercantile establishments. Mr. Cawthorne liv ed at one time in Roanoke and Brookneal for thirteen years and of her places where he left many friends who mourn his passing. He was a member of Liberty Baptist Church at Appjomattox, Lakeland Lodge, A. F.  A. M., Roanoke. He is survived by his widow, the former Nultie McDearmon two sons, John Raymond, of Roanoke, and Howard DuVal, of Altavista, two grandchildren, Barbara Anne and William DuVal Cawthorne. Al so the following brothers and sis ters J. Russell Cawthorne, of Spout Spring H. P. Cawthorne, of Roanoke, Mrs. Samuel Jennings, of Evergreen, and Mrs. Walter Far rar, of Petersburg.  Funeral services were conducted Sunday af ernoon at Liberty Bap tist Church. The Rev. H. Frederick Jones, pastor of the church, was as sisted by the Rev. R. E. Redding, the Rev. W. R. Reed, a id the Rev. A C Lawson.  Blessed Assurance and My Hope is Buii on Nothing Less, favorite hymr.s of Mr.Caw-  homes, were sung by the church choir. Interment took place in the Evergreen cemetery. Active pallbearers were H. W. McKinney, C. Lewis McDearmon,J. D. Jennings, J. K. Hamilton, El more C.. Farrar and Fred C. Caw thorne. A large gro-upi of local citi zens acted as honorary pallbearers. Mr. Cawthorne was one of the most popular and loved citizens of Appomattox. He possessed, in a marked degree, the spirit of friend liness and radiant good cheer. His smiles were scattered alike on rich and pool1, young and old, high and low. His greeting was reminescent of the Jine courtesy that has ever characterized the Virginia gentle man. Though he had been in frail health, a number of years, he pre ferred to work whenever it was humanly possible. He wished t o cotnribute his bit to life. His suf ferings he bore with rare courage. He was a devoted husband and father, and a faithful friend. W e like to think of him as Stepping on shore, and finding it Heaven Of taking hold of a hand, and find ing it Gods hand Of hreathin new air and finding it celestial air Of feeling invigorated, and finding it immortality Of passing from storm and tempest, Jo an unknown ealm  Of waking, and finding it Heaven."}, "highlight": {"text": {"matched_tokens": ["McDearmon"], "snippet": "widow, the former Nultie <mark>McDearmon</mark> two sons, John Raymond,"}}, "highlights": [{"field": "text", "matched_tokens": ["McDearmon"], "snippet": "widow, the former Nultie <mark>McDearmon</mark> two sons, John Raymond,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [673.8, 469.01, 844.1, 993.31], "bbox_id": "e584290371", "file": "AppomattoxNewspapers_1939-1943a_0432.pdf", "page": 1, "text": "T-304 Sampson Eugene Pennix N T-305 Samuel Bernard Doss W 306 John Emmett Stanley W T-307 Calvin Ako Harvey ÎN T-308 nes Howard Rosser W i-309 Warfefc Allen Webber W T-310 John Robert Lewis W T-311 Willie Thomas Puckett W T-312 Hiram Lester Reeves W T-313 Richard Edwin Fore W 314 Charles Witt Baldwin W T-315 James Lacy Russell W T-316 Willie Jackson Tolley W 317. Robert Robertson Williams W T-318 Richard Stanley Baldwin W 319 John William Megginson W T-320 Harry Morton Orange W T-321 Andre- Moser Goin W T-322 Jam Melvin Cumby W T-323 Mac Mover Baldwin W T-324 Willie Wilson Brown W 325 John Paul Jones N T-326 Ernest Walker N T-327 Vvillie Wy-.tt N T-328 James Henry Marshal N 329 George Morgan N T-330 Samuel Thomas Carwile W T-331 H rman Henry Schutt W T-332 James Robert Ford W T-333 Theodore Roosevelt Kestersv 334 Howlette Burge Martin W T-335 Willie Walker Mayberry W T-336 Floyd Brooks Smith W T-337 Frederick Jefferson Wheeler N T-338 Jack Lee Matthews N T-339 Eligha Calloway V N -340 Joel Emmett Day W -341 Charlie Newton Mayberry V -342 Wellington Henry Conner 143 G or e Albert Austin T-344 Emmett Taylor Layne V -345 James Everett Jamerson W T-346 Robert Twyrnan Burks W T-347 Fred Harrison Franklin W T-348 Earl Baxter Martin W T-349 James George Franklin W T-350 Warren Carlton W T-351 Aubrey Lafavette Doss W T-352 Sampson D -ey Cawthorn W T-353 Clarence Evant Tester W 354 Frank Harrison Ross N 355 Claude Lewis N T-356 William Hunter N T-357 Ray McKinley Rceser W T-358 Thomas Henry Massie W T-359 Claude Baldwin W 360 John Walker Webb Jr. W T-361 James Wilbur McDearmon W"}, "highlight": {"text": {"matched_tokens": ["Samuel"], "snippet": "Eugene Pennix N T-305 <mark>Samuel</mark> Bernard Doss W 306"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel"], "snippet": "Eugene Pennix N T-305 <mark>Samuel</mark> Bernard Doss W 306"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [897.84, 419.45, 1803.57, 860.23], "bbox_id": "2c282ff55d", "file": "AppomattoxNewspapers_1949-1952a_0601.pdf", "page": 1, "text": "SC R IPT U R E  Exodus 2012 M ark 78-13 Luke 241-52 John 1825-27. DEVOTIONAL REA D IN G  P roverb 41-10. MAY BIRTHDAYS Mrs. Wesley Stanley, May 14. Charles Richardson, May 3. Hamil Stanley, May 13. Alice Faye Almond, May 11. Larry G. Watson, May 8. Samuel Stanley, May 31. Roy Lee Sharp, May 24. Mrs. Henry Fleetwood nee Miss Alpha Higginbotham, May 15. Aubrey B. Evans, III, May 13. Aubrey B. Evans, Jr., May 23. Hubert Gallier, May 17. DeLoise Williams, May 30. Mrs. Helen Gunter, May 17. Wilfred Rogers, May 23. Mrs. R. B. Hudgins, May 27. Jack Lawson, May 10. Bobby Lawson, May 15. Mrs. Luther Franklin, May 24. Eugene Franklin, May 23. Bobby Franklin, May 25. Sandra Mottley, May 20. Mrs. Pauline Mottley, May 13. Mrs. Harold Franklin, May 14. Mrs. C. S .McDearmon, May 28. Mrs. E. Carroll Smith, May 23. Sammy Carter, May 21. Thomas Ranson, May 15. Mrs. Thomas Ranson, May 15. Mrs. Sam Anderson, May 28. Mrs. Carrie Ford, May 10. Samuel Ford, May. 18. Jackie Ford, May 6. Donna Grey Ford, May 26. Samuel tennis Ford, May 12. Mrs. Mae Lee Hodnett, May 20. Mrs. Dorothy Lee Moore, May 16. Charles T. Newman, U. S. N., May 27. Mildred L. Ferguson, May 14. Sammy L. Ferguson. May 22. Mrs. Elsie Lucado, May 21. Mrs. Roger Norfleet, May 18."}, "highlight": {"text": {"matched_tokens": ["D"], "snippet": "John 1825-27. DEVOTIONAL REA <mark>D</mark> IN G  P roverb"}}, "highlights": [{"field": "text", "matched_tokens": ["D"], "snippet": "John 1825-27. DEVOTIONAL REA <mark>D</mark> IN G  P roverb"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1670.15, 1581.49, 2312.27, 1760.85], "bbox_id": "74663c06b4", "file": "AppomattoxNewspapers_1926-1933a_0512.pdf", "page": 1, "text": "Patients will be examined on chel and Ruth Guill, Mr. Rlmolpomattox, visited in the home ly when referred by the family and Deleware Guill, Mrs. Cliff of Mrs. J. C. Staples Saturday, physician, and report of find- Franklin, Mrs. Willie Guill, Mr jr and jflrs. Clarence Me- ing will be made to him. Par- and Mrs. Thomas Guill, JAr. Dearmon and Mr. and Mrs. ents desiring to have their chil- Cliff Franklin, Jr., Mr. Clyde VVilbur McDearmon visited in dren examined, and adults who White, Misses Flora, Mattie home of Mr. and Mrs. E. F. want an examination for them- and Lucy Franklin, Mr. Wes- Glover Sunday p. m. selves should first consult the ley,  ? d ? avid f n 11-1!1 i o Miss Margaret Pittman, of faily Physician, and Mrs. Samuel Guill and  U chmond, visited her s i s t e r ,   will be no charge for children. The birthday cakeijtirs q P Farrar Sunday. I the tuberculin and chest exami-     1  ,. . . . nation, but when an X-ray pic- Mrs. E. F. Glover, who has ture 0f the chest is made there been sick, is improving. j wjjj he a charge of 2 to cover the cost, of making the picture. _ _________ . . . Alt children, white and col- ofour s  and brotherj Taylor Sweet Pepper and Earliana Tomattox, were visitors in Ever- ored, under 15 years of age,"}, "highlight": {"text": {"matched_tokens": ["McDearmon"], "snippet": "Jr., Mr. Clyde VVilbur <mark>McDearmon</mark> visited in dren examined,"}}, "highlights": [{"field": "text", "matched_tokens": ["McDearmon"], "snippet": "Jr., Mr. Clyde VVilbur <mark>McDearmon</mark> visited in dren examined,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1495.69, 578.28, 1657.66, 877.56], "bbox_id": "53bdcbdf99", "file": "AppomattoxNewspapers_1933-1936a_0163.pdf", "page": 1, "text": "Other Local On Page 8    Misses Ida Belle Evans, Ethelyn Lee and Bertrand and Samuel Lee spent Sunday in Richmond.    They were accompanied home by Mr. and Mrs. George Nnchols and George Hutson.    Mr. and Mrs. S. B. Keechlok, of Knoxville, were Sunday guests of Mr. and Mrs. Frank C. Dresser.    . Mr. and Mrs. C. S. McDearmon have leturned from a visit to Flor ida.    Rev. and Mrs. G. D. Coffey and jhildren, of Prospect were visitors n the home of Mr. and Mrs. C. W. Smith Saturday.  a  Mr. iand Mrs. Adfield McCain, and daughter, of Lynchburg were Sun day guests of Dr. and Mrs. Chas. F. James.    Mrs S. J. Crowder died at her home in Virgilina February 25. She vas the mother of Mrs. J. T. Irby 1 Appomattox."}, "highlight": {"text": {"matched_tokens": ["Samuel"], "snippet": "Lee and Bertrand and <mark>Samuel</mark> Lee spent Sunday in"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel"], "snippet": "Lee and Bertrand and <mark>Samuel</mark> Lee spent Sunday in"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1695.24, 403.89, 1863.59, 1223.88], "bbox_id": "e44cd3c8ce", "file": "AppomattoxNewspapers_1952-1954a_0180.pdf", "page": 1, "text": "Mrs. Mollie H. Lawson is ill at her home here. We are sorry to hear that Mr. Walter D. Hunter, of Route One is quite sick with flu. Mr. and Mrs. Sam Evans of Peters burg, will spend Wednesday with Mrs. Evans mother, Mrs. Jennie Johnson. Miss Betty Jane Wingfield, of Radford College, Radford, spent the weekend at her home here. Flatwood Blackwell, of VPI, spent the weekend with his parents, Mr. and Mrs. Curtis Blackwell, here. Mr. and Mrs. K. E. Coleman and son, Ken, were weekend guests of Mr. and Mrs. H. G. Johnson. Mr. and Mrs. Babby Lawson, of Richmond, spent the weekend here with relatives. Mrs. Samuel S. Shouse returned last week from a trip to New York City. Mrs. Mary Tucker, of Drakes Branch, was a visitor in the home of C. S. McDearmon last week. Mrs. C. E. Coleman, of Roanoke, spent the weekend with her sister, Mrs. W. L. Brown. Mr. Harold Coleman, of Roanoke, visited his aunt, Mrs, W. L. Brown, recently. Dinner guest of ifvv-ini Mrs. Paul Cawthorn Saturday evening were Mr. and Mrs. T. J. Cawthorn and son, Jack, and Mrs. Eva Cawthorn. Mrs. W. D. Mason, of Rice, visited her sister, Mrs. Matilda Hancock, and her brother, W. J. LeGrand, last week. W. R. Holt, who has been seriously ill and under observation in the Farmville Hospital, is now respond ing satisfactorily to treatment. Mrs. Sam Anderson came home iSunday after spending several days with her sister, Mrs. W. B. Thomas of Evergreen, who has been quite ill. She is much better at this writing. Mr. and Mrs. E. Carroll Smith and children spent Sunday with his parents, Mr. and Mrs. Eugene Smith in Charlottesville. Mrs. Sam Witt Jr., is a patient at the St. Elizabeths Hospital in Rich mond. Mrs. Witt is the daughter of C. S, McDearmon, of Appomattox. William T. Evans spent the week end with his parents, Mr. and Mrs. IS. J. Evans, in Petersburg He was accompanied by Mrs. Jennie John son and Miss Mary Watt Stanley. Mr. and Mrs. S. H. Wilkins, of Clifton Forge, spent the weekend .here with their daughter, Mrs. H. E. Kerr.  Friends have been advised of the illness of both Mr. and Mrs. R. Norman Dawson at the home of their niece, Mrs. Fred Roth, 164 West Taylor Rd., Philadelphia, Penn. Mr. and Mrs. Dawson left their home here just before the Christmas holidays to spend the winter with the Roths. Frank F. Carr and Clarence Moore left Monday morning for Virginia Beach where they will attend a State wide conservation meeting. While away, Mr. Moore will visit his daught er, Mrs. Joe Chinnis, at Norfolk."}, "highlight": {"text": {"matched_tokens": ["D"], "snippet": "hear that Mr. Walter <mark>D</mark>. Hunter, of Route One"}}, "highlights": [{"field": "text", "matched_tokens": ["D"], "snippet": "hear that Mr. Walter <mark>D</mark>. Hunter, of Route One"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2139.79, 758.8, 2315.37, 1605.42], "bbox_id": "b065f7eace", "file": "AppomattoxNewspapers_1902-1905a_0144.pdf", "page": 1, "text": "Mr. Tom  Marsh, near this piece. Mr. and Mrs. Ford of New Yorki n Thursday last the guests of his sisteiv Mrs. Samuel Fergnsou, ofjl this place. Quite a large crowd of both óldj end joung persona were invityd on Friday atoning to Mr. Johnny Gaw- .thorns, to work on the missionary! quilt to be given to Rev. W. E.War ren, Ltis in the evening ÍGe-ofanf, cake, and lemonade were served. To onr regret, Mim Carrie was too ill i to join ns, and of ooorm we did hot hpfqas. good, a time as wed have  done, bad she been with ns. That Ms the place to go tor a good time. fWa trust that Mim Carrie may soon be entirely pell again. Mr. Lacy Mcüearmon, of Barke- ville, came up on Wednesday last to visit hit relative here. Mr. Gus Wool ridge, who hat for the past four months been working at Portsmouth, Ohio, came borne a few days wgo. He is looking as well as ever  Mr. Jack Staples is now clerking i?F P   Tucker  Co., in place of iite p sid e Ragland. We wish this  wortby young man much success in his new business. There is a crowd of tbe railroad  boys now in onr village. We are al- ways glad to have them come, if It  is only for a few days. Dr. Wiley Tucker, who has for tbe put three months been with bis sister, Mrs. McDearmon, last1 week  left for Brobkneal, much to the, re- gret of his teeny friends, who were l anxious for bite to settle hete. We wish bint tench success.  Mr Neal Jennings, of Christian- burg, spent last week with his rela tive pad friends here. Come again, S eft We are always glad to TikIre you Amone us. Mr. William, of Hotel Pamplin, was jn our village on Tuesday last to fh Miss Ethel OBrien. Mr. and Mrs. Walter Davis, Roan oke, and their pretty little d rt catee here, yesterday from Pamplin City, I where Mrs. Davis has been the guest of her sister, Mrs. Edw.i. Hamilton. We fire iudeed glad to have them among us again. Among tiie many guests of Mr. and Mfs. Daniel Ferguson on Satur day night, July 25, were the follow ing persons from this place Mr. W. K. Wool ridge and daughter, Mim Let 4 Mi. Chap Sims, Mjss Vash.j Davis, Mr. Olff. Mann, Mim Mattie Sims Mim Bern Ragland, Mr. Floyd Wodfidge, Mr. Goa Woolridge, Miss Mánde Ragland, Mr. Neal Jennings. A nice supper -was served, and later ice cream and cake. They report that they never enjoyed a pleasanter evening. Mr. Tom LeGrand, who works at Blue Ridge, took back with hite on Sunday night his little son Jim to pend a week with a friend of his. Mr. Lather Southal spent Sunday with relatives at Prospect. Mim Fannie Harvey is tbe guest of Mr. Walker, of Pamplin City, and is under the doctors treatment. Mr. Chas. North,- of Lynchbnrg, was last week the guest of his rela tives the MeDearmont, of this place. August 3,1903."}, "highlight": {"text": {"matched_tokens": ["Samuel"], "snippet": "of his sisteiv Mrs. <mark>Samuel</mark> Fergnsou, ofjl this place."}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel"], "snippet": "of his sisteiv Mrs. <mark>Samuel</mark> Fergnsou, ofjl this place."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [253.43, 327.34, 416.06, 1224.9], "bbox_id": "ee8a14a089", "file": "AppomattoxNewspapers_1908-1909a_0492.pdf", "page": 1, "text": "Mr. and Mrs. Duval Caw- thorne, of Princeton, W. Va., visited this week in the home of C- S. McDearmon. Mrs. R. A. Steffans and three children, of Meanie, Florida, are visiting Mr. and Mrs. J. S. Kenney. . BL W. E. Abbitt, of Roanoke, and J. R. Abbitt, of Sweet Briar, spent Wednesday .in the home of A. R. Harwood. Mr. and Mrs. J. W. Scott, of New York have returned home after visiting Mr. and Mrs. W. W. Scott and Mrs. Tad Sears. Eddie, Betty and Jim Stan- of Virginia Beach are visiting their grandmother, Mrs. J. H. Stanley. Mrs. Helen Hicks, of Lynch burg, spent the week-end with her mother, Mrs. Cora John son.Thomas N. and H. J. Cam- efix and children, of Richmond Client the Fourth of July holi days with relatives near Vera. Little Miss Pauline Jamer- son has beensp ending some time visiting her grandparents Mr. and Mrs. R. L. Godsey. Mr. and Mrs. D. J. Frank lin visited his sister, Mrs. W. P. Gunter, in Petersburg, Sun day. Mr. and Mrs. Finley Doss and son, - Junior,spent the week-end with his parents Mr. and Mrs. Samuel H. Doss. Mr and Mrs. C. A. Hancock and grand-daughter, Jeanette, have returned to Huntington, W. Va., after visiting here. Mr. and Mrs. W. A. Walton have returned to Disputania after visiting Mr. and Mrs. T A. Walton here. Prof. Fitzgerald Flournoy and Mrs William Cabell Flour noy, Of Lexingtoh, were guests last week of Mrs. E. E. Gills. A party of local boys and girls spent Monday, July 4, at Lake Tonawanda, ending With a picnic supper at 6 oclock. The Rev. W. M. Thompson, Miss Virginia Lee Thompson and Jack Scott left this week to attend the Baptist encamp ment at Virginia Beach. Mr. and Mrs. Jay Packard, of Antigo, Wis., leftIor Rich mond and Washington after visiting Mr. ahd Mrs. H. C. Babcock here. . Mrs. Bezryl Burgardner, of Stoney Bottom, W. Va., and children, have returned home after visiting her aunt, Mrs. H. C. Babcock and others here. Miss Frankie Godsey, Of Lynchburg, .returned .home after a pleasant visit in the home of Mr. ahd Mrs. R. L. Godsey. i  Jones Caldwell, Of Lynch burg, Mr. and Mrs. C. D. Lew- jis and sons, Clark and Dan, visited their parents, Mr. and i Mrs. M. C. Caldwell, during the week-end."}, "highlight": {"text": {"matched_tokens": ["McDearmon"], "snippet": "home of C- S. <mark>McDearmon</mark>. Mrs. R. A. Steffans"}}, "highlights": [{"field": "text", "matched_tokens": ["McDearmon"], "snippet": "home of C- S. <mark>McDearmon</mark>. Mrs. R. A. Steffans"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [749.98, 984.62, 907.39, 1565.57], "bbox_id": "af1dbadfec", "file": "AppomattoxNewspapers_1898-1902a_0515.pdf", "page": 1, "text": "E v e rg re e n . Everything is very quiet just now in and around our village, as all of the railroad men are away. Theyll soon lie back, much to the delight of some persons. There is no sickness in the village now, we are glad to state. Messrs. Edmund Cawthorn . and Hamilton have had their store root painted. Mr. Willie Gills, uear West Ap pomattox, has bought the lot form erly owned by M h . Mary Norris. He has had the stone placed for the foundation of his new house. The lot is near the church. Mr. Samuel Ferguson has had his garden nicely fenced in, which adds much to the appeaaanee of his al ready pretty home. Mrs. Albert Harveys condition is not much improved, we are sorry to say. Dr. E. E. Walker and family, of Pamplin City, were not long ago the guests of relatives near this village. Mrs. Gollie Inge and her sou, Mr. Bennie Inge, are quite ill with fever. We hope for them a quick recovery. Capt. Marshall and wife, of West Appomattox, paid a visit on Sunday afternoon to Mr. and Mrs. McDear- tnon. Mr. and Mrs. John D. Hamilton were lately the guests of her broth er, Mr. Willie Inge, near this place. Miss Mazie McDearmon will this Tuesday evening leave for Burke- ville to visit her brother, Mr. Lacy McDearmon. She will be greatly missed by all. Miss Sadie Coleman and brother, of your town, were in our village last week. We are always pleased to see her. Mr. John Rutledge, of Roanoke, was last week the guest of his par ents near this place. Miss Gracie Browning, of the old Courthouse, was last week a visitor in our village. Miss Maude Ragland returned on Sunday afteinon from KeysviLe, where she has been visiting Roanoke Bridge, the beautiful home of Miss Evie Baker. She reported that she had a pleasant visit."}, "highlight": {"text": {"matched_tokens": ["Samuel"], "snippet": "near the church. Mr. <mark>Samuel</mark> Ferguson has had his"}}, "highlights": [{"field": "text", "matched_tokens": ["Samuel"], "snippet": "near the church. Mr. <mark>Samuel</mark> Ferguson has had his"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
