{"document": {"bbox": [1566.56, 451.25, 1928.66, 612.69], "bbox_id": "ba76f1f97f", "file": "TimesVirginian_1980a_0184.pdf", "page": 1, "text": "which would in turn be set by the negotiation is a tract of Continetal Can Mayor and Council. The charge to each land south of town, sewer customer wcuid be based solely The outfall line would enter Falling on the amount of water that customer River downstream from where it does used during a month, just as the with the current sewer system, and as current billing is done, according to a result, effluent purity standards will Mayor Ronnie Spiggle. not be as high. Spiggle noted that this would result  In addition, the proposed system will in equitable division of cost with provide for growth within the town and commercial sewer customers paying can be expanded as needed in later their fair share, and cause very little years. increase in sewer bills to people within The addendum, which will cost the the town who are on fixed incomes. town a maximum of 2,506, must be Though the site for the aerated completed and submitted to the federal lagoon plant has not been secured, av Environmental Protection Agency by prime candidate currently under ifuly 1."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "the with the current <mark>sewer</mark> <mark>system</mark>, and as current billing"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "the with the current <mark>sewer</mark> <mark>system</mark>, and as current billing"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1101.57, 194.46, 1266.77, 951.05], "bbox_id": "114b392a50", "file": "AppomattoxNewspapers_1912-1915a_0563.pdf", "page": 1, "text": "week lately when Ivy, nursed back to Strength and hope, listened to bis sim ple appeal. I am a lonesome man, you are a lonesome girl. I offer you a home. I think we could be very happy to gether. Oh!, If t could think you would not tire of mèI, so poor, so unused to love and tenderness! I could slave for you and be happy in the merest hut, she said. Basil Drake, in his coarse way, laughed uproariously as, a month before the wedding, he took Hugh to see the house and lot. A narrow strip of land two hundred feet wide, half a mile in length, lay between tbe hills. Once there had been a house there. It had been burned down. All that was. left was a substantial but rough tool house. Theres your house and lot, just aa I promised, he said. Hugh winced, but he said quietly  Thank you. I think I can make it do, He set at work to make the big roomy shell comfortable. One day while he was bard at work a stranger came to him. I understand you own the valley strip here clear to the next section line, he remarked. Thats right, replied Hugh. Got a deed to it? A week ago, all clear and record ed. We are surveying for a district sewer system, explained the man. i represent the county board of im provements. Your land has a natural slant and could be utilized without excavating. Would you sell? Why, 1 suppose I would, answered Hugh. Ive considered tbe land, so low and narrow, rather valueless, but I can offer you five thousand dol lars, said the man. Hugh was dazed. It seemed as if the coffers of Croesus had been sud denly set at hiB disposal. IllIll take it, he all but gasped, a wild, joyous vision of a little two thousand dollar rose-embowered cot tage nearer town filling bis vision. Then he signed a contract to ac cept five thousand dollars for the strip of ground, the house and lot shrewd, calculating Basil Drake had put over upon him. Drake looked chagrined and mad when he learned of the transaction. One glorious evening, that of their plain, simple wedding day, Hugh Evans led his bride to the little cottage of which he was the proud owner. Oh, Hugh! she breathed ecstat ically, as he led her up the path to the rose-glorified home, this is not ours? i Ours, my dear, yours and mine,, he said. . She put her loving arms about his neck. The blue heavens seemed to smile down upon them. -Then,, true children of the heart, they passed the humble portal of what was to them the .most beautiful palace in all the wide, wide world."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "surveying for a district <mark>sewer</mark> <mark>system</mark>, explained the man. i"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "surveying for a district <mark>sewer</mark> <mark>system</mark>, explained the man. i"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2338.8, 1177.32, 2505.08, 1265.82], "bbox_id": "234c405511", "file": "AppomattoxNewspapers_1947-1949a_0397.pdf", "page": 1, "text": "WatJ a job? The Town of Appo mttox is advertising for a man t be assistant to Town Sergeant J. W. Cawthon and aid in maintain ing the town streets, sewer system and many other tasks long en trusted to his capable hands. Th  town council recently voted to try to find an assistant."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "ing the town streets, <mark>sewer</mark> <mark>system</mark> and many other tasks"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "ing the town streets, <mark>sewer</mark> <mark>system</mark> and many other tasks"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1906.03, 1534.82, 2071.48, 1561.62], "bbox_id": "50d3693045", "file": "AppomattoxNewspapers_1936-1939a_0010.pdf", "page": 1, "text": "Town sewer system completed. Two cases of typhoid fever are .eported in county."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "Town <mark>sewer</mark> <mark>system</mark> completed. Two cases of typhoid fever are .eported in county."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "Town <mark>sewer</mark> <mark>system</mark> completed. Two cases of typhoid fever are .eported in county."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1049.75, 462.65, 1213.41, 492.35], "bbox_id": "d892a3b3ee", "file": "AppomattoxNewspapers_1939-1943a_0051.pdf", "page": 1, "text": "Town of Appomattox receives a PWA check for 15,250 as part pay ment on sewer system."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "Town of Appomattox receives a PWA check for 15,250 as part pay ment on <mark>sewer</mark> <mark>system</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "Town of Appomattox receives a PWA check for 15,250 as part pay ment on <mark>sewer</mark> <mark>system</mark>."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1083.84, 1412.03, 1372.89, 1634.15], "bbox_id": "7e4bd50b26", "file": "AppomattoxNewspapers_1936-1939a_0035.pdf", "page": 1, "text": "These buddings w ith th s land a d ja c e n t th e re to w ill Jba e fo r sale separately, as well as tw o lo ts w ith no b u  l,n l   J on them , which w 11 fro n t on an alleyrw ny thpg rup  P i Church S treet b etween the b rick sto re b u ild in g an d the  office building, ow ned by M rs. E th el O uld, a n d extending , the w estern boundry of the e n tire tra c t, w hich wll give  tage for the two unoccupied lots, this sto ra g e building the large garage m entioned above. T hese cu b-diviin will shown on a plat prepared by W . A. M oses w hich m ay be ,e n the B ank of A ppom attox and a t th e sale. i ... -...... ___ . . _ , ia fh e large residence has sixteen room s, is steam heated , radiators in every- room , and h a s an elec tric sto k e r fo r the W j nace, and is adequately equipped w ith elec tric lig h ts and ran ning w ater on every floor, hath room s, to ilets, etc. W iltiiM tW SW  . 1 The sm aller house n ex t to the, m ain dw elling ban sx v  including hath room , electric lights an d ru n n in g w ater. T o ther sm all dwelling has fo u r r wms an d is w ired fo r elect! lights and also fronts on R ailr ad A venue.  - l   -   T_  .i The brick store bu ilding is a sp.cn didly eq u ip p ed m odern buW in,g. All this p roperty is located n th - c e n te r o f the to  w ith surfaced streets on both, sides, accessible to the seWer system , an d very d esirable as residence a n d bus property. r"}, "highlight": {"text": {"matched_tokens": ["seWer", "system"], "snippet": "sides, accessible to the <mark>seWer</mark> <mark>system</mark> , an d very d"}}, "highlights": [{"field": "text", "matched_tokens": ["seWer", "system"], "snippet": "sides, accessible to the <mark>seWer</mark> <mark>system</mark> , an d very d"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [428.41, 772.5, 601.92, 1203.69], "bbox_id": "f09bd961d3", "file": "AppomattoxNewspapers_1939-1943a_0308.pdf", "page": 1, "text": "There are problems right here that should command our attention. We view it to be the -duty of a newspaper to constantly advocate the cause of sound progress. For years we advocated a local three- point program 1. A new high school building at Appomattox 2. A town sewer system 3. Restoration of the historic Appomattox Surrender Grounds The first two of these planks in our platform have been realized, and the third is not only assured but is under way. Bj.t, is that all? Shall we stop there? Are there other things Appo mattox needs, and the advocacy and planning of which should command our attention? Lets see .......... 1. The health and appearance of our town requires that some way be found to provide at least a weekly collection of garbage and trash. Un-1 der its present budget, the town has insufficient funds to provide this service, bt where mere is a will, a way will be found,.. . . and we advocate finding that way. 2. Our town has inadequate fire protection. Our fire engine is out moded. Frankly it is about fifteen years old and its tires have seen service over twelve years. And we need more fire plugs over 250,000 worth of buildings in Appomattox could not be reached by water if they caught on fire. Maybe your home is included! We have been lucky about fires, but, frankly, we would hate to be the insurance com pany carrying protection on some properties in town. 3. We have a wonderful attrac tion nearby, in Holliday Lake. But th e r o a d into Holliday Lake 3hould"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "Appomattox 2. A town <mark>sewer</mark> <mark>system</mark> 3. Restoration of the"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "Appomattox 2. A town <mark>sewer</mark> <mark>system</mark> 3. Restoration of the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [409.88, 1543.66, 698.48, 1654.71], "bbox_id": "1cea6d234c", "file": "AppomattoxNewspapers_1936-1939a_0039.pdf", "page": 1, "text": "The smaller house next to the. main dwelling han . x rooms, including bath room, electric lights and running water. The other small dwelling has four raoms and is wired for electr c lights and also fronts on Railroad Avenus. The brick store bilding is a sp rtididly equipped modern build ing. All this property i. located in the center of the Wwn, wUh surfaced streets on both sides, accessible to the new sewer system, and very desirab e as residence and business property. After offering ths property for sale in sub-division, mention ed above, I will them offer the entire property for sale."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "accessible to the new <mark>sewer</mark> <mark>system</mark>, and very desirab e"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "accessible to the new <mark>sewer</mark> <mark>system</mark>, and very desirab e"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [838.78, 1697.2, 993.25, 1946.15], "bbox_id": "993b21e611", "file": "AppomattoxNewspapers_1898-1902a_0630.pdf", "page": 1, "text": "The New York Subtreasury state ment shows that the banks lost-4,029,- 000 last week. . The Erie surplus alter, charges for quarter ending December 31 was 301,- 651 as against 306,120 last year. On four sales of Erie  Western pre ferred jumped from 134-to 138. The close on the previous day was at. 132. The common capital stock -of the Northern Pacific Company has been stricken from the list of the New York Slock Exchange. The Cincinnati Court has sustained the lease of the Cincinnati, Southern Railway to Cincinnati, New Orleans  Texas Pacific Railway, controlled by Southern Railway. The Finance Committee of Cleveland, O., has recommended the issue of bonds to the amount of 2,000,000 to complete the intercepting sewer system and 50,- 000 to establish free baths. The annual report of the Diamond Match Company for the year ending December 31 shows net earnings oil 2,0214172, an increase over the preced ing year of 6,233, and a total surplus of 1,736,919, as compared with 636,919 in the previous year."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "to complete the intercepting <mark>sewer</mark> <mark>system</mark> and 50,- 000 to"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "to complete the intercepting <mark>sewer</mark> <mark>system</mark> and 50,- 000 to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [591.77, 594.44, 760.94, 801.18], "bbox_id": "99d4f3c4cc", "file": "AppomattoxNewspapers_1939-1943a_0121.pdf", "page": 1, "text": "THE CENSUS RESULTS Appomattox takes pardonable pride in the results of the 1940 census, just announced _ A fine gain, fwm 704 to 1005 bears out the belief many of us have held, that ours is one of the fastest growing towns in Central Virginia. i Not only is Appomattox s growth one of size. In the last two years we have had remarkable growth in civic organizations, community ser vices Consider the list  New library facilities New school building Sanitary sewer system Active, garden club Active Ruritan Club Active Lions Club Boy Scout Troop New offices locat ed here Expansion of business services,"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "New school building Sanitary <mark>sewer</mark> <mark>system</mark> Active, garden club Active"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "New school building Sanitary <mark>sewer</mark> <mark>system</mark> Active, garden club Active"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [416.89, 649.73, 753.19, 1049.72], "bbox_id": "4c36f128a7", "file": "AppomattoxNewspapers_1939-1943a_0023.pdf", "page": 1, "text": "that topic. But we c come and go witnou statement that 1939 most progressive year of Appomattox and we ail should be properly thankful this Christmas for our many blessings. As A1 Smith used to say Lets look at the record! 1939 saw the comnletion of near ly 90 miles of Rural Electric lines, one of the most bcieficial project ever undertaken in Appomattox... _ _ _____ _ _ ____ 1939 saw the completion of a new I paratively brief 125,000 central high school build - 1 ing here, the greatest educational advance in 30 years... 1939 saw the completion 65,000 town sewer system, great est sanitary project in of the county... , 1939 saw the development of Holi- day Lake and a great recreational area in Appomattox and Bucking ham which portends wonders for this section... 1939 saw the completion  of a handsome county library building, the gift of a generous benefactor.. 1939 saw a handsome new county office building in use... 1939 saw great improvements to Route 460 in and near our county. . ___________  __ ____ I ___ _ 1939 saw a great business upswing  busts committee points out that tl and development of community lue, I census figures will not be ava clubs, churches and pride in growth. I aje or legislature when it cd 1939.... year of progress anaIvenes next month and that afiy-J achievement! , I districting based on the 1930 teas While Europe and Asia fought it  wouyj be ten years out of date out on battlefields during 1939, we I 0f this is apparrft. poured concrete and laid bricks! I would be a futile gesture to red Lets be grateful that we live m I  J 940 using as a basis f a land of peace and a community 1 ures wnjb re ten years old, wh of progress!  I by delaying two years the Gene"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "the completion 65,000 town <mark>sewer</mark> <mark>system</mark>, great est sanitary project"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "the completion 65,000 town <mark>sewer</mark> <mark>system</mark>, great est sanitary project"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1953.6, 553.13, 2114.32, 835.28], "bbox_id": "368cc9185c", "file": "AppomattoxNewspapers_1915-1918a_0128.pdf", "page": 1, "text": "stopped with a little straw. Even cat tie paths in pastures often deepen so that they need such treatment. In oth er places it is necessary to plnn to sow sorghum to stop washing, but if the gullies are more than a foot deep and two or three feet wide it is usual ly better to use brush, concrete dams, or the sewer system, which has given good results under certain circum stances. The Brush dam gives better results if straw is mixed with the brush to help hold the dirt. Wherever the fall is great enough to make the water cut seriously it is likely to be necessary to stake down the brush and straw so that they will not be washed away. For deep narrow gullies concrete dams from 6 to 12 inches thick will give better results. Iron rods to give weight must be used in re-enforcing the larger dams, but heavy wires .will d 6 very well in the smaller ones. The middle should Always be left lower than the edges and the supply way should be provided with a Concrete, stone or brick apron at the bottom of the gulley to prevent the falling water from cutting into the soil and under mining the dam."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "concrete dams, or the <mark>sewer</mark> <mark>system</mark>, which has given good"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "concrete dams, or the <mark>sewer</mark> <mark>system</mark>, which has given good"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [500.19, 1015.07, 2391.87, 1259.08], "bbox_id": "6ce0a606e5", "file": "AppomattoxNewspapers_1936-1939a_0011.pdf", "page": 1, "text": "Soute Boston plans gala program r this years tobacco festival. Seasoned Timber Tow.n sewer system completed. Two cases of typhoid fever are ported in county. Appomattox, Va,   medicine to MaUMUdee The athletic  - contests ot usually are won by do we find in cr. bination of physical -1 makes the champion war the men who go o .  ar young men. as are the n k  L 01 - htfng planes and man , battleships. fa industry and in business there i certain types of work that can best done by young men at their zenith physical dexterity and stamina. But It is a different matter to outli the policies of a giant corporation lead a country at war to understand a solve the complex problems of a er andiht0f  8ble to Wln the conflden and the full cooperation of leaders bl Ugil an? actlon For such importa tasks thoughtful persons demand men broad experience--seasoned timber  The biggest job in the world todav"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "festival. Seasoned Timber Tow.n <mark>sewer</mark> <mark>system</mark> completed. Two cases of"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "festival. Seasoned Timber Tow.n <mark>sewer</mark> <mark>system</mark> completed. Two cases of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [302.14, 546.12, 473.27, 1458.76], "bbox_id": "ea7f5d7f46", "file": "AppomattoxNewspapers_1905-1912a_0235.pdf", "page": 1, "text": "side Virginia ?oH ure yet to he folly ,tnon Or.e f our farmers, and he came to ns from the far West, ays he will make two hundred bushels f corn net season to the acre. Tuis may be counting chick ens rather prematurely bat he has the habit o doing whatever he und ertakes to do and I wouldnt wonder at his suocess on this new line. M ijor J. U Martin, who is al- vays marshall on tournament days, looks lonesome since he h is been stripped of hs fine feathers, in which lie was dressed for tho occasion And he makes a fine oog. , A Sunday School convention was h dd here on the eight1, in tho lee turp rom of tht Methodist church, ant the first interdenominational kind ev-r hed in theconnty. Bev. Co lins, oi Aheviile, N. C., was the moving spirit in the inauguration of tho nnvo ent and was present t intiuot and inspire wi h spirited address. He was followed iv the ms,o s of the Baptist and Presbyterian clinrche, Prof. Mad- lox, Mr. A. F. H ward, and Misses Andrews and Woodruff, of the Nor nul faculty. A permanent orgari- z it. ion was fleeed, with Mr H. E Urrow as pre-ident., Mr. Frank Bm on, secretarv Mr. V. Vaiden treasurer, and Mias Maud Talta ferro, assistant sectetary. It was anject of regret that the attend tuce from thdschools of the oonn ry ohurones was not  larger. Tbe tidies of he town had made ready to eut rtaiu them. Those who did attend i h troughty enjoyed th  day and no doubt new inspiration baa be-.-n given to the work. Every i o ty nappy over the results of the eleotion. Thu town council, at its la t ses sion, agreed to buy trie sewer system at a c st not to exceed 10,000 am the vuers w II on tbe 29tb of the pre- eut month xpr ss their views on the subject The arbitrators of the water question are still to bo heart from. A family from Minnesota arrived hi r  leoentty md now occupy a modest hou e on a ten-acre farm west of town and are basking in the royal sunsuine. Of coarse they en joy it as they oame direct from blinding now storms and driving b1 zzuds. And with the few acres the chickens were bought, and the fuiniy cow and the hogs and the c rn. so that they are rsady for housekeeping. Y ur o respondent s w them iu the midst of their ciiiokens and the scene was a pleas ant rural one. The wonder is that everybody doen come to South ide Virgin . But when they do o ime to us trout other sections the first thing to d is to learn our soil ud our bust methods of cultivating it There is no suck word as fail  r in the experience of people who obeeiv thin safe and sane ral."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "agreed to buy trie <mark>sewer</mark> <mark>system</mark> at a c st"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "agreed to buy trie <mark>sewer</mark> <mark>system</mark> at a c st"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1566.94, 695.52, 1711.44, 750.07], "bbox_id": "6aca17fea2", "file": "AppomattoxNewspapers_1936-1939a_0013.pdf", "page": 1, "text": "Sewer System In Operation"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "<mark>Sewer</mark> <mark>System</mark> In Operation"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "<mark>Sewer</mark> <mark>System</mark> In Operation"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [744.27, 1547.42, 1076.99, 1577.4], "bbox_id": "86625ed1e8", "file": "AppomattoxNewspapers_1939-1943a_0230.pdf", "page": 1, "text": "Sewer debt Of the total debt incurred by the Town for the construction of the Sewer System, amounting t o ............ 33,225.00 There has been paid ....................................................................... 3,725.00"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "Sewer debt Of the total debt incurred by the Town for the construction of the <mark>Sewer</mark> <mark>System</mark>, amounting t o ............ 33,225.00 There has been paid ....................................................................... 3,725.00"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "Sewer debt Of the total debt incurred by the Town for the construction of the <mark>Sewer</mark> <mark>System</mark>, amounting t o ............ 33,225.00 There has been paid ....................................................................... 3,725.00"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1924.3, 1641.87, 2088.35, 1711.65], "bbox_id": "57da404da2", "file": "AppomattoxNewspapers_1905-1912a_0122.pdf", "page": 1, "text": "River and Harbor Improved Wharves and Terminal Constructed Vlatr Potter Developed Railroad llullt Water Work Erect d Report an Propertle Sewer System Designed dear Water Filtration Consultation WOTIC- I NOTICE"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "River and Harbor Improved Wharves and Terminal Constructed Vlatr Potter Developed Railroad llullt Water Work Erect d Report an Propertle <mark>Sewer</mark> <mark>System</mark> Designed dear Water Filtration Consultation WOTIC- I NOTICE"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "River and Harbor Improved Wharves and Terminal Constructed Vlatr Potter Developed Railroad llullt Water Work Erect d Report an Propertle <mark>Sewer</mark> <mark>System</mark> Designed dear Water Filtration Consultation WOTIC- I NOTICE"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1725.52, 1053.0, 1997.37, 1358.97], "bbox_id": "8096741f19", "file": "TimesVirginian_1980a_0082.pdf", "page": 1, "text": "protection to the pipe work which was not stipulated in the bid. Theengineers estimates on the cost of the project was 275,000. Councilmen also received a repdrt on a proposed 48-unit HUD-subsidized housing project, known as the Virden Limited Housing Proposal. , The project would be available to families with between 7,000 and 17,500 annual income, with the amount of subsidy decreasing as the amount of yearly income increases. The housing proposal must be approved by the Uounty Board of Supervisors. If it is, then the town will receive 71,000 for improvements to the town sewer system to upgrade thq sewer so that it will handle the additional water inflow. City Manager Bill Britton said the money will be granted only if the sewer-improvement work is completed withinsix months of the date that the money is paid. He said he would include a clause in that agreement that would stipulate that the six months could not B o a rd m eets to n ig h t"}, "highlight": {"text": {"matched_tokens": ["sewer", "system", "sewer"], "snippet": "improvements to the town <mark>sewer</mark> <mark>system</mark> to upgrade thq <mark>sewer</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system", "sewer"], "snippet": "improvements to the town <mark>sewer</mark> <mark>system</mark> to upgrade thq <mark>sewer</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.5, 844.47, 2034.13, 1501.39], "bbox_id": "0e6392459e", "file": "TimesVirginian_1981a_0075.pdf", "page": 1, "text": "proposed hew sewer plant, if current trends of escalating  construction costs and federal spending cutbacks continue. Britton presented for the boards consideration an option whereby the county could participate in funding the seWer system in the event that all of the federal money needed to build the new sysrtem is not approved, or if construction cost overruns further escalate the estimated cost at vW proposed system. He noted that the countys participation could be viewed as an investment in feture industrial growth in the area surrounding the town. In addition, he said, federal laws regulating sewer authori ties would allow for an ordinance to by w ritten requiring any industry that moved into the county to repay the county a portion of the money used to fund, the sewer construction, Board Chairman Dr. S Tl. Lawson said he feels that Appomattox County has enough large industry for now, with three garment factories aiida furniture factory. O ther counties hayfe grown too fast for their own good,. and found themselves with more than they could handle, Lawton commented. He added that it might T h T more advantageous to the . county to seek smaller indus tries employing between 15 and 25 persons. Britton noted that current efforts by the Regan Adminis tration to reduce federal regulation Of localities may. result - in the towns being perm ited  to upgrade the current sewer system, rather than having to build a.new one. But even witM relaxed federal regulations, any com mercial growth requiring use of town sewer facilities would be Father Darkleaf"}, "highlight": {"text": {"matched_tokens": ["seWer", "system"], "snippet": "participate in funding the <mark>seWer</mark> <mark>system</mark> in the event that"}}, "highlights": [{"field": "text", "matched_tokens": ["seWer", "system"], "snippet": "participate in funding the <mark>seWer</mark> <mark>system</mark> in the event that"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.73, 590.25, 1508.85, 1181.52], "bbox_id": "38efe0806c", "file": "TimesVirginian_1980a_0333.pdf", "page": 1, "text": "producing substantial am ounts of water. The Councilmen authorised Britton to approach the Appomattox County School Board, owners of the property, and negotiate an agreement that would allow the town to drill a test well on the property. Councilmen also heard a report on the cable television franchise in Appomattox. Arco, Inç., the Pennsylvania-based company which holds the franchise, has not been in compliance with the terms of the franchise, according to Britten. He noted that the company was given 30 days to come into compliance, and that time was due to expire Tuesday Oct. 14. After that time, thé town could annul the franchise, Britton noted. He said that a cable television firm currently operating but of Farm vilie has expressed strong interest in picking up the franchise if Arco loses it. The Councilmen also voted to put a street fight on a stretch of Morris Avenue which is abnormally dark at night. Mayor Ronnie Spiggle noted that street lights are vary expensive, costing the taxpayers .-more than 12,000 in the first nine Months of fiscal 1966. In other business the . few er com m ittee m o  a te iM d  c M fM - roval for a motion to deny MbMviHe Furniture Industries access to the municipal sewer system. Commit tee spokesman Ray Noble noted that addition of the Thomasville wastep ater would put additional strain on a system which is already operating near capacity, and would necessitate costly monitoring since the influent contains chemicals which are consider ed hazardous materials. The Couneilmon aisé voted to adopt a proposed Areawide Housing Opportu nity Kan AHOP with the stipulation that the plan be administered locally. The plan, if proved by the U. S. Department of Housing and Urban Dev elopment, would provide a method of dispersing federal housing subsidy funds for low-snd-ukoderate-income . housing."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "access to the municipal <mark>sewer</mark> <mark>system</mark>. Commit tee spokesman Ray"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "access to the municipal <mark>sewer</mark> <mark>system</mark>. Commit tee spokesman Ray"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1102.02, 1023.18, 1256.16, 1060.8], "bbox_id": "c4b9db6772", "file": "AppomattoxNewspapers_1933-1936a_0382.pdf", "page": 1, "text": "Old Oakes Skip Found 4 Sore!. Que.Workmen digging a trench for a sewer system in the Do minion government shipyard here un"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "Old Oakes Skip Found 4 Sore!. Que.Workmen digging a trench for a <mark>sewer</mark> <mark>system</mark> in the Do minion government shipyard here un"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "Old Oakes Skip Found 4 Sore!. Que.Workmen digging a trench for a <mark>sewer</mark> <mark>system</mark> in the Do minion government shipyard here un"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [840.26, 1112.07, 1027.92, 1535.81], "bbox_id": "786c5375b7", "file": "AppomattoxNewspapers_1947-1949a_0436.pdf", "page": 1, "text": "of present ownership over fifteen thousand dollars not to say any thing aljput repairs and labor. THISis the baby which it has been voted so the paper says to aban- r _ don. Now what is the record of ! this worthless company. It has been on tap day and night to serve your needs at home for cooking, drinking, bathing and sani tary purposes. This same system which it is pro posed to scrap has stood on tap day and night guarding your homes against fire - ready on call to fur nish the tfater to fight fires. Never once has the water fiailed in such cases. Take two of our biggest fires Rosser Milling Company - Plenty of water - but part of the equipment was not even on the fire truck. Take the case of the J. E. Seats Co. fire  This fire started in open day time at the lunch hour - The fire truck came - the water was ready - what happened - in the first few minutes the fire engine stalled Lynchburg was called and they came with two engines and pulled on this bad water supply for six hours and not once did they call for water  it was on tap. Again  This town voted a bond issue of 25,000 dollars to build a sewer system and disposal plant. They have spent many thousands more in sewer extensions since  Do you suppose a sewer system would have been built at so great cost if it had not been that we have a good water system? Of course I know every public"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "dollars to build a <mark>sewer</mark> <mark>system</mark> and disposal plant. They"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "dollars to build a <mark>sewer</mark> <mark>system</mark> and disposal plant. They"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1539.05, 527.08, 1715.67, 976.26], "bbox_id": "73237210ff", "file": "TimesVirginian_1980a_0122.pdf", "page": 1, "text": "now due to the present inflationary times and the economic conditions was made by Councilman Richard L. Bass and seconded by Thomas W. Lawson. All members approved the motion. Plans are for the town to revitalize the present sewer system and make do with what they can afford to pay for without putting a burden on the citizens of the Town of Appomattox. More than 60 per cent of the heads of households in the Town of Appomattox are over 62 years of age and are trying to live oo fixed incomes. The Town of Appomattox has taken a stand, it is fed up with Federal and State mandates, according to the coun cil members. George E. Jones  Sons, Inc. of Amherst has been awarded the con tract to connect the new one-million gallon water storage tank to the existing town water line. Construction is scheduled to begin May 16. M ay Spiggle read a proclamation from the City of Lynchburg thanking them for the assistance given by Town Police Department in carrying, out operation sting. In other business council a conjunction with the A_ ty Board of Supervisors, a support tie Existing Housing Section 8, Rental Subsidy program. Council voted to participate in the anti-litter campaign and will have a truck available on certain days to pick up litter in the corporate limits of the town only. On recommendation from the Street Committee council will turn over 200 feet of Price Land and 400 feet of Ethel Street.to the Virginia Department of Highways. ,v"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "to revitalize the present <mark>sewer</mark> <mark>system</mark> and make do with"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "to revitalize the present <mark>sewer</mark> <mark>system</mark> and make do with"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.72, 499.94, 1710.81, 622.14], "bbox_id": "4249febc87", "file": "TimesVirginian_1980a_0216.pdf", "page": 1, "text": "notification of funding by Oct. 1 . Tho funding would cover 75 percent of the cost of the now municipal sewer system, which engineers have estimat ed will total approximately  1.6 million. The new sewer system will have a 400,000-gallon-per-day capacity, with an outfall pipe Mitering railing River downstream from the outfaU pipe used hi the current sewer system, resulting in lower effluent-quality standards. Britton added that the town"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "of the now municipal <mark>sewer</mark> <mark>system</mark>, which engineers have estimat"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "of the now municipal <mark>sewer</mark> <mark>system</mark>, which engineers have estimat"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1759.89, 949.27, 1927.29, 1373.97], "bbox_id": "a45bfdf85f", "file": "AppomattoxNewspapers_1936-1939a_0037.pdf", "page": 1, "text": "Mrs. W T Steele is in the hospi tal for treatment. Mr. and Mrs. R .F B Steele and family, of Petersburg, spent the week-end here in the Burke home. Rev. L.C. Shearer and Rev. R. H Shapland are spending this week in Danvillei attending a Methodist conference. The Appqmattox girls basketball team will play Pampini here this afternoon at 315. There will be an auction sale of the W .L.Ould real estate here on Saturday- October 14. See complete information see Page 8, Have you mailed in tbe post card sent you about the Anti-Rat Cam paign in Appomattox? The Lions Cluj Charter Night will be - held October 26. Thè re gular meeting of the club will be held tonight. Several from here attended Buck ingham court this week. The office of the county treasur er js being moved to flay to the new office building at the court house. Nearly forty families have now tapped on to the new town sewer system. Work is progressin grapidly on the new residence of W.W.Burke, and on the drolling being erected oq the old warehouse site on Court Street. 3   s  W. W. Burke has dedicated to the town a street from his new res idence"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "to the new town <mark>sewer</mark> <mark>system</mark>. Work is progressin grapidly"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "to the new town <mark>sewer</mark> <mark>system</mark>. Work is progressin grapidly"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1670.15, 369.46, 1832.05, 1055.49], "bbox_id": "5af6916dd5", "file": "AppomattoxNewspapers_1902-1905a_0141.pdf", "page": 1, "text": "M ovem ent to Prom ote the M aterial Aa pects o f Hom e Life. The American Institute for Social Service has named delegates to attenf the international housing congress hich Is to be held in Paris from Julj to November, end. the purpose of whlcl Is to arrive at the best plans for mak ing the homes of the working people more especially the poosqr classes more healthful, convenient and attract e without Imposing serious additional burdens on tbe occupants. It is ex pected that in this long continued con gress the whole subject, from tht standpoint of the working people, th landlord, the tenant, the philanthropist and the municipal and State govern ments, will be reviewed and consid ered. Much good should result tho world over from such deliberations. This subject is one to which the peo ple of this country should give special consideration. The working people of the United States live better than those of any other nation In the world, but so they should. They are better paid. The opportunities for general educa tion and refinement are within the each of a much larger proportion of the population than in any other coun try. The inducements for individual ambition are greater in this free, demo cratic land than in other parts of the world. Yet there is scope for great improvement in the domestic environ ments of a very large class of Ameri can working people, and it should be the business of all those who, through the obligations of special fortune or thoseof official position can do mucb to promote the social order, to glvo this subject attention. A little direction, given in the right spirit, will help amazingly those who have little art in helping themselves in the improvement of -the material aspects of home life. The matters of sanitation, cleanliness, order, furnish ings and decorations, both in the house and on the premises, can be greatly promoted through a measure of en couragement. These things do not necessarily make living more, expens ive, nor do they increase the burden? of home keeping. A house once in or der may be kept in order with but little daily attention.  But the greatest aid and incentive to better standards in the home Is hlghet standards in the municipality. A city that has well-paved and well-kept streets, good sidewalks, plentiful shade, fine parks, handsome boulevards and abundance of water at cheap rates, a perfect sewer system and a public- spirited administration will not only nspire civic and individual pride in the hearts of its residents, but it will also Invite the better classes in all tho walks of life. People who seek new and permanent homes take into con sideration the general advantages of a city as well ns the immediate interests of their business or profession.Haft sas City Star."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "cheap rates, a perfect <mark>sewer</mark> <mark>system</mark> and a public- spirited"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "cheap rates, a perfect <mark>sewer</mark> <mark>system</mark> and a public- spirited"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [109.7, 289.83, 434.13, 317.58], "bbox_id": "c640310c1f", "file": "AppomattoxNewspapers_1905-1912a_0290.pdf", "page": 1, "text": "j S 1 wU   .r. voted for Ih.  young  Tender pure lasing the sewer system at"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "j S 1 wU   .r. voted for Ih.  young  Tender pure lasing the <mark>sewer</mark> <mark>system</mark> at"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "j S 1 wU   .r. voted for Ih.  young  Tender pure lasing the <mark>sewer</mark> <mark>system</mark> at"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1502.39, 950.89, 2177.68, 1071.33], "bbox_id": "d58120ad28", "file": "AppomattoxNewspapers_1939-1943a_0410.pdf", "page": 1, "text": "It is forecast that 1,300,000 men goodnessthe old ling to provide books for these men Ten million booksor more is the national goal and these books are sought from readers all over the lanp  , . w nf ma__ kinds  er side_ to ttn s conservation  to , nation. Regfstration hours wiU Good books of many Rinas are i to0 at wj,lch we will all probably 7 , a m tn q p ___ _ needed fiction, technical books, cur-j have to become experts. Thats noth- 0  engine. The town operates on a very I rent cairs, government, history and I ing than tpUng care of things slim budget and faces constant de-J biography, poems, plays, essays, and I ___ from garden hose to tractors. mauds for new services and calls for I reference works. In short, exactly the I Tbats j ust keeping the old bus increasing services already render-1 hooks most of us like are the ones I running and being careful of its tires Miss Alice Harwood entertained ed. When you deduct the tax used I our service men would like. I because it may be a long, long while Saturday evening in her newly com- to pay for our sewer system tee j Appomattox county is again go-1 before you can get another helping, pleted home, which is now being oc-"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "to pay for our <mark>sewer</mark> <mark>system</mark> tee j Appomattox county"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "to pay for our <mark>sewer</mark> <mark>system</mark> tee j Appomattox county"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1893.31, 781.36, 2304.36, 872.62], "bbox_id": "caf6500114", "file": "TimesVirginian_1981a_0222.pdf", "page": 1, "text": "Improvements discussed or town 9s sewer system"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "Improvements discussed or town 9s <mark>sewer</mark> <mark>system</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "Improvements discussed or town 9s <mark>sewer</mark> <mark>system</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1354.22, 799.17, 1535.46, 1372.63], "bbox_id": "885030bbf1", "file": "TimesVirginian_1980a_0159.pdf", "page": 1, "text": "Hie Appomattox Town Council instructed Mayor Ronnie Appon night i and To Monday 1 Town Manager Bill Britton to toft the state W ater Control Board that Appomattox wants 100 percent funding or no funding for a new regional sewer system. Spiggle aad Britton are scheduled to appevbefore the W ater Control Board tomorrow Friday to discuss th e possibility o f. altering the plan for expenditure of sewer-grant funds already approved for the town.- The town wants the states support in using grant monies to upgrade its existing sewer acHity. Britton and Spiggle had originally planned to approach the W ater Control Board to return the funds b e  allocated, but that the town write an addendum to the original grant application which would allow Appo mattox to build n sewer system which would be left of a financial burden to the townspeople. Britton noted Monday night that the money has been approved end awaits final formal application from Appomat tox. The councilman, however, said they would rather make it dear that the town wants complete funding if the federal governm ent is going to mandate that it build a new sewer plant. Council also voted to sonrove a 99-year right-of-way lease to VEPCO for installation of a power line across a portion of the old landfill rite. The town will receive 1150 for the lease, which involves less than an acre of land. Council also voted to advertise a, proposed bank franchise tax ordinance for Appomattox. Britton explained that Appomattox and other towns in the state are currently under suit by Fidelity Bank, which is contesting the state law which allows the towns to tax the bank franchise. The proposed drifinanee would be a protective measure to prevent further suits. Britton noted that the General Assembly enacted legislation in it 1980 session which allows towns to pass such protective ordinances."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "for a new regional <mark>sewer</mark> <mark>system</mark>. Spiggle aad Britton are"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "for a new regional <mark>sewer</mark> <mark>system</mark>. Spiggle aad Britton are"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2088.24, 636.25, 2421.35, 708.48], "bbox_id": "ce22449019", "file": "AppomattoxNewspapers_1936-1939a_0004.pdf", "page": 1, "text": "Have you read all the ads? m , ,   ------------ _____ Near 8nd of work on .lOppomattox Roosevelt may recall congress to , Sewer system _________ enact neutrality law changes in the  T event of war in Europe L Experts, geliev Italy not planning ______ 1 I for immediate war. Appomattox fjaseball cam lest Sunday to Boydton, 6 to 2. tYiir town needs boosters!"}, "highlight": {"text": {"matched_tokens": ["Sewer", "system"], "snippet": "may recall congress to , <mark>Sewer</mark> <mark>system</mark> _________ enact neutrality law changes"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "system"], "snippet": "may recall congress to , <mark>Sewer</mark> <mark>system</mark> _________ enact neutrality law changes"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.61, 518.05, 1891.47, 1185.37], "bbox_id": "89718fc81e", "file": "TimesVirginian_1980a_0254.pdf", "page": 1, "text": "have very little to hpld them here. A lot of people who would stay in Appomattox for a meal wind up going to Lynchburg because they cant have a glass of wine or a beer with their meal. She added, I dont expect to make a lot of money off the sale of beer and - wine in fact, I dont expect to mkke much at all. But I think being able to sell beer and wine on Sunday will keep a lot of business in Appomattox. Councilman voted to advertise the proposed change in the town ordinance, which currently prohibits sale of alcoholic beverages on Sunday within the corporate limits. The proposed change would allow sale of beer and wine between the hours of noon and 11 p.m. Sundays. We need to get public comment on this proposal before we make any changes, noted Councilman Robert Hubbard. In another matter, council granted a conditional use permit to Harry G. Lawson, who is seeking to build 50 apartment units on a parcel of land off Dogwood Street in the Morris Heights area. The permit was granted on the stipulation that Lawson pay the town ahy necessary funds for upgrading the town sewer system to treat additional sewage created by the apartment project, if it is determined that the plant can not handle the additional sewage at the time that the apartments are completed. If, on the other hand, the sewage plant can process the additional load created by the apartments when construction is complete. Lawson will be connected the same as any other sewer and water customer. Councty -.ajaq approved a . zoning change on two acres of land at the northwest corner of town on Route 460, at the request of Steve Poole. Poole said he and Marshall Goin are planning to relocate their businesses on the land, which is located adjacent to the Lee Grant motel, northwest of the Thomasville property. Maylor Ronald C. Spiggle pointed out that thetowns policy has been for a new business to bear the expense of connecting to the town water line if a line does not already exist in the area, and that there are no lines in the area which Ppole proposed to build. Poole said he understands and that the stipulation will present no problem. The council voted unanimously to approve the zoning change from M-l to B-l,"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "for upgrading the town <mark>sewer</mark> <mark>system</mark> to treat additional sewage"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "for upgrading the town <mark>sewer</mark> <mark>system</mark> to treat additional sewage"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [184.3, 282.52, 352.92, 873.81], "bbox_id": "90d2a5712e", "file": "AppomattoxNewspapers_1905-1912a_0332.pdf", "page": 1, "text": "fABMVILLE. Thi closing days of April white with frost in the early ing hours and then bright with sun shine until the sun went down, the fruit escaped it simply means that frost isnt always an enemy of opening buds. Fortunately neither wheat nor grass wilt under the bit ing touch and those crops are rich in promise. Our Main street looks more eity- fied since the shade trees have al been cut down, but in the hot days of August we will long for the sheltering arms of our old friends. One well has been left open on this street to the comfort and joy of many who have been using the water for years and who think it pure, health-giving and delightful to the taste. Before Farmville began the new work on its streets all the bonds which were issued for street im provement in years gone hy had been paid off and destroyed. And then after using the cobble stones on Main street for sixty years they have been placed on other streets in as good condition as when brought into service. At the next session of the council the body will not only elect a Mayor to fill out the unexpired term of Mayor Blanton, but will no doubt appoint a business manager to have charge of the light, water and sewer system. To make a mistake as to the right man for the place would be a distinct blow to the best inte rests of the people of the town. The Jeffersonian test of honest and capable will no doubt be applied and some one will be found to mea sure up to it. Letters have been pouring in to. our growers of lettuce asking that the plants le hurried to market. There is evidently great demand for"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "the light, water and <mark>sewer</mark> <mark>system</mark>. To make a mistake"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "the light, water and <mark>sewer</mark> <mark>system</mark>. To make a mistake"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [122.14, 580.7, 293.04, 1742.99], "bbox_id": "6b9d5df814", "file": "AppomattoxNewspapers_1905-1912a_0143.pdf", "page": 1, "text": "F A R M V I L L E . Between lawn parties, dancing at the armory, entertainment by the Bine lodge, bridge parties and the like Farmvilles social circles have known no dnll hour of late.  Let the world wag as it will well be gay and happy still. Tiie town council has had the es timates of the experts as to the value of our water and sewer system pub lished in pamphlet form for the benefit of the tax payers of the town, and when they have been carefully examined I presume a pro per oonelusion will be arrived at. A large sum of money will be involved in the purohaae and the wishes of those who aro to pay the money will be respected. The consensus of opinion is that all towns as well as all cities should control their utilities and Farmville cannot be au exception to the general rule. Whenever a municipality gets into the market, however, the purchaser prices go soaring. The world has yet to learn that the money of cor porations, big or little, belongs to anybody. It just Bee ms to be the prey of any man who can get his hands on it. And it may be due to the fact that corporations have no souls and therefore are insensate. This! feeling prevails in Washington to an alarming extent and from that as a .center spreads the country ever. Or lato I have been watching county wagons lea ing town loaded with hay and meal, and the sight is slwsys a sad one to- me. F irmers - may no doubt laugh at suggestions that go ont to them from men who work in thé shade, but it doe  seem to me strange indeed that any farm er should be content to buy from stores the things which he may raise on the farm. I know of no success ful grower of tobacco who buys food for teams or workers in his fields. First feed the fsmily and then help to feed the world must be the best policy. But I say again it is with diffidence that I make suggestions to those who lator in the snnBhine with coats off and sleeves rolled up. Our churches have again observed Childrens Day and the occasions were impressive and enjoyable. It remains ever true that a little child shall lead them. And at times such as t ese the smallest of them do lead gently, sweetly and lovingly. Heaven will be filled with children and yet there is no reason to fear that others will be crowded eut. Those of us who witness the unfolding of such programs little appreciate the earnest work which has gone before that there may be no hiteh nor break. And this is womans work too. The men of the chnrches may keep the women from voting but they can not combine to keep them from working. Editor Hart has recently been in Richmond making ready for the meeting of the editorial association daring the month of July. A great time is ant cipated as the brothers commune together while they ride the high seaa over. It is said that when Memphis recently entertained th? editors of Mississippi  nothing solid was allowed, but no such order has been issued for the Vir ginia meet. But neither have pro hibitory orders been issued. It is rather remarkable that all of oar warehouse inspectors should spend their summers on farms. They should know just what it costs to raise tobacco and should have some thing to do with fixing proper prices for the weed. That the men who grow it should be well paid for their work is nothing but"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "of our water and <mark>sewer</mark> <mark>system</mark> pub lished in pamphlet"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "of our water and <mark>sewer</mark> <mark>system</mark> pub lished in pamphlet"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [258.88, 1488.52, 423.38, 1776.91], "bbox_id": "9230f766b5", "file": "AppomattoxNewspapers_1905-1912a_0425.pdf", "page": 1, "text": "expressed in sharp and stinging I words. His many friends unite I with him in his regret that the law I should have interrupted his daily I comfort and convenience. The sewer system of the town is I being extended and the convenience I will be brought in touch of every hoiuo in Farmville. Our smooth pavements still give entire satisfac tion and our side-walks remain peer less, Mr. B. J. Wortham, who so long served as deputy clerk of the oounty under his distinguished father, has sold out his household fnrniture and another old homestead is broken up. The older of ub regret the passing of the old land-marks for about them gathered much of the glory in days gone by. Let me just here congrat ulate the Guu Club of Appoiittox ou the fine record it is making! as I leans from the T imes - V iaeiJu  , and let"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "comfort and convenience. The <mark>sewer</mark> <mark>system</mark> of the town is"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "comfort and convenience. The <mark>sewer</mark> <mark>system</mark> of the town is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1552.28, 383.19, 1720.99, 745.04], "bbox_id": "87aad886a8", "file": "AppomattoxNewspapers_1939-1943a_0028.pdf", "page": 1, "text": "Continued from Page 1 July 12, Supreme Court Justice James C. McReynolds passes through Appomattox. July 13. Miss Virginia Christian to be Miss Appomattox  at South Boston ITobacco Festival. July 19, Joel W. Flood named commander local post of American Legion. July 27, Large recreational area in Appomattox and Buckingham is leased to the State. Aug. 2, T .U . Connor dies Aug. 2, Funeral of A.F.Drink- ard.Aug. 5, C . T . Moses named pres identof Tabocca Growers Associa tion- . . . , . Aug. 12, New baseball park is opened here. Aug. 15, Senator Byrd and throng of 800 attend Young Democratic Club barbeeue at Holiday -Lake. Aug. 23, Lions Club formed here. Aug. 20, New to ,n sewer system completed. Aug. 22, New Appomattox high school ready. Sept. 9, Langran and Whitaker open mens ab-p here. Sept 12, New school dedicated. Sept. 23, School opens football schedule. . Oct. 1, Va. Public Service Com pany announces rate cut. Oct. 5, Referendum in bright to bacco belt. . Jf Oct. 5, Funeral Mrs. W.W.Far-"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "20, New to ,n <mark>sewer</mark> <mark>system</mark> completed. Aug. 22, New"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "20, New to ,n <mark>sewer</mark> <mark>system</mark> completed. Aug. 22, New"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [676.28, 979.67, 1005.93, 1240.97], "bbox_id": "c19ab5d930", "file": "AppomattoxNewspapers_1952-1954a_0173.pdf", "page": 1, "text": "community formed comn rit V clinic. Some of the results 1. All streets in the village paved. 2. Sewer system installed. 3. Needed doctors obtained. 4. Recreation facilities provided. 5. Adult education program. Holtville, Alabama. Boys and girls can work miracles under their own power. They may need help in shaping their first plansbut, after that, youd better watch out or youll get run over. At the beginning of this project Holtville, Alabama, was a village of about 100 homes strung along the pike 25 miles from Montgomery. It offered no hope for the ambitious young person. Its unpainted frame houses were spotted with black where weather-beaten boards were rotted. Dirt yards were dusty in summer and muddy in winter. In their eroded fields farmers raised little but weevil infested cotton, scrawny chickens, and razor backed hogs. Their wive of children. School buildings are  perspired over hot wood stoves, and"}, "highlight": {"text": {"matched_tokens": ["Sewer", "system"], "snippet": "the village paved. 2. <mark>Sewer</mark> <mark>system</mark> installed. 3. Needed doctors"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "system"], "snippet": "the village paved. 2. <mark>Sewer</mark> <mark>system</mark> installed. 3. Needed doctors"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [198.02, 1616.44, 485.11, 1751.89], "bbox_id": "a320f05399", "file": "AppomattoxNewspapers_1902-1905a_0453.pdf", "page": 1, "text": "Captain Kjeldsen has been engaged to command the Terra Nova, William Zeig- ler s new vessel, which will leave in May for the Far North. The sanitary authorities of the Pan ama .Canal zone government have un dertaken the sanitation.of the cits of Panama and Colop. Houses are being thoroughly fumigated and work on the sewer system and water-supply plant is advancing rapidly. King Victor Emmanuel discussed with --------cretarv he Society for the Protection of Emigrants, the conditions of the centra, part of the sun, J immigrant in tjte United States."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "and work on the <mark>sewer</mark> <mark>system</mark> and water-supply plant is"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "and work on the <mark>sewer</mark> <mark>system</mark> and water-supply plant is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1380.24, 543.25, 2110.36, 1025.32], "bbox_id": "14484755de", "file": "TimesVirginian_1980a_0167.pdf", "page": 1, "text": "By BILL SHERROD Appomattox may build a waste water-treatment system to serve an area smaller than that originally proposed by the federal Environmental Protection Agency, according to Town Manager Bill Britton. Britton reported at a special meeting of the Mayor and Council Monday night that representatives of the state Water Control Board have agreed that the wastewater-treatment service area can be condensed to serve the corporate limits and a small area outside the town, rather than the wide region originally proposed by EPA. He met with the Water Control Board Friday to discuss possible alternatives to the proposed regional facility. The council has become concerned with the projected cost of a regional facility. Britton said Monday that-a number of alternatives exist which would allow the town to build, a less expensive treatment plant. The two alternatives in which the councilmen expressed an interest involve upgrading and expanding the existing sewer system. One alternative would be to revamp the, sewer treatment plant currently being used, and run an outfall line to Falling River. The second alternative appealing to the council involves revitalizing the existing sewer treatment plant, and using it vas a preliminary treatment system for an overland flow system located on Continental Can property squth of town. t An added attraction of the overland-flow system is that it would bit eligible for 85 percent funding by 4Ee-Iedeal government, including Charges set"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "and expanding the existing <mark>sewer</mark> <mark>system</mark>. One alternative would be"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "and expanding the existing <mark>sewer</mark> <mark>system</mark>. One alternative would be"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1565.71, 568.87, 1731.84, 637.87], "bbox_id": "69ee4978c2", "file": "AppomattoxNewspapers_1936-1939a_0006.pdf", "page": 1, "text": "Building and improvement pro jects about 175,000 are in final stages of completion in Appomattox. The town sewer system will be completed in another week. Inspec tion of. the job will take place this week-end."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "in Appomattox. The town <mark>sewer</mark> <mark>system</mark> will be completed in"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "in Appomattox. The town <mark>sewer</mark> <mark>system</mark> will be completed in"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [865.69, 318.77, 1013.27, 685.41], "bbox_id": "7fbdc9be22", "file": "TimesVirginian_1976_0331.pdf", "page": 1, "text": "budget. This is not a surplus, as it has been accounted for nd only amounts to a paper transfer. When asked about the swine flu immunization program in the area, Dr, J. B. Kinlaw, area health director, told the board I just dont have the personnel and neither does any health department, so we are asking industry to help OUt. , Dr. Kinlaw said originally the department planned to give the shots during the last two weeks in October, but delays in producing the vaccine have pushed the program until Nov. 5 through 12. Were going to be taxed, he said, in giving the abets to 140,000 people in the Central Virginia area. In his report to the board, Slagle said Pampiin again is seeking a D epartm ent of Housing and Urban Develop ment grant td finance a water and sewer system for the town. The town tried unsuccessful ly for a similar grant last year so it is attempting to gather more information to document  this years application."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "finance a water and <mark>sewer</mark> <mark>system</mark> for the town. The"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "finance a water and <mark>sewer</mark> <mark>system</mark> for the town. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1412.11, 506.22, 1579.26, 569.97], "bbox_id": "3c8add96b3", "file": "AppomattoxNewspapers_1936-1939a_0010.pdf", "page": 1, "text": "Boute 460 is comiajg back! Bids have been opened for taking put dangerous curves in and near Spout Spring and for macadam. The contractor is ready to turn the completed Appomattox sewer system over to the town."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "turn the completed Appomattox <mark>sewer</mark> <mark>system</mark> over to the town."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "turn the completed Appomattox <mark>sewer</mark> <mark>system</mark> over to the town."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [132.01, 1067.44, 293.98, 1233.69], "bbox_id": "1352b6b966", "file": "AppomattoxNewspapers_1912-1915a_0220.pdf", "page": 1, "text": "Benjamin L. Dulaney, coal land own er and steamship operator, of Wash Ington and Bristol, is improving Clif ton Heights, a commanding section on the high knot in the western suburbs of Bristol. He has graded roadways of shale surface entirely around the heights so that automobiles can go and come on a 5 per cent grade. He has constructed a pumping station at the base of the heights, from which water is carried into a reservoir on the highest point. The grounds on the summit have been platted and pro vided with a water and sewer system, and already several handsoihe sum mer homes are In process of construc tion."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "with a water and <mark>sewer</mark> <mark>system</mark>, and already several handsoihe"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "with a water and <mark>sewer</mark> <mark>system</mark>, and already several handsoihe"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [207.55, 732.12, 366.3, 998.87], "bbox_id": "d44af59651", "file": "AppomattoxNewspapers_1905-1912a_0324.pdf", "page": 1, "text": "At a largely attended mass meet ing whici was held on Monday evening the subject of the sixty-five thousand bond issue for the pur chase of the water plant, was thoroughly discussed and at the conclusion of the meeting the con- sansns of opinin was that the voters would vote the amount by signific ant majority. It would complicate things should this prediction not prove true. Farmville must own all its utilities, improve the plants and extend the lines so as to give the conveniences where ever wanted. And this has already been done with the sewer system where vork has been begun to place the pipes in touch of all residences of this day and at the Bame time provide for extensions to meet the growing de mands of the town. This work will and"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "been done with the <mark>sewer</mark> <mark>system</mark> where vork has been"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "been done with the <mark>sewer</mark> <mark>system</mark> where vork has been"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1956.69, 785.57, 2133.19, 1337.97], "bbox_id": "d8de09ee07", "file": "AppomattoxNewspapers_1933-1936a_0416.pdf", "page": 1, "text": "Appomattox, Va. Dear Sib In reply to your article in last weeks issue of the Times Virgin ian please permit me to say that off handed it might appear as seem ingly indifference on the piirtof the mayor in regard to the wrA project for a sewer system in the town of Appomattox, Va. If you recall you sumitted your first editorial on the subject before you published it and 1 approved of same Your paper came out on Thursday of that week, carrying the editorial on the frqnt page, for which I want to thank you. On i n- day, the next day I left town for a trip to Florida, leaving word to the acting mayor that if he saw fit he could call the .mass meeting of the citizens as suggested in your editorial during the next week.When I returned from my trip, which was March 14, Saturday I immediately began by correspondence as my files will show to try and find out just exactly what could he done about the project so as to have something definite to present to the citizens when they were called to meet. We sent the town attorney, a mem ber 1 of the council arid the ser geant to the district office in Farm ville, Va. to ascertain the facts in the case and we find that there is no possible chance of getting the project started owing to a short age qi lreief. labor and the re quirement that 90 per cent of said ijibor must be taken from relief rolls, and further fact that soil erosion and conservation, reforest ation and re-habilitation projects have priority over WPA projects such as our sewer system in se curing labor. Therfore, not with standing the fact that the project has been approved it cannot be car ried out because of a shortage of labor. I want to assure you ftjr editor that the mayor has the int oiests of Appomattox at heart as much as any person living in the town, and is always willing and ready to co-operate to the fullest extent to that end. Furthermore the town council has done all it possib ly could to get our sewerage sy stem started."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "wrA project for a <mark>sewer</mark> <mark>system</mark> in the town of"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "wrA project for a <mark>sewer</mark> <mark>system</mark> in the town of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1572.16, 910.42, 1720.23, 1231.9], "bbox_id": "bf03581863", "file": "TimesVirginian_1978_0364.pdf", "page": 1, "text": "An Inflow and Infiltration Sewer System Evaluation Survey, m andated by the Environmental Protection A- gency, is now underway in, the Town pud Cnnte-qt4iimaV , tex. The Town of Appomattox has received an EPA grant in the amount of 27,500 for the study. Bill Britton, Town Manager, would like to make citizens aware of the feet that smoke testing, associated with the I  I Survey Analysis, will be done 1 on this phase of the project during the week of September 11 - September 15, 1978. ,, For any information on the I  I study or the smoke testing, please contact Bill Britton at the Appomattox Town Office. More formation regarding the smoke testing will be given through the TIMES-VIRGIN IAN prior to the testing. A Public Hearing was held Monday evening prior to the"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "An Inflow and Infiltration <mark>Sewer</mark> <mark>System</mark> Evaluation Survey, m andated"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "An Inflow and Infiltration <mark>Sewer</mark> <mark>System</mark> Evaluation Survey, m andated"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1751.01, 507.6, 1935.3, 731.94], "bbox_id": "fcb4dc5f1a", "file": "TimesVirginian_1980a_0193.pdf", "page": 1, "text": "alteration, after which the contract would be either renewed or cancelled. In other business, the councilmen. voted to prepare a full application for an W00.000 Fanners Home Administra tion loan,, to cover local cost in building a new municipal sewer system. Terms q f p t loan, if the application it .accepM , are payment at 5 percent interest over a period of 40 years. In other business, council voted to seek bids for trash-collection service in town, to see if contracted trash-collec tion service would cost less than the town service currently provided. Council also voted to enact a bank franchise tax to protect the town from liability in collecting taxes from bank franchises, and voted to amend a portion of the town code to allow for a. standing mUce committee."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "building a new municipal <mark>sewer</mark> <mark>system</mark>. Terms q f p"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "building a new municipal <mark>sewer</mark> <mark>system</mark>. Terms q f p"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [413.51, 794.41, 586.01, 1133.15], "bbox_id": "50031d632c", "file": "AppomattoxNewspapers_1954-1955a_0375.pdf", "page": 1, "text": "active support in the various health programs. Public aceptance of the program of rabies vaccination was noted. A total of 1,640 doses of Modified Chick Embryo Vaccine were admin istered to dogs. There were 454 inspections and visits made to the twenty-two food establishments under supervision, in order to maintain and improve the food service to the public. During the year, 419 visits were made to homes, for purposes of ob taining water samples, installation of septic tanks, rabies control, etc. All school lunchrooms were super vised for sanitation. Also, 203 in spection visits were made to the 29 service stations under supervision. It was noted that in the Town of Appomattox there were 13 new sewer connections and several ex tensions of the present sewer system were made to increase service. A rural survey, in cooperation with the V. P. I. Extension Division, was carried out and it was deveîhped that 471 homes, or 50.3 had water un der pressure 185 or 19.7 had chain and bucket wells 49, or 5.2 had hand pumps 5, or 0.5 had protected springs, and 126, or 13.5 unprotected springs."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "tensions of the present <mark>sewer</mark> <mark>system</mark> were made to increase"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "tensions of the present <mark>sewer</mark> <mark>system</mark> were made to increase"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1846.09, 494.26, 1994.88, 685.51], "bbox_id": "60dbbf49da", "file": "TimesVirginian_1980a_0025.pdf", "page": 1, "text": "A group of local officials are heading to Chestertown, Md. today Thursday to examine a type of sewer system which may be constructed here in Appomattox. Ths system, known as an overland flow wastewater disposal system , is being championed by the Federal Environmental Protection a- gency EPA and the state Water Quality, Board as a cost-effective solution to sew age treatment. It does not, however, meet the state Health NDepartments criteria for sani-"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "examine a type of <mark>sewer</mark> <mark>system</mark> which may be constructed"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "examine a type of <mark>sewer</mark> <mark>system</mark> which may be constructed"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2351.7, 1647.16, 2518.61, 1786.26], "bbox_id": "2c204e79bb", "file": "AppomattoxNewspapers_1952-1954a_0215.pdf", "page": 1, "text": "By almost unanimous vote, citi zens of Dillwyn, Buckingham Coun ty, voted for a town water - sewer age system in a special election. Only three votes were cast against the proposal. Mayor J. R. Snoddy stated that bonds would be sold to finance the project, and that the date when ac tual work would begin was uncer tain. A new consolidated grade school is being constructed at the intersec tion of Routes 15 and 20."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "for a town water - <mark>sewer</mark> age <mark>system</mark> in a special election."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "for a town water - <mark>sewer</mark> age <mark>system</mark> in a special election."}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.57, 1126.07, 1646.42, 1246.92], "bbox_id": "42d2340adf", "file": "AppomattoxNewspapers_1892-1898a_0440.pdf", "page": 1, "text": "Board of Supervisors met Tues day with a full attendance and and transacted right much business. Ordered three foot ditch around jail and abandonment of the sewer age system. The yard fence is to be painted mass-meetiug requested uext court to get the sentiment of the people on levying a road tax settlement of treasurer."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "and abandonment of the <mark>sewer</mark> age <mark>system</mark>. The yard fence is"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "and abandonment of the <mark>sewer</mark> age <mark>system</mark>. The yard fence is"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [127.18, 789.66, 2350.88, 944.84], "bbox_id": "a17664e6c9", "file": "TimesVirginian_1980a_0436.pdf", "page": 1, "text": "WINNERS IN AREA 12 Whiter Special Olympics are, Steve Clark. Barham Breggin,  Alvin Walker. Kenneth Davidson and Ronald Heed. . 1980 as seen in the Times- Virginian To ou many wonderful friends and patrons, sincere best wishes for the holidays and. a Thank you! foryour patronage! Wf BILL SHERROp Ronnie Spiggie and Town Manager Bill that Mrs. Eloise Aivis Wheeler, who 3 The year 1960 has been a newsy  Britton were preparing to travel to wrote the Stonewall news for the ong for Appomattox County and the Chestertown, Md. with a delegation of Times-Virgfadu for 17 years, had 1toMeVMWaa, with headlines coer- area officials to examine an overland- passed away. fog everything from sewer systems to flow system, as reported in the Jan. 24 The Feb. 21 issue reported that a proposed teachers salaries increases, issue. new Mood-donor record had been set Fouowfogare some news highlights, u In that issue also, Appomattox during that months visit of the gleaned from the front pages of the learned that Harry Gordon Lawson had bloodmobile, with 152 units being given year s issues. been appointed to the statewide by Appomattox Countians."}, "highlight": {"text": {"matched_tokens": ["sewer", "system", "system"], "snippet": "away. fog everything from <mark>sewer</mark> <mark>system</mark>s to flow <mark>system</mark>, as reported in the"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system", "system"], "snippet": "away. fog everything from <mark>sewer</mark> <mark>system</mark>s to flow <mark>system</mark>, as reported in the"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [408.68, 1514.29, 669.65, 1537.54], "bbox_id": "8720b14e41", "file": "AppomattoxNewspapers_1962-1965a_0199.pdf", "page": 1, "text": "Part basement. Stoker fired forced hot water heating system. City water and sewer."}, "highlight": {"text": {"matched_tokens": ["system", "sewer"], "snippet": "Part basement. Stoker fired forced hot water heating <mark>system</mark>. City water and <mark>sewer</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["system", "sewer"], "snippet": "Part basement. Stoker fired forced hot water heating <mark>system</mark>. City water and <mark>sewer</mark>."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [803.75, 676.83, 972.0, 716.33], "bbox_id": "2d7c45d700", "file": "AppomattoxNewspapers_1955-1957a_0302.pdf", "page": 1, "text": "House remodeled in 1946, includ ing complete insulation, new wiring, copper pipes, cast iron sewer pipes, oil heating system modern."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "House remodeled in 1946, includ ing complete insulation, new wiring, copper pipes, cast iron <mark>sewer</mark> pipes, oil heating <mark>system</mark> modern."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "House remodeled in 1946, includ ing complete insulation, new wiring, copper pipes, cast iron <mark>sewer</mark> pipes, oil heating <mark>system</mark> modern."}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2186.82, 1330.26, 2363.39, 1402.9], "bbox_id": "6b06370bb7", "file": "TimesVirginian_1983a_0252.pdf", "page": 1, "text": "Councilmen were also told that the Health Departm ent has determined that grease traps will have to be installed at local restaurants to prevent clogged a towns  sewer lines in wastewater system. the"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "prevent clogged a towns  <mark>sewer</mark> lines in wastewater <mark>system</mark>. the"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "prevent clogged a towns  <mark>sewer</mark> lines in wastewater <mark>system</mark>. the"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [127.8, 586.68, 389.27, 1712.74], "bbox_id": "7bf6fd0c62", "file": "AppomattoxNewspapers_1905-1912a_0175.pdf", "page": 1, "text": "PARM VlLiLfS. Pluma grown in this section this season are superior to any I ever saw. Many of them are as large as the average apple and are as delici ous as they are large. If the land owners of this section are not en- conraged to pay more attention to fruit growing in the future then object lessons are of not muon im portance. I very much doubt that California can beat us on the plum lines. There is promise of a warm pri mary town election even in the warm weather of the  summer. There are some fifteen applicants for the town sergeantcy made va cant by the retirement of Sergeant Miller, and it is proposed to decide between them by a primary. The office is worth some 1,500 a year, rather a good pull at publio pap, the aspirants afe all popular and the race will be exciting from start to ánisb. Another suggestion is to do away with a town treasurer and have the sergeant to do tho work alohg with that of his own office. The charter says there must be a treasurer, but it does - not say that the sergeant may not be trea surer. The combination would sive them 800 a year to the town and in the management ol ones private business that amount saved would be reckoned as desirable. Still another suggestion is that a general manager be appointed to have charge of the street improve ments, the electric light system and the water and sewer should the town buy the last two. What work has heretofore been done by members of the oonncil, principally by chair men of certain committees who serve without compensation and ii is urged that this is requiring too much of business men. i The town is waking up on ail lines rave on the advertising line. We are n.t letting the outside world hear about ns, and this in my opinion, is of prime importance. Larger cities are advertising as never before in their histories, and if it is necessary with them places like Farmville can not afford to neglect if. Atlanta has been made on printers ink, and Jacksonville is feeding at th-j same trough. Des . inoines perhaps leads them all and results ts-ere have been far ahead of all exp ctations. And whats true of towns and cities is equally true of merchants. Wanamaker is now 72 and yet he advertises as though he was beginning a new business for he has new goods to sell day by day. There are no shop-worn goods on the shelves of merchants who advertise. Not spasmodically but regularly and intensely. Prof. Binford gave an illustrated lecture on the subject of public schools in Virginia before the Sum mer Normal which was of genuine interest. Many schools of the State were pictured before the audience The people of the town have re sponded generously to the claims of the widow and children of Mr. Barnwell, who was killed by light ening. The burial of the father and son frpm the same home at the same time was something new in my experience. Mr. R. H. Panlett and the ma dam are at Asbnry Park Mr. and Mrs. D. T. Elam at the Greenbrier White Mrs. Tabb and daughter at Yellow Sulphur Rev. Hill and family at Wrightsville Beach, N. C. Rev. Fugate and family at Abing don, and Rev. Boogher has jnst re- j family was a happy"}, "highlight": {"text": {"matched_tokens": ["system", "sewer"], "snippet": "ments, the electric light <mark>system</mark> and the water and <mark>sewer</mark> should the town buy"}}, "highlights": [{"field": "text", "matched_tokens": ["system", "sewer"], "snippet": "ments, the electric light <mark>system</mark> and the water and <mark>sewer</mark> should the town buy"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1179.08, 802.08, 2604.9, 1081.79], "bbox_id": "2b3e1b31ee", "file": "AppomattoxNewspapers_1962-1965a_0073.pdf", "page": 1, "text": "Fuel Pumping Station Site In Cumberland APPLE, PEACH, CHERRY present. That without the pres ence of Christ we have lost charges for Installing water taps to new users replenish this fund during the year. Sewer Fond An estimated 15,000 surplus in the Sewer Fund is on hand to use in enlarging the toughs sew age facilities, the Council men reported. Other than this, sum, set aside for future action, major expense in the sewer fund are rjjlm salary for one Tpwn worker, pins repairs, maintenance, ana a bond payment and Interest. Total operating budget involves 12,590. Taxes, plus sewer con nection and maintenance fees are the source of revenue for this department. 50 cents per tax dollar is earmarked for the Sewer Fund under the present system of allocation. The other"}, "highlight": {"text": {"matched_tokens": ["Sewer", "system"], "snippet": "is earmarked for the <mark>Sewer</mark> Fund under the present <mark>system</mark> of allocation. The other"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "system"], "snippet": "is earmarked for the <mark>Sewer</mark> Fund under the present <mark>system</mark> of allocation. The other"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [421.45, 547.75, 562.83, 875.28], "bbox_id": "28e2f0ca27", "file": "TimesVirginian_1976_0369.pdf", "page": 1, "text": "C ratd from Page 1 demands. The proposed plan, which incorporates components of the existing system where possible, includes the following 1 extension of sewer lines from the existing trickling plant to the site of the proposed treatment facility 2 a sewage pumping station at the existing lagoon and sewer lines to the present collection system 3 an aerated lagoon system followed by chemical treatment or land application if treatment standards of 12m gl BODS and Total Suspended Solids TSS are imposed by state and federal agencies, or an aerated lagoon followed by clarification if 30 mg1 BOD 5 and TSS are approved by those agencies. Placement of- the proposed treatment facility in the area designated for future develop ment will facilitate expanded service with a minimum of cost in the future. Cost of construction for the sewage collection system is"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "the existing lagoon and <mark>sewer</mark> lines to the present collection <mark>system</mark> 3 an aerated lagoon"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "the existing lagoon and <mark>sewer</mark> lines to the present collection <mark>system</mark> 3 an aerated lagoon"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2301.83, 494.41, 2447.37, 876.54], "bbox_id": "a69e60c9f9", "file": "TimesVirginian_1980a_0025.pdf", "page": 1, "text": "gallon per day aerated lagoon system with 75 percent federal funding. A third incentive for building the overland flow plant is that if the system does not meet design criteria within two years, the EPA will pay 100 percent of costs for installing a system that does measure up, even if that means having to install a lagoon system. Britton notes that the towns current sewer plant is operat ing within accepted state and federal wastewater quality limits. - - 71 feel the councilmen believe they are being forced into building a new system because of m andates the federal safe water drinking act of 1977. If it werent for these mandates, wed probably just upgrade the plant we have now, according to Britton. The health departm ents current rejection of the overland flow system is, according to B riitop, the greatest obstacle between the idea and the reality of- an overland disposal system . And, of course, the coqpcilmen."}, "highlight": {"text": {"matched_tokens": ["system", "sewer"], "snippet": "to install a lagoon <mark>system</mark>. Britton notes that the towns current <mark>sewer</mark> plant is operat ing"}}, "highlights": [{"field": "text", "matched_tokens": ["system", "sewer"], "snippet": "to install a lagoon <mark>system</mark>. Britton notes that the towns current <mark>sewer</mark> plant is operat ing"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1575.86, 523.48, 1723.58, 959.05], "bbox_id": "f136da26f5", "file": "TimesVirginian_1981a_0180.pdf", "page": 1, "text": "New York has exprerssed strong interest in purchasing the Appomatox franchise, as have local merchants Roy E. Franklin and Ron Coleman, if the satellite equipm ent is induded in the sale. Deimlers request for a couple more weeks time to work on getting the satellite equipment installed was not granted by the Council. However, Councflmen did ag ree to consider side of the existing franchise if Deimler is able to have the equipment installed and negotiate pur chase terms before the fran chises scheduled date of expiration.  v Deimler told the CouincQmen that he will continue to work on procuring satellite equipment for the Appomatox system. In other business. Council- men yoted to change the policy regarding payment of sewer charges when a town water customers water system de velops a leak on he customers side of the water meter. The new policy states that a customers sewer charge in the event of a lead in the water system will be based on an average bill compiled over the prior three billing periods, if it is determined that there was a bona.fide lead, and that the water which leaked did not go into the m unicipal sew er system."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "policy regarding payment of <mark>sewer</mark> charges when a town water customers water <mark>system</mark> de velops a leak"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "policy regarding payment of <mark>sewer</mark> charges when a town water customers water <mark>system</mark> de velops a leak"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1978.24, 915.78, 2130.42, 1696.64], "bbox_id": "f0d281542c", "file": "TimesVirginian_1976_0363.pdf", "page": 1, "text": "complete, possibly in 1978, could bring about this increase in the rate per customer as the ounqjber of customers in thé  Town of Appom attox are limited. Seventy-five percent of the entire project is fupded by the Environmental Protection Agency.  Thé TJown of Appomattox,, according to W illiam S. Slagle, former Town Manager, has been looking toward fontfing from other sources that would perhaps offset th e remaining 25  cost to be paid by the town. If funding is available in this amount, then there would be no additional cost to customers. It is hoped that the Town Council will continue to look toward other means of funding this project. Recent upward trends in population and industrial de velopment in the Appomattox Area have demonstrated the need for a new sewage disposal system in the town and its environs. The problems associa ted with the present public and prfvate system s and the consideration of growth poten tialities and actualities led the Town Council of Appomattox to authorize the preparation of this Facilities Plan. Available data indicates steady population growth with in the Town from 704 in 1930 to 1,400 in 1970. Projections forecast a population rise, in the area considered for sqwerage service, from 2,134 in I76 to 4,106 in 2010. Land use, as set forth in the Comprehen sive Plan prepared by the Commonwealth of Virginia Division of Planning 1966, trends toward an increase in medium to high  density repidential use and m ajor increases in light industry usage. Many problems are obvious in the present system. Metered fknr into the trickling filter plant system indicates a serious overloading of most, if not all, its components and excessive deterioration is common in the concrete sewer lines. All the entering flow in this system is considered to be standard domestic sewage which requir es an 85 percent degree of treatm ent. Comparisons of water usage to wastewater return indicates, also, a high raté of infiltrationinflow, even in excessively dry weather and storm periods create overflow"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "common in the concrete <mark>sewer</mark> lines. All the entering flow in this <mark>system</mark> is considered to be"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "common in the concrete <mark>sewer</mark> lines. All the entering flow in this <mark>system</mark> is considered to be"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2318.4, 1128.87, 2491.92, 1546.87], "bbox_id": "dbf7887703", "file": "AppomattoxNewspapers_1939-1943a_0368.pdf", "page": 1, "text": "Plans Were All Ready The plans for the McLean House Reconstruction have been completed and now await final approval by the Director of the National Park Ser vice. At any time that the Recon struction may be deemed feasible, work can begin without delay. Mean while, research work for the res toration of the rest of the village is currently under way and no stoppage seems imminent. Nor is any cessation of work by the CCC contemplated, as far as is now known. The Colored Veteran Company, No. 1351, attached to the area is at present at work on aich- eological investigation, the laying of sewer lines, and allied work. A mod ern water system will shortly be installed, this being considered ex tremely necessary for fire, protec tion. Installations cf other utilités are also expected to progress. In addition to these current jobs, the CCC men will soon begin a widespread stabilization and pre servation program. Many repairs to the old buildings have not been made because it was thought that actual restoration .was soon to come. Now all such repairs necessary for the preservation of the decaying structures will be, undertaken, and all efforts towards restoration of the village, short of actual construction and private contract work, will be made. But, for the time being, the Mc Lean House will not rise again as a memorial to a reborn Union, though the handclasp of Lee and Grant is a spiritual symbol to all Ameri cans who look to the past for the inspiration to face the future."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "investigation, the laying of <mark>sewer</mark> lines, and allied work. A mod ern water <mark>system</mark> will shortly be installed,"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "investigation, the laying of <mark>sewer</mark> lines, and allied work. A mod ern water <mark>system</mark> will shortly be installed,"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1834.11, 547.66, 2102.63, 898.66], "bbox_id": "f05ad496cb", "file": "AppomattoxNewspapers_1905-1912a_0339.pdf", "page": 1, "text": "Munyons Paw Paw Pills are unlike 11 other laxatives or cathartics. They oax the liver into activity by gentle methods. They do not scour, they do not gripe, they do not weaken, but they io start all the secretions of the liver ind stomach in  way that soon puts these organs in a healthy condition and corrects constipation. In my opinion constipation is responsible for most ail ments. There are 26 feet of human bowels, which ia really a sewer pipe. When this pipe becomes clogged the whole system becomes poisoned, caus ing biliousness, indigestion and impure blood,. which often produce rheumatism j TO DRIVEOCT MAI, aria nd kidney ailments. No woman who - - suffers with constipation, or any liver ailment can expect to have a clear complexion or enjoy good health. If I had my way I would prohibit the sale of nine-tenths of the cathartics that are now being sold for the reason that they soon destroy the lining of the stomach, setting up serious forms of indigestion, and so paralyze the bowels that they re fuse to act unlesB forced by strong purgatives. Munyons Paw Paw Pills are a tonie to the stomach, liver and nerves. They invigorate instead of weaken they en rich the blood Instead of Impoverish it they enable the stomach to get all the nourishment from food that is put into it. These pills contain no calomel, I no dope they are soothing, healing and stimulating. They school the bowels to act without physic. Regular size bottle, containing 46 pills, 23 cents. Munyons Laboratory, 63d 6 c Jefferson Sts.. Philadelphia."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "which ia really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "which ia really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1200.5, 1340.36, 1362.25, 1774.66], "bbox_id": "eb4a49c948", "file": "AppomattoxNewspapers_1905-1912a_0374.pdf", "page": 1, "text": "A trial package of Munyons Paw Paw Pills will be sent free to anyone on re quest. Address Professor Munyon, 53d A Jefferson Sts., Philadelphia, Pa. If you ar In need of medical advice, do not fail to write Professor Munyon. Your communi cation will be treated in strict confidence, and your case will be diagnosed as care fully as though you had a personal inter view. Munyons Paw Paw Pills are unlik all other laxatives or cathartics. They coax the liver into activity by gentle methods. They do not scour, they do oot gripe, they do not weaken, but they Jo start all the secretions of the liver and stomach in a way that soon puts these organs in a healthy condition and corrects constipation. In my opinion constipation is responsible for most ail ments. There are 20  feet of human bowels, which is really a sewer pipe. When this pipe becomes clogged the whole system becomes poisoned, caus ing biliousness, indigestion and impure blood, which often produce rheumatism and kidney ailment. No woman who suffers with constipation or any liver ailment can expect to have a . cle complexion or enjoy good health, it I had my way I would prohibit the sale f nine-tenths of the cathartics that are sow being sold for the reason that tney oon destroy the lining of the stomach, setting up serious forms of indigestion, nd so paralyze the bowels that they re fuse to act . unless forced by strong purgatives. , Munyons Paw Paw Pills are a toni to the stomach, liver and nerves. They invigorate instead of weaken they en rich the blood Instead of tmpoverun It they enable the stomach to get all the nourishment from food that is pn- into it. These pills contain no calomel, no dope they are soothing, healing an stimulating. They school the bowe to act without physic. Regular size b o ttle , c o n ta in in g 45 pdlA 25 cents. Munyons L a b o ra to ry , 53 Tefferson Sts.. P h i l a d e l p h i a . _______ ___"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "which is really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "which is really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1370.4, 481.86, 1531.72, 918.8], "bbox_id": "3c22c5ff84", "file": "AppomattoxNewspapers_1905-1912a_0319.pdf", "page": 1, "text": "A trial package of Munyons Paw Paw Pilla will be sent free to anyone, on re- neat. Address Professor Munyon, 53d St Jefferson Sts., Philadelphia, Pa. If you are In need of medical advice, do not fail to Irrite Professor Munyon. Your communi cation will be treated in strict confidence, and your case will be diagnosed as care fully as though you had a personal inter- r w   j Munyon s Paw Paw Pills are unlike All other laxatlvea or cathartics. They jtoax the liver into activity by gentle methods. They do not scour, they do feot gripe, they do not weaken, but they do start all the secretions of the liver Bnd stomach in a way that soon pats these organs in a healthy condition and corrects constipation. In my opinion constipation is responsible for most ail ments. There are 26 feet of human Bowels, which is really a sewer pipe. When this pipe becomes clogged the whole system becomes poisoned, caus ing biliousness, indigestion and impure blood, which often produce rheumatism and kidney ailments. No woman who Buffers with constipation or any liver Wilment can expect to have a clear complexion or enjoy good health. If It had my way I would prohibit the sale of nine-tenths of the cathartics that are blow being sold for the reason that they boon destroy the lining of the stomach, betting up serious forms of indigestion, bnd so paralyze the bowels that 1 they re- i use to act unless forced by strong mrgatives.  Munyons Paw Paw Pills are a tonic to the stomach, liver and nerves. They Invigorate instead of weaken they en rich the blood Instead of Impoverish It they enable the stomach to get all the nourishment from food that is put into it.  These pills contain no calomel, no dope they are soothing, healing and btimulating. They school the bowels lo act without physic. Regular size bottle, containing 45 pills, So cents. Munyons Laboratory, 63d St Jefferson Sts.. Philadelphia."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "which is really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "which is really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.97, 493.4, 2034.65, 928.15], "bbox_id": "c97a60c632", "file": "AppomattoxNewspapers_1905-1912a_0353.pdf", "page": 1, "text": "A trial package ef Munyona Paw Paw Pills will be sent free to anyone on re quest. Address Professor Munyon, 53d  Jefferson Sts., Fhilsdelphis, Pa. If you are in need of medical advice, do not fail to write Professor Munyon. Your communi cation will be treated in strict confidence, and your case will be diagnosed as care fully at though you had a personal inter view. -s Munyons Paw Paw Pills are nnliks all other laxativea or cathartics. They coax the iver into activity by gratis methods. They do not scour, they do not gripe, they do not weaken, but they do start all the secretions of the liver and stomach in a way that soon puts these organs in a healthy condition and corrects constipation. In my opinion constipation is responsible for most ail ments. There are 26 feet of human bowels, which is really a sewer pipe. When this pipe becomes clogged the whole system becomes poisoned, caus ing biliousness, indigestion and impure blood, which often produce rheumatism and kidney ailments. No woman who suffers with constipation or any liver ailment can expect to have a clear complexion or enjoy good health. If I had my way I would prohibit the sale of nine-tenths of the cathartics that are now being sold for the reason that they soon destroy the lining of the stomach, setting up serious forms of indigestion, and so paralyze the bowels that they re fuse to act unless forced by strong purgatives. Munyons Paw Paw-Pills are a tonic to the stomach, liver and nerves. They invigorate instead of weaken they en rich the blood Instead of Impoverish it they enable the stomach to get all the nourishment from food that is put into it. These pills contain no calomel, no dope they are soothing, healing and stimulating. They school the bowels to act without physic. Regular size bottle, containing 45 pills, 25 cents. Munyons Laboratory, 53d A Jefferson Sts.. Philadelphia."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "which is really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "which is really a <mark>sewer</mark> pipe. When this pipe becomes clogged the whole <mark>system</mark> becomes poisoned, caus ing"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1638.55, 781.57, 2183.77, 1177.95], "bbox_id": "d27274f70d", "file": "TimesVirginian_1980a_0152.pdf", "page": 1, "text": "By BILL SHERHOD lines. Items such as aquisition of land the town limits. The town limits A ppearing before a House and rights of way for the treatm ent encompass approximately 1.S square subcommittee Tuesday, Appomattox plant would have to be funded by the miles. Maylcr Ronald C. Spiggie and Town town. u The enlarged service area was Manager Bill Britton asked that the In addition, the cost of m nt,niiiig outlined anticipating growth in the federal government take a serious look and operating a new plant built area of Appomattox. But the town at its current method of mandating and according to federal guidelines would would have to pay for 25 percent of the funding sewer projects. have to be .borne solely by the town, system as well as all of the rights of  The local men were scheduled to Spiggie pointed out, in addition, that way and land on which the plant would speak at 3J0 p.m. before the the cost of building a new wastewater be built. subcommittee on Housing and Urban treatment plant .according to federal The proposed system mauid1 destroy Development independent agencies, stipulations would probably increase the elderly and those on fixed nr law committee on appropriations. 100 percent over current estimates by incomes, the hhie collar group who Spiggie and Britton appeared before the time the facility were completed, nave moat of the taxes and nan hit the subcommittee on behalf of the based on the inflation rate of the last hardest by inflation, Spiggie mid. National League of Cities, and the town two years. He noted that the average merer bill, of Appomattox. Our freedom of choice is being which is now a minimum of .82 per Before the testimony Tuesday, the eroded, Spiggie said. Were sacrifie- month, would increase to a minimum of men outlined their, points in a- ing our community future for the 10 or 12 per month or more, an 4Hmee-Vfoghiim interview. - fa iu sl W fle tk m ot the praaau t. . increase of 1100 percent. . .   . The major point, according to Britton noted that the sentiment Other problems crap up. Spiggie Spiggie, is th at . the federal expressed by the Appomattox Mayor continued. We dont have the steffto government would not mandate what and Council is similar to sentiment operate and maintain a system like the is nqt necessary. And if it does, then it expressed in small towns and cities, ofie proposed and hiring addition should provide 100 percent funding, across the nation.  - personnel would mean more money We feel this is the major reason the The mandates are control that would have to come from the economy is in the shape it is now. . away from the local governing bodies, town...Also, the regulations, handed The comments were in relation to according to Britton, The federal down by EPA are continuously wastewater treatm ent standards man- government is saying, you are going to changing, and with each change there dated by the federal Clear Water Act grow. Were saying, hold on - we is a good-chance that we are going to of 1977. Environmental standards for dont want to grow tost fast. We want have to put out more money. wastewater treatm ent plants were to grow, but at our own speed. These local Appomattox officials established, including a plan for partial Brittons comment concerned the have done what the big city officials federal funding for construction of federal Environmental Protection havent, Britton concluded. Theyve those new treatm ent plants.. Agencys outline of the service area stayed out of debt the town is actually But, according to Britton, much of which would be served by the town debt-free. But were being forced, the expense of building a new sew er system . It would include through bad management decisions, to treatm ent plant is not eligible for approximately 8 square miles of go into debt. W ere being mandated funding according to federal guide- territory, including many areas outside into debt."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "percent of the funding <mark>sewer</mark> projects. have to be .borne solely by the town, <mark>system</mark> as well as all"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "percent of the funding <mark>sewer</mark> projects. have to be .borne solely by the town, <mark>system</mark> as well as all"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1216.77, 838.32, 1340.12, 1033.52], "bbox_id": "10108c5677", "file": "AppomattoxNewspapers_1922-1923a_0289.pdf", "page": 1, "text": "Typhoid fever deaths in Net? State numbered 1554 during according to the report of Dr. H. Porter, State Commissio Health. Dr. Porter says that, no exaggeration to attribute every one of these deaths to ii water. While there may be doubts as to this statement, r tionably many of the deaths? caused, and there is no doubM his recommendations for sanitary control of the potable of the State should be heedet recommends legislation pro that all plans for public waten plies be approved by the State missioner of Health, and also, cure inspection of proposed and ing sewer systems and wateti plies."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "of proposed and ing <mark>sewer</mark> <mark>system</mark>s and wateti plies."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "of proposed and ing <mark>sewer</mark> <mark>system</mark>s and wateti plies."}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1373.98, 514.31, 1846.46, 767.26], "bbox_id": "1bcaa57b63", "file": "AppomattoxNewspapers_1926-1933a_0394.pdf", "page": 1, "text": "the big fall in the typhoid death rate because, as he ex plained, it is really a commun- I ity disgrace to have a case of I nd appreciative audiences, he farm population of the typhoid fever, i Many of our young ilpeople ited States is now the smallest  if, said this health work- visited their homes during the twenty years, according to! the peopleof Virginia who j Easter . holidays. Among 6 U. S. Department of A gn-dQ not have the advantages of those who came home were jlture. It is estimated thaton I city water and sewer systems Misses Illene McClenny, Hilda nuary 1, 19 , t ere were would ?be as much interested Ligon, Elizabeth Duling, Mary 1,000 persons on fannsasj. iw,wl0i,lMo fh I Briirhtwell ami Mary Beale mpared with 32,000,000 in 1909. in protecting themselves as the  Brightwell and Mary cities are in giving public pro- lEgg-yolks are among the best Action, the air could be full n-rich foods. They also con of flies and the result wouId in phosphorus and cabtum be nothing more than discom- ments needed to build boneM fort and possibly profanity, th and other tissues. Vitamins if flies cannot get to filth, they e present, and some fat. Food  cannot carry filth germsthat ntaining egg-yolks are there-1 is so obvious that no one can re always valuable."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "I city water and <mark>sewer</mark> <mark>system</mark>s Misses Illene McClenny, Hilda"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "I city water and <mark>sewer</mark> <mark>system</mark>s Misses Illene McClenny, Hilda"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1607.29, 1150.25, 1767.31, 1430.0], "bbox_id": "bd6b93892f", "file": "AppomattoxNewspapers_1912-1915a_0057.pdf", "page": 1, "text": "States New Rifle Range. Virginias new rifle range has been formally accepted, as equipped for fir ing purposes, and is now a part of the States military property. The com mittee which had charge of construc tion examined the range. It is com posed of Colonel C. A. Dempsey, U. S. A. retired Major Stanley W. Martin, Major A. B. Percy and Major Peyton B. Winfree, of Lynchburg, and Cap tain H. L. Opie, of Staunton. It was the opinion of the committee that Virginia will have one of the best rifle ranges in the country. The range is located two and a half miles below Virginia Beach, and in order to be of easy access, the Norfolk-South ern Railway has contracted to con struct about 20,000 feet of track. Sev eral buildings, one for the quarter masters department, club houses, etc. are to be constructed, while a site will be provided for tents for the rifle teams when practicing on the range. Water and sewer systems are to be installed, and in a short time the range will be connected with the Nor folk telephone system. The range will be ready for the use of tho Virginia Volunteers in the spring. ."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "the range. Water and <mark>sewer</mark> <mark>system</mark>s are to be installed,"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "the range. Water and <mark>sewer</mark> <mark>system</mark>s are to be installed,"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [277.87, 533.18, 450.91, 1690.17], "bbox_id": "2f7d1d9942", "file": "AppomattoxNewspapers_1905-1912a_0139.pdf", "page": 1, "text": "small blaze on the lot, of Mrs. An nie McKinney and now we may re-t in peace for a time. Three times and out is a good old adage. The State examiner of banks hasnt been with us as yet and no one who has interest in our banks cares particularly to see him in our midst and at his official work, satis fied as all are that onr banka need no matching from the outsid. The men in charge of them are  honest and capable and the immortal Jef ferson laid that down as a stn d ird for human conduct. We can ask no more for no more is needed. Our Fair authorities are contem plating the erection of buildings on the race track suitable for t ie hold- ng of all the exhibits and so aban don tne use of our warehouses for snch purposes. This is an experi ment which I hope will work well. Among the small residences of onr own which has ben grealy im proved and made most attractive is that of the late, Mr. C. C. Bass, on South Main Street. It is wonder ful what a porch nd paint will do for shoos. The changes wrought by them are like those made on the person of man by the clean share and clean shirt of Sunday morning. The hours for selling at the dis pensary are longer and I am told that c ol beer is in mnch demand, though strange to say, some folks continue to drink hot whiskey in hot weather. Bnt one man aays it cools him off whereas in the winter time the same man insists that it warms him np. Wondeiful is hot ze anyhow. Three bright and beautiful yonng girls got together on a recent even ing and had a sugar stew to which I was invited as the only honored gueit. I am feeling the thrill of the compliment as I wiite. And after stewing the angar they dotted it all over with raisins, and it was simply  fine. The live question with us just now is whether or not the town shall buy and operate its wa er and sewer systems. If the purchase is made I fear it will be sometime be- foie we have a high school building such as we should have. If MrB. T. Henry Glenn, of Pros pect, is beating the i armville ladies growing ro es this seaBor. she must indeed hare a garden of none such. The clover coutest still continues with us and the last sample exhibit ed measnied rorty-six inches. This was of the old time red top variety, and still had inches of gr th ahead of it. It the product continues to grow much talUr air-ships o ust not pass this way or they will ot into trouble. Rev. Dr. English, wife aod daughter, of Union Theological Seminary, Richmond, are guests in the home of Rev. W. E. Hill. Mr. Hill married a daughter of Dr. Eng lish. Mr. Woodruff, of Anniston, Ala., is visiting his daughter, Mrs. J. L. Bugg. He is also the father of Miss Woodruff, of the Normal faculty. Mrs. Turner, of Mt. Sterling, Ky., is visiting her venerable father, the Rev. Mr. Littleton. The overall factory isnt at work, bit you know large Indies move lowly Judge Hundley was detained a long time in Charlotte. And the eases that have kept him there were surprises to me of most profound nature. I thought I knew those men farly well and always regarded them as model business men.  None righteous, no not one."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "its wa er and <mark>sewer</mark> <mark>system</mark>s. If the purchase is"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "its wa er and <mark>sewer</mark> <mark>system</mark>s. If the purchase is"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1961.74, 1714.91, 2126.09, 1767.73], "bbox_id": "aba2aa3381", "file": "AppomattoxNewspapers_1905-1912a_0105.pdf", "page": 1, "text": "R lv e r i a n d F!arb or I m p r o v e d IV h arve an d T e r m in a ls C o u str e ic te d atr Power Developed Railroads B uilt W ater W orks Erected Reports on Properties Sewer Systems Designed Consultation Clear W ater F iltration"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "Erected Reports on Properties <mark>Sewer</mark> <mark>System</mark>s Designed Consultation Clear W"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "Erected Reports on Properties <mark>Sewer</mark> <mark>System</mark>s Designed Consultation Clear W"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1525.43, 175.63, 2015.41, 560.35], "bbox_id": "0e2b622929", "file": "AppomattoxNewspapers_1908-1909a_0299.pdf", "page": 1, "text": "must do. The only question is just how long it will take to complete the campaign of ed ucation that our various agri cultural advisors have institut- ed.They have much to combat. The record of a disastrous fail ure, notwithstanding the evi dence that the collapse of thte I píete sewer systems, protect- movement was not due to any ed public water supplies and inherent fault in its structure, rigid milk inspection, is difficult to overcome. Q- Can we vaccinate against It is to be hoped that the to-1 these diseases? farmers and other business I bacco growers of Virginia will A. We can get protection men interested in the organiza- not be slow to grasp the facts from typhoid fever for a tion of a permanent, efficient, of the situation. The way has greater or less time through co-operative association of vo- been pointedto them by all the the use of typhoid cational agriculture and ar- authorities they recognize. It  but this is the range to attend the series of is merely a question of time local meetings where these when they will accept this ad matters will be discussed. vice, and form a new eo-oper- o ------- -  ative marketing association. Initiative Needed Times Dispatch o- The Federal Farm Board, Questionaire On Public Health likehe Lord helps those Who h,elp themselves. Notwith-I Editors Note This is the standing the criticism of those seventh of a series of eight who were anxious for the gov- health questions and answers emment to go to greater prepared by the State Health"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "of thte I píete <mark>sewer</mark> <mark>system</mark>s, protect- movement was not"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "of thte I píete <mark>sewer</mark> <mark>system</mark>s, protect- movement was not"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [2453.97, 530.93, 2595.43, 920.82], "bbox_id": "09dc5c60c2", "file": "AppomattoxNewspapers_1971-1973a_0391.pdf", "page": 1, "text": "Mayor Henry B. Pack announ ced Tuesday that Mr. Williams. Slagle has been appointed Town Manager by the Appomattox Town Council in a recent meet ing. Slagle comes to the Town of Appomattox from Madison Hgts. where he is employed by the State Water Control Board as Area Engineer. He is a graduate of V. P. I. with a degree in Civil Engi- neeriug and also a M. S. de gree in Sanitary Engineering. Slagle served with the Va. Department of Highways Co operative Program where he had six months ot surveying, six months of drafting, and ten months of Construction Inspec tion. He served with the United States Army and while there he was in the hydraulics section and project coordinator of the Chicago District Office. His present position with the State Water C o n t r o l Board should give him experiences which would be of great benefit to the Town of Appomattox as they plan to expand their water and sewer systems to meet the growth which is taken place in the village and surrounding area."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "expand their water and <mark>sewer</mark> <mark>system</mark>s to meet the growth"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "expand their water and <mark>sewer</mark> <mark>system</mark>s to meet the growth"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [463.71, 786.34, 627.01, 838.64], "bbox_id": "83bb6aff90", "file": "AppomattoxNewspapers_1905-1912a_0058.pdf", "page": 1, "text": "K l ver m id H a r b o r s I m p r o v e d W h a r v e s a n d T e r m i n a l s C o m t r i t c t e d b a t e r P o w e r D e v e l o p e d I t a t l r o a d  1 -u ilt W a t e r W o r k s E i c o t c d K ep o rt 011 P r o p e r t i e s Sewer Systems Designed  n e a r W a t e r F i l t r a t i o n C o n s u l t a t i o n"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "t i e s <mark>Sewer</mark> <mark>System</mark>s Designed  n e a"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "t i e s <mark>Sewer</mark> <mark>System</mark>s Designed  n e a"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1912.46, 876.41, 2099.55, 1456.38], "bbox_id": "73065a673f", "file": "TimesVirginian_1980a_0139.pdf", "page": 1, "text": "By BILL SHERROD , Appomattox Mayor Ronald C. Spiggie and Town Manager Bill Britton will testify before Congress within two weeks, seeking to have federal sewer regulations for small towns reassessed. The announcement was made last week at a special meeting of the Mayor and Council. It i6 one of several developments imrnlilng Iba  p n aS i waabewubar- treat merit project for Appotmftox  County.  In a related development, Council members authorized Spiggie and Britton to approach the state water control board to seek support for a plan to altar the towns federal sewer-grant funding request. Britton Mid ha received a call from Charles Massey of the water control board, who informed the town manager that additional money is now available for w astew ater treatm ent plant planning. For the town to receive this money, it would have to write an addendum to its existing sewer- renovation plan. The addendum would be written so as to allow Appomattox the options of 1 using the money for a study on the cost of renovating its existing sewer facilities 2.funding a study on the feasibility of cutting down the sewer - service area so that a smaller plant could be built to service the town of Appomattox 3 renovating existing sewer facilities and using them as a part of a total new system, to be built sometime in the future 4 budding a regional w astew ater facility, but budding it a step at a time as need dictates, rather than all at once. Britton said Appomattox could get 10 percent of the rands for construction immediately, with a letter of assurance on the remainder of the funds which would be used for construction costs provided the president and congress release the freeze on fond, which would be used to assist small towns in upgrading their sewer systems. Council members debated the merits of seeking the addendum, since the council expressed its desire to divorce itself from federal grant money at its last regular monthly meeting."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "towns in upgrading their <mark>sewer</mark> <mark>system</mark>s. Council members debated the"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "towns in upgrading their <mark>sewer</mark> <mark>system</mark>s. Council members debated the"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1941.11, 1631.92, 2104.72, 1684.77], "bbox_id": "590ad703e8", "file": "AppomattoxNewspapers_1905-1912a_0140.pdf", "page": 1, "text": "Blveri and Harbors Improved Wharves and Terminals Constructed W ater Power Developed Railroads Built Water Works Erected Reports on Properties Sewer Systems Designed Consultation Clear Water Filtration"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "Blveri and Harbors Improved Wharves and Terminals Constructed W ater Power Developed Railroads Built Water Works Erected Reports on Properties <mark>Sewer</mark> <mark>System</mark>s Designed Consultation Clear Water Filtration"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "Blveri and Harbors Improved Wharves and Terminals Constructed W ater Power Developed Railroads Built Water Works Erected Reports on Properties <mark>Sewer</mark> <mark>System</mark>s Designed Consultation Clear Water Filtration"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [265.42, 1446.7, 441.45, 1520.12], "bbox_id": "f44360d669", "file": "AppomattoxNewspapers_1905-1912a_0070.pdf", "page": 1, "text": "1 1 917 Bauk St., Richmond, Ya.  . ! Hivers anti Harbors Improved f ! Wharves and Terminals Constructed r I II ator Power Developed 0 ! Railroads Unlit Mater Works Krcctrd 5  lleports on 1ropertles A ! Sewer Systems Designed ? ! Consultation Clear Water Filtration"}, "highlight": {"text": {"matched_tokens": ["Sewer", "System"], "snippet": "lleports on 1ropertles A ! <mark>Sewer</mark> <mark>System</mark>s Designed ? ! Consultation Clear Water"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer", "System"], "snippet": "lleports on 1ropertles A ! <mark>Sewer</mark> <mark>System</mark>s Designed ? ! Consultation Clear Water"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [2001.34, 494.26, 2146.73, 684.3], "bbox_id": "ed4a93ebb3", "file": "TimesVirginian_1980a_0025.pdf", "page": 1, "text": "tary sewer disposal systems. Bill Britton, Appomattox town manager, says there will be ah official of the state health department with the gronp travelling to Maryland. The system doesnt meet the health departments re quirements at this time because it is what is termed a new and innovative method of waste- water treatment, according to Britton. At present, there is no treatment plant in the state Which circulates municipal wastewater over the open ground, as the overland flow"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "tary <mark>sewer</mark> disposal <mark>system</mark>s. Bill Britton, Appomattox town"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "tary <mark>sewer</mark> disposal <mark>system</mark>s. Bill Britton, Appomattox town"}], "text_match": 1157451436947144825, "text_match_info": {"best_field_score": "2211881025536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436947144825", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [2330.64, 1039.46, 2504.49, 1709.94], "bbox_id": "9560ffc719", "file": "AppomattoxNewspapers_1960-1962b_0587.pdf", "page": 1, "text": "ana i bumi we w n u au make a- qpecial effort to jd t on our Sunday bent during thin time. Trash containers haute been ooiv veniently located along main and Cxjwhch Streetu. Lets all do our part by using these containers in- so ad of, our streets foe, trash a n d refuse. Muny of ytm have prttoably notic ed the new Mercury Vapor lights a- long Main . Church Streets. These lightB give almont twice the light as the old type, with only a very slight increaq in ioe to the town. Eventually the Ckyuncil intends to replace all old light with the newer ones. If amyonfe has any comments pro or on oonceonan,p the new light, I am sure yiotcr council would like to bear from, yknu on this mat- tear. We are oooMtantly trying to im prove our sewer and water systems with an eye to their present and future uses. Mirny botUi necks In Our sewier system are toeing eli ma noted and new impnovaments are being made. Our water system Is bring extended with larger line in certain areas to provide better ser vice to our citizens, flow council is constantly trying td improve these flaciBtiee ao -that they will more than take care of our present needs end also our fixture needs in years to come as our town continues to grow and expand. Recently the ooandl purchased some new equipment to be used by the town -employees to better aid them to render quicker and more efficient service to all o f us. Wknk is programing en the curt and gutter and sidewalk project on Confederate Bhnd. west bo the Co operative limits. Your Oouncil has requested the Htate Highway Com mission for additional fundfe to con tinue these came improvement from the corner of CVmnffi and Con federate Blvd. to the east Coopera tive limit. This will certainly be a big asset to the property owners a- long Confederate Bkd. and a big bripro v e m to  townin many ways. I want- to thank each of you for the splendid cnoperatikra that many of you have given your oouncil in the pert. We invite your comment about how we can improve your town and we look forward to better serving all of you. Respectfully, S. R. Lawson Mayor, Town ol Appomattox"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "to im prove our <mark>sewer</mark> and water <mark>system</mark>s with an eye to"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "to im prove our <mark>sewer</mark> and water <mark>system</mark>s with an eye to"}], "text_match": 1157451436812927097, "text_match_info": {"best_field_score": "2211880960000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436812927097", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [462.94, 350.42, 633.1, 762.78], "bbox_id": "157f6dfdfd", "file": "AppomattoxNewspapers_1955-1957a_0304.pdf", "page": 1, "text": "C are of Septic T ank, Im portant How suburban and rural home- owners care for their septic tanks may spell the difference between health and disease. Most counties and cities have lo cal ordinances regulating sewage disposal, and these ordinances should be consulted before any disposal system is constructed. A septic tank permit from the local health department is required be fore the tanks can be constructed. As for general care of septic tanks See that the area around the drain field is well drained. If the land is high and well drained, grade it to eliminate low areas which will collect water in extremely wet weather. Water al lowed to stand over the drain field will seep into the drain tile and fill up the entire system. Keep area over drain field clear of trees and shrubbery. The roots of willow, cottonwood, dogwood, gum, or elm trees can cause dam age to sewer lines. Clean home systems at least once every three to five years. Use bleach solutions, lye, etc., sparingly. Do not make alterations to the system without first consulting your health department. Do not allow heavy machinery to run over the system because it may break the tile or the septic tank.  m Do not make a driveway ovdr the drain field or cover any part"}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "cause dam age to <mark>sewer</mark> lines. Clean home <mark>system</mark>s at least once every"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "cause dam age to <mark>sewer</mark> lines. Clean home <mark>system</mark>s at least once every"}], "text_match": 1157451436678709369, "text_match_info": {"best_field_score": "2211880894464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436678709369", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [2183.01, 572.05, 2327.93, 1337.78], "bbox_id": "650097cd99", "file": "TimesVirginian_1980a_0032.pdf", "page": 1, "text": "W.,R. Biitton, Jr., Appomat tox town marfager, is meeting this week with representatives of Technological Research, Inc., a subsidiary of Campbell Soup Company, Inc., and the State W ater Control Board in Richntpnd to discuss the possibility and feasibility of an over-land flow sewer treatm ent facility for the Town of Appomattox.  The meeting follows a trip to Chestertown, Md., last week by various town officials to view a similar system in operation there. Going on the trip to Maryland were Britton, Mayor Ronald giggle, Councilmen Bob. Hubbard and Maurice Gordon, past Major Henry Pack, and townsewer operator John H arris, as well as representatives from Amelia County Board of Supervisor, three members of Chase City Town Council, two representa tives fax, the health depart- meoWanda consulting engineer for the tdvn,. In Chestertown last Thurs day, according to Britton, the group saw a- 20-year-old working over-land flow and line saturation system with solids removecPprior to land applica tion. rad without ray enter- gen cy holding facility. The system operates 100- percent of the time due to the lack of holding facilities, which were not required at the time of installation,  . The twp representatives from the Virginia State Health Department, according o Brit ton, made comments that in Virginia, in accordance with the existing regulatkms, the pre- treatment of solids and the holding ponds would be mandatory for the system to be installed. Britton looked at a one-year- old system in Easley, S. C. in November of last year that was working perfectly with the exception of a few design problem s. The 20-year-old system in Maryland is meeting the requirem ents of the Maryland State Water Control Board, but aa viewed by the delegation from here, could be run more efficiently. A fter viewing the two facilities, one in South Carolina"}, "highlight": {"text": {"matched_tokens": ["sewer"], "snippet": "of an over-land flow <mark>sewer</mark> treatm ent facility for"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer"], "snippet": "of an over-land flow <mark>sewer</mark> treatm ent facility for"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2307.08, 495.36, 2598.87, 927.04], "bbox_id": "4c0065d50a", "file": "TimesVirginian_1980a_0025.pdf", "page": 1, "text": "want to be sure that such a system, if built, would not have adverse effects on residents near it, Britton adds. . .Councilmen and consultants are currently poking at a piece of land owned by Continents Cam that has perc-tested favorably, located south of the confluence of the Falling River and Caldwells Creek, for a possible overland-flow con struction site. Whatever the outcome of this weeks foray into Maryland, one things for certain there is definite interest throughout the state in this new and innovative method of Waste water disposal. . Going on the trip are Mayor Ronnie Spiggle, and Coun cilmen Bob Hubbard and Morris Gordon, past Mayor Henry Pack and town sewer operator John Har.vis, as well as representatives from the Amelia County Board of Supervisors and three mem bers of the Chase City Town Council, a representative of the health departm ent and a consulting engineer for the town. Fariss wins award"}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "sure that such a <mark>system</mark>, if built, would not"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "sure that such a <mark>system</mark>, if built, would not"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [946.3, 395.2, 1109.67, 1791.55], "bbox_id": "4cf642fdb7", "file": "AppomattoxNewspapers_1898-1902a_0479.pdf", "page": 1, "text": "W arwick City jail, about ten miles above Newport News, was the scene of a desperate fight between George Ear nest, a negro prisoner just brought there from Baltimore and waiting trial on the charge of robbing a schooner of 400, and Frank H. Gibson, the jailer. Gibson opened the cell door and the negro struck him with a heavy piece of iron. A hand-to-hand fight ensued, Gib son receiving nine scalp wounds from the iron. The negro had him down finally and was beating him into insensi bility when a negro woman prisoner rushed to the rescue. Her screams at tracted the attention of a plumber work ing outside, and the two managed to subdue the brute in time to prevent him from finishing his man. The shaft to the Tinders Flat mine, in Louisa county, which is 800 feet deep, has had some additional borings by dia mond drill about 100 feet deeper than the working shaft. The gold fields of the Tinders Flat mine are now being prepared for systematic and extensive working. A branch of the Chesapeake and Ohio Railroad from Sulphur Mines has been run to them, and buildings, en gine, boilers, etc., have been put in to work the gold gravel, which covers a large area on Contrary creek. After extracting the gold the gravel will be delivered on Chesapeake and Ohio cars and used for ballast by the Chesapeake and Ohio Railway on its main line. Mr. Thomas L. Alfriend, one of the best-known fire insurance agents in Richmond, died very suddenly at his home on North Laurel street of heart trouble. The deceased was 58 years of age and was widely known among un derwriters all over the country. Mr. Alfriend was a gallant Confederate sol dier. H e leaves a widow and several sons and dauhgters, all grown. He was a brother of the late Frank Alfriend, at one time librarian of the State, and a well-known newspaper correspondent at the national capital 25 years ago. The Alexandria authorities, after they had constructed a sewer on Henry street, in the  twenties, made no more sewers until after 1890. Since that time all the old open drains running into the river have been closed in and sewers have been made on King, Prince, Pitt and other streets. A portion of Alfred street is now being sewered, and an ex tension of the K ing street sewer, be tween Royal and Fairfax streets, has been projected, as well as the covering in of the south end of the great drain into Hunting creek at the south end of Royal street. It is stated that the Chesapeake and Ohia Railway Company is behind the movement for establishing a steel plant at Tree Hill, on James river, near Rich mond. The road is reported to have an option on this property. Tree Hill was the home of Franklin Stearns, a man who was conspicuous as a Unionist dur ing the Civil War. The Jefferson Hotel may be rebuilt, not by the owners, but possibly by the insurance companies. Those who haJ risks on the house are, it is said, getting estimates from builders with a view of restoring the hotel. The companies claim that they can put the building back in the condition it was before the fire for the amount of the insurance, 565,000. A t the joint convention of Lancaster and Richmond counties Mr. W. F. Dun away, of Lancaster, was unanimously nominated as the Democratic candidate for the two counties to the Constitu tional Convention. Mr. Dunaway in ad dressing the meeting said he was against the wholesale disfranchisment of the ne gro. He is also in favor of a new judi ciary system. W . B. Sanders was made chairman of the meeting and W . Y. Morgan secretary. Rev. A. H. Burroughs, of the Bristol Gretna Green altar, has made life happy for the following couples during the week  Charles C. Doss and Miss Edna Reynolds, Waitsville, W . V a . Thomas V . Craft and Mrs. M aggie Lee Petty john, Bristol John T. Sexton and Miss Mary Sexton, Etter. W ythe county, V a . S. F. Harmon and Miss S. E. Franklin, Tazewell county. _ Judge A. A. Phlegar, wh iftn charge as associatetSeiyer. -gj- tle Virginia I i i?Sr 77 al and Coke Company, issued a circular designating J. L. Brass for general manager of the company. Mr. Brass, who has been assistant general manager under Receiver Shields, who retires, will also be general manager of the Virginia and Southwestern Railway. News has been received of the death of Mr. Lewis Berkeley Cox at his home in Portland. Ore., April 11. He was a native of Loudoun county, Va., and was graduated from W ashington and Lee University in the law class of 1878. He married Miss Eleanor Jackson Jun- kin, a daughter of the late Dr. Wm. F. Junkin, of Mont Clair, N. J., who was a brother-in-law of Gen. Stonewall Jack- son. The schooner Teresa W olf. Captain Gifford, of Somers Point. N. J., and the schooner Charles W . Alcott, Captain Loveland, of New York, were in colli sion off the Capes. The W olf was slightly injured and proceeded on her voyage. The Alcott lost her jibboom and bowsprit and was towed to Norfolk. The long distance telephone line con necting Lexington with Richmond via Staunton has been completed. The line connecting Lexington with Buchanan has been completed, and connection will be made with Roanoke and from that point connection can be secured with Lynchburg. Mr. Eustace Lim erick and  iss H ar riet Bullock, both of Fredericksburg, were married by Rev. Dr. J. S. Dill at his residence. This is the young couple who went to W ashington to marry, but were denied a license on account of their youth. The Richmond Board of Aldecmen, by a vote of 14 to 2, decided to accept Mr. Carnegies offer of 100,000 tor a public library here. The matter now goes to Common Council, the lower branch of the city legislative body. The saloon and grocery of-J. Walter Vaughn, at Suffolk, was burned. Loss, 1100 insurance, 650. The officers and directors of the Nia gara Hydraulic Engineer Co. made a business trip to Radford, where they contemplate the erection of waterworks to supply the city. Mrs.. Pearl Hale has brought suit in the Chancery Court of Bristol for a di vorce from her husband, Robert L. Hale. She charges cruel treatment among other things."}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "now being prepared for <mark>system</mark>atic and extensive working. A"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "now being prepared for <mark>system</mark>atic and extensive working. A"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [136.51, 603.45, 434.36, 774.26], "bbox_id": "ef1bf8ab77", "file": "TimesVirginian_1981a_0389.pdf", "page": 1, "text": "TOWN OF APPOMATTOX SEW ERAGE IMPROVEMENTS EPA PROJECT NO. C-510536-04 TO THE CONCERNED CITIZENS OF THE TOWN OF APPOMATTOX The Town has received approval to reduce the sewer service area proposed in its current Facility Plan to the approxim ate boundaries of its existing water service area. This change resulted in a reduction in the projected wastewater flows. The Report entitled  Review of Wastewater Treatment System Alternatives for the Proposed Wastewater Treatment System Improvements dated August 27,1961 and Revised September 1, 1961 and October 20, 1961 concludes that because of the reduction in sewage flows upgrade of existing sewerage facilities is the most cost effective alternative for sewerage treatm ent in the Town of Appomattox. The following data is provided for public review."}, "highlight": {"text": {"matched_tokens": ["sewer"], "snippet": "approval to reduce the <mark>sewer</mark> service area proposed in"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer"], "snippet": "approval to reduce the <mark>sewer</mark> service area proposed in"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1721.73, 668.08, 1905.6, 1339.75], "bbox_id": "5c19a2fd06", "file": "TimesVirginian_1980a_0427.pdf", "page": 1, "text": "town limits, there will be a minimum bi-monthly charge of 18 for metered water consumption up to 4,000 gallons. The sewer rate for metered water consumption over 4,000 gallons will be 0.90 per thousand gallons.  Sewer customers outside the town limits who do not have town water  p c e will be billed baaed on the .arijge, bi-monthly metered water cenflUmptioD of a similar in-town user for the same billing period i.e., , residential, commercial, industrial, etc, except a t otherwise determined by the Tawn QnmdL - There will be ft minimum bi-monthly chargeof 18 for water consumption up to 4,000 gallons. The sewer rate for water consumption over 4,000 gallons fcjUl be-billed at 0.90 per thousand gallons. . At Thursdays meeting, the Mayor audGauadl ripe approved the town tax ra te for Fiscal 1981, which is unchanged from last years. The rries are as follows Bai Estate - 0.20 per dollars assessed value Ptrssnel Property - 0.55 hundred dollars asaeued value j J h p Mggni. a m .  .  j u i hundred dollars assessed vmm  Mobile Homes - 0.20 per Hundred dollars assessed value. Town Manager Bill Britton pointed out that federal revenue-sharing funds for the next fiscal year have been approved by the Congress, a major factor in tho . towns tax rates remaining unchanged. He said this action by Congress will provide the Town of Appomattox will approximate ly 22,000, and . the county with approximately 100,000. in other business, Council approved installation of cathodic protection and a telemetry system for the new town water tank. They systems will be funded by a portion of a , 151,000 federal Department of Housing and Urban Development grant to upgrade the towns total water system. Britton also told Council that a proposed change-of locations for the towns new sewer, plant has been approved by the federal Environmen tal Protection Agency. Plans for the proposed new site, on Continental Can property south of the Falling River County Club, will be forwarded to the state Water Control Board for approval. The site originally proposed for the new sewer plant was the Barger property, located southeast of Falling River Country Club."}, "highlight": {"text": {"matched_tokens": ["system", "system"], "snippet": "protection and a telemetry <mark>system</mark> for the new town water tank. They <mark>system</mark>s will be funded by"}}, "highlights": [{"field": "text", "matched_tokens": ["system", "system"], "snippet": "protection and a telemetry <mark>system</mark> for the new town water tank. They <mark>system</mark>s will be funded by"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1363.66, 1111.41, 1586.85, 1567.24], "bbox_id": "26ec9726fe", "file": "TimesVirginian_1976_0079.pdf", "page": 1, "text": "To Be Introduced Here  Pat Daley, Teacher, Profes sional Seamstress and Lectur e r , will be here Mon., March 8 , to introduce the newly develop- ed Sunburst Pattern Making System. Many seamstresses, being self-taught, are always consci ous of a homeihade appear ance in their garments. Too siten professional sewing and pattern alteration instruction of a highly technical nature is Reeded to giye the home sewer the tailored look. Pat Daley and her husband took a long look at astern Pennsylvania and de cided to open the Stich It fabrics shop in Scranton. Their total concept was not just the salé of fabric, but in teaching ladies bow to handle fabric through proper sewing instruction and proper pattern Ipt. - Y li Having spent 18 years in the garment industry, Pat is a qualified instructor of the most modern tailoring and sewing techniques- used in Working with sweater knits, bathing anits, conventional knit fabric applications, fake fur, and lingerie. In her shop, her classes included not only basic wing, but crocheting, knitt ing, hobby crafts, and tailoring aoatn. blazers, trousers, shirts ad menswear. Pat also made anatom designed clothes and"}, "highlight": {"text": {"matched_tokens": ["System"], "snippet": "ed Sunburst Pattern Making <mark>System</mark>. Many seamstresses, being self-taught,"}}, "highlights": [{"field": "text", "matched_tokens": ["System"], "snippet": "ed Sunburst Pattern Making <mark>System</mark>. Many seamstresses, being self-taught,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1719.88, 572.76, 1892.93, 623.11], "bbox_id": "4ead56dd2b", "file": "TimesVirginian_1980a_0216.pdf", "page": 1, "text": "The town manager added that the sewer user fee will be figured on a percentage of-water-used basis to provide for equity in paying for the new system."}, "highlight": {"text": {"matched_tokens": ["sewer", "system"], "snippet": "The town manager added that the <mark>sewer</mark> user fee will be figured on a percentage of-water-used basis to provide for equity in paying for the new <mark>system</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["sewer", "system"], "snippet": "The town manager added that the <mark>sewer</mark> user fee will be figured on a percentage of-water-used basis to provide for equity in paying for the new <mark>system</mark>."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2102.1, 1193.28, 2279.97, 1786.01], "bbox_id": "b8dfe1b041", "file": "TimesVirginian_1980a_0201.pdf", "page": 1, "text": "The new fiscal year begins July 1 and the budget was adopted after a public hearing was conducted by the board on the proposed budget on June 2. The countys real estate tax rate stands at 60 cents per 100 of the assessed evaluation. The personal property tax rate is 3.50 per 100 of assessed evaluation. William R. Britton, Jr., Appomattox town manager and ..special projects assistant to the board, told the supervisors that the Appomattox Town Council plans to construct a lagoon-type regional waste water system and that council has decided to locate it onContinental Can land approximately 1000 feet downstream from a site that had been considered. This notification was required by law. The Appomattox County Overall Economic Development Plan has been approved by the U. S. Department of Commerce Economic Development Administration, according to Britton. Loans and grants will be available to help stimulate growth and economy in the county. In other business, Dan Herncall was appointed to replace Mr. Charles R. Perkins as Chairman of the Appomat tox Overall Economic Development Plan Committee. The board heard a report from the Appomattox Planning Commission on the request to review. Poff Construc tions proposal for 48 low-income apartment units in the county. The request was denied as the county can not furnish sewer for such a complex. Glenda Gwen Guthrie was appointed to the position of Juvenile Deliquency Prevention Specialist effective im mediately. The position was approved through November 1 of this year and will be funded through grant money. Bobby Waddell, representing the Appomattox County Young Farmers Association, appeared before the board to ciscuss complaints filed after the 4-wheel-drive pull mid the tractor pull held here recently. This event first started in 1978 and is sponsored by the Appomattox County Young Farmers Tractor Pullers, Inc. The last event attracted approximately 1150 penm m -  Lawson told Waddell that they had"}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "lagoon-type regional waste water <mark>system</mark> and that council has"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "lagoon-type regional waste water <mark>system</mark> and that council has"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [385.92, 225.85, 547.82, 792.89], "bbox_id": "e6ff74676f", "file": "AppomattoxNewspapers_1905-1912a_0437.pdf", "page": 1, "text": "The county exhibit of Prince E 1- ward at the State Fair won no pre mium but stood seventh out of 33 and chi i gives us comfort. Will d better next time. Mr. J. J. Gillian prepared the exhibit and deserve credit for the gner.ua work he did in connection with it. The work of exteoding the Farm- rilie eewsr system is much more ot an nndertaking than was thought to be, and yet all difinaltiea are being overcomed and in the near future it will be complete in all its detail.. Water ic the house without the j sewer convenience isnt of muc value, and our people are realiziu, the fact in its fall significance. A housewife of old Buckingham was heard to say with a tinge of sad ness that now as her husband wa shipping cream she couldnt get milk to churn and of course no but ter milk to drink. Too bad. Drink butter milk and live to be 100 is tb advice some one has given. Add to toe habit the cold bath of morning and long walks during the afternooi and the advice is fine. The Normal bell rings at dx in the morning and most of Farm ville jumps out of bed. Some exception for with some folks the morning nap  lifes best luxury. And many o them never barn the midnigat lam either. Mr. Jos. E. Garland, thehustling insurance man, is ont on a business tour this week and he never return without a number of scalps dangling to his belt. Judge Watson was in town recent- y shaking hands with f ends and it mayhave been the initial step towards Congress from this district. He is in the race nd will be foeman worthy any mans beat steel. Jndge Watkins has cot hie bumpi er crop which was raised in the west"}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "the Farm- rilie eewsr <mark>system</mark> is much more ot"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "the Farm- rilie eewsr <mark>system</mark> is much more ot"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2407.14, 492.2, 2561.67, 1333.31], "bbox_id": "2de287b277", "file": "TimesVirginian_1976_0451.pdf", "page": 1, "text": "The Appomattox Town Coun cil approved the budget for 1977 at their meeting on Monday night of this week. The budget, as adopted, calls for operating expenses amount ing to 233,882.00 for 1977 as opposed to a 215,834.00 total budget for 1976. These figures show an increase in the budget for 1977 in the amount of 18,048.00. The 1977 budget shows 30,000.00 expenses for the Appomattox County Schools electric charges. Under an agreement with the Appomat tox County School Board and the Appomattox County Board of Supervisors, the entire 30,000.00 will be reimbursed to the Town of Appomattox. If the rate is unchanged, this amount should be sufficient to cover payment for electricity at all Appomattox County Schools I 148,565.00 was approved for expenditures from the General Fund, 65,317.00 was approved for expenses for the Water Fund, and 20,000.00 was approved for Sewer Fund expenses. Of the 148,565.00 approved and allocated for the General Fund, 69153.00 will go for Administrative expenses 34, 427.00 goes to the Police Department 4,670.00 goes to the Fire D epartm ent 24,222.00 goes to the Street Department and 16,093.00 goes for expenses for the Sshitctiqp Department. fwi Jim May and Mr. lsiph Hines, May-Hlne8 Associates of Farmville, appeared before council to ask approval to submit to the health depart ment in Richmond, on behalf of the Town of Appomattox, plans and specifications for improve ment to the water system. The project, mostly funded by a HUD block grant, would include a water storage tank and foundation and part of a water line to the storage tank. Additional funds will be needed and a local public works application has been sent in for funds. Assuming it is approved, work is to begin within 90 days. If and when the project is advertised for bids it will be in two parts one, storage tank and two, water line. . Council approved the May- Hines request. May-Hines Associates was also given authorization by council to apply for additional funds through HUD for the l next step in the Downtown  Project, that being the recon struction of Harrell Street. In other business, council ! gave approval to purchase a"}, "highlight": {"text": {"matched_tokens": ["Sewer"], "snippet": "20,000.00 was approved for <mark>Sewer</mark> Fund expenses. Of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Sewer"], "snippet": "20,000.00 was approved for <mark>Sewer</mark> Fund expenses. Of the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1973.97, 984.26, 2117.71, 1301.94], "bbox_id": "10157703b6", "file": "TimesVirginian_1978_0106.pdf", "page": 1, "text": "reared in Appomattox County. He served three and one-half years overseas in the Navy Seabees during World War n . He is married to Ella Gordon who retired last year from the Appomattox County Public School System. They have one daughter, Virginia, who with her husband, Ed Forant, reside at Virginia Beach. Since June of 1948, Gordon has been associated with T. E. Brown Construction Company Incorporated. This company has offices in Appomattox and M orehead City, NC and specializes in the construction of roads, water and sewer construction and city streets. He was engineer and general manager of the company for a number of years but for the past twelye years he has been President and Chairman of the Board of Directors. If elected, he promises to do his best to help further the grow th of the Town of Appomattox."}, "highlight": {"text": {"matched_tokens": ["System"], "snippet": "Appomattox County Public School <mark>System</mark>. They have one daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["System"], "snippet": "Appomattox County Public School <mark>System</mark>. They have one daughter,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.93, 719.69, 1790.52, 992.96], "bbox_id": "b51a79dbb7", "file": "AppomattoxNewspapers_1939-1943a_0074.pdf", "page": 1, "text": "M J A rer system and disposal      H K i 63,374.06.  V rt J p p j public Works Ad- k relief frem the Sum of f cold, t a k e  share Was glfi-lstoifog manner id  Tablets - sold, 4fiM90 borrowed -----------------  , I Borrowed from J W l  M i O O  premium  H on bonds, 2- 1 ELS OR 1,712.99 leav- ,tL5 or H1GiB K M K ew er fund of i000 was Paid election ef w al banks anu 58.52 ap- Strie awsiU f?nd C-J-myt ancMglphe construction dosed. smart new the sewer aystem began lg, lfiS8-lfohe lines are sra for your service and near- and business places A tapping _ ___ _ A for each unit Vanderslice, presented the  chape1  juBjbip.a expenses. I program Wednesday at 1030. me . ! string band played and there were S ad presented the jmitations of Amos n Andy and Ed- lanced statement I gar. Bergen and Charlie McCarthy, ed ihday on page 3. i Billy Redding returned to school I K 1. I Wednesday aftor a spell of sickness"}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "M J A rer <mark>system</mark> and disposal      H K"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "M J A rer <mark>system</mark> and disposal      H K"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2035.2, 846.35, 2179.83, 988.58], "bbox_id": "cc525f3988", "file": "TimesVirginian_1981a_0075.pdf", "page": 1, "text": "limited, according to Britton.. If we dont build a new system now, it will probably be a long time before we do because of cost escalations, Britton said. He noted that upon notifi cation of federal approval of the towns sewer grant applica- Begins April 1 H"}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "dont build a new <mark>system</mark> now, it will probably"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "dont build a new <mark>system</mark> now, it will probably"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [650.16, 1679.39, 809.4, 1776.94], "bbox_id": "8ff344b4e2", "file": "AppomattoxNewspapers_1912-1915a_0097.pdf", "page": 1, "text": "In Honolulu the entire system of waterworks Is being remodeled, while important extensions of the sewer sys tem have been projected and made and new projects entered into. Per haps the two most important improve- ments to Honolulu are reclamation of the swamp lands of Kakaako, Kewalo, and to and lying below Kalakaua ave nue and the reconstruction of the Punchbowl district."}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "In Honolulu the entire <mark>system</mark> of waterworks Is being"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "In Honolulu the entire <mark>system</mark> of waterworks Is being"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1609.87, 210.88, 1753.64, 478.88], "bbox_id": "353af21876", "file": "AppomattoxNewspapers_1962-1965a_0414.pdf", "page": 1, "text": "Grover E. Steele, park super intendent, announced be will open proposals for the construc tion in the parte office at 3 p.m. on Wednesday, June 3. Invitations to bid on the work have been mailed to contractors throughout the area, Steele said. The new construction will in clude a sewage lagoon contain ing a minimum of 7,500 square feet of liquid surface area to gether with an overflow area of 1,600 square feet. The lagoon will be created alonside Rt. 24, due south from the parks Visitors Center. The new construction will re place our present disposal sys tem here at the park, Steele expalained. We have outgrown it. The present system consists of a leaching field, which the la goon will replace. About 210 feet of six-inch cast iron sewer line will be installed in the new project, be 9aid."}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "outgrown it. The present <mark>system</mark> consists of a leaching"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "outgrown it. The present <mark>system</mark> consists of a leaching"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2256.25, 710.86, 2424.19, 1084.38], "bbox_id": "2f2ae0275a", "file": "AppomattoxNewspapers_1952-1954a_0553.pdf", "page": 1, "text": "FUNDS FOR LONGWOOD Farmville, Va.- The General As sembly appropriated 1,642,960 for the operation and maintenance of Longwood College for the next bi ennium, Dr. Dabney S. Lancaster announced today. Dr. Lancaster said that this amount was almost as much as he had asked for, but that funds appro priated for capitol outlay fell far short of the actual needs. He added that he realized none of the state institutions received what they want ed for capitol outlay. Longwood will receive 103,000 for improvements and additional equipment for the biennium. Of the total amount appropriated for operation and maintenance, SfliAQ 1000 wiflyp fU pptps a uWf UiVi G kilMil 44 M 44 . f TV CUiilO from tuition and other revenues to the college and not out of the tax payers pocketbook. Longwood will receive 812,900 for the first year of the biennium and 830,060 for fV A flAAAM J V The breakdown of the capitol out lay fund is as follows additional equipment, 40,000 purchase of   n J H i A A A A . a - 4 -________ teas iuf yiifUiUp a aiuiac vault lOl coal and a concrete roof for the power plant, 11,000 new plumb ing for the dormitories in Ruffner Hall, the oldest building on the cam pus, 15,000 a sprinkler system for the Student Building which is not fire proof, 25,000 and a sewer line,"}, "highlight": {"text": {"matched_tokens": ["system"], "snippet": "pus, 15,000 a sprinkler <mark>system</mark> for the Student Building"}}, "highlights": [{"field": "text", "matched_tokens": ["system"], "snippet": "pus, 15,000 a sprinkler <mark>system</mark> for the Student Building"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1379.55, 444.29, 1558.45, 609.09], "bbox_id": "f5eee7a810", "file": "TimesVirginian_1980a_0184.pdf", "page": 1, "text": "By RILL SHERROD The appomattox Mayor and Council voted Monday night to write an  addendum to - its sewer grant plan which will allow it to construct a 400,000 gallon per-day plant with an outfall in Falling River. The system would cost roughly 1.6 million, according to consultants May-Hines and Associates, Inc, The proposed system would be eligible for 75 percent funding from the federal government, according to the consultants. Estimated user charges would be based, on a percentage of water use."}, "highlight": {"text": {"matched_tokens": ["sewer"], "snippet": "an  addendum to - its <mark>sewer</mark> grant plan which will"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer"], "snippet": "an  addendum to - its <mark>sewer</mark> grant plan which will"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1477.9, 940.75, 1776.65, 1340.99], "bbox_id": "b0c8aaadb0", "file": "AppomattoxNewspapers_1949-1952a_0354.pdf", "page": 1, "text": "bring into being the caril- und the middle of the four. firm only an inside form is needed. mu me mmu.e ______ _ Boxes on the end panels of the intury the record describes forms provide notches in the end Inneur being appointed towalls for setting the 4-inch sewer on the bells by hand for pipe outlet and inlet in pc .ion. led of the community. La- The outlet pipe is about three inches lat century clocks were at- below iha inlet, the bells so that from the! Pipes are cemented in these open- -ould come the pealing of.ings after tank forms are removed.  1 A mushy concrete mix for the tank can usually be made in pro- portiens .of five gallons of water, t fb sacf! of portland cement, 2 1-4 cubic feet of average wet sand and three cubic feet of gravel up to about 1 1-2 inches in diameter. If the mix is too stiff to place readily, less sand and gravel are used if it is soupy, more sand and gravel are added. About 21 sacks of ce ment are needed for a 720 gallon tank. I The walls and bottom of the tank are cast at one time resulting in one piece construction. The cover is usually made of reinforced con crete slabs about 4 inches thick.They are cast on a flat surface and later- placed on the tank. The field disposal system into _____ which the liquid flows from the le, the end of the 15th cen- septic tank consists of a concrete carillon consists of 23 or I distribution box and tile lines, ills, chromatic in range and. _____   from a keyboard or clavier, jbly, the bass-hells are below pier level and the medium and j bells near aftd above the Id. the order of 1 ivelopment bell, the chime and the"}, "highlight": {"text": {"matched_tokens": ["sewer"], "snippet": "for setting the 4-inch <mark>sewer</mark> on the bells by"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer"], "snippet": "for setting the 4-inch <mark>sewer</mark> on the bells by"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [354.7, 521.08, 522.21, 1088.97], "bbox_id": "60f2c1635a", "file": "AppomattoxNewspapers_1922-1923a_0291.pdf", "page": 1, "text": "65,ooc price. . . Fifteen hundred excursionists were thrown into a panic during a collision between the steamboats Thomas Patton and Perseus in New York harbor. Mrs. Florence L. Piza. of New York, ill with nervousness, killed herself by leaping from the sixth story of the Hotel Touraine, Boston. The sewer Pipe Trust, facing probing by a federal grand jury, agrees to dis band on condition that the investigation be called off. The town of Socorro. N. M., has been badlv damaged by earthquakes, many of the inhabitants having tied or camped out. The National Business League has indorsed Roosevelts work in placing the consular service on the merit system. A number of New England cotton mills have made a five per cent, increase in operatives wages. Two Kentucky feudists, Dick Hall and John Thornberry, were shot to death from ambush. Henry H. Rogers and William Rocke feller, of the Standard Oil interests, have withdrawn from the committee of trus tees of the Mutual Life Company ap pointed to nominate a new board of directors. Proprietors of New Jersey coast re sorts have protested against the dump ing of New Yorks garbage so close to shore that it drifts in on the Jersey beach. Former Judge Hargis and former Sheriff Callahan, charged with the mur der of Attorney Marcum in a Kentucky feud, were declared not guilty. Chicago hears that the New York Central Railroad has made a bid of 18.- 000,000 for John R. Walshs two In diana railroads. The mother of Harry K. Thaw and her lawyers have decided to ask that the prisoner be committed .to an insane asylum. Two lives were lost and three persons were injured in a fire in the Park Ho tel, Pittsburg. Consul General George E- Anderson, at Rio Janeiro, reports that many Bra zilian diamond companies are frauds with Americans as the victims. Samuel Meanley and his son and daughter were struck by a train on th Manhattan Beach Line, in East York, and all three were killed. Charles Engel, a wealthy merchant of Constantine, Mich., married Miss Seg ridge Johnson, the parlor maid at th- Hotel Manhattan, New York."}, "highlight": {"text": {"matched_tokens": ["sewer"], "snippet": "Hotel Touraine, Boston. The <mark>sewer</mark> Pipe Trust, facing probing"}}, "highlights": [{"field": "text", "matched_tokens": ["sewer"], "snippet": "Hotel Touraine, Boston. The <mark>sewer</mark> Pipe Trust, facing probing"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
