{"document": {"bbox": [1785.1, 289.2, 1950.87, 1051.64], "bbox_id": "fd6a9f21da", "file": "AppomattoxNewspapers_1915-1918a_0169.pdf", "page": 1, "text": "Frank W, McKinney, the pop ular Sheriff of Appomattox county, passed away at his old ancestral home, near this town, Sunday evening, in the 61st year of his age. Since January last Mr McKinney had been a great sufferer, and many hospitals and surgeons had been visited in the hope of finding some relief. Early in this month he suffered an op eration in a Lyncaburg hospit al, which operation revealed his troublecancer. After his wound healed he was brought home, where the tenderest care has been administered by his wife aud brother. He contin ued to suffer, and grew weaker each day until the end came, which was a great relief to his suffering frame. Frank was born and reared in the home where he died. He was a faith ful and courageous officer, and possessed the confidence and esteem of the public in the highest degree. He was a member of the Presbyterian church, and was full recon ciled to his God and feUow- man. The deceased is survived by his wife and little daugh ter, Frankie and the follow ing brothers and sisters J. W. and J, L. McKinney, and Mrs. C. A. Poore, of Lynchburg H. Winston McKinney, Appomat tox Mrs. Kate Wright and Mrs. Fannie McKinney, of Roanoke and Mr. William McKinney, of the U, S. army. The funeral took place from his late home and was conduct ed by his pastor, Kev. J. C Le,.s, where a-large crowd of relatives and friends had as sembled, many from Roanoke and Lynchburg, and this coun tyalthough the weather was threatening, a laige crowd of the friends of this popular citi zen came to pay a last respect to a departed friend. Hand some floral designs bedecked his grave. Mrs. Bessie James and Mrs. ft. E. Caldwell, jr., sang very sweetly several selections. The following acted as pall bearers Dr. D. N. Twyman, Messrs W. B. Gala well, Robert Irby, B. G. Anderson, J. O. Woodson and ..A. il. Clement,"}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney", "Sheriff"], "snippet": "<mark>Frank</mark> <mark>W</mark>, <mark>McKinney</mark>, the pop ular <mark>Sheriff</mark> of Appomattox county, passed"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney", "Sheriff"], "snippet": "<mark>Frank</mark> <mark>W</mark>, <mark>McKinney</mark>, the pop ular <mark>Sheriff</mark> of Appomattox county, passed"}], "text_match": 2314894167190274169, "text_match_info": {"best_field_score": "4419510730752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167190274169", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [678.48, 203.69, 844.06, 676.87], "bbox_id": "17a8e2c947", "file": "AppomattoxNewspapers_1892-1898a_0453.pdf", "page": 1, "text": "Wheu sheriff Coleman passed out of the building to the broad stone porch, he was accosted by R. H. Browning, and the heated words that ensued soon led to blows, sev eral of which were exchanged. A very few minutes after the difficulty, Field Smith, a well-known resident of Appomattox, denounced the sher iff, and another difficulty was nar rowly averted. Mr. Coleman has been sheriff of Appomattox county for a good many years. He will be opposed in his candidacy for re-election to the office spring after next by Mr. Frank W. McKinney. A gentleman from Appomattox who arrived in the city yesterday said to a reporter of the News that Mr. Coleman had stated to several parties since the political meeting on Thursday, that he was a candidate for the legislature as the floater from Appbmattox and Campbell. Mr. Coleman has been a staunch Democrat for many years, and his action has been a surprise to his many friends. On Friday Mr Coleman told a friend that he was iu the fight and I mean business. The editor of this paper was not present when the altercation between the sheriff and Mr. Browning took place nor when the sheriff announced himself an independent candidate for the House of Delegates, but from the leliable information we liather there seems to be little doubt that the report given of the affair by the News is correct, except that which is corrected by card is this issue."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney"], "snippet": "after next by Mr. <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. A gentleman from Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney"], "snippet": "after next by Mr. <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark>. A gentleman from Appomattox"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Frank", "W", "McKinney", "W"], "snippet": "Bryant, S. P. Coleman, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> and H. <mark>W</mark>. Mc"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "W", "McKinney", "W"], "snippet": "Bryant, S. P. Coleman, <mark>Frank</mark> <mark>W</mark>. <mark>McKinney</mark> and H. <mark>W</mark>. Mc"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [826.8, 646.02, 1147.13, 907.66], "bbox_id": "ed32593d7d", "file": "AppomattoxNewspapers_1926-1933a_0210.pdf", "page": 1, "text": "W arrants charging Jerr Franklin, 2 0 Walker Frank in, 27, and Gordon Smith, 2. -vith breaking into W- R. Re iolds store and taking mol han 50 worth of merchai Use, were served last Monda n Lynchburg. The robbery, yith whic ey are charged, was carrie ut Dec. 12, when Reynold -tore was broken into, th afe badly damaged, althoug. tot opened, and a quantity o nerchandise taken. A. H Jlements caf was taken th -ame night, tjind later found i he river near Lynchburg. The arrests were made bj sheriff H- W. McKinney, D- A Gonner, and Detectives C. N SStSS oLynchburg.Th Mr or j warrants were sworn out b Mr. Smith for investigation. jMr. Reynolds J"}, "highlight": {"text": {"matched_tokens": ["sheriff", "W", "McKinney"], "snippet": "arrests were made bj <mark>sheriff</mark> H- <mark>W</mark>. <mark>McKinney</mark>, D- A Gonner, and"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff", "W", "McKinney"], "snippet": "arrests were made bj <mark>sheriff</mark> H- <mark>W</mark>. <mark>McKinney</mark>, D- A Gonner, and"}], "text_match": 2312642367779242105, "text_match_info": {"best_field_score": "3319999299584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367779242105", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.51, 542.23, 1624.91, 1040.13], "bbox_id": "9827ee68ea", "file": "AppomattoxNewspapers_1905-1912a_0013.pdf", "page": 1, "text": "O akville. Tire se ias of meetings held at Red Oaks by Rev. Hugh C. Smith la t week closed on Friday morning Much good was done and ten united with the church The Sunday School at Red O.ik has been very interesting this ye.tr, and we hope it will continue so Ti e wnter went to Hermon on Sunday to bear Rev. Mr. Dunkb v preach h- last sermon,the loss . egret Ye th nk Mr. DunUlej a line man and an excellent preach.  Alta. B, 8. Thorpe aud family ic turned to Lynchburg on Friday last, c ompanied by Mrs. T. G. Thorpe. Mr. Robert Gardner has left! for Lynchburg, where he hat accjibf a position as salesman in the lWrd- ware .stoic of John E. Gannaway. Messrs. Curry Abbitt and Kinckl. Martin made  flying trip to Stone wall on Friday last. Miss Jessie Thorpe who hgs been quite sick for come Fine we ere glad to say is convalescent. Miss Mary Goodman of Spout Springs visited her sister at Oak ville last week. Sheriff F. W. McKinney still vi its Oakville quite often. We art always glad to see him. Ootne again Frank. Tne O kviilescho 1 is progressing nicely wi h an enrollment of twenty- nine anil an average daily attendance of twenty odd Mr, Jim Gordon is a frequent viaitor to Otkvilie there seYiis to be some aur ctiou. We enjoy reading T he T imes"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "W", "McKinney"], "snippet": "Oak ville last week. <mark>Sheriff</mark> F. <mark>W</mark>. <mark>McKinney</mark> still vi its Oakville"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "W", "McKinney"], "snippet": "Oak ville last week. <mark>Sheriff</mark> F. <mark>W</mark>. <mark>McKinney</mark> still vi its Oakville"}], "text_match": 2312642367779242105, "text_match_info": {"best_field_score": "3319999299584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367779242105", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [271.2, 1040.4, 748.95, 1242.7], "bbox_id": "471dc07f19", "file": "AppomattoxNewspapers_1908-1909a_0471.pdf", "page": 1, "text": "Addie Lena Ferguson, Vernon Ragland, taidlle Cralle, Lucille ......... 1 __ _ _ __ Blackwell, !Rroiine XeGrand, prolleing are toucoea w a mauani w-  J -r. 1 William Jobe, Lawson lee, Alice proved by communist dogma. But chance, whpthgr for merchandise I  Joe Gailier Myrtle Din- there are great tomes on sociology, or cash? It s easy to exchangeI 8 Chilton Evelyn Dick- ytttar TTrw1r rel,rfn merchandise for cash. Urson, Horsley Harris, Frank I Cawthorn, Eleanor Davidson. I Seventh grade  Elizabeth Sheriff McKinnéy and his de-1 Trent, Nellie -Simms, Christine puties have succeeded in round-1 Paulette, Eloise OBrien, Claud- Ing up a part of the gang which! jne OBrien, Hilda Moore, Carrie has been breaking open houses I Jamerson, Louise Godsey, Clark- and stores here for some time. e vanSj. Mandáne Anderson. Last Ftlday the Sheriff arid Alex. I Sixth gradeLeilas Davis,. Eliz- Bingham-tookcharge of Gordon I abeth Cralle, .Mary Clark, Ruby Smith at Blue1 Ridge and contin I Cole, Margaret Carter. Mabel"}, "highlight": {"text": {"matched_tokens": ["Frank", "Sheriff", "McKinnéy"], "snippet": "cash. Urson, Horsley Harris, <mark>Frank</mark> I Cawthorn, Eleanor Davidson. I Seventh grade  Elizabeth <mark>Sheriff</mark> <mark>McKinnéy</mark> and his de-1 Trent,"}}, "highlights": [{"field": "text", "matched_tokens": ["Frank", "Sheriff", "McKinnéy"], "snippet": "cash. Urson, Horsley Harris, <mark>Frank</mark> I Cawthorn, Eleanor Davidson. I Seventh grade  Elizabeth <mark>Sheriff</mark> <mark>McKinnéy</mark> and his de-1 Trent,"}], "text_match": 2312642366839718009, "text_match_info": {"best_field_score": "3319998840832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642366839718009", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.55, 1322.66, 1799.17, 1426.59], "bbox_id": "0e1d6f3817", "file": "AppomattoxNewspapers_1926-1933a_0090.pdf", "page": 1, "text": "Sheriff McKinney, Duvall Con- dumrto  he afho rHalfe Bui- . ner and Constable Pulliam. The son, Louie wdwrmHaUie Bu Hgnt kook party at et up a careful watch nette, Lonelle Hamilton, Lucy f Mrs. Frank McKin-1 d after a lpng anj patient ver- LeGrand, Mary. Jamerson, Sadie  was a delightful af-j e rewarHeH by the ap- and Virginia Reynolds, Florence lad plate and choco- rfV .  tue operators on the I Gregory, Messrs. Frank Robert- ed the guests. f c  w h o J u p T e crude son, Homer bcoek Cornehn x, Campbell, Am- plant which consisted of gas bM- Cawthorn, Jones CaldweJl Ed- urtotte, Bedford and 11 and worm. After the ,flre w a r d R  e y  H e n r  Caldweii."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "McKinney"], "snippet": "<mark>Sheriff</mark> <mark>McKinney</mark>, Duvall Con- dumrto  he"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "McKinney"], "snippet": "<mark>Sheriff</mark> <mark>McKinney</mark>, Duvall Con- dumrto  he"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1550.39, 210.96, 1712.01, 1713.08], "bbox_id": "2aed2bb2ac", "file": "AppomattoxNewspapers_1915-1918a_0310.pdf", "page": 1, "text": "Mr. H. M. Crowder was in town last week. Mrs. Lavona Crowder made short visit to Mrs. S. L. Fer guson last week. Miss Alice Proffitt left last week for Cleveland, Ohio, where she will live for a while A d a m e Bros.-Paynes Co., Lynchburg, have change of ad ou this page. Sheriff McKinney wants a jailer, but there is no one in jail. Mrs. R. N. Dawson, of Rich mond, is visiting her parents, Mr. and Mrs. R. H. Browning, near here. Mr. George Paris gave a few of his friends a party Saturday night, the 20 th, which was his birthday. Mr. and Mrs. 0. G. Chandler have returned home, after a very pleasant visit spent with home people near Burkeville. Miss Kyle Davis, of Culpep- , Va., has been on a visit to cousin, Miss Eula May Burke, for several days. WantedColored family oa large farm. Good wages and land for orking people. Address, with prticnlars, Box 28, Route 1 , Ever green, Va. 110 3w Mr. Moses Hunter has nine children down with measles. he children are doing well, and Mose is a very busy man. Mr. C S. Frank was a visitor in Appomattox today. He has recently bought a farm in the Southside of the county. A large attendance of far mers is earnestly desired here at the C. H. Saturday, to or ganize a Farm Loan Bank. Are you coming? W hats the N. Sc W. going to do for the people of Appomat tox, since the people yielded to iheir contention for the dos lag of the main street crossing? Mr. Jessie Harvey sold on tbe Appomattox tobocco mar ket to-day 1000 lbs, for which he received 224.86. What market can beat it? If you want the farms of Ap pomattox to keep up with the progress of the State, come out Saturday and help organise the  federal Farm Laud Bank. Are you ooming? Supervisor L. E. Smih at tended the recent good roads meeting in Norfolk. Len is a ive supervisor, and wants Ap ppmattox to stand for progress, good roads. FARMERS! .Tobacco is selling high. You ought to start your plant beds for this years crop right, by 6  ng Old Dominion Guano on it. have jnat received a carload of eah m tde goods. 17 2 w E. L e R oy S mith . Rev. McElroy has been con fined to his home since Monday with a deep cold. He is much better and expects to be ready for the prayer meeting Thurs day night. Miss Pocahontas Wray, of Martinsville, Va., is on a visit to the Dormitory here. Miss Wray was teacher here for our years, and her friends are glad to have her with them Evergreen Baptist church Quarterly church meeting Sat urday, 27tb, at 230 p. m Preaching Sunday morning 11 oclock, and 8 unday afternoon oclock. My boy left home about tbe last of. February a year ago His name is Levi. Any infor mation about his present resi ilence will be highly appreciat ed. Has large eyes, 15 years of age, black. J a s . W . F lood , Appomattox, Va, There will be a meeting of tbe Appomattox Barred Rock Associa non on Feb. 2nd at 230 p. m. All members are urged to toe present, ae Mr. N. E. B. Talcott, State Ponltry Agent, will be he, e and will give ,ou some interesting information, 1 24 2w E. LeRoy Smith, Sec Preaching at Memorial Meth odist church Sunday at 11 a.m by the Presiding Elder of the Lynchburg district. Rev. W .T Green, who will preach again Monday morning at 11 a. m and hold the first quarterly conference of the year. Ser vices Sunday evening at 730 by the pastor. Subject, T te Power of the Gross. Sundagr school at 10 a. m. and proytv meeting Wednesday evening at 730. Everybody invited to attend these servioee."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "McKinney"], "snippet": "ad ou this page. <mark>Sheriff</mark> <mark>McKinney</mark> wants a jailer, but"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "McKinney"], "snippet": "ad ou this page. <mark>Sheriff</mark> <mark>McKinney</mark> wants a jailer, but"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["W", "McKinney"], "snippet": "J. A. Burke, H. <mark>W</mark>. <mark>McKinney</mark>, Geo. Ab bitt, Jr.,"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "McKinney"], "snippet": "J. A. Burke, H. <mark>W</mark>. <mark>McKinney</mark>, Geo. Ab bitt, Jr.,"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
