{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["William", "Paris"], "snippet": "Watkins, Geo. T. Peers, <mark>William</mark> <mark>Paris</mark>, Wilson Hix, W. T."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Paris"], "snippet": "Watkins, Geo. T. Peers, <mark>William</mark> <mark>Paris</mark>, Wilson Hix, W. T."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [760.29, 426.59, 917.47, 1977.82], "bbox_id": "1ea84278aa", "file": "AppomattoxNewspapers_1898-1902a_0412.pdf", "page": 1, "text": "The New York Jury in the case of Louis H. Hilliard, who died at Belle vue Hospital, gave a verdict that he came to his death from injuries caused by Davis, Dean and Marshall, the nurses. The accused were held for the grand jury. Myles McDonald and Thomas Ken nedy, a pair of gamblers in New York, had a pistol duel, the result of which was the mortal wounding of Edward Courteney and George Price. In his address before the Southern Educational Association, Professor Branson attributed the backwardness of education in the South to the lack of co-operation. Andrew and Elizabeth Noel, of Jack- son township, Pa., were arrested on the charge of burning their house to defraud the insurance company. The threatened strike on the Wilkes- barre and Wyoming Valley Electric Railway was avoided, a compromise being amicably agreed upon. D. A. Jennings, of Columbus, Ohio, sued 20 people of Washington county, Ind., for 200,000 damages for perse cuting him and his family. A fortune In government bonds was found in the cave of Ypsulantl Smith, a hermit, who died near Fletcher, Ohio. The Red Mountain stage was over turned near Ouray, Col., and six pas sengers precipitated over a cliff. William Westlake, widely known as an inventor, died at his home in Brooklyn. Prof. Moses Coit Tyler, of Cornell University, died at Ithaca, N. Y. William H. Smythe, grand secretary of the Masonic Order in Indiana, was shot and seriously wounded in his of fice in Indianapolis. He says a woman shot him. At the second quarterly meeting of the American Physical Society, held in New York, Prof. Rowland, of the Johns Hopkins University, Baltimore, was re-elected president. Samuel D. Miller, whose son was ab ducted from Indianapolis, Ind., by the hoys mother, recovered the child at Lawrence. Mrs. Lulu C. Jenkins, whose husband was lynched in Ripley county, Ind., will receive 4000 damages from the bondsmen of the Sheriff. Abraham Johnston and his wife, an aged couple, were tortured and robbed at their home, near Marietta, O. Mrs. Mary Kennedy was burned to death and several other women were injured in a fire in Chicago. Michael Maloney, a farmer, died at bis home, in Lenox township, Pa., at the age of 107 years. John F. Welshaus, a former resident of Shepherdstown, W. Va., died sud denly in Chicago. The general meeting of the Ameri can- Chemical Society was held in Chi cago. The wife of Samuel D. Miller, son of former United States Attorney General Miller, kidnapped her seven-year-old son, who, with his father, was living at the home of his grandfather in In dianapolis. . The couple have been liv ing apart, but are not divorced. The fifth annual convention of the National Commercial Teachers Fed eration was opened in Detroit, W. C. Stevenson, of Port Deposit, Md., presi dent of the federation, made an ad dress on the progress of commercial education. Mr. Bryan, in a speech at a Jefferson banquet in Lincoln, Neb., said that whether he would ever be a candidate for office again was a question which must be determined by events. Charles H. Cramp says he received a cablegram announcing the signing of the contract with the Turkish Minister of Marine for the construction of a cruiser. Deputy John Usher and Charles Bowline, a saloonkeeper, were killed, and Birch Hillen wounded, in Mayfield, Ky., as the result of an effort to arrest Hiller. Physiologists of the University of Chicago announced as the result of ex periments made upon turtles that salt causes the heart to beat. Handsome Elk, a dangerous Indian, of South Dakota, beat his squaw near ly to death and scalped another Indian woman. Colonel Asa Bird Gardiner sur- repdered his office as district attorney of New York to Eugene A. Philbin un der protest. Prof. D. W. Batson, dean of Ken tucky Wesleyan College, resigned on account of his opposition to football playing. Mr. Cleveland wrote a letter to the Atlanta Journal stating that he did not vote for McKinley at the recent elec tion. Rev. Dr. Thomas Murphy, an emi nent Presbyterian clergyman and ec clesiastical writer, died in Philadel phia. Frank Corcoran, while skating on Loucks Dam, near York, Pa., broke through the ice and was drowned. The strike of the miners at the En terprise colliery, in Shamekin, was set tled. The new Rocky Mountain smelter started up at Florence, near Pueblo, Col. Mr. Bryan, in a greeting to political friends in Kansas, says, The princi ples of Democracy still live, and the policies for which the fusion forces fought will yet be vindicated. There is rowing doubt as to Mr. Ad- dicks abHlty to capture one of the-Del- aware senatorshlps, to be filled when he legislature of that State meets in January. The pony supposed to have been rid den by one of young Cudahys ab ductors has been found in a barn 23 miles south of Omaha, where it was abandoned. Hughes Dillard, a well-known resi dent of Martinsville, Va., was probably fatolly shot by a negro. The latter probably escaped lynching by flight. Mrs. Sarah Frank, of Brooklyn, N.Y., took a dose of paris green in mistake for headache powder, and died an hour afterward. The Agricultural Department an nounces a successful experiment near Hartford, Conn., in the growth of Su matra tobacco. Noble Lindsey, president of the First National Bank of Alexandria, died sud denly after a few hours illness. Senator Hanna attended a dinner given to 1500 poor people at Cleveland by the Salvation Army and made a short speech. Mr. R. B. Cooke has been elected traffic manager of the New York, Philadelphia and Norfolk Railroad Company, with headquarters in Nor folk. Farmers around Newport News are endeavoring to have the study of ag riculture introduced into public schools. Because Louis Lombardo persisted in singing love songs in serenading his sweetheart, in Brooklyn, he was shot in the head by the girls father."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "precipitated over a cliff. <mark>William</mark> Westlake, widely known as"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "precipitated over a cliff. <mark>William</mark> Westlake, widely known as"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [333.1, 531.11, 489.61, 1624.65], "bbox_id": "e78a55afc4", "file": "AppomattoxNewspapers_1902-1905a_0272.pdf", "page": 1, "text": "Domestic. Lieut. G. S. Richards and F. B. Nielson have returned from Manila under arraignment to appear before a military court-martial on the charge of duplicating their pay accounts in the Philippines. The directors of the Corn Product Company passed the dividend on the companys common stock the usual quarterly dividend of 3  per cent, on the preferred stock was declared. Second Deputy Police Commis sioner Henry F. Haegerty was re moved by Commissioner McAdoo after he had refused to hand in his resignation. Eugene Allison, the builder of the wrecked Hotel Darlington, in New York, was closely questioned dur ing the coroners inquest. The Citizens Alliance of Telluride, Col., has shipped a number of union men and their sympathizers out of town. William E. Miller, a member of the Light Brigade which made the famous charge at Balaklava, died at Grotan, Ct. President Hill nd other officials of the Northern Securities Companies held a conference in New York. Two persons were killed and several were injured in an explosion that wrecked a toy factory in Chicago. The miners of the central competi tive district voted, by a large major ity, to accept the wage scale. The only opposition was in Illinois and Iowa, where the majority was in favor of a strike. A suit has been brought by the New York, New Haven and Hartford Rail road to secure a condemnation of stock in the old New Haven and Derby Railroad. Frank H . Burness, a condrnned murderer, has written to Governor Odell requesting that there be no de lay in his execution. The petition of Mrs. Anmie Mur phy to be declared the lawful daughter of the late Baron von Glahn was de nied. State Senator Jewell, of Kansas City, was brought to trial upon the charge of soliciting a bribe. The provisional battalion of Philip pine scouts has arrived at San Fran cisco. Admiral Dewey has explained to the Navy Department his failure to call on President Morales when h was near San Domingo. He did not deem it wise to make an official visit during the fighting that was then in progress. In a fit of jealousy a negro killed his wife and then himself at W ashing ton, Pa. The tragedy took place at the door of a church where a festival was in progress and the negroes in attend ance were thrown into a panic. A letter received in New York states that Miss Ando Toshi became the idol of the Japanese by stealing the map of the defenses of Port Arthur and taking them to the Japanese Minister in hina. Former Senator Rawlins, of Utah, sent a telegram to Chairman Burows, of the Senate committee on Smoot, flatly contradicting Judge Hiles state ment that he was a Morman. Just as the members of a fanatical religious sect were about to sacrifice the seven-year-old child of Mrs. Beal on Beals Island, Me., the sheriff forci bly dispersed the congregation. The Presbyterian Board of Foreign Missions in New York received by cable confirmation of the murder of Rev. Benjamin W. Laboree, the mis sionary, near Khio, Persia. Foreign. Officials of the American Embassy in Paris are considering points of French law to insure protection of the United States when payment of  40 ,- 000,000 for Panama Canal property is made. The German government has asked the Reichstag to appropriate  1 , 675 ,- 000 for expenses in suppressing the Herero rebellion in German South west Africa. Lewis Vernon-Harcourt, eldest son of William Vernon-Harcourt. has been elected to the House of Commons. It is admitted in British government circles that Premier Balfour suffered a personal defeat in only being able to keep his ministry in power by a majority of 46 . The French Court of Cassation con tinued in the investigation of the War Office documents in the Dreyfus case. On account of conflicting reports of the intentions of the Japanese commanders in Manchuria the Russian corps which has arrived at Harbin will be detained there. Twenty-four States of the United States have passed industrial arbitra tion laws. Waitresses at Rochester. N. Y.. have formed a union. A shorter workday is desired. The trials of the rioters and mur derers at Kishineff were concluded. One man was sentenced to 20 years for the murder of a Jewish couple."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "sympathizers out of town. <mark>William</mark> E. Miller, a member"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "sympathizers out of town. <mark>William</mark> E. Miller, a member"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [781.9, 407.11, 946.25, 1962.85], "bbox_id": "d217d557fb", "file": "AppomattoxNewspapers_1898-1902a_0513.pdf", "page": 1, "text": "Domestic Intense heat prevailed nearly all over the East, except in the Gulf States. In the Middle West at some points and on the Pacific Coast it was cool. It was very hot in New England, two deaths being reported at Lowell, Mass., and one at West Derry, N. H. Three pros trations were due to heat in Boston and Pittsburg. An order was issued by President T. J. Shaffer, of the Amalgamated Asso ciation of Iron, Steel and Tinworkers, calling all the union men out. The strike, which will involve 20,000 men, was decided upon because the American Sheet Steel Company refused to tpake all their plants union shops. Hiram F. Heald, of Carlisle, Mass., said while in Chelmsford, Mass., he saw and spoke to J. Wilfred Blondin, want ed in Boston on the charge of wife mur der. The United States Reduction and Re fining. Company, with a capital of 10,- 000. 000, was incorporated at Denver. Oliver S. Carter, president of the Na tional Bank of the Republic, in New York, died at Saratoga. N. Y. Rev. G. H. Hill of Richmond, Ind., was seriously hurt in a railroad colli sion at Ridgeville, in that Start. Six masked men robbed the dwelling of Jacob L. White, near Brothers Sta tion, W. Va. Louis G. Graff, of Philadelphia, died at Riverton, N. J., aged 82. There were three deaths from the heat in Philadelphia. The President has refused to pardon ex-District Attorney Ellery P. Ingham and ex-Assistant District Attorney Har vey K. Newitt, of Pennsylvania, who were convicted and sentenced to two and a half years imprisonment for connec tion with the famous Jacobs counterfeit ing cases in Pennsylvania several years ago. At Columbus, O., Mrs. Ruthven, whose husband was electrocuted for murder of a policeman, said prior to the electrocution that she, and not her hus band, was the real murderer. A young negro who entered the room of a daughter of John Whittaker, of Georgetown, Ga., was taken from the sheriff by a mob and probably lynched. At Rockford, 111 ., Morris Curison was killed by lightning while playing base ball. Other players and spectators were shocked. Robert Price, colored, killed George Hooks and seriously cut Charles Davis, who were trying to arrest him. The gold coinage at the Philadelphia Mint during the fiscal year was 99,065,- 715 silver coinage, 35,265,498. William E. Clark, his two daughters and George B. Bryan were drowned at Newberne, N. C. Frank Miller, a notorious safe-blower, was hanged at Birmingham, Ala. Upon the order of Comptroller of the Currency Dawes, the Seventh National Bank of New York closed its doors, and Forrest Raynor, national bank ex aminer, was appointed temporary re ceiver. The Pennsylvania Prohibition State Convention at Harrisburg nominated Isaac Monderan, of Meadville, for Su preme Court Judge, and J. J. Porter, of Pittsburg, merchant, for state treas urer. The striking mine workers of the Reading Iron Company rejected the companys offer for 25 per cent, in crease, insisting upon a recognition of their union. A. L. Hayman asks 5,000 damages from Sam W. Steel in _ Norfolk Va., whom he accuses of writing a letter to a Baltimore house that ruined his credit. T. C. Crenshaw, president of the Georgia Railroad Commission, was stabbed and seriously injured by a Pullman car conductor on a train in Georgia. _ _ _ _ _ To reign. Fournier won the three-day auto car race from Paris to Berlin, receiving an ovation from a brilliant gathering of notabilties, who welcomed all the par ticipants as they arrived at the finish. There was a big banquet at night. The American athletes, especially A. H. Duffey, the Georgetown runner, and Kraenzlein, the hurdler, carried off hon ors at the London Athletic Club meet ing at Stamford Bridge, Kraenzlein breaking British records. The select committee of the Britrey House of Lords reported that the ac cession declaration of the sovereign might be modified to eliminate the por tion objectionable to the Roman Catho lics. General Davis regards as a travesty on Justice the second verdict of acquit tal in the case of Harold M. Ftet, tried in Manila on the charge of being con cerned in the commissary scandal. The debate in the Italian Chamber of Deputies over the fight between soldiers and strikers became so acrimonious that the president felt obliged to suspend the sitting. Lord Kitchener reported that the Boers attacked two blockhouses on the Delagoa line, near Brugspruit Bight, but were driven off with loss. The Anchor Line steamer Armenia went ashore on Nigger Head, near St. John, N. B., and is likely to prove a total wreck. There was a notable pro-Boer de monstration inBrussels to Andreis de Wet, after he had delivered a lecture there. Shamrock II. easily beat Shamrock 1. in the first trial between the two yachts since the challenger was wrecked. Edward Krohmann, a hanker of Leip zig, Germany, committed suicide on his estate at Lindenau. Clausen, the well-known German chemist, died from the effects of Roent gen rays. In the great automobile race from Paris to Berlin Fournier was ahead at Aix-la-Chapelle, the end of the first days run. One automobile ran over and killed a child. Foxhall Keene met with a mishap. A tire on his car burst and he was thrown, but not seriously injured. _______ flitK iol Union Pacifics May earnings shows a gross increase of 388,958 and a net in crease of 49,852. The stockholder of the National Su gar Company hae voted to increase the capital stock from 1.000.000 to 2,000,- 000. The Delaware, Lackawanna  West ern Railroad Co. directors have decarcd the regular quarterly dividend of 1 3-4 per cent. Chicago, Burlington  Quincys statement for May shows an increase in gross of 774,631 and an increase in net of 232,911. The American Ice Company has de clared the regular quarterly dividend of 1 1-2 per cent, on its preferred stock, payable July 15. The Secretary of State of Indiana has taken action against the United States Steel Company, requiring it to incorpo rate under the Indiana law for foreign corporations doing business in that State. It is reported that the American Ce real Company will increase its capital stock to 10,000,000. The Northwestern Miller reports floor output at Spring wheat centers for the week 367,975 barrels. Crops in fair condition and promise good."}, "highlight": {"text": {"matched_tokens": ["sheriff"], "snippet": "was taken from the <mark>sheriff</mark> by a mob and"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff"], "snippet": "was taken from the <mark>sheriff</mark> by a mob and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [916.09, 474.01, 1076.76, 2056.88], "bbox_id": "f16c460dbe", "file": "AppomattoxNewspapers_1898-1902a_0099.pdf", "page": 1, "text": "and men or toe army ana or tne navywbc remained in their departments and stations faithfully performing most Important du. tira connected with the war, and whose re quests for assignment in the field and at sea I was compelled to refase because theb services were indispensable here,  e en titled to the highest commendation. It Is my regret that there seems to be no pro vision for their suitable recognition. In tracing these events we aje constantly reminded of onr obligations to tbe Divine Master for His watchful care over us and His safe guidance, for which the nation makes révèrent acknowledgment and of fers humble prayers for the continuance ol His favor. Spain Sacs For Feacs. Spaio, having realized that she had lost, tbe President states, now - sued. for eace. The signing of the protocol is re ferred to, and then tbe Message relates the details of the negotations which ended In a suspension of hostilities, the appoint ment of the military commissions to superintend the evacuation of Cuba, Portò Rico and the adjacent islands and the peace commission. Continuing, he says Peace Commissions Work. Pursuant to the fifth article of the proto col, I appointed William B. Day, lately Secretary of State Cushman K. Davis, William P. Frye and George Gray, Senators of the United States, and Whitelaw Reid to be the Peace Commissioners on the part of the United States. Proceeding in due season to Paris, they there met on the 1st of October five Commissioners similarly appointed on the part of Spain. Their negotiations hare made hopeful progress, so that I trust soon to be able to lay a definite treaty of peace before the Senate, with a review of the steps leading to its signature. Government of New Possessions. .1 do not discuss at this time the govern ment or the fatare of tbe new possessions which will come to us as a result of the war with Spain. Such discussion will be ap propriate after the treaty of peace shall be ratified. In the meantime, and until Con- tress has legislated otherwise, it will be mÿ Suty to continuetbe military Governments which have existed since onr occupation, and give to tbe people security in life and property and encouragement under a just and bénéficient rale. Independence Alone For Caba. As soon ns we are in possession of Cuba and have pacified tbe island, it will benec- essary to give aid and direction to its people to form a government for them- selves. This should be undertaken at thè earliest moment consistent with safety and assured success.  It is important that onr relations with this people shall be of the most friendly oharacter and our commer cial relations close and reciprocal. It should be our duty to assist in every prop er way to build up the waste places of the Island, encourage the industry of the peo ple, and assist them to form a government which shall be free and Independent, thus realizing the best aspirations of the Caban people. Spanish rule must be replaced by a just, benevolent, and humane Government, created by the people of Cuba, capable of performing all international obligations, and wbich shall encourage thrift, industry and prosperity, and promote peace and good will among all of the inhabitants, whatever may have been their relations in the past. Neither revenge nor passion should have a place In the new Govern ment. Until there is a complete tran quillity in the island and a stable Govern ment inaugurated military occupation will be continued. Friendly Relations Witn All Nations. With the one exception of the rapture with Spain, the Intercourse of the United States with the great family of nations has been marked with cordiality, and tbe close of the eventful year finds most of the is-, sues that necessarily arise in the complex relations of sovereign States, adjusted or. presenting no serious obstacle to a just and honorable solution by amicable agreement. The President dwells at some length on the long unsettled- boundary dispute be tween the Argentine Republic and Chile, and expresses pleasure that his efforts to induce them to resort to arbitration have been successful. He also refers to the strong hope he has that the rates charged on the cables of American corporations in tho transmission - between Buenos Ayres and the cities of Uruguay, Brazil and the Atlantic cities of South America may be freed from an almost prohibitory discrimin ation. He favors an international agree ment for an interenange of messages over connecting cables. Then taking up home topics he says Austria and the Lattimer Strike. On the 10th day of September, 1897, a conflict tcok place at Lattimer, Penn., be tween a body of striking miners -and the Sheriff of Luzertie County and his depu ties, In which twenty-two miners were killed and forty-four wounded, of whom ten of the killed and twelve of the wound ed, were Austrian and Hungarian subjects. The deplorable event naturally aroused tbe solicitude of the Austro-Hungarian Government, which, on the assumption that the killing and wounding involved tbe unjustifiable misuse of authority, claimed reparation for the sufferers. Apart from tbe searching investigation and peremptory action- of the authorities of Pennsylvania, the Federal Executive took appropriate steps to learn the merits of the case, in order to be In a position to meet the urgent complaint of a friendly power. The Sheriff and bis deputies, hav ing been indicted for murder, were tried and acquitted after protracted proceedings and the hearing of hundreds of witnesses, on the ground that the killing was in the line of their official duty to upnold law and preserve publie order in the State. A rep resentative of the Department of Justice attended the trial and reported its coarse fully- With all the facts in its possessioni this Government expects to reaah a har monious understanding on the subject with that of Austria-Hungary, notwithstanding the renewed claim of- the latter after learn ing the rèsult of the trial,for indemnity for Us,injured subjects. After an extended reference to the y e  s events in Central America, he devotes the following pagraph to the Nicagus Canal Nicaragua Canal a Necessity The Nicaragua Canal Commission, under the Chairmanship of Bear-Admiral John C. Walker, appointed July 24, 1897, under the authority W a provision in the Sundry Civil aot of Jane 4 of that year, has nely com pleted its labors, and the results ot its ex haustive inquiry tntotheproper route, the feasibility and- the cost of construction of an lnteroeeanio oanal by a Nicaraguan route will be laid before you. In the per formance ot its task the commission re ceived all the possible courtesy and assist ance from the Governments oLJJicaragua and Costa Bica, which thus testified their appreciation of the importance of giving a speedy and practical outcome to the great projeot that bas fqr so many years en grossed the attention of the respective countries. As the scope of the recent inquiry em braced the whole subject, with the aim of making plans and surveys tor a canal by tbe most convenient route, it necessarily included a review of the results ot previous surveys and plans, and in partioul those adopted by the Maritime Canal Company under its existing concessions from Nica ragua and Costa Blea, so that to this extent those grants necessarily hold as. essential a part in the deliberations and conclusions of the Oanal Commission as they have held and must of need hold In the discussion ot the matter by the Congress. Under these elrenmstances, and in view of Overtures made to tbe Governments ot Nicaragua and Costa Rlep by other parties for a now canal concession, predicated on the as sumed approaching lapse of the contracts of the Maritime Canal Company with those States, I have not hesitated to express my conviction that considerations of expedi ency and international policy as between the several Governments Interested in the construction and control of an interoceanic canal by this route require tbe maintenance of the status quo until the Canal C ommls sion shall have reported and the United States Congress shall have had the oppor tunity to pass financially upon tbe whole matter daring the present session without prejudice by reason of any change in the .existing condifious. Nevertheless, it appears that tbe Gov ernment of Nicaragua, as one ot its last sovereign sets before merging Its powers In those Of the newly formed Cqlted States ot Central America, has granted an optional concession to another association, to be come effective on the expiration of the present grant. It, does not appear what .surveys have been made or what route is proposed under tjtts contingent grant so that an examination of the feasibility of its plans is necessarily not embraced in the report of the Canal-Commission. AU these elreumstanaessuggest tbe urgency of some fltflaltT mtfw -C 9 PgcflJ at. thia"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "proto col, I appointed <mark>William</mark> B. Day, lately Secretary"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "proto col, I appointed <mark>William</mark> B. Day, lately Secretary"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
