{"document": {"bbox": [249.07, 447.91, 413.06, 1223.26], "bbox_id": "1024d6fe6d", "file": "AppomattoxNewspapers_1902-1905a_0197.pdf", "page": 1, "text": "TH E COUNTY CLERKSHIP. A right pretty political fight is to take place in this county for the clerkship, which is the best-paid office within the gift of our jieople The present clerk holds od for two more years, and then the will be made for an eight-year term Dr. D. Mott Robertson, late county- treasurer, who resigned that office last summer, has announced to sono of his friends that he will stand fo the Democratic nomination for tb clerkship, and that he will, if elect ed, run the office for the fees alone This would be a saving to the tax payers of nearly 600 per annum, or nearly 5,000 for thè term. The election is some distance be fore us, and it is not our purpose to stir up the candidates or the people upon the subject thus early  but we shall fill the field of a newspaper and keep our readers informsd of events as they occur. Among tbi possible candidates we feel warrant ed in mentioning our present sheriff. Mr. S. P. Coleman, who would be u formidable opponent for any aspir ant H. Winston McKinney, the ef ficient deputy clerk, who is perhapi more familiar with the duties of the office, and better qualified for theii discharge, than any other available man. Should he enter the race, he would undoubtedly have the warm support of Mr. George T. Peers, the present clerk  and Mr. Peers would, no doubt, remain in the office for a time to aid him in his work. Mr. J Rolfe Horsley, whom Mr. Peers de feated for the office in 1899, is also likely to be a candidate. Mr. Hors ley last Week resigned the position of private secretary to Congressman Flood, which oarried a salary of 1, 200 per annum paid by Congress and assumed the management of the Southside Virginian. The resigna tion of Mr. Horsley probably caused Dr. Robertsons early announcement of his candidacy. We are satisfied that there will be other candidates. The people are being quietly sounded as to thiB and that man, bat the great majority of them will hardly bind themselves to any one at this stage of the game- none, perhaps, except a few whc be lieve that they ought to be allowed  to shape all the public policies of the connty, and to name all of the officeholders years in advance of the election. We respectfully dissent, and Bhall await developments before we bind ourselves to the tail of any"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "warm support of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, the present clerk  and"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "warm support of Mr. <mark>George</mark> <mark>T</mark>. <mark>Peers</mark>, the present clerk  and"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["George", "T", "Peers"], "snippet": "served until I860, when <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> became clerk. At this"}}, "highlights": [{"field": "text", "matched_tokens": ["George", "T", "Peers"], "snippet": "served until I860, when <mark>George</mark> <mark>T</mark>. <mark>Peers</mark> became clerk. At this"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Peers", "T", "Sheriff"], "snippet": "were named. Geo. T. <mark>Peers</mark> became Clerk Wm. <mark>T</mark>. Johnson <mark>Sheriff</mark> W. J. Collins, Commissioner"}}, "highlights": [{"field": "text", "matched_tokens": ["Peers", "T", "Sheriff"], "snippet": "were named. Geo. T. <mark>Peers</mark> became Clerk Wm. <mark>T</mark>. Johnson <mark>Sheriff</mark> W. J. Collins, Commissioner"}], "text_match": 2312642367376588921, "text_match_info": {"best_field_score": "3319999102976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367376588921", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [770.65, 243.83, 919.51, 772.91], "bbox_id": "84df881017", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "Stuart Farrar, of Pamplin, happened upon a shelf of Lyn chburg directories among the records in the court house, Ly nchburg. In the oldest directory there, 1887-1888 he found sev eral pages of interesting in formation about this county back when  Rose Bower ,  Neb raska ,  Reedy Springs etc. were post office locations.  Ne-  braska , of course was the pre sent county seat,the Town of Appomattox. Population in 1887 was 10,080 with 5,153 white and 4,927 colored. County seat was  listed as Appomattox CH the  old village, now Appom attox j Court House National Historical j Park with a population of 100.  Average assessed value of j lands in 1887-1888 was 4.13 j per acre. The Circuit Court of I the Fifth Circuit met on the 15th  of March and 15th of Sept, with  Judge John D. Horsley and Geo rge T. Peers as clerk. Henry T. Parish was county judge and Mr. Peers serving as clerk and County Court met at the Court House Thursday after the 1st Monday in each month. County officers 84 years ago were T. B. Bryant, sheriff A.S. j Swan, surveyor, J . R. Franklin, Treasurer George W. Abbitt, commissioner of the revenue and W. C. Franklin, common wealths attorney. The supervisor board, then as now, was composed of three representatives, one from each district Wm. White was chair man together with D. H. Mar shall and H. E . Gilliam. County magistrates were A. Womack, C . H. Gilliam, Pam plin City Ja s. A. Walker, Tower Hill N. W. Owen, Oakville C. W. Cardwell, Spout Spring C.B ."}, "highlight": {"text": {"matched_tokens": ["T", "Peers", "T"], "snippet": "Horsley and Geo rge <mark>T</mark>. <mark>Peers</mark> as clerk. Henry <mark>T</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Peers", "T"], "snippet": "Horsley and Geo rge <mark>T</mark>. <mark>Peers</mark> as clerk. Henry <mark>T</mark>."}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
