{"document": {"bbox": [2135.47, 657.31, 2288.2, 852.56], "bbox_id": "0d66afc189", "file": "AppomattoxNewspapers_1962-1965a_0569.pdf", "page": 1, "text": "shot and killed Monday after noon, Dec. 28, as he and another youth played with a shotgun dur ing a hunting trip near Promise Land about seven miles south of here. Dead is H enry Lee Baker, 13, Negro, shot by a 16 guge shell loaded into a 12 gauge shotgun while playing inside an auto with James Connell Scott, also a 13- year-old N egro. Appomattox County Sheriff L. Stanley said Baker was killed I at 445 p .m . as the two youths played inside the car after tiring of a hunting trip they had join ed with th re e adults. All were neighbors fro m Concord. Sheriff Stanley said they were pitching a dead quail up and"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "Stanley"], "snippet": "N egro. Appomattox County <mark>Sheriff</mark> <mark>L</mark>. <mark>Stanley</mark> said Baker was killed"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "Stanley"], "snippet": "N egro. Appomattox County <mark>Sheriff</mark> <mark>L</mark>. <mark>Stanley</mark> said Baker was killed"}], "text_match": 2314894167727145081, "text_match_info": {"best_field_score": "4419510992896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167727145081", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1904.62, 452.59, 2051.0, 732.79], "bbox_id": "98842bcf0f", "file": "AppomattoxNewspapers_1962-1965a_0383.pdf", "page": 1, "text": "Two youths who escaped Sun day afternoon from Appomattox County Jail under the pretext of washing the jail windows were  taken into custody early Mon- day, Sheriff L. L. Stanley re- j ported. j The boys, age 18 and 15, from Lynchburg Training School and Hospital, had recently been con !victed of breaking and entering I and each sentenced to five years the sheriff said. A woman employed as a baby sitter for Jailer H. A. White, who lives with his family at the jail, was working Sunday dur ing the absence of the jailer and his wife. Sheriff Stanley said the youths told the woman they were sup posed to wash windows but had nothing to do it with. When the woman brought cleaning items, the boys dashed by her and es caped, Stanley said. The two escapees were picked up early Monday on a second ary road. They had traveled only about three miles from jail."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "custody early Mon- day, <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley re- j ported. j"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "custody early Mon- day, <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley re- j ported. j"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1624.07, 1104.2, 1764.73, 1310.95], "bbox_id": "cfaec24c62", "file": "AppomattoxNewspapers_1962-1965a_0329.pdf", "page": 1, "text": "Three young men and a girl, escapees from the Lynchburg Training School, were appre hended near Pamplin about 10 a.m. Tuesday morning by the Appomattox County Sheriffs De partment and State Police. Sheriff L. L. Stanley reported that at least 157 worth of mer chandise had been stolen from the Howard Williams store in Pamplin early Tuesday morning. Almost all of this, plus about 22 in change was recovered from the young escapees. They were turned over to Training School authorities. The stolen merchandise includ ed guns, boxes of ammunition, pocket knives, flashlights, a tran sistor radio and food and cloth ing."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "partment and State Police. <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley reported that at least"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "partment and State Police. <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley reported that at least"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2163.37, 1370.61, 2738.38, 1772.76], "bbox_id": "b77ab96588", "file": "AppomattoxNewspapers_1962-1965a_0604.pdf", "page": 1, "text": "Thirty - two îtiembênu of thé Robert E. Lee Chapter b t Futtiré Farmers of Amerloft iéére ad vanced to the degree of Chapter Farmer In an initiation cere mony conducted by chapter offi cers at a regular meeting of the group on Thursday. Tbe chapter Farmer degree is thehighest de gree that a local FFA chapter may confer upon g mmbe.  In presenting tfié-wvef which is emblemattcr ofthe de gree, President Eugene Shirty stated, . Your parental ypttr school, and this your chapter shall expect more of you then we did as green hands. He stressed the need on the,pert of the new degree members, o Join together in advancing the ob jectives of the FFA and agricul ture. Together we shall achieve great things, was the .challenge given to the candidates by Dwight Paulette, reporter of the chapter.  Members receiving the Chip- ter Farmer degree were. Jante8 Burcher, Roy Cheatham, Mick Coleman, Marshall Doss, Alvin Evans, Donald Ferguson, Billy Franklin, Edward. FultJJer, Jphn Giles, Melvin Garnett, Rât Hail. William Hawkins, Ronud Harris Larry Johnson, Anthony Lucado, Alfred Marsh, William Mayberry Calvin OBrien, David Page, Belle Williams  Still l i f e   A Pitsenbergcr, Health Depart-1 well, Jr. announce tire birth of a j David Reeve, Mike Seay. Rodger Rodrick I Slagle. Mike Wallace, Joel W u. Roger Nor- ! ment Mr. Earl Smith, Superin R .. .... _ i tendent of County Schools Mr - Kca, uu u L. Stanley, County Sheriff Mrs. Roy Moon Landscape w W"}, "highlight": {"text": {"matched_tokens": ["L", "Stanley", "Sheriff"], "snippet": "Mr - Kca, uu u <mark>L</mark>. <mark>Stanley</mark>, County <mark>Sheriff</mark> Mrs. Roy Moon Landscape"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley", "Sheriff"], "snippet": "Mr - Kca, uu u <mark>L</mark>. <mark>Stanley</mark>, County <mark>Sheriff</mark> Mrs. Roy Moon Landscape"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1994.17, 1366.73, 2289.57, 1551.68], "bbox_id": "848022332c", "file": "AppomattoxNewspapers_1962-1965a_0600.pdf", "page": 1, "text": "the grades. Heavy leaf advanced tion of the arm. chiefly 1 and 12 per hundred Simpson said Hall would be pounds, thin leaf and lugs 2 to charged with reckless driving, 4 and nondescript 4 to 9. On j following too closely in a line of the other hand, several good to 1 traffic.  choice grades of heavy and thin Sheriff L. L . Stanley said Mon-, eaf and wrappers, which were  day that all the hogs except more plentiful than during la st! three were recovered. Approxi- j season, declined from 1 to 9.  mately 14 hogs died as a result Auction bid averages exceeded j  of the accident. They were given their respective support rates by away in the community said the mainly 4 to 8 per hundred, sheriff. j Auctions began December 1 Roger Dale Franklin, 22, of and ended February 11 after 29 Appomattox, driver of a car in- j saies days _ two more than dur-! volved, sustained a neck injury, ing 1963 . 64 . The three markets ! and a passenger in the car, Dav- dosed after sales December 17 j id Omar Austin, 27, of Appomat- jn observance of Christmas holi- i tox, suffered a back injury. Both days and reopened January 11.! were believed not seriously in- A marketing quota of 11,240,0001"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "of heavy and thin <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark> . Stanley said Mon-, eaf and"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "of heavy and thin <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark> . Stanley said Mon-, eaf and"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2390.81, 505.22, 2546.66, 1437.14], "bbox_id": "1a624f85a5", "file": "AppomattoxNewspapers_1971-1973a_0095.pdf", "page": 1, "text": "Spirited campaigning by the candidates for the office of State Senator, 18th Senatorial Dis trict plus a local contest for the office of Appomattox County treasurer brought out a sizeable number of voters in Tuesdays state-wide election for the of fices of senators and represen tatives in the Va. General As sembly and c o u n t y o f f i c e s throughout the Commonwealth. In the only local contest it was a race between incumbent coun ty treasurer John Garland Plun kett and Mrs. Ida Belle Camp bell, deputy commis s i o n e r of revenue, seeking public office for the first time. With all percints reporting winner was Mrs. Id a B e l l e Campbell with an u n o f f i c i a l count of 2006 votes as compared with 1728 votes for John G. Plunkett. The new Lieutenant Governor of Virginia is Henry E.Howell, Jr., with an unofficial vote tabu lation showing a total of 1168 county votes. He defeated two other candi dates, George J.Kostel, of Clif ton Forge and George P. Sha- fran, of Northern Virginia. Winner of the Senatorial con test for the 18th Senatorial Dis trict is Howard P. Anderson of Halifax. In Appomattox county he received 2379 votes. Losing candidate is Bert F. Dndson T uchburg with 1198 vdtkA County offices filled by the voters included that of the Trea surer also, the office of Com monwealths Attorney with in cumbent Harry Gordon Lawson unopposed, receiving a vote of confidence, 2826 votes. Incumbent Commissioner of the Revenue John Curtis Cald well, also unopposed, was re turned to office with a vote of 2910. Claude Anderson, unopposed candidate for the Representa tive to the House of Delegates received 2563 votes. Also unopposed was James Eugene Richardson, sheriff of Appomattox county, r u n n i n g for the office for the first time. Sheriff Richardson was sworn in as acting sheriff following the retirement of incumbent Sheriff L. L. Stanley in July. He received 3035 votes. There was also no opposi tion for the offices of the three members of the Appomattox County Board of Supervisors. Incumbent John C. Cole, of Appomattox, Southside District was returned to office with a vote of 1219. Incumbent O. Hun ter ToUey, of Pamplin, repre senting Cloverhill District, was returned to office with a vote of 927. Incumbent Otho W. Mar tin, Jr. of Oakville, represent ing Stonewall District, was re turned of office with a vote of 960. For Justice of the Peace, Southside District, Mrs. Ger- aline R. Mitchell, incumbent, was returned to office with a _____________ Cont on page 2B"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "the retirement of incumbent <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley in July. He received"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "the retirement of incumbent <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley in July. He received"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2409.88, 669.05, 2563.91, 1405.74], "bbox_id": "677de35187", "file": "AppomattoxNewspapers_1971-1973a_0086.pdf", "page": 1, "text": "Polls will be open from six a.m. to seven p.m. Appearing on one ballot are the candidates for the State Sen ate Eighteenth Senatorial Dis trict B. F.  Bert Dodson, of Lynchburg and Howard P. And erson, of Halifax. For the House of Delegates, Twenty - Seventh Legislative District there is one candidate incumbent Claude W. Anderson. County offices to be fiUed on Tuesday include the office of Commonwealths Attorney with incumbent Harry Gordon Law- son the only candidate. There are two candidates for treasurer incumbent John Gar land Plunkett and Mrs. Ida Belle Campbell, deputy Commission er of Revenue, seeking the office for the first time. Incumbent Commissioner of the Revenue John Curtis Cald well is unopposed. Also unop- posed jg. Jarnes Eugene Rich ardson, sworn in as sheriff upon the retirement in July of Sheriff L. L. Stanley. Each voter, if he has not al ready done so in a previous election, is asked to bring with him or her on a separate sheet of paper his social security number. This is a Virginia statute, according to Murrell Ferguson, s e e r e t a r y of the Electoral Bord. During last Novembers elec tion there was considerable de lay for some voters in the re cording of Social Security num bers. Social Security numbers are NOT part of the election, but merely a prelude to a state wide computer system for the registration of voters. A separate ballot will be is sued listing nominees for the board of supervisors. There is no opposition in any of the sup ervisors races. Also on this ballot, the nominees f r o m Southside and Clover Hill Dis trict for justices of the peace, both of these without opposit ion. .V Nominees for supervisor, Southside District, John C. Cole of Appomattox. Cloverhili Dis trict, O. Hunter Tolley, of Pam- plin. Stonewall District, Otho W. Martin, Jr. of Oakville, all are incumbents. For Justice of the Peace, Southside District, Mrs. Ger aldine R. Mitchell, incumbent. Contd on Page SB"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "retirement in July of <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley. Each voter, if he"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "retirement in July of <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley. Each voter, if he"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2351.3, 945.32, 2495.65, 1283.86], "bbox_id": "acd93f5ea5", "file": "AppomattoxNewspapers_1962-1965a_0426.pdf", "page": 1, "text": "now in the budget for purchase of new heating equipment. The supervise said that a repairman had repotted that the present coal funner could no longer be patched up.  Any change W tilt Want wiU require a fin marshalls in spectlon, said supervisor. Cole possibly the construction of a separate building.  Store Sale Helps County Sheriff L. L. Stanley said that purchases of canned food from the J. T. Almond store, going out of business, wlU save mon ey for the county. He said that quantities of goods purchased there were bought at less than wholesale price. The front of the Court House was discussed. The Board agreed that the American Legion should be consulted about the list at veterans painted on a large pla que at the entrance. They said that years of weathering had al most obliterated many of the names. The Board, currently consider ing approval of a Subdivision Ordinance which involves two miles of county territory in f mediately adjoining the Town at Appomattox, said they consider the ordinance a good thing."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "Store Sale Helps County <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley said that purchases of"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "Store Sale Helps County <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley said that purchases of"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.75, 553.26, 1855.7, 717.6], "bbox_id": "057281485a", "file": "TimesVirginian_1980a_0074.pdf", "page": 1, "text": "lié may look just a little older, but J. E. Gene Richar dson. Appomattox County Sheriff, celebrated his 10th bir thday Friday. Feb. 29. Being born on Feb. 29, Gene has a birthday only once every four years and he told the Times-Virginian Tuesday that he really felt only 10 years old. Richardson was employed with the Appomattox Sheriffs Department as a deputy under the late Sheriff L. L. Stanley for seven years. Since 1971 he has served the county as sheriff.  Even though he has had only 10 birthdays, he is the father of a four-week old soh and four other children, ages seven to 19. Gene and his wife. Carolyn, planned a celebration for Saturday evening but for some reason it had to be can celled - could have been the-snow storm."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "deputy under the late <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley for seven years. Since"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "deputy under the late <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley for seven years. Since"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1312.52, 542.98, 2014.82, 902.92], "bbox_id": "e821675839", "file": "TimesVirginian_1983a_0151.pdf", "page": 1, "text": "Janies Eugene Gene Richard- son. Sheriff of Appomattox County, announced Uia. week that he is a candidate for reelection to the office of sheriff in the general election to he held in November. After being employed with the Appomattox Sheriffs Department as a deputy under former Sheriff L .L . Stanley for seven years, he was appointed in July 1971, to serve out the unexpired term of Sheriff Stanley. He was then elected to the office of sheriff in November, 1971, taking office in January, 1972. Richardson was reelected to his second term as sheriff in November, 1975 and his third term in November, 1979. During his years as Sheriff, Richardson has completed many classes ia law enforcement proce dures pertaining to narcotics, drug use and abuse, criminal invest iga- tions .and civil work. He has eumfjleted many sem inars and ciiursfjh on working with alcoholics dnd drug abusers, first aid to the Webb appointed to town council"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "a deputy under former <mark>Sheriff</mark> <mark>L</mark> .<mark>L</mark> . Stanley for seven years, he"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "a deputy under former <mark>Sheriff</mark> <mark>L</mark> .<mark>L</mark> . Stanley for seven years, he"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.37, 735.24, 1909.55, 1095.13], "bbox_id": "6e8d23256c", "file": "AppomattoxNewspapers_1962-1965a_0445.pdf", "page": 1, "text": "Five Appomattox county white men have been charged in con nection with the throwing of an incendiary device into the home of Edward Thomas Johnson, as sistant principal of Carver Price High School. Sheriff L. L. Stanley said the incident occurred at Johnsons home about 230 a.m. Sunday. Johnsons wife was in the bath room when the incendiary came through the window, but she was not injured, said the sheriff, who reported that the screen had been cut. He said no clear-cut explana tion had emerged from his in vestigations, but he said the al leged participants are believed to have been drinking late Sat urday and early Sunday. Charged with a felony, malic ious destruction by using an ex plosive device or substance were Emory Woods, 26, and James Wirt Doss. 25, both of Ap pomattox. Three men charged with- aiding and Abetting in the Incident were Ronald Guill, 23 warren Eugene Guill, 26, and James Percy Ayers, 18, all of Appomattox. Doss was released under 5,000 bond until a preliminary hear ing July 29 in Appomattox Coun ty Court. Woods, Ayers and both Guills have been released on"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "Carver Price High School. <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley said the incident occurred"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "Carver Price High School. <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley said the incident occurred"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1358.12, 1108.42, 1472.22, 1252.31], "bbox_id": "4407ce6df5", "file": "AppomattoxNewspapers_1962-1965a_0328.pdf", "page": 1, "text": "AnnomaVox Conntv Health tments Dog clinic held ay at ApDomattox record- dogs receiving anti-rabies e, a record number ac- g to G. A. Pitsenberger, rian, Sheriff L. L. Stanley eputy Sheriff J. E. Rich- helped direct the heavy f traffic to the Court House, t everyone was dressed y for the outdoor clinic, ing Pitsenberger, who wore eepskin lined flying suit as tion against the snowy"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L", "Sheriff"], "snippet": "G. A. Pitsenberger, rian, <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley eputy <mark>Sheriff</mark> J. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L", "Sheriff"], "snippet": "G. A. Pitsenberger, rian, <mark>Sheriff</mark> <mark>L</mark>. <mark>L</mark>. Stanley eputy <mark>Sheriff</mark> J. E."}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [843.45, 741.23, 986.09, 1087.67], "bbox_id": "285bd0a474", "file": "AppomattoxNewspapers_1962-1965a_0268.pdf", "page": 1, "text": "To the Voters of Appomattox County Ladies and Gentlemen Tuesday, November 5, 1963 will be Election Day. This is the day we vote for the elected Demo cratic Nominees of the July Pri mary If you have been voting by ab sentee or mail ballot and expect to be away on that day, and want to vote, which I hope you will, and I humbly ask you to do. Please let me know, or the f o l l o w i n g know, promptly George F. Abbitt, Jr., Common wealth Attorney Watkins M. Abbitt, Congressman John C. Caldwell, Commissioner of Reve nue, John G. Plunkett, Treasur er L. L. Stanley, nominee for Sheriff C. W. Smith, Clerk John C. Cole, Nominee for South- side District Supervisor Otha W. Martin, Jr., Supervisor for Stonewall District Richard M. Webb, Supervisor, Clover Hill District, or D. A. Conner. Go in person if you can. Carry the members of your family who vote, and ask your friends and neighbors to go out and vote Tuesday, Nov. 5, General Elec tion Day. Thanks, Charles T. Moses"}, "highlight": {"text": {"matched_tokens": ["L", "Stanley", "Sheriff"], "snippet": "Plunkett, Treasur er L. <mark>L</mark>. <mark>Stanley</mark>, nominee for <mark>Sheriff</mark> C. W. Smith, Clerk"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley", "Sheriff"], "snippet": "Plunkett, Treasur er L. <mark>L</mark>. <mark>Stanley</mark>, nominee for <mark>Sheriff</mark> C. W. Smith, Clerk"}], "text_match": 2314894167458709625, "text_match_info": {"best_field_score": "4419510861824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167458709625", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1779.12, 919.38, 1921.21, 1089.43], "bbox_id": "81eef2d3ef", "file": "AppomattoxNewspapers_1962-1965a_0269.pdf", "page": 1, "text": "Theres no apparent opposition to Tuesdays élection for county and state offices. July 9ths Democratic primary placed the following names oh the ballot. For State Senator Charles T. Moses For the House of Dele gates Dr. W. A. Pennington, of Buckingham. Commonwealth At torney George- F. Abbitt, Jr. Treasurer, J. Garland Punkett Supervisor, Southside District, John C. Cole Clover Hill Dis trict, Richard Mead Webb Stone wall, Otho W. Martin. Sheriff Sgt. Leslie L. Stanley Commis sioner of Revenue, John C. Cald well."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "Stanley"], "snippet": "wall, Otho W. Martin. <mark>Sheriff</mark> Sgt. Leslie <mark>L</mark>. <mark>Stanley</mark> Commis sioner of Revenue,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "Stanley"], "snippet": "wall, Otho W. Martin. <mark>Sheriff</mark> Sgt. Leslie <mark>L</mark>. <mark>Stanley</mark> Commis sioner of Revenue,"}], "text_match": 2314894167458709625, "text_match_info": {"best_field_score": "4419510861824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167458709625", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2351.01, 524.79, 2496.43, 874.02], "bbox_id": "4cbc92f43a", "file": "AppomattoxNewspapers_1962-1965a_0274.pdf", "page": 1, "text": "1,336 voters from showing up at the countys ten polling locations. A total of 2,737 voters cast bal lots In toe primary. Unofficial returns Tuesd a y night gave 1,252 votes to Senator Charles T. Moses, Sr. 1,072 to Dr. W. A. Pennington, Stale house delegate from Bucking ham. Incumbent Commonwealth Attorney George F. Abbitt re ceived 1,262 and Commissioner of Revenue John C. Caldwell, 1,254. L. L. Stanley, running for sheriff, received 1,252. Incum bent J Garland Plunkett receiv ed 1,241. John C. Cole, running for Soutoside supervisor to re place retiring Fltz L. Murphy, received 631. Incumbent Stone wall District supervisor Otoo W. Martin received 345, and Incum bent Clover Hill supervisor Rich ard M. Webb received 313. - Two justices of the peace were elected from the Soutoside Dis trict Geraldine Mitchell, 449 votes and E.T. Guill, 577. Frfin the Clover Hill District, James .Wilson Franklin, 241, and wqjcm Kanipe, 179. World Traveler  To Speak Sunday"}, "highlight": {"text": {"matched_tokens": ["L", "Stanley", "sheriff"], "snippet": "C. Caldwell, 1,254. L. <mark>L</mark>. <mark>Stanley</mark>, running for <mark>sheriff</mark>, received 1,252. Incum bent"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley", "sheriff"], "snippet": "C. Caldwell, 1,254. L. <mark>L</mark>. <mark>Stanley</mark>, running for <mark>sheriff</mark>, received 1,252. Incum bent"}], "text_match": 2314894167458709625, "text_match_info": {"best_field_score": "4419510861824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167458709625", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [714.69, 295.15, 859.67, 944.49], "bbox_id": "b19bbfea0b", "file": "AppomattoxNewspapers_1962-1965a_0447.pdf", "page": 1, "text": "Mr. and Mrs. Alfred Ray Gor don and son, Michael Alan, of Los Angeles, Calif., arrived last week to visit their parents, Mr. and Mrs. J. L. Gordon, Sr. and Sheriff and Mrs. L. L. Stanley. Mr. Gordon left Wednesday for Langley Field, where they will make their home. Mrs. Stanley and son remained for a longer visit.  9 9 Miss Gray Holland, who enter ed the Lynchburg General Hos pital last Thursday, returned1 home Sunday.  9 9 Cameron Seay, of Richmond, visited Mr. and Mrs. C. W. Smith Tuesday.   Paul Cawthome, who is a pat ient in the Virginia Baptist Hos pital is reported to be improv ing.  9 9 Mrs. Joel W. Flood spent last night in Richmond with her sis ter, Mrs. Cameron Seay.  9 9 David Randolph Caldwell, Jr., who underwent surgery at the Virginia Baptist Hospital, Tues day, Is expected to return home this week end.   9 Misses Sandra Caldwell, Mary Bruce Chandler and Joann Ohl- sen are attending camp at Mass- ametta this week.  9 4 Ann and Charles Purcell, of grandparents, Mr. and Mrs. C. S. Booth.    Friends are sorry to hear of the illness of S. C. Ranson. 9 9 9 Mrs. Flossie Erwin, of Hix- burg, is a patient in the Langley Field Air Force Base Hospital, near Norfolk. While there for a check up she will visit with her son, Lt. Col W. M. Erwin, Jr.  9  Professor and Mrs. E. E. Trent and daughters, Carol and Terry Ann, of Kilmonock will spend this week end with his mother, Mrs. D. G. Trent, of Appomattox.  9 Mr. and Mrs. Lawrence Weath- erhaltz and boys, Mrs. Doris Baldwin, of Carey, Ohio, was callers in the home of Mr. and Mrs. Fred Grishaw last week. Mr. and Mrs. David Smith and daughter were callers in this home Sunday night."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "L", "L"], "snippet": "L. Gordon, Sr. and <mark>Sheriff</mark> and Mrs. <mark>L</mark>. <mark>L</mark>. Stanley. Mr. Gordon left Wednesday"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "L", "L"], "snippet": "L. Gordon, Sr. and <mark>Sheriff</mark> and Mrs. <mark>L</mark>. <mark>L</mark>. Stanley. Mr. Gordon left Wednesday"}], "text_match": 2314894167324491897, "text_match_info": {"best_field_score": "4419510796288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167324491897", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [586.28, 286.04, 733.85, 636.33], "bbox_id": "1fe344f0a7", "file": "AppomattoxNewspapers_1962-1965a_0492.pdf", "page": 1, "text": "APPOMATTOX  W i l l i a m Harrison Stanley, 85, of Rt. 1, Appomattox, a retired foreman for the Virginia Highway Depart ment, died unexpectedly today at 7 a.m. at his home. Born in Appomattox County, he was the son of William Burl and Anne Viar Stanley. He was a member of Memorial Metho dist Church in Appomattox. He is survived by seven sons, Clarence H. Stanley, of Lynch burg, William B. Stanley of Madison Heights, and L. L. Stan ley, sheriff of Appomattox Coun ty, Samuel L. Stanley, M. A. Stanley, H. B. Stanley and Ed win T. Stanley, all of Appomat tox frur daughters, Mrs. Kelly Knight and Mrs. Curtis J. Page, both of Lynchbu g and Mrs. G. B. Doss and Mrs. Samuel L. Page, both of Appomattox a sister, Mrs. Mary Crooks, of Lynchburg 30 grandchildren and ! 23 great grandchildren. Funeral services were conduct- ! ed at 11 a.m. Monday at Robert- j son Funeral Home by the Rev. Forrest Wagoner with burial in j Liberty Cemetery. Pallbearers I were Bobby Stanley, Clayton Stanley, Clarence S. Stanley, Jr., Edwin T. Stanley, Robert Kelly Knight and Dicky Wright."}, "highlight": {"text": {"matched_tokens": ["sheriff", "L", "Stanley", "Stanley"], "snippet": "L. L. Stan ley, <mark>sheriff</mark> of Appomattox Coun ty, Samuel <mark>L</mark>. <mark>Stanley</mark>, M. A. <mark>Stanley</mark>, H."}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff", "L", "Stanley", "Stanley"], "snippet": "L. L. Stan ley, <mark>sheriff</mark> of Appomattox Coun ty, Samuel <mark>L</mark>. <mark>Stanley</mark>, M. A. <mark>Stanley</mark>, H."}], "text_match": 2314894167056056441, "text_match_info": {"best_field_score": "4419510665216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167056056441", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [657.11, 1193.71, 798.95, 1337.35], "bbox_id": "018b7749ef", "file": "AppomattoxNewspapers_1962-1965a_0198.pdf", "page": 1, "text": "To The Voters of Appomattox, Va. I am 59 years old and under State Police regulations could have worked until January 1, 1964, but chose to retire early to run for sheriff of our county. If eleoted I will draw no re tirement pay from the State Police as long as I serve as an elected officer. Your vote and support will be gratefully appreciated. L. L. Stanley"}, "highlight": {"text": {"matched_tokens": ["L", "Stanley"], "snippet": "be gratefully appreciated. L. <mark>L</mark>. <mark>Stanley</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley"], "snippet": "be gratefully appreciated. L. <mark>L</mark>. <mark>Stanley</mark>"}], "text_match": 2312642368047677561, "text_match_info": {"best_field_score": "3319999430656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642368047677561", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1897.23, 665.89, 2037.85, 804.99], "bbox_id": "d3c8aec3c7", "file": "AppomattoxNewspapers_1962-1965a_0145.pdf", "page": 1, "text": "To The Voters of Appomattox, County. T am 59 years old and under State Police regulations could have worked until January 1, 19- 64, but chose to retire early to run for sheriff of our county. If elected I will draw no re tirement pay from the State Po lice as long as I serve as an elected officer. Your vote and support will be gratefully appreciated. IL. L. Stanley 4-11-1P"}, "highlight": {"text": {"matched_tokens": ["L", "Stanley"], "snippet": "be gratefully appreciated. IL. <mark>L</mark>. <mark>Stanley</mark> 4-11-1P"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley"], "snippet": "be gratefully appreciated. IL. <mark>L</mark>. <mark>Stanley</mark> 4-11-1P"}], "text_match": 2312642368047677561, "text_match_info": {"best_field_score": "3319999430656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642368047677561", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2197.86, 683.77, 2375.49, 1187.95], "bbox_id": "7cacacac04", "file": "AppomattoxNewspapers_1954-1955a_0334.pdf", "page": 1, "text": "There are four contests awaiting the decision of the voters. In Stonewall Magisterial District there is a three-way race for the office of supervisor. Incumbent John P. Alvis, Jr., is being opposed by O. W. Martin, Jr., and Hpbert B. Scruggs. Over 800 votes are expect ed at the three precincts in Stone wall District. Veteran incumbent James H. OBrien is being opposed for nomi nation for another-term as Commis sioner of the Revenue by H. H. Caldwell, Jr. - Incumbent David T. Robertson is being opposed for Sheriff by J. Alex Bingham, a retired State Police Lieutenant. Deputy Treasurer John Garland Plunkett and Thomas Terrill Martin, are vieing for the nomination for County Treasurer. These contests have been the oc casion of active campaigns, both by the contestants and their friends. Many letters have been mailed to the voters and personal appeals have kept all hands on the go fonthe past three months. Predictions as to the outcome de pend on which side you question, but the overa-all conclusion is that there will be a heavy vote and that at least some of the contests will be close. Most contestants are preparing their workers for a major effort on1! election day and will try to see that no eligible voter fails to go to the polls. There are ten voting precincts in Appomattox County. Election offi cials, aeording to a list secured by this newspaper yesterday, will be as follows Court House Precinct Judges J. H. Lucado, L J. Mor ris and J. W. Durrum. Clerks Mrs. L. L. Stanley and Mrs. Lou C. Rog ers."}, "highlight": {"text": {"matched_tokens": ["L", "Stanley"], "snippet": "Durrum. Clerks Mrs. L. <mark>L</mark>. <mark>Stanley</mark> and Mrs. Lou C."}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley"], "snippet": "Durrum. Clerks Mrs. L. <mark>L</mark>. <mark>Stanley</mark> and Mrs. Lou C."}], "text_match": 2312642368047677561, "text_match_info": {"best_field_score": "3319999430656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642368047677561", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2044.29, 946.22, 2186.38, 1192.87], "bbox_id": "696eb16dfa", "file": "AppomattoxNewspapers_1962-1965a_0126.pdf", "page": 1, "text": "Sergeant Leslie L. Stanley, who retired from the State Police force Friday has announced his candidacy for Appomattox Coun ty Sheriff, opposing incumbent Walter Conner in the July 9 Democratic primary. Under Stjte Bailee regulations personnel with a! least ZS Sfears creditable service are retired at age 60. Under this regulation Stanley could have worked until Jan. 1, 1964 but chose to retire early In order to be able to run for sheriff this year. He was born Dec. 11, 1903 at Hebron Church in Appomattox County and attended Appomat tox High School. He previously worked for the Norfolk  West ern Railway and the Virginia Supply Co. of Bluenfield, W. Va. before joining the State Police June 18, 1930. Stanley had served all his time in State Police Area 21, of which"}, "highlight": {"text": {"matched_tokens": ["L", "Stanley"], "snippet": "Sergeant Leslie <mark>L</mark>. <mark>Stanley</mark>, who retired from the"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley"], "snippet": "Sergeant Leslie <mark>L</mark>. <mark>Stanley</mark>, who retired from the"}], "text_match": 2312642368047677561, "text_match_info": {"best_field_score": "3319999430656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642368047677561", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1266.53, 709.6, 1481.09, 886.35], "bbox_id": "876b947ad2", "file": "AppomattoxNewspapers_1962-1965a_0177.pdf", "page": 1, "text": "APPOMATTOX  Political activity in A County stepped up Tuesday, with L. L. Stanley that he intentionally made a false statement whs nounced in opposition to Sheriff Walter Conner, The allegation concerns a statement Stanley regards to his being able to draw retirement pay State Police  where he formerly was a sergeant, he serves as sheriff, if elected. When I announced my candidacy for sherif pomattox County, I stated to the voters in all sin I would not be eligible to draw any retiremei elected to th at office. I made this announcement after consulting, superior and after being assured by him that I be eligible to receive my retirement pay while salary from the county as sheriff."}, "highlight": {"text": {"matched_tokens": ["L", "Stanley"], "snippet": "up Tuesday, with L. <mark>L</mark>. <mark>Stanley</mark> that he intentionally made"}}, "highlights": [{"field": "text", "matched_tokens": ["L", "Stanley"], "snippet": "up Tuesday, with L. <mark>L</mark>. <mark>Stanley</mark> that he intentionally made"}], "text_match": 2312642368047677561, "text_match_info": {"best_field_score": "3319999430656", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642368047677561", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [538.54, 263.01, 681.06, 650.75], "bbox_id": "89c09cf252", "file": "AppomattoxNewspapers_1962-1965a_0198.pdf", "page": 1, "text": "Rite Masons. Two Seek Sheriffs Post Incumbent Sheriff Walter S. Conner, appointed to fill the un expired term of David T. Robert son after Robertson was killed in an auto accident in 1960, seeks his first full term as sheriff, hav ing served as deputy sheriff under Robertson. Leslie L. Stan ley, retired State Police serg eant also seeks the post. Conner Conner will be seeking his first full term as sheriff. He was ap pointed by Circuit Court Jud Joel W. Flood to fill the unex pired term of Dave T. Robertson alter Robertson was killed in an auto accident in Dec., 1960. Conn er had been a deputy under Ro bertson since 1950. He is married and has two children, Neal and Gail, who are students at Appo mattox High School. Stanley Stanley, 59, retired recently from Virginia State Police after nearly 33 years service. Stanley is married to the former Vara Smith, of Appomattox. They have two children, Mrs. .psetta Sowers, of Richmond, and. Mrs. Shirley Gordon, of Los Angeles. Commissioner of Revenue Incumbent John C. Caldwell, 59, and Thomas E. OBrian, 24, have announced they will seek the Democratic nomination for commissioner of revenue. Cald well has been commissioner of"}, "highlight": {"text": {"matched_tokens": ["sheriff", "L"], "snippet": "ing served as deputy <mark>sheriff</mark> under Robertson. Leslie <mark>L</mark>. Stan ley, retired State"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff", "L"], "snippet": "ing served as deputy <mark>sheriff</mark> under Robertson. Leslie <mark>L</mark>. Stan ley, retired State"}], "text_match": 2312642367645024377, "text_match_info": {"best_field_score": "3319999234048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367645024377", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1625.49, 1148.36, 1802.63, 1700.88], "bbox_id": "a95daa6179", "file": "AppomattoxNewspapers_1933-1936a_0396.pdf", "page": 1, "text": "then he burst out in a torrent of re- proach. Lish Winslow, what on earth are vou doin? Here Ive been waitin out side in the wind, ketchin my death of cold, an you settin here by the stove rockin an eatln pie! I know, Eleazer, I know, Elisha stammered. It may, mebbe, seem queer to you. I Just hadnt got round to the business In hand, that s alL I m cornin to it in time. Ive made a start. I was just leadin up to It in a sorter tactful way. , There aint no way of beln tactful when youre arrestin folks. Youve got the thing to do an you have to go  straight to it Arresting folks? Marcia repeated, looking from one man to the other. Yes. Since Lish Is so spineless at his job, I mays well tell you w h a t we come for. Pretty kind of a sheriff be Is. _ . You better look out, Eleazer Crock er, how you Insult an officer of the law, Elisha bawled angrily. Say  word more an Ill hall yon into court. If you dont land me there faster n you do Heath I shant worry, Jeered Eleazer. Heath? Mr. Heath? Marcia re peated. Yes. We come over here this morn- in to place Mr. Stanley Heath under arrest, Eleazer announced. The woman caught at the edge of the table. Her mind worked rapidly. She must gain timeworm out of them how much they knew. Of what are you accusing Mr. Heath? she demanded. Of the Long Island robbery, Elea zer answered. You mean to say you think him a thief? We know hes oneleastways Elisha does. Iyes! Im tolable sure. I have evidence, Elisha replied. At least I Agger I have. , Shucks, Lish l Eleazer cried. Wheres your backbone? You figged you have! D o n t you know It? Alnt you beheld the loot with your own eyesY Elisha nodded. Then why on earth don t you stand up In your boots an say so? The door opened and Sylvia entered, . ____ a . _ a n Vi rochftlfl"}, "highlight": {"text": {"matched_tokens": ["sheriff"], "snippet": "Pretty kind of a <mark>sheriff</mark> be Is. _ . You better"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff"], "snippet": "Pretty kind of a <mark>sheriff</mark> be Is. _ . You better"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1759.9, 213.46, 1919.92, 1267.51], "bbox_id": "bcba619ebd", "file": "AppomattoxNewspapers_1908-1909a_0248.pdf", "page": 1, "text": "Several Of our Appomaftn- young people put on a very creditable program at a Rich mond broad-casting station, Wednesday, Those contribu ting to the entertainment were Mrs. Ruth Clement Potts, Misses Catherine Gills, Elean- iarwood, Elizabeth Hancock ind Mr. John Curtis Caldwell. Rev, and Mrs. G. S. Reamey, vho have been visitors in the -ome of C. W. Smith for the ast week, left Tuesday. They vili visit Richmond, Chester nd Wakefield before return- ig to Yalesville, Confi.. Mr. .eamey will attend Yale Uni- ersity for another tenn and is iso pa8t-r of a Methodist hurch in Yalèsvillé ini connec- on with his school work. 4hé tomato cannery has pened here but the crop of latoes is very much dam ged on account of the drought nd hot weather, many crops eing complete failures. Mr. ears says his crop of canning amatoes is late and he hopes ith seasonable weather te ave a fair pack. Miss Ella V. Jones, of Bing- iampton, N. Y., and Lieuten- -nt R. E. Hunter, of Denver, Jot, have been visiting in home  Miss J ones nieee, Mm Jes- ie Harvey. Miss Jpnes has èst returned from a tour a- road where she saw the fam- us passion play for the second ime at Oberammergan. An accident occured here aturady near the residence of Jr. Alex Bingham, The de- ivery truck of L. E. Smith iriven by Eddie Woolridge and  car driven by Carter Martin ollided. The truck received ittle damage from the encount er, hut the other car was com pletely demolished. Mr. Mar in was painfully, but not ser- ously hurt. Several stitches tad to be taken in thè cut on lis tongue. The pthir occu pant of the car, Miss Kate Cole- nan sustained severe injuries, he is now receiving treatment n a Lynchburg hospital. While on the road from Evergreen to Appomattox Tuesday two young men be arne Involved some way with wo daughters of .Mr. Dock Mayberry. jThe young ladies xcited hurried  to Appo mattox and reported that two men had attacked them. Dep ity Sheriff, Connor had no rougle in finding thè men who were also  walking the high way and brought them here nd  lodged- them in jail. On nvestigation the men were re eased as thè charges were jrofidless. Tuesday seven colored sab- ath schools from Lynchburg were picnicing at Gallilee hurch here. About 700 were fi attendance and apparently ì big time was had. One dark- y charged with interfering with officers Hampton Steele ind Lèn Stanley was ftfied, two others were fined for reckless driving and one was charged withcarrying improper license ifi his car. Leonard Thomas was charged with violating the prohibition law, having been aught with two pints of liquor, le will have a hearing before Justice Brown tomorrow. A box containing 9 pints was ound hid in the bushes."}, "highlight": {"text": {"matched_tokens": ["L"], "snippet": "de- ivery truck of <mark>L</mark>. E. Smith iriven by"}}, "highlights": [{"field": "text", "matched_tokens": ["L"], "snippet": "de- ivery truck of <mark>L</mark>. E. Smith iriven by"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["sheriff"], "snippet": "sis- .. According to deputy <mark>sheriff</mark> Dillard W. Shields, the"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff"], "snippet": "sis- .. According to deputy <mark>sheriff</mark> Dillard W. Shields, the"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1344.5, 522.12, 1662.0, 956.9], "bbox_id": "dbf2d42521", "file": "TimesVirginian_1981a_0140.pdf", "page": 1, "text": "ir M U  SHERROD the tournament would be used  The Appomattox Town Coun- to benefit the department, eil Monday night authorized Councilman- agreed to allow Town Manager Bill Britton to u sej of the field during the i W t Whatever action nee- specified period of time, and to I essary to initiate proceedings waivfi the normal fee of 25 per  lor termination of the Areo night for the benefit of the  Cfblevision franchise in Appo- softball tournament. wtx. The councOinen also voted to  Britton informed the Council allow free use of the ball park 1 that Stanley Demiler, owner of this summer for softball I Areo, has not accepted the tournam ent to b en efit, the 1 w ritten notification of the Appomattox Ccounty Cold n towns intent to cancel the , Homes Program. 1 franchise. Its still in the post - M ilton Lam bert, who is 1 office in Pennsylvania, accor- planning the fundraising event. I ding to Britton. appeared before the council to 1  He noted tnat, according td ask permission fot use of the S the cable vision franchise, Deim- facility for the tournament, as R -x-e receive  due well as a music show. Ootification of the town s mtent The council members pointed  lopull the franchise before canc Cut that the music show would I ellation proceedings may begin. have to be cleared through the 1  Coundlmen instructed Brit- county Board of Supervises m ton to take the necessary action since the county has an for notifying Deimler, whether ordinance regulating such 1 that action be having a sheriff functions. Serve the notification papers or Lam bert said he would  using an oilier of publication. appear before the. Supervisors P  In another m atter, the a t their next m eeting to  cound lmen authorized a public request permission to hold the bearing to discuss a request by music show. Carolyn Page to turn the Old The Councilmen also ap- ! Georges Auction BuOding into proved the new town code, with an amusement center. a single amendment, which will I The building, ad Route 460 raise the water-use deposit for j cross from Courtland Manu- renters from 15 to 25. factoring, would under Page!s 1 proposal, house amusements a r .  n , . , , such as pinball m achines, 1 l f l t l O I l B l IS lO O C tllO l computer games, and possibly a- short-order item restaurant. _ _ _"}, "highlight": {"text": {"matched_tokens": ["Stanley"], "snippet": "ball park 1 that <mark>Stanley</mark> Demiler, owner of this"}}, "highlights": [{"field": "text", "matched_tokens": ["Stanley"], "snippet": "ball park 1 that <mark>Stanley</mark> Demiler, owner of this"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2473.84, 522.46, 2622.0, 1176.55], "bbox_id": "945bf30d84", "file": "AppomattoxNewspapers_1962-1965a_0102.pdf", "page": 1, "text": "F. L. Murphy, Chairman of the Board of Supervisors for the past 13 years announced Friday that he will not seek re - election. The other two supervisors, O. W. Martin, Jr. and Richard Webb have stated that they will seek office in the primary this year. I am not going to run due to age and health, Mr. Murphy said. Please thank the people for their support. Chairman Murphy has served continuously as chairman of the three - man board since his first election to office. He serves the Southslde District O. W. Martin, Jr., the Stonewall District and Richard M. Webb, the Clover Hill District. Cole Announces John C. Cole, Dairyman, and resident of the Souttiside District, announced Tuesday that he will file petitions in April and plans to run for the Supervisors posi tion. Filing Date Filing date for office seekers to county posts is April 10. Each candidate for a place on the Democratic primary ballot on July 9, must pay a filing fee to the county Democratic Commit tee and must submit a petition or petitions bearing at least 50 names of qualified voters. Oher Offices Open Every county office Is up be fore the voters except the Clerk of Court who is elected for an eight year term. The present of fice holders, in addition to the supervisors, are Sheriff Walter Conner, Commissioner of Reve nue John Curtis Caldwell, Com monwealth Atorney George Ab- bitt, and County Treasurer Gar land plunkett have indicated that they will run again.  Possible Opposition jjphere are,, strong indications xogt. Ir. h i Stanley -He p Stete Police, may file in April to . run against Sheriff Conner. Sgt. Stanley soon due for retire ment from the State Police force, admitted his interest in the upcoming elections, but stat ed that his present duties as law enforcement officer prevent him from making any announcement at this time. Julian Wingfield, county chair man of the Republican party, stated Saturday that he has no announcement to make immedi ately. He indicated that a county meeting of Republicans would take place in the near future."}, "highlight": {"text": {"matched_tokens": ["Sheriff", "Stanley"], "snippet": "April to . run against <mark>Sheriff</mark> Conner. Sgt. <mark>Stanley</mark> soon due for retire"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "Stanley"], "snippet": "April to . run against <mark>Sheriff</mark> Conner. Sgt. <mark>Stanley</mark> soon due for retire"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.21, 295.43, 1965.73, 1274.75], "bbox_id": "29e9f52fc3", "file": "AppomattoxNewspapers_1933-1936a_0370.pdf", "page": 1, "text": "estate, escaped In his speed boat end here he washere, under this very roof I A robberthat was what he was I A robber bandit, such as one saw in the movies 1 That explained why he was so well- dressed, so handsome, had such fas cinating manners. He was e gentle man burglar. All up-to-date villains In these days were gentlemen. Not that ahe had ever encountered a villain In the fleBh. Still, she had read romances about them and waa there not one In every moving-picture? They were not diffi cult to recognise. It waa exhilaratingwonderful I A thief in the room overhead I Think of it! The very thief for whom all the police In the countryside were search ing ! He was no small, ehesp type of criminal. He did things on a big scale big that radio announcements had been broadcast about him and no doubt at this Instant detectives and crime Inspectors were chasing up and down the highways dashing through eltles and keeping telephone wires hot In wild search for the gentlemen asleep upstairs I Why, that very morning had not EH- aha Winslow, the Wilton sheriff, who had frankly admitted he yearned for excitement, helped undress the wretch and put him comfortably to bed? The humor of the situation almost over came her. It seemed as If she must have some one to share the Joke. But no one ahould. Not Nobody should be the wiser because of her. The poor, hunt ed fellow should have his chance. It was a little venturesome and risky, she admitted, to obstruct Justice and should she be found out she would, without doubt, be clapped Into Jail. Still she resolved to take a chance. After all, who could prove ahe had known Stanley Heath to be what he was? Nobody. She would not even let him suspect lt The Important thing was to await an opportunity and soonbefore he was able to be aboutreturn the hand kerchief she held In her hand to Its place beneath the brick. Then all would be well. This should not be dif ficult It would be quite easy to get Marcia to take up Mr. Heaths supper. In the meantime, the situation was Intensely amusing. Its danger ap pealed to her. She had always en joyed hair-breadth escapades. Any thing but dullness. That had been the trouble with Alton Citylt had been dulldeadly dulL But Wilton waa not dull. In spite of the fact that only this morning Elisha Winslow had complained the town was In need of a stirring up, It seethed with electricity. If she chose, she could hurl a bomb-shell Into Its midst this very minute. But she did not choose. Instead she Intended to play her own quiet game and keep what she knew to herself. She wondered why. Per haps she was falling in love with this adventures. Yes, that must be l t She was In love with himIn love with 1 bandit 1 Sylvias Imagination had traveled so swiftly and so far that lt came to earth with a crash when Marcia opened the door. It was not alone the buffeting of the salt breeze nor the exhilaration of walking against lt that had trans formed her Into something radiantly lovely. From within glowed a strange Are that made her another creature altogether. WhywhyMarcia! breathed Syl via, bewildered. Ive had such a glorious walk, dear! cried Marcia. The fog has lifted and the sky Is s sheet of amethyst and gold. Did the men get the boat off? Yes. She Is floating tranquilly os dove. What Is her name?  My Unknown Lady. Mercy on us 1 That ought to satisfy even Elisha. It did, said Marcia."}, "highlight": {"text": {"matched_tokens": ["sheriff"], "snippet": "aha Winslow, the Wilton <mark>sheriff</mark>, who had frankly admitted"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff"], "snippet": "aha Winslow, the Wilton <mark>sheriff</mark>, who had frankly admitted"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [636.0, 454.47, 939.94, 1111.67], "bbox_id": "d1be1c3f87", "file": "AppomattoxNewspapers_1898-1902a_0647.pdf", "page": 1, "text": "Domestic. The National City Bank of New York paid out 21,500,000 dividends of the Standard Oil and Consolidated Gas Com panies. Mrs. Brooks, in a New York court, testified that Florence Burns said she would shoot Walter Brooks if he did not marry her. The factory owners at Fall River, Mass., have agreed to the 10 per cent, in crease in wages demanded by the strik ers. While speaking to a miners conven tion at Des Moines, Iowa, President John Mitchell was taken suddenly ill. Gen. W . S. Smith states that the steel framework in many of Chicagos sky scrapers is corroding and the buildings may soon become dangerous. A new volcano is reported to have burst forth near Kenal, on Cook In let. Alaska. Notices were posted at the collieries of the Reading Company in the Hazleton district that the present scale would be continued for another year. Edward Butler, a prominent St. Louis politician, was arrested on a bench war rant charging him with offering a bribe. He was released on bail. Henry Clark and Emmet Brown, col ored, were arrested in Alexandria, Va., on suspicion of having murdered Mr. Clayton, of Richmond. Lafe Yerlcey, of Flint, W . Va., be came suddenly insane and buried a hatchet in ins wifes head and then cut his throat. J. Cauffman Stoner, an old-time stage driver, died from a paralytic stroke at his home, near Shippensbttrg. Pa. Mrs. O. L. Benson, of Petersburg. Va., attempted to commit suicide by cutting her own throat with a carving knife. Martin J. Klausdigger had himself shipped from Kansas City to Chicago as a sack of potatoes on a wager. Six deaths occurred on the transport Sheridan, which arrived at San Fran cisco from Manila. Mrs, Alice Stover shot and killed her husband, John T. Stover, in self-defense, in New York. The strike of the weavers has extended to the Anchor Mills, in Pascoag, R. I. Largely through the influence of Gov ernor Crane, the strike leaders in Bos ton have recommended that the men re turn to work, pending results of the Governors efforts to secure concessions from the transportation companies. Major General David S. Stanley, re tired, who fought in many campaigns and was a corps commander during the Civil War, died at the age of 73 years in Washington. Governor Odell, of New York, in structed his appointee. Sheriff Dilke, to use force, if necessary, to evict Guden, who holds on to his office. Arthur Batnhurst. who attempted to shoot Miss Minnie Gohn in York, Pa was arrested on the charge of attempted murder. The transport Sheridan arrived at. San Francisco. Cal., with soldiers from Ma nila, including a number of sick and in-  ______ sane. Seven Mca Injured by an Explosion. I Andrew J. Watrous, a well-known Huntington, W . V a Special. Tom ! newspaper writer, committed suicide, in"}, "highlight": {"text": {"matched_tokens": ["L"], "snippet": "Shippensbttrg. Pa. Mrs. O. <mark>L</mark>. Benson, of Petersburg. Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["L"], "snippet": "Shippensbttrg. Pa. Mrs. O. <mark>L</mark>. Benson, of Petersburg. Va.,"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2332.82, 574.2, 2480.17, 1130.69], "bbox_id": "963d84a357", "file": "AppomattoxNewspapers_1962-1965a_0143.pdf", "page": 1, "text": "A contest In all three magis terial districts of Appomattox County was assured. Friday with the announcement by Hubert B. Scruggs, of Stonewall District, that he will oppose incumbent Qtho W. Martin, Jr., of Oakville. Filing deadline for county can didates was midnight, Wednes day, April iu. In the Cloverhill District, in cumbent Richard Webb is op posed by David R. Wood, and a three - way race is underway in Southside District where John C. Cole dairy products producer, Joe T. Irby, shoe repair store operator, and J. Peyton Harvey, a farmer, have filed for the post left vacant by the retirement at the end of this term of Fitz L. Murphy, present chairman of the Board of Supervisors. Scruggs Files H. B. Scruggs, a native of Ap pomattox, is a livestock buyer for McKenna Meat Products Co., Lynchburg. A cattle raiser and farmer, also. Scruggs is married to the former Myrtle Alma Wright, and they have two daugh ters and two grandchildren. Scruggs is a member of Hebron Baptist Church, Marshall Lodge No. 39 AF  AM, the Wloodmen of the World, and the Scottish Rite Masons. O. W. Martin, Jr., of Oakville is a salesman for a hardware concern. In addition, he oper ates a store at Oakville. The Martins have two children. Other County Contests Incumbent Walter S. Conner and Leslie Lv Stanley will run for county sheriff, subject to the J3fnwppp.iie.- pilntary. Incumbent John C. Caldwell andTttontas E  OBrien will seek the Democra tic nomination for commissioner of revenue. Other incumbents who have announced their candidacies for re - election are commonwealths attorney, George F. Abbitt, Jr., and J. Garland Plunkett, treasur er.  Town Election"}, "highlight": {"text": {"matched_tokens": ["Stanley", "sheriff"], "snippet": "Conner and Leslie Lv <mark>Stanley</mark> will run for county <mark>sheriff</mark>, subject to the J3fnwppp.iie.-"}}, "highlights": [{"field": "text", "matched_tokens": ["Stanley", "sheriff"], "snippet": "Conner and Leslie Lv <mark>Stanley</mark> will run for county <mark>sheriff</mark>, subject to the J3fnwppp.iie.-"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1537.69, 550.92, 1697.04, 707.37], "bbox_id": "480066342f", "file": "AppomattoxNewspapers_1892-1898a_0453.pdf", "page": 1, "text": ". Sheriff Coleman and two sous, J. S. Plunkett, W. A. Moses, P. H. Fore, H. E. Gilliam, R. L. Burke, J. P. L. Fleshman, Phil. Purdum aud family, Rev. S. H. Johnson and fam ily, P. R. Wooldridge and family, Miss Kate OConnor, Master Ray mond and little Willie Stanley, J. R. Atwood and family, attended the fair this week. So did Joel and Clinton Cawthorn together with sev eral young ladies from the Cub creek neighborhood."}, "highlight": {"text": {"matched_tokens": ["Sheriff"], "snippet": "<mark>Sheriff</mark> Coleman and two sous,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff"], "snippet": "<mark>Sheriff</mark> Coleman and two sous,"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1529.75, 1522.97, 1688.75, 1753.43], "bbox_id": "07aa7301de", "file": "AppomattoxNewspapers_1933-1936a_0122.pdf", "page": 1, "text": ", ------ Isnt he the one wio told uff. how much sugar and much flour we could have, back a 1917, 18?    A check shows that there are tome half dozen Roosevelts in Har- rd this fall. That makes America fe for Democracyand Jim Farley Quite some years yet.    Ever notive how sheriff McKinney 1 00 his keys up and down while Rending?    . fat her and Mother Brightleaf can stify t 0 the prowess of R. L. wilu 6 0n tbe golf greens. Playing j t  us Tuesday he sank putts no ss than three times from clear off he green.    Watt Stanley tells that prizes v er.e offered at the tournament on yesterday for evervihinsr in eolf."}, "highlight": {"text": {"matched_tokens": ["sheriff"], "snippet": "yet.    Ever notive how <mark>sheriff</mark> McKinney 1 00 his"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff"], "snippet": "yet.    Ever notive how <mark>sheriff</mark> McKinney 1 00 his"}], "text_match": 2310390568368210041, "text_match_info": {"best_field_score": "2220487868416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568368210041", "tokens_matched": 4, "typo_prefix_score": 0}}
