{"document": {"bbox": [1448.65, 373.96, 1618.4, 780.2], "bbox_id": "f6f45114ff", "file": "AppomattoxNewspapers_1955-1957a_0012.pdf", "page": 1, "text": "misdemeanors and slaves. It fixed the county levy and apportioned the same among white jnales over 21 years of age. The County Court appointed white male property own ers over 21 years of age to open and keep up the roads of their re spective vicinities. The Governor appointed Joel Watkins first sheriff of Appomattox, with Samuel D. McDearmon, Will iam J. McDearmon and William J. Watkins as his deputies. The sheriffs duty not only included law enforce ment, but the collection W taxes, and disbursement of same on order of the justices. Since there were no juries summoned in those days, the sheriff had to go out and find jurors when needed at each term of court. John T. Bocock was first county clerk Thomas iS. Bocock the first commonewalth attorney, and An drew B. Baker the first coroner. Up on the death of John T. Bocock, the first clerk, he was succeeded by his son, Henry F. Bocock, who .served until I860, when George T. Peers became clerk. At this time there were eight post offices in the county and three towns. Bent Creek, formerly called Diuguidville, Pamplin, later called Pamplin City, and Spout Spring. On authority says the name Ap pomattox is from an Indian word meaning tobacoc plant country, another version is that is was nam ed for an Indian tribe. The first census was taken 1850 in"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins", "sheriff"], "snippet": "vicinities. The Governor appointed <mark>Joel</mark> <mark>Watkins</mark> first <mark>sheriff</mark> of Appomattox, with Samuel"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins", "sheriff"], "snippet": "vicinities. The Governor appointed <mark>Joel</mark> <mark>Watkins</mark> first <mark>sheriff</mark> of Appomattox, with Samuel"}], "text_match": 1736172819382796409, "text_match_info": {"best_field_score": "3315704332288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819382796409", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins", "Sheriff"], "snippet": "nominated to the Governor <mark>Joel</mark> <mark>Watkins</mark> for Rriff, and he was ommissioned the first <mark>Sheriff</mark> of Appo- Mttox County,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins", "Sheriff"], "snippet": "nominated to the Governor <mark>Joel</mark> <mark>Watkins</mark> for Rriff, and he was ommissioned the first <mark>Sheriff</mark> of Appo- Mttox County,"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.76, 544.47, 1524.82, 675.78], "bbox_id": "cdc189d018", "file": "AppomattoxNewspapers_1905-1912a_0334.pdf", "page": 1, "text": "TreaaurerR. F . Bnrke, Appon Sheriff F. W. M cKinney, Appoi Deputy Sheriff -H . W. McKln attox. ClerkJ. R. Horaely, Appom attox. Attorney fur Commonwealth 8 . L. Fer m ion, Appomattox. com m iuioner o f R evenueE. B. A bbitt, Appomattox. county SurveyorW, A . Moses, Appo m at- ox. SCHOOL OFFICERS. j. K. H annah, SupL. Appom attox J . c J o n e s , A p p om attox.J. Lee, Appom attox , j. r . Ham ilton, Evergreen Joel Watkins 1 Vera J. F. Dickerson, A ppom attox H . R Pittman, Evergreen C. E. Lewis, Vera J . P Alvls, pout Spring, J. O Davidson, Appo mattox OUXH8IDB DISTRICT,"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "r . Ham ilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> 1 Vera J. F."}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "r . Ham ilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> 1 Vera J. F."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "new countys government were <mark>Joel</mark> <mark>Watkins</mark>, William Math ews, Major"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "new countys government were <mark>Joel</mark> <mark>Watkins</mark>, William Math ews, Major"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [128.4, 271.42, 299.31, 1783.02], "bbox_id": "15c37bb3f8", "file": "AppomattoxNewspapers_1912-1915a_0139.pdf", "page": 1, "text": "F A R M V IL L K . The cold has coma and gone, h frost has bit and quit and there is vide spread difference as to the dam age done the fruit. Your corres pondent has examined two orchards and found peaches, plum, and pears apparently unhnrt, but a veteran orchardist says they w 11 fall before maturing. At least I am hoping he will prove a poor prophet. Ice formed on the morning of the 22od but I am t Id that frcst is more to be feared than ice. The writer witnesed the reoo t ball game between Hampdeu-Si uev and Bandolph-Macon, said to have been a fioe game, while he looked on with comparative indifference for the simple reason be didnt know the rales and failed to catch on to a catch, to recognize a foul, to know short atop from long stop and utter ly unappreciative of a perfect pitch Having been raised onchumneyand cat and bandy theres no wonder that the game is all new to him And what a crowd did witnes this game. Farmville out in full force and fall drees while the surrounding country emptied itself of fair maid ena and manly men. And that so many people should cheerfully pay fifty cents to go on an old field to watch boys at play is wonde-fu again. B-t play ball is the slogan of the hoar while from President Wilson to the small boy of tie streets there is genuine interest in the game. And President Wil-on enjoys advantage over most of ns as he approaches every gate armed with a freo ticket. Those who have shall have more abundantly. Mr. Joel Watkins begins to look like a permanent resideut of Farm ville. Fine fa mer will make a fine inspector and the loss of Appomat tox will be Farmvilles gain  King Adams, the ancient and honorable sheriff of Cumberland has been shaking hands with Farm ville friends and no one is more cor dially received for he makes sunshine wherever he goes. An old soldier was asked in the presence of friend King whether or not h6 would take in the reunion at Gettysburg and said he was too old when the sheriff said, Im too young. May he live long and Im snre he will never resign. The sheriff says that Cumberland is aroused on the sub ject of good roads and is ready to do ner nil part in the work or se curing them. Buckingham ditto, Farmville the same so there canbe no s oh word rs failure. And j m t here let me say that the sand-topped road way has come to stay. Only  few days since I drove over the two miles and three quarters of maca dam road leading out from Farm- ville and that cost about 111,000 and on leaving the macadam at once travelled over the sand-covered road way andbeyond controversy the last named was the better road of the two. Aud in this connection 1 am reminded that Mr. Ben Johns, who went with his motor car to Rich mond to give his father daily out ings, on his return from Richmond for most of the way moved over these sand roads and pronounced them absolutely satisfactory, free from mud, smooth, well drained and just fine. This being so it seems to me that the road problem has been solved for this section of Virginia The sand i - here and when properly applied and then properly drained the al year round good road has been secured. And instead of the macadam coBt, some 14,009 a mile, these roads may be had lor an aver age of 600 a mile. The circuit court for Prince Ed ward is in session as I write and the docket is of unusual interest. And the case now on is that of Miss Thackston vs. Drs. Anderson and Hudgins, the charge being that of malpractice and damages claimed 25,000. Messrs Hester and Jest- if I have the names correct of Lynchburg, represent the plaintiff and Mr. H. W. Anderson, of Rich mond, brother of Dr Anderson leading counsel for the defenee. As in all sneh cases the doctors differ widely and there ie evidence of bad blood. A large crowd attends upon the hearing of the case and intense interest manifested. The jury was eleoted in Cumberland and is made up of a fine body of citizens, mostly  farmers. They are good listeners and may be relied upon to render a just decision. A trained stenogra pher is on haDd and every word of testimony taken down, both sides no doubt preparing for an appeal if beaten in this Court. And then there is a case of slander, damages 1,00, and still another, involvit g rter rights where damages art"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "have more abundantly. Mr. <mark>Joel</mark> <mark>Watkins</mark> begins to look like"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "have more abundantly. Mr. <mark>Joel</mark> <mark>Watkins</mark> begins to look like"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1328.17, 648.77, 1487.42, 771.33], "bbox_id": "fdcd207ca7", "file": "AppomattoxNewspapers_1912-1915a_0426.pdf", "page": 1, "text": "Beputy Sheriff- SiSÊ-J. B- Homely. Appo netto. for CommonwealthB. _ _ m  SmtSaSneiofHevenueB. K. Abbiti, irveyorW. A. Moses, Appo ma t- scHooL ornea kb . u u Featherston, SupL, Vera J. C iooea Appomattox sTa. Lee, Appomattox j A Hamilton. Hvergreen Joel Watkins If h  i . ...... -   n im m a tto x  J . W i,Vera J.F Appo- uttox. gODTHBIDB DIBTBIOT,"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "j A Hamilton. Hvergreen <mark>Joel</mark> <mark>Watkins</mark> If h  i . ...... -   n"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "j A Hamilton. Hvergreen <mark>Joel</mark> <mark>Watkins</mark> If h  i . ...... -   n"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1399.89, 671.65, 1557.22, 836.85], "bbox_id": "0bd3152b64", "file": "AppomattoxNewspapers_1905-1912a_0389.pdf", "page": 1, "text": "APPOMATTOX. urerR. F. Burke, Appomattox. J  F, W. McKinney, Appomattox. -uty Sheriff -H. W. McKinney, Appo- x. rkJ. R. Horsely, Appomattox. Forney for Commonwealth8. L. Fer- n, Appomattox. mmlMioner of RevenueE. R. Abbitt, mattox. nty SurveyorW, A. Motes, Appomat- SCHOOL OSTICBKS. K. Hannah, BupL, Appomattox J. C a, Appomattox S. J. Lee, uppom attox Hamilton, Evergreen Joel Watkins . F. Dickerson, Appomattox U. tt !, Evergreen 0. B. Lewis, Vera J . P , Spout Spring, J, O Davidson, Appo-1 jk. SOUCH81DE DISTRICT, SupervisorJ. R. Atwood, Appomattox. H tstab leR. C, Mann, Appomattox, jtoad CommissionerS. J. Lee, Appomat-"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "uppom attox Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> . F. Dickerson, Appomattox U."}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "uppom attox Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> . F. Dickerson, Appomattox U."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1347.6, 614.55, 1505.52, 788.15], "bbox_id": "68a0a4bb68", "file": "AppomattoxNewspapers_1905-1912a_0346.pdf", "page": 1, "text": "APPOMATTOX. TreasurerR. F. Burke, Appomattox, sheriff F. W. McKinney, Appomattox. Deputy Sheriff -H. w. McKinney, Appo mattox. ClerkJ. R. Horsely. Appomattox. Attorney for CommonwealthS. L. Fer mion. Appomattox. Commtsaioner of RevenueB. K. Abbitt, Appomattox. Cou unty SurveyorW. A. Moses, Appomat- ox. s c h o o l onricE K S . j. k . Hannah, Supt., Appomattox J. C Jones, Appomattox S. J. Lee, Appomattox 1 b THamilton, Evergreen Joel Watkins Vera J. Dickerson, Appomattox H. R am     1 - J . P Appo-J mattox. SOUTHS ID E D ISTR IC T, SupervisorJ. B. Atwood, Appomattox. ConstableB. C. Mann, Appu  Road CommissionerB. J. I dx."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "1 b THamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. Dickerson, Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "1 b THamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. Dickerson, Appomattox"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.26, 616.13, 1525.99, 748.18], "bbox_id": "6f80ed0e03", "file": "AppomattoxNewspapers_1905-1912a_0354.pdf", "page": 1, "text": "APPOMATTOX. TreasurerB. F. Burke, Appomattox. Sheriff F, W. McKinney, Appomattox. Deputy Sheriff -H. W, McKinney, Appo mattox. ClerkJ . R. Horsely, Appomattox. Attorney for CommonwealthS. L. Fer guson, Appomattox. Commissioner of RevenueE. R. A bbitt Appomattox.  1 County SurveyorW, ox, SCHOOL OFFICERS. J. K. H annah, Supt., A ppom attox J . C Jones, Appom attox S, J , Lee, Appomattox J. H. Hamilton, Evergreen Joel Watkins Vera J. F. Dickerson, A ppom attox H. K Pittm an, Evergreen C. E. Lewis, Vera J . P I Aivis, Spout Spring, J. o Davidson, Appo mattox."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "J. H. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. F. Dickerson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "J. H. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. F. Dickerson,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1382.36, 419.92, 1543.7, 553.67], "bbox_id": "0a72d6adb5", "file": "AppomattoxNewspapers_1905-1912a_0322.pdf", "page": 1, "text": "APPOMATTOX. TreasurerB. F. Burke, Appomattox, henff F. W. McKinney, Appo mattox. Deputy Sheriff -H. w. McKinney, Appo mattox. ClerkJ. R. Horsely. Appomattox. Attorney for Commonwealth8. L. Fer guson, Appomattox. Commissioner of Revenue E. R. Abbltt, Appomattox. _ County SurveyorW. A. Moses, Appo mat- ox, SCHOOL OFFICE Its. J. K. Hannah, Snpl. Appomattox J. C Jones, Appomattox S. J. Lee, Appomattox J. B. Hamilton, Evergreen Joel Watkins. Vera J. F. Dickerson, Appomattox H. R. Pittman, Evergreen C. E. Lewis, Vera J. P. Alvts, Spout Spring, J. O Davidson, Appo mattox."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "J. B. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark>. Vera J. F. Dickerson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "J. B. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark>. Vera J. F. Dickerson,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1368.48, 533.66, 1529.1, 739.65], "bbox_id": "f617b5c54d", "file": "AppomattoxNewspapers_1905-1912a_0338.pdf", "page": 1, "text": "APPOMATTOX. TreasurerB. F. Burke, Appoi Sheriff F. W. McKinney, Appomattox. ttox. X nney. Appo-  Deputy Sheriff-H. W. Mcffin mi ttox. ClerkJ. B. Horaely, Appomattox. Attorney for CommonwealthS. L. Fer guson, Appomattox. Commissioner of RevenueE. B. Abbitt, tox. Surveyor-W, A. Moses, Appomat- Appo matto X. County ox. SCHOOL OFFICERS. J. K. Hannah, Supt., Appomattox J. C Jones, Appomattox S. J. Lee, Appomattox J. B. Hamilton, Byergreen Joel Watkins Vera J. F. Dickerson, Appomattox H. K Pittman, Evergreen C. B. Lewis, Vera J . P Aivls, Spout Spring, J. O Davidson, Appo mattox OUTHHDa DISTRICT. SupervisorJ. R. Atwood, Appomattox. ttox. Appo ma t- ConstableR. O. Mann, Ai Boad Commissioners. ox, Jnstieee of the PeaceJ. T. Lee. Appomat tox and W. L. Brown, Bveigreen T. W. Moses, Appomattox Overseer PoorS. G. Harvey, Appomattox, CIOVBR HILL DISTRICT."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "J. B. Hamilton, Byergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. F. Dickerson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "J. B. Hamilton, Byergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. F. Dickerson,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1358.4, 625.47, 1521.59, 757.53], "bbox_id": "1738121ee0", "file": "AppomattoxNewspapers_1905-1912a_0358.pdf", "page": 1, "text": "APPOMATTOX. TreasureR. F. Burke, Appomattox. Sheriff F, W. McKinney, Appom attox. I Deputy Sheriff -H. W. McKinney, Appo-1 mattox. ClerkJ . K. Horsely, Appomattox. I Attorney for Commonwealth 8 . L. Fer- I guson, Appomattox. Commissioner o f RevenueB. R. A bbitt I Appomattox. 1 county SurveyorW, _ ____ _ ox. SCHOOL OFFICERS. J. K. H annah, Supt., Appom attox J. C Jones, Appom attox 8 . J. Lee, Appomattox J. R. Hamilton, Evergreen Joel Watkins Vera J. F . Dickerson, A ppom attox H. it Pittm an, Evergreen C. E. Lewis, Vera J . P Alvis, Spout Spring, J. o Davidson, Appo mattox."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "J. R. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. F . Dickerson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "J. R. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J. F . Dickerson,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.0, 614.6, 1520.13, 748.92], "bbox_id": "d1dcf6c96b", "file": "AppomattoxNewspapers_1905-1912a_0342.pdf", "page": 1, "text": "APPOMATTOX. attox. Treasurer-R. F. Burke, Appon Sheriff F. W. McKinney, Appomattox. Deputy Sheriff -H. W. McKinney. Appo- cierkJ. R. Horsely, Appomattox. Attorney for Commonwealth8. L. Fer guson, Appomattox.  commissioner of Revenue E. R. Abbltt, Appomattox.   - county SurveyorW. A.-Moses, Appomat- ox. SCHOOL OFFICERS. j. K. Hannah, Snpt., Appomattox J . C Jones. Appomattox S. J. Lee, Appomattox j, R. Hamilton, Bvergreen Joel Watkins Vera J- F. Dickerson, Appomattox H. K Pittman, Bvergreen C. B. Lewis, Vera J. P Alvis, Spout Spring, J. U Davidson, Appo mattox."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "j, R. Hamilton, Bvergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J- F. Dickerson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "j, R. Hamilton, Bvergreen <mark>Joel</mark> <mark>Watkins</mark> Vera J- F. Dickerson,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1266.52, 750.95, 1415.24, 911.86], "bbox_id": "f7d93b1a9f", "file": "AppomattoxNewspapers_1905-1912a_0569.pdf", "page": 1, "text": "APPOMATTOX.  TreasurerK. F. Bnrke, Appomattox. heritf F, W. McKinney, Appomattox.  Deputy Sheriff -H. W. McKinney, Appo- attox. ClerkJ. R. Horsely, Appomattox. Attorney fur CommonwealthS. L. Per son, Appomattox. Commissioner of RevenueE. R. A bbitt ppomattox. County SurveyorW, A. Moses, Appoinatr. i, SCHOOL OFFICERS. J. K. Hannah, Supt., Appom attox J. C ues, Appomattox S. J. Lee, A ppom attox R. Hamilton, Evergreen Joel Watkins era J. F. Dickerson, Appom attox H. M iittman, Evergreen C. B. Lewis, Vera J . p Uvls, Spout spring, J. U. Davidson. Appo mattox SOUTHSIDE DISTRICT, SupervisorJ. R. Atwood, Appomattox. ConstableR. C, Mann, Appomattox. I Road Commissioners, j . Lee, Appomat-"}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "attox R. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> era J. F. Dickerson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "attox R. Hamilton, Evergreen <mark>Joel</mark> <mark>Watkins</mark> era J. F. Dickerson,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1333.44, 562.36, 1487.39, 772.75], "bbox_id": "719c1235e8", "file": "AppomattoxNewspapers_1892-1898a_0296.pdf", "page": 1, "text": "Harvey. Dr. C. W. Jones of Roanoke is visiting his parents at their home near here. Sheriff Coleman, went to Lynch burg Tuesday to attend the sale of his tobacco. Messrs. Wm. H. aud Edward W. Forbes, of Milton, Mass., were in town on Monday. Mrs. Joel W. Watkins is visiting her Cousin Mrs. Thos R. Pugh in Charlotte County. Mr. Joseph A. Moses has been ap pointed postmaster at Chap, vice J. T. Moses, resigned."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "town on Monday. Mrs. <mark>Joel</mark> W. <mark>Watkins</mark> is visiting her Cousin"}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "town on Monday. Mrs. <mark>Joel</mark> W. <mark>Watkins</mark> is visiting her Cousin"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Joel", "Watkins"], "snippet": "Jones, R. P. Poore, <mark>Joel</mark> W. Flood, Thos. S. Bocock, James <mark>Watkins</mark>, D. Mott Robertson, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Joel", "Watkins"], "snippet": "Jones, R. P. Poore, <mark>Joel</mark> W. Flood, Thos. S. Bocock, James <mark>Watkins</mark>, D. Mott Robertson, W."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [968.88, 550.01, 1112.31, 717.66], "bbox_id": "6ecf86e4e5", "file": "AppomattoxNewspapers_1962-1965a_0125.pdf", "page": 1, "text": "Three county office candidates made it official Saturday at the conclusion of the county Demon- cratic Committee meeting, J . T.  Irby and J . P . Harvey each filed with the chairman, Watkins Ab- bitt, as candidates for the South- side County Supervisors seat. Walter Conner, incumbent Ap pomattox County sheriff, files his intentions to run, also. Conner will be seeking his first full term as sheriff. He was appointed by Circuit Court Judge Joel W. Flood to fill the unexpired term of Dave T. Robertson, after Ro bertson was killed in an auto ac cident in Dec. 1960."}, "highlight": {"text": {"matched_tokens": ["sheriff", "Joel"], "snippet": "first full term as <mark>sheriff</mark>. He was appointed by Circuit Court Judge <mark>Joel</mark> W. Flood to fill"}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff", "Joel"], "snippet": "first full term as <mark>sheriff</mark>. He was appointed by Circuit Court Judge <mark>Joel</mark> W. Flood to fill"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
