{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["T", "Johnson", "Sheriff", "W"], "snippet": "Peers became Clerk Wm. <mark>T</mark>. <mark>Johnson</mark> <mark>Sheriff</mark> <mark>W</mark>. J. Collins, Commissioner of"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "Johnson", "Sheriff", "W"], "snippet": "Peers became Clerk Wm. <mark>T</mark>. <mark>Johnson</mark> <mark>Sheriff</mark> <mark>W</mark>. J. Collins, Commissioner of"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [695.99, 408.46, 854.49, 859.64], "bbox_id": "f038efea2d", "file": "AppomattoxNewspapers_1898-1902a_0055.pdf", "page": 1, "text": "Buckingham C. H. Sheriff Williams was in town to day  said he bad just returned from a canvassing tour with Judge Quarles they spent a week to gether  he said the Judge was very much pleased with tbe county aud the people. The estate of Air. A. B. Wade, of Alpha, his been put into the hands of the sheriffthe appraisers, Messrs. Isaih England, J. E. West, unci G. P. Agee met Tuesday the 20th of Sept. Aliss Fannie Johnson, daughter of the late W. T. Johnson, of Wealthia, was accidentally shot by her sister. It seems that some gen tlemen were visiting them, they had a pistol which they bad unloaded to examineafter looking at it they reloaded it and laid it on the table, the girl not knowing it, picked it np aud it was discharged and striking the piano the ball rebouuded, pass ing through her sisters leg just above the knee and lodged in the other. The ball had not been ex tracted when last we heard from them. Mrs. A. T. Aloseley has been quite sick for several weeks, but she is much better and we hope on the road to recovery. Mr. S. J. Puryear has left town for Newport News to spend a couple of days. G ipsy ."}, "highlight": {"text": {"matched_tokens": ["W", "T", "Johnson"], "snippet": "daughter of the late <mark>W</mark>. <mark>T</mark>. <mark>Johnson</mark>, of Wealthia, was accidentally"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "T", "Johnson"], "snippet": "daughter of the late <mark>W</mark>. <mark>T</mark>. <mark>Johnson</mark>, of Wealthia, was accidentally"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [811.69, 979.15, 983.23, 1460.54], "bbox_id": "e27c940c22", "file": "AppomattoxNewspapers_1947-1949a_0352.pdf", "page": 1, "text": "VIRGINIA the Circuit County, on ber, 1948. McKinley Johnson vs H. W. McKinney, Sheriff Appomat tox Co.  Admr. of Annie D. John son, decd., Exra Clark, Harold J. Marshall, Ezra E. Marshall, Rosa Bell Lowery, Annie May Marshall, Elizabeth Scruggs, Beulah Gordon, Eldridge N. Joplin and Others, and unknown heirs of Annie D. John son, decd. Defendants. The object of this suit is to settle the estate o T  Annie D. John son, deceased, to clear up all of the liens against certain real es tate at Appomattox, Va., lying on H 111 ___ con taining slightly more than one acre, owned by the plaintiff and the heirs at law of Annie D. Johnson to sell the said real estate for the purpose of paying liens and for partitioning the net proceeds thereof between the parties to this suit as their in terests appear, and for incidental relief. , And it appearing by affidavit fil ed that Ezra Clark, HaroldJ. Mar shall, Ezra E. Marshall, Rosa Belle Lowery, Annie May Marshall, Eliz abeth Scruggs, Beulah Gordon, El dridge N. Joplin, and all of the oth er heirs at law of Annie D. John son, deceased, whose names and residences are unknown, are not residents of Virginia, or are un known, they are hereby required to appear within ten days after the due publication of this order and do what is necessary to protect their interests. Jno. B. Boatwright, p. q. Teste C. W. Smith, Clerk 11-4-4 tc"}, "highlight": {"text": {"matched_tokens": ["Johnson", "W", "Sheriff"], "snippet": "on ber, 1948. McKinley <mark>Johnson</mark> vs H. <mark>W</mark>. McKinney, <mark>Sheriff</mark> Appomat tox Co.  Admr."}}, "highlights": [{"field": "text", "matched_tokens": ["Johnson", "W", "Sheriff"], "snippet": "on ber, 1948. McKinley <mark>Johnson</mark> vs H. <mark>W</mark>. McKinney, <mark>Sheriff</mark> Appomat tox Co.  Admr."}], "text_match": 2312642367510806649, "text_match_info": {"best_field_score": "3319999168512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367510806649", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1400.67, 1148.75, 1553.97, 1808.76], "bbox_id": "52cfa0ce83", "file": "TimesVirginian_1980a_0054.pdf", "page": 1, "text": "time. What you moat? I tppomattox in 1961, and faced Tree Great Depres- skm. But the decade I recall moat was The Roaring Twen ties. Fresh from victory in World War I we wore aglow with wide and power. Wo had Mary Pfekfbr. Douglas Fair banks, Charlie Chaplin and Rudolph Valentino. Bobby Jones, BUI T ildes, Jack Dempsey, Red, Grange and Knots Rockne. Ah yea, Billy Sunday and Cal Coolidge. The Talking Movies. What a Decade. And how waa it in - Appomattox? Our Town was incorporated in 1925, with Barnes W. Cawthrene as first Mayor, followed by W. L. Drown and C. 8. McDearmon. C. W. Smith waa county dark, TL W. McKinney waa Sheriff, J. H. OBrien commissioner of .revenue, D. A. Conner game warden, R. F. Burke and then A I Burke treasurer S. L. Ferguson, H. D. Flood,- Joel W. Flood, prominent attorneys. I soiling local merchants were L. E. Smith, H. M. Burge, A. T. -Inge, J. D. and W. M. Morris, H. C. Pulliam, Will Smith, J. M. Rosser, Mias Emma 8ntith, Mr. and Ifrs. W. R. RaynMda, Chaa. V . James, and we had the leadership of A. R. Harwood, H. C. Babcock, L. M. Wilkes, Don .Moses, Prof. L. Crawley. Do you remember Mias Kate Franklin, Mias M. Anna Jones, C. K. Hunter, Rev. Peter Price, Rev. W. M. Thompson, Alee Ringham. R. W. Wilkins, B. G. Anderson, J. A. Burke, LeRoy  Smith, R. S. Wheeler, Walter -Stott, W. M. Hancock. JJkv D. N. Twyman, Das u . A. Christian, Jr., Baa Caldwell, E. T. Mitchell? JE . Sears. N. R. Featheratqa, nob Craig, Spflier Trent, M. P. Porter, T. W. Mooed, Rev. R. E. Redding. . Miaa Eula Mae Burke, Dr. H. G. AbMtt, Latter B. Harvey, W. T. Nash, A. A. Baldwin, and H. G. Johnson, and ao many fine penonaNMp of the tMOTal 1 could double the Hat.  . Appomattox la A Growing. Town and so many have helped - ,r"}, "highlight": {"text": {"matched_tokens": ["W", "T", "Johnson"], "snippet": "AbMtt, Latter B. Harvey, <mark>W</mark>. <mark>T</mark>. Nash, A. A. Baldwin, and H. G. <mark>Johnson</mark>, and ao many fine"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "T", "Johnson"], "snippet": "AbMtt, Latter B. Harvey, <mark>W</mark>. <mark>T</mark>. Nash, A. A. Baldwin, and H. G. <mark>Johnson</mark>, and ao many fine"}], "text_match": 2312642366973935737, "text_match_info": {"best_field_score": "3319998906368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642366973935737", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.79, 457.8, 2186.56, 1181.55], "bbox_id": "09bf374ee3", "file": "AppomattoxNewspapers_1943-1947a_0141.pdf", "page": 1, "text": "Miss Maryland Virginia Smith,37, secretary to the superin,endent at the State Penitentiary, was killed instantly shortly after 7 oclock Sunday night when siie was s ruck by an automobile as she walked along route 460 about half a mile east of Bedford. Driver of the automobile, Russell W. Orange, 19, of Thaxton, was booked on a charge of manslaughter and released on 2,000 bond at Bedford county jail. Miss Smith was walking along the highway wiih . er sister, Mrs. R. W. Jamerson, of Webber City, just outside Bed ford, when she was hit. She was spending the week-end with her sis- .. According to deputy sheriff Dillard W. Shields, the two women were walking eastward along the side- of the highway when the Orange machine, traveling in the same direction, passed another ma chine, operated by Roy Bowyer, of Bocock Crossing, and struck Miss Smith as the two cars were running adjacent along the road. Besides Mrs. Jamerson, Miss mAh is survived by her father, M. C. Smith of Appomattox an other sister, Mrs. O. L. Sihefflerof Appomattox and six brothers, C. W. Smith, clerk of Appomattox Circuit Court LeRoy Smith, Appo- mat cx postmaster and S. Guy Smith also of Appomattox E. C. Smith of Clintwood E. G. Smith of Lu- ay, and W. I. Smith of Dufham, N. C. Funeral services were held at 3 M,, January 23 from Memorial Methodist Church here, conducted by Rev. W. R. Reed, and Rev. H. Frederick Jones. Interment was in ..ber y Cemetery. Active pallbear- eis were W. D. Ferguson, W. M. Abbitt, R. W. Stanley, F. W. Han- enkrat, Jr., Raymond Jamerson and Galen C. Smith. Flower bearers in cluded Miss Myrtle Smith, Mrs. L. E. Conner, Miss Hilda Carter, Mrs. Alfred Price, Mrs. Paul Cawthom, Mrs. Raymond Lawson, Miss Nola Burkey, Mrs,- W. W. Godsey, Mrs. A. A. Babcoek and Mrs. J. C. Cald well, of Appomattox Miss Sallie Lambert, Mr Cyril Hinchman,Mrs. T. W. West, -Mrs-Geo. Myers, Miqs Margaret Saunders, Mrs. Lena An derson, Mrs. Frank B Busch, Mrs. Alfred T. Blencowe, Mrs. E. R. Walthall and Mrs. Lloyd Willis, of . RidinuwU. Meade, of Clintwood, and In. D. E. Powell and Mrs. Mildred Stallard, of Bed- ford, Va. Honorary pallbearers in cluded Dr. D. A. Christian, C. L. Johnson, C. T. Moses, L. Crawley, R. L. Burke, A. R. Harwood, J. A. Burke, H. W. McKinney, Geo. Ab bitt, Jr., D. A. Conner, L. F. Fer guson, S. P. Cawthorne, A. T. Inge, J. W. Flood, N. R. Featherston, H. Y. Spencer, H. C. Pulliam, J. E. Jamerson, T. W. Fergttson, _B. G. Anderson, E. C. Rogers, J. C. Dav idson, Geo. Myers, Wilbur McDear- mon, Dr. L. L. Gayle, Edwin Moore."}, "highlight": {"text": {"matched_tokens": ["T", "W"], "snippet": "Lambert, Mr Cyril Hinchman,Mrs. <mark>T</mark>. <mark>W</mark>. West, -Mrs-Geo. Myers, Miqs"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "W"], "snippet": "Lambert, Mr Cyril Hinchman,Mrs. <mark>T</mark>. <mark>W</mark>. West, -Mrs-Geo. Myers, Miqs"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1427.05, 798.03, 1585.27, 1402.88], "bbox_id": "4c9fdacad7", "file": "AppomattoxNewspapers_1898-1902a_0529.pdf", "page": 1, "text": "Assassination or Lynching? Acting Secretary Hill dispatched tc the Italian Charge here, Count Carig nani, a copy of the report of Governoi Longino, of Mississippi upon the recen killing of Italians at Erwin. The Governor says that it has no yet been determined whether the Ital ians were naturalized citizens of th United States. After receiving news of the outbreak he immediately senl the sheriff of Washington county, ir which county the affair took place, tc the spot, and on the second day th Governor went. there in person anti learned that every endeavor was mak ing to discover and punish the guilts parties. The residents of Washington county the Governor says, condemn the out rage, and he assures the State Depart ment. and requests that the assuranc be communicated to the Italian Gov ernment. that every proper effort is b? ing made to bring the lynchers to jus tice. A study of the Governors repor makes it appear that after all the ques tion of the nationality of the murderec Italians will not be the principal issu in the inquiry. The Governor appar ently leans strongly to the belief tha- there was no real lynching but tha- the affair was a simple assassin? oi and that the men were not killed be cause they-were Italians, but as the re suit of a tribal quarrel. Should thi view be surtained by the inqu ry now i progress, the case at once will lose i international aspect. To Retire ia February. Rear-Admiral W. T. Sampson wil go on the retired list in February next when he will be relieved of command of the Boston Navy Yard by Rear Admiral M. L. Johnson. In case Rear-Admiral Sampson should like to be unattached, as is Rear-Ad miral Schley, in order that he may at tend the session of the court of inquirv he will be immediately detached frorr  his present duty and placed on waiting orders. No intimalion has reached th I department that Rear-Admiral Samp son would like immediate detachment but the Secretary is disposed to gran- a request for relief from his presen1 duty in case the officer should submil it. _______ Clerks and Their Superiors. The fact that certain clerks to quar j termasters and commissary officers ob I jected to accompanying those officer I when transferred to other stations ha?  induced the acting Secretary of War tc i issue the following notice to all con j cerned The Secretary of War consid  ers- that the interests of the service re I quire that employees at large in the de ! partment must be subject to orders it j regard to transfer of station, and a re fusal to obey such orders will be deemec a proper and sufficient reason for dis ! charge from the service."}, "highlight": {"text": {"matched_tokens": ["W", "T"], "snippet": "Retire ia February. Rear-Admiral <mark>W</mark>. <mark>T</mark>. Sampson wil go on"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "T"], "snippet": "Retire ia February. Rear-Admiral <mark>W</mark>. <mark>T</mark>. Sampson wil go on"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.25, 319.69, 1999.01, 1666.68], "bbox_id": "fe9358180a", "file": "AppomattoxNewspapers_1902-1905a_0168.pdf", "page": 1, "text": "Pennfons granted Virginians Solo mon Marshall, 12 Larry H. Mosley, 12 Frank C. Finnega, 8 Channing Jones, 8 Daniel Powers, 10 Corbin Jones, 12 George C. Clark, 24 Dan iel Knowles, 13, George Tice, 40. The new Episcopal Church at Min eral will be completed within the next 10 days. Rev. M. S. Eagle is the rector. Capt. T. C. Morton is canvassing Richmond, for the balance of the 10,- 000 needed to reproduce Monticello at the St. Louis Exposition. Mecklenburg county Democrats have nominated E. C. Goode for Common wealths Attorney B. E. Cogbill, Treasurer W. R. Beals, Sheriff Com missioner of the Revenue in District No. 1, T. F. Pectus, and in District No. 2, J. S. Montgomery S. P. Reed, for the House of Delegates. Staunton Daughters of the Confed eracy have elected the following dele gates to the Norfolk meeting Mes- dames Carter Harrison, McCullough, J. E. B. Stuart and Miss Minnie Mor ton alternates, Mesdames Nelms, Bis- sel and Tnrk and Miss Margaret Tim- berlake. At Charlottesville lociil physicians and surgeons have organized a stock com pany to erect a private sanitarium. The promoters are Drs. J. Hamilton Browning, Charles S. Venable, Hugh T. Nelson, William M. Randolph, W. Douglas Macon, Edward M. Magru- der and Halstead S. Hedges. The Virginia Medical Society at its closing session at Roanoke decided that in the future physicians may place business cards and advertisements of private hospitals in newspapers. Df. B. C. Keister, charged with advertis ing, in violation of the code of ethics, was, however, criticised by the society. Richmond was chosen as the next place of meeting. A deed has been recorded in the County Clerks office in Staunton con veyin g all of the property of the Cri- mora Manganese Company, of V ir ginia, to the Crimora Manganese Com pany, of New Jersey. This property is assessed at 30,000, but it is worth sev eral times that amount.  Gus Pryor, a negro, was arrested in Winchester charged with horse steal ing. It is alleged he stole a horse from James Slonaker, at Capon Bridge, a week ago. Grover Henry, the 19-year-old son of Mr. and Mrs. D. Henry, was killed by a freight train on the Norfolk and Western Railroad at Bentonville, W ar ren county. Young Henry was walking toward his home on the main track when he was struck. Mrs. Flemming, wife of Capt. J. H. Flemming, repulsed a negro who at tacked her when on her way home from a neighbors in the Park View suburb of Norfolk. The highwayman caught Mrs. Flemming by the arm and throat and demanded her money and jewelry. She gave him a stunning blow in the face with her fist, which so startled the negro that he fled. The tidewater truckers, with Mr. Henry Kirn as president, held a secret meeting in Norfolk, the purpose of which is to inaugurate a line of steamships be tween that city and New York. The wealthy trucker are dissatisfied with the rates and facilities of the Old Dominion Steamship Company. The Supreme Court of Appeals, in an opinion handed down at Staunton, de clared unconstitutional the act passed bj the Virginia Legislature several years ago prohibiting the use of trading stamps. The lower court is reversed ir the case, which went up from Berryville, and under the decision merchants maj resume the giving of stamps to custom ers. The use of the frading. stamps hac become popular in Richmond, Norfolk and other cities a few years ago when under the pressure of mercantile in fluence, the Legislature passed an ac forbidding their use. Mrs. E. R. Shenk and daughter, Mis Effie Shenk, of White Post, had a thril ling escape from drowning while cross ing the Opequon on the Millwood road on their way to Winchester. The Ope quon was swollen, and when in mid stream their buggy overturned. Mis Shenk was swept beneath the vehicle but after a terrible battle both ladies managed to reach the opposite bank. Tht horse swam out, but the buggy war smashed. Jas. Pritchard, aged 23 years, a son of Postmaster C. W. Pritchard, of Shenan doah, was run over by a Norfolk and Western train at Berryville and instantly killed. It is believed that Pritchard fell between the cars while stealing a ride. W. D. Bowles, the mail clerk who is charged with robbing the United States mail, was indicted by the grand jury in thd United States Court at Lynchburg. He was admitted to bail in i,coo, .with his brothers, J. C. and Malcolm S. Bowles, as his sureties. Mr. H. Eugene Ritter and Miss A. Blanche Weakley, of Winchester, were married Friday. The bride is barely 15 years of age and was attired in short skirts.. She is a daughter of Benjamin F. Weakley, who gave his.consent to the marriage. Rural Free-Delivery Inspector James S. Walbach had a close call at Wertz. He was at a country postoffice investi gating a complaint against a letter car rier. There was a large oil lamp burn ing over the place where the investiga tors were sitting and underneath was a loaded revolver. Having completed the examination Mr. Walbach walked to the door, when he declare the lamp exploded and the revolver was discharged. The large Bartycs Mill of the Nulsen- Krausse Manufacturing Company was destroyed by fire at Lynchburg. This was the largest of the companys thre mills, two of which are in Lynchburg The loss is about 25,000, with some in surance. The Thirteenth Tennessee Cavalry o Federal Veterans, to whose credit i placed the killing of General Morgan ai Grecneville, will hold its eighth annua reunion at Neva, Johnson county, Tenn. next month. The reunion will last threr days, the dates being October 7, 8 and 9 The veterans will camp in the moun tains. The ladies will participate anc there will be vocal choruses. At Campbell Courthouse, S. C., Gog- gin and John E. Withos. candidates fot nomination for clerk of the Court o Campbell County, tried to engage in a joint discussion, but the discussion end ed in a general row."}, "highlight": {"text": {"matched_tokens": ["W", "Sheriff"], "snippet": "B. E. Cogbill, Treasurer <mark>W</mark>. R. Beals, <mark>Sheriff</mark> Com missioner of the"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "Sheriff"], "snippet": "B. E. Cogbill, Treasurer <mark>W</mark>. R. Beals, <mark>Sheriff</mark> Com missioner of the"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2163.37, 1370.61, 2738.38, 1772.76], "bbox_id": "b77ab96588", "file": "AppomattoxNewspapers_1962-1965a_0604.pdf", "page": 1, "text": "Thirty - two îtiembênu of thé Robert E. Lee Chapter b t Futtiré Farmers of Amerloft iéére ad vanced to the degree of Chapter Farmer In an initiation cere mony conducted by chapter offi cers at a regular meeting of the group on Thursday. Tbe chapter Farmer degree is thehighest de gree that a local FFA chapter may confer upon g mmbe.  In presenting tfié-wvef which is emblemattcr ofthe de gree, President Eugene Shirty stated, . Your parental ypttr school, and this your chapter shall expect more of you then we did as green hands. He stressed the need on the,pert of the new degree members, o Join together in advancing the ob jectives of the FFA and agricul ture. Together we shall achieve great things, was the .challenge given to the candidates by Dwight Paulette, reporter of the chapter.  Members receiving the Chip- ter Farmer degree were. Jante8 Burcher, Roy Cheatham, Mick Coleman, Marshall Doss, Alvin Evans, Donald Ferguson, Billy Franklin, Edward. FultJJer, Jphn Giles, Melvin Garnett, Rât Hail. William Hawkins, Ronud Harris Larry Johnson, Anthony Lucado, Alfred Marsh, William Mayberry Calvin OBrien, David Page, Belle Williams  Still l i f e   A Pitsenbergcr, Health Depart-1 well, Jr. announce tire birth of a j David Reeve, Mike Seay. Rodger Rodrick I Slagle. Mike Wallace, Joel W u. Roger Nor- ! ment Mr. Earl Smith, Superin R .. .... _ i tendent of County Schools Mr - Kca, uu u L. Stanley, County Sheriff Mrs. Roy Moon Landscape w W"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "w", "W"], "snippet": "u L. Stanley, County <mark>Sheriff</mark> Mrs. Roy Moon Landscape <mark>w</mark> <mark>W</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "w", "W"], "snippet": "u L. Stanley, County <mark>Sheriff</mark> Mrs. Roy Moon Landscape <mark>w</mark> <mark>W</mark>"}], "text_match": 2310390567697121401, "text_match_info": {"best_field_score": "2220487540736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567697121401", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1657.17, 1018.53, 1835.39, 1828.31], "bbox_id": "82df54ad8a", "file": "AppomattoxNewspapers_1922-1923a_0253.pdf", "page": 1, "text": "Buckingham. I The meeting held here on the 14tii Jin the interest of the soldiers mon- j nmen t was a. success in every way,  socially, financially and intellectual- Jly. First, we had a feast of humor land flow of soul in a two-hours speech by Col. James Marshall, of Craig. The speaker was gracefully introduced by Col. It. T. Huba.d, who said he had rtood shoulder to shoulder with him in the Legislature in trying to save to the State th old Kanawah canal, and speaking of Col. Marshall as a big hearted man. Col Marshall opened by addressing himself to soldieis of every flag, col ored men of every hue. He then told of deeds of valor done by the Confi derate soldiers, bow at Antie- tum 35,000 Confederates, who were in a half starved condition, drove back 90,000 Federal soldiers. Every body sings the praise of the Con federates. Deep down in his heart is the love of home and the love of God. He has gone along filling the offices of duty and of destiny, and turning to Mr. E. W. Hubard oh, Edmund, all the offices of .emolu ment he could get. Then turning to the ladies he sad the smile of woman was the sweetest thing that had ever patting h s heart played I under his homespun jacket. Then turning to Sheriff Williams he said, Ben Johnson was a man modeled like you and I, and after he had found a woman that would consent to marry him she told him she had a secret she felt bound to divulge to him and then leave him to say If he wanted her. She then told him she had an uncle w 10 was hung. He said, why that is nothing. I had nine who ought to have been hung. The speaker said, I want to die with a smile on my face. I want it writ ten of me that I made more people laugh than cry. I have seen a Con federate soldier presiding over the Senate of the United States. I have seen one a judge of the Supreme Court. They have gotten all the good offices they could get. Some way, somehow, in the gret beyond, I think there will be a Confederate reunion. He spoke of how few of the old commanders were now liv ing, and mentioned M. B. Forest, the son of a blacksmith, who could not write in English sentence cprrectly, and yet was great on the field of battle. Said Forest was never known to write but one dispatch and this was when appealed to by some com"}, "highlight": {"text": {"matched_tokens": ["Sheriff", "Johnson"], "snippet": "jacket. Then turning to <mark>Sheriff</mark> Williams he said, Ben <mark>Johnson</mark> was a man modeled"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff", "Johnson"], "snippet": "jacket. Then turning to <mark>Sheriff</mark> Williams he said, Ben <mark>Johnson</mark> was a man modeled"}], "text_match": 2310390567697121401, "text_match_info": {"best_field_score": "2220487540736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567697121401", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2344.76, 580.7, 2487.07, 1056.74], "bbox_id": "bf0c82873c", "file": "AppomattoxNewspapers_1962-1965a_0183.pdf", "page": 1, "text": "Dr. F1. R. Lawson, mayor of Appomattox for the past two years, led the balloting in Tues days election with 316 votes. Five incumbent Councilmen were re turned to office. The sixth in cumbent, C. Lewis McDearmon, did not run. His place was filled by Richard L. Wingfield, former acting postmaster of Appomat tox, and presently an employee of G. E.s Finance Department, Lynchburg. Of the 382 votes cast, Henry B. Pack, head of the Vocational Agriculture Dept., Appomattox High School, led the council vote with 288. Next was Mrs. Earje P. Robinson, assistant to the publisher of the TIMES-VIRGIN IAN with 282. Ivey Holland, sec retary - treasurer of J. E. dearé and Go., received 268. Burke Guill, salesman for Moses Motor Co. won with 255 votes, and Wingfield joined the council with 229. Ewen T. Mitchell, taxi owner and former deputy sheriff re ceived 179. Harry G. Johnson, retired Standard Oil Co. plant superintendent received 141, and John R. Garrett, mortician and funeral director in Lynchburg re ceived 155, A Few Write - Ins A few write-in votes were re corded For Mayor, Grover E. Smith, 3 votes C. Lewis Mc Dearmon, 4 votes, and F. L. Murphy, 2 votes. Balloting was considerably lighter than 1961s record vote of 1 495. teglstrar W. Twyman Cole- iÉDr!àitl that about 000 voters were éligible to cast ballots. The new Council will convene on September 1, 1963."}, "highlight": {"text": {"matched_tokens": ["sheriff", "Johnson"], "snippet": "owner and former deputy <mark>sheriff</mark> re ceived 179. Harry G. <mark>Johnson</mark>, retired Standard Oil Co."}}, "highlights": [{"field": "text", "matched_tokens": ["sheriff", "Johnson"], "snippet": "owner and former deputy <mark>sheriff</mark> re ceived 179. Harry G. <mark>Johnson</mark>, retired Standard Oil Co."}], "text_match": 2310390567562903673, "text_match_info": {"best_field_score": "2220487475200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567562903673", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [470.66, 260.16, 629.45, 1163.16], "bbox_id": "db9eaa66c0", "file": "AppomattoxNewspapers_1902-1905a_0354.pdf", "page": 1, "text": "At a meetingof tbo Board of Supeervisors of Buckingham county, held at the Court House of said county, on Monday, the 13th day of June, 1904, present P, A.Orlgg, Allie C. Wood. Alox. F rbes, Forrest Guthrie, Ii, K Nuckolsaud M. L. Lay no. Gentlemen Su pervisors. The following claims and accounts against the county wore presented to the Board which being sworn to were examined, allow-  , ordered to be entered and tnat the clerk issue warrants for the same payable out of the county levy for 1903. Patteson W L Superintendent Poor supplies for paupers .........................  42 00 Moss  Grigg..................................... 26 60 Johnson C. I.  Son, rations for Mar tha McFadden and Polly Bryant, James River District.......................... Lewis J. H., rations for Salina and DorindaPerrow and vary A. Webb, James River District ......................... 6 00 Harris H, M., rationsTor Wash Hook- e ., James River District ................... 1 00 Sharp Daniel, carrying paupers to Poor H ouse...... ................................ 2 00 White W. H., rations for Francis Wright and Susan Brown, Marshall District. ................................................ 6 00 Morriss Dr. G. I attending smallpox c a se s......... ........................................ ioooo Mitchell Dr. J.H.,.ttending smallpox . 808 ...................................................... 10 00 Anderson It. M. Co., rations for small pox cases ........................................... . 1479 Amos Stephen S., guard for smallpox cases............................... 11 SO Lead better Jackson, guard for small pox cases .................... j go Morgan Richie J guard for smallpox cases...... . ......................................... 32 60 Anderson E. P., guard for smallpox eases............................... 40 qq McCraw W. E services in smallpox tses . .................................................... 2 00 5 poneer t. a ., carrying four lunatics to White Hall ...................................... 6 00 Bransford J. T., J. P holding iuquest over said body... ................. 3 00 Christian C. L., special commission-  n summoning Jury of inquest ....... 1 50 lull 1 . ii., sitting one day as regis trar............... . ............... . ,,,, ....... 300 Moss .Jno, R salary as Judge from January 1,1904, to January 12,1904.. 13 20 Spencer Mrs. C. A., boarding two men putting down carpet in Court House 2 50 Musa  Grigg, 1 doz. cuspidors for Court House and freight................... 10 80 Grigg P. A conveyance for two men from W hit Hall to Court House and return to put carpet down in Court House.................................................... 4 -5 Forbes P. A., paid freight  n matti g for Court House steps ....................... 5 -, Anderson Geo. W.  Sons, carpet for Court House........................................ 175 Everett Waddey Co., stationery for clerks office ......................................... 24 IJ 5 Hubard E. W., attorney for common wealth, allowance January 1 . 1904, to-July i. 1904. ...................................... 200 a Forbes P. A., clerk county from Jad. 1, 1904, to July 1, 1904 ......................... 250 00 Same, clerk Bcurd Supervisors, from January 1,19M.to July 1.1904 ........... 15 o  j Williams Wm., sheriff from January 1, 1904 .10 July 1, 1904 ......................... 200 CO Shepherd B.F..Overseerof Poor.from Januarv 1. 1904, to July 1, 1904 ......... 7 50 Wright Clifford, Overseer of Poor from Jaduary 1.1904. to July 1 . 1904. 7 fo Pollard Daniel E.. Oveaseer of Pool from January 1 , 1904, to July 1, 1904 . 7 50 Sharp Daniel, Over eer of Poor from January 1.1961, to July , 1904 ........... 7 50 Atkinson Robt.,Overseorof Poor from January 1,1904, to July 1, 1904 ......... 7 50 Agee F. L Overseer of Poor from January 1,1904, to July 1,19U4 ......... 7 10 Grigg P.A., 8 ervice 8 oue day on board 3 0  Wood Allie C., services one day on Board and mileage............................. Forbes Alex., services one day on Guthrie Forrest, services one day on Board and mileage .............................. 4 50 Nuekols B. F.. services one day on Board and mileage .............................. 4 50 Oliver J. T working roads in Mays- vilie district ........................................ 14 Agee C.D.,working roads In Maysville Taylor C. i., working roads in Mays- ville district........................................ 4  Robertson T. J. S., working roads in James River district ......................... 54 41  Bryant D.M., working rouds in Jamec River district ...................................... 89 F 5 Glover Juo,U.,workf!Upoud inJumes River district ...................................... 23 15 Davidson W. B., working roads in Francisco district............................. 19 j 5 Taylor C. I., working roads in Curds- ville district............................ 7 7  Thomas T.H.,working roads in Curds- viile district ..................................... 8  Nuekols R. J working roads in Mar shall district ........... . .......................... 34 3 - Winfrey Geo, N., working roads in Marshall district ................................. 3 q  Childress Jno. M., working roadsin Marshall district ................................ J 40 81 Tapscott L.T., working roads in Slate River district............................ 30 45 Winfrey Geo. N., working roads in Slate River district ........... . ............  00 Tindal Nalson, working roads in Slate River district ...................................... 7 f, A?.e A .working roads in Slate River district ...................................... 31 61  Tindall Thus., working roads in Slato River district ...................................... 10 38 Patteson H,C.,tools for working roads in Slate river district ......................... 1 Ordered that hereafter guards in smallpox cases be paid no more than  1.25 per day. Ordered that P. a , Grigg buy four shades for the court room windows. 1904, J une 13th, balance county levy. for 1913. . ............... . . .i.....,2040 9 Maysville Road District, 1904, June  13th, balance ......... ...................... 73 hs James River Road District, 1904, June 13th, by balance ..................... Francisco Road District, 1904, Juue 13th by balance ........ ..................... Curdsville Ro d District, 1904, June 13th, by balance ............................... Marshall Road District, 1904, June 13th, by balance ........................ Slate River Road District ..........  .  P. A. GRIGG, Chairman. A copy-teste P. A. FORBES, Clerk."}, "highlight": {"text": {"matched_tokens": ["W", "t"], "snippet": "eases............................... 40 qq McCraw <mark>W</mark>. E services in smallpox tses . .................................................... 2 00 5 poneer <mark>t</mark>. a ., carrying four lunatics"}}, "highlights": [{"field": "text", "matched_tokens": ["W", "t"], "snippet": "eases............................... 40 qq McCraw <mark>W</mark>. E services in smallpox tses . .................................................... 2 00 5 poneer <mark>t</mark>. a ., carrying four lunatics"}], "text_match": 2310390567026032761, "text_match_info": {"best_field_score": "2220487213056", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567026032761", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.74, 401.65, 1630.64, 1721.5], "bbox_id": "64368108ad", "file": "AppomattoxNewspapers_1892-1898a_0325.pdf", "page": 1, "text": "The two negroes who attempted to assassi nate Col. C. D. Hunter near 8elma, Ala , were lynched ----- Victor Nottingham and Edward Wilson were sentenced in Norfolk to flve yenrs in the penitentiary for the murder of Allen Jones ---- Guy Smith, a boy, was ar rested in Huntington, W. Va., for horse stealing. ----- A small boardwalk at Atlantic City collapsed, and several young people were badly h u rt ----- Two passenger train8 on tho Illinois Central, while running at full speed, collided. Two were killed and a. number Injured. ----- The Columbus Buggy Company, of Columbus, O., made an assign m ent -The death list at the Atlantic City disaster is now placed at forty-four, of whom forty have been identified ----- It has been found that Frank Donnelli, who was sup posed to have leaped from the steamer Poca hontas Into the James River, was murdered. William Hawkins, a bartender, was killed in Chicago by J. G. English and hit sister Nellie, He had deceived the g ir ___ John Webster shot his mother In Laport, Ind., because she refused to give him money. ----- J. George Smith, manufacturer of spring and Iron bedsteads, at Chicago, made an as signment to A. S. Tobias, an employe of the firm. Assets aro given at 55,0JO and lia bilities 13,000  Edward Burbank, one of tho robbers ol the Cripple Creek stage coach, has been caught ----- The Civic Federation of Chicago, claims lo have wholesale evidence of police cor ruption in that city ----- Two masked meD robbed the Illinois Central Station nt Walker, a station between Springfield and Clinton in Illinois. AgeDt Campbell was shot and probably fatally wounded by the robbers. ---- Colonel John Hallam, an Arkansas at torney, shot and fatally wounded llev. W. O. Forbes, a prominent Baptist minister io Texarkana, Ark. ----- Ephraim Glover, prominent citizen of Haddonfleld, N. J., was Instantly killed by being struck by the At- antio City expicss on tbe Camden and At lantic road. ----- Edward Johnson struck John HUdeberg, of Perth Amboy, N. J , a blow in the jaw that killed him. ----- James Casherega, alios George Wilson, was hanged In the fed- eral jail at Fort Smith, Ark , for mu dering a man named Thack for the purpose of rob bery. He protested his innocence on tbe gal lows. -Andrew Todd, of North Adams, Mass., was arranged before United States Commissioner Fiske in Boston on a charge  of robbing a postal car at Newport, Vt., aud was held lor court. ----- W. C. Burt, of Aus tin, Tex., murdered his wife aud two little children, and placed their dead bodies in cistern. ----- A number of persons were killed and injured in a railroad wreok at the cross- ing ot the West Jersey and Atlantic City rail roads on the meadows just outside of Atlan- tle City.  An unknown woman riding a blko ran down and killed Wm. KUnk In Chicago. ----- Frank Owens, a brlckmoson, of Brooklyn, N. Y., who had been working in Kent, O , re ceived his pay and went on a spree. He was arrested in Akron, O., while intoxicated, and attempted to hang himself In bis cell at the city pris ra with his suspender. He was dis covered and cut down bofore barm was done. ----- Two men robbed a faro bank at Newport, Ky.The East Chicago Iron and Steel Company, of Hammond, Ind., has made an assignment ----- Bert Green, colored, con victed of the murder of Miles P. Mitchell, near Whitevllle, Hardeman county, in De cember last, was hanged at Jackson, Tenn. ---- Henry Lyons, who killed his wife neat Mt. Pleasant, W. Va., went to the home of bis mother and committed suicide ----- Charles De Heart, a farmer in Patrick coun ty, Va., who had given information to rev- snue officers about moonshiners, was found lead in a fluid shot through the head. The Pennsylvania Railroad Company has de cided to stop all work on its lines wherever possible, in order to reduce expenses The Dennison Deposit Brnk at Dennison, O., made an assL-nment. Liabilities over 103. J00 assets G0, CO Joseph Greldler, ol Minnesota, a crack bicycle rneer, was killed ra the track at Lima, O. Fifty people wero overcome by the heat ii St. Louis. Of these ten died. ---- Wm. Fi ilc, of Carlisle, P .i, has been arrested in Chi cago on a chargeof forge-y. ----- Two masked men shot George Hetzler, a saloonkeeper fr Cincinnati, who refused lo give up his raon- y One of tbe robbers was arrested. ----- The An cient and Honorable Company ot A tlllerj reached Boston, from their excursion t England and France. When the rteamei had reached her berth, a letter f om Mayo Quincy was handed to Colonel Walk which the cuinpany was congratulated ou ii safe return. ----- Revised lists of tbe dead ant lojured by the railroad wreck on the mead ows near A lantic City show that forty-sever persons were killed and forty-three injured George F. Hauser, who had charge of th signal tower near where the accident occur- ed, was arrested pending the invcstigatloi by the coroners jury. Georgo McConnell, grand keeper ot re- eorda and seals ot K. of P. of Oregon, has disappeared. His accounts are short 2,003. - ---- The main auditorium of tbe Frankford Music Hall, in Frankford, a suburb of Phila delphia, was destroyed by flats. The loss will amount to 20,093. Ths origin of tho Are is unknown Tho building was 50 by 150 feet. ----- A. G. Elliott  Co., paper man ufacturers In Philadelphia, made an assign ment. ----- Judge Tiillnghast, of the Appellate Court of Providence, B. I , directed the en trance of a decreo forfeiting tbe charter of the Commercial Mutual Fire Insurance Com pany, restraining tbo president and othor officers of the company from transacting any insurance business in the name of the com pany, and appointing James C. Collins, Jr. receiver. ----- Sheriff David Douglass and an unknown highwayman were found dead In the woods near Navada City, Cal. They had probably killed each other. ----- Fifteen miners wore droVned, several other lives wero lost, thirty-six persons wero injured, many of them by lightning, and property valued at 100,000 destroyed In the storm that swept over rittsburg nnd vicinity Monday nlglit Tbe storm also di-1 great damage In other parts of Pennsylvania."}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "ar rested in Huntington, <mark>W</mark>. Va., for horse stealing."}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "ar rested in Huntington, <mark>W</mark>. Va., for horse stealing."}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1029.85, 448.62, 1318.14, 1786.51], "bbox_id": "d321572500", "file": "AppomattoxNewspapers_1922-1923a_0441.pdf", "page": 1, "text": "tage near Charity ahnV miles from Stuart ith thLSt Pete Hall i  ltn their Dei j e 18 years old. On day night. March 24 a men armed with shotguns, sun.  ed the house and riddled thT tog with bullets. Ann f i f was 60 years of age was! death through the Window wtfl a room attired in her nightcb Her sister, who is about 50 W age, was shot in the arm not fatally hurt. A state of excitement son- akin to terror exists at Pinners and another suburb of Port s a result of frequent as highway robbery and setting u J2gs Thursday  iS r J tile efforts were made to start that might have been parti disastrous. Rags satuated win! had been placed beside the bull ignited. J. C. Apperson, an aged W the Peace, from Matthews Or was recently murderously ana and robbed at Pihners Point  going to visit at the home j son. He was knocked senseld his assailants and upward oi was taken from him. Harry B. Earnest, son oi and Mrs. D. F. Earnest, of Port folk, 34 years of age, was klliefl the explosion of a locomotive K in Mojave, Cal., according to 1 graphic advices received in Norf George L. Andrews, for attemn to defraud the United States in 1 ing a 2 silver certificate to- pleaded guilty when his called for hearing in the Ur States District Court at Rich- Judge Waddill then sentence! to serve five years in the State tentiary at Atlanta, Ga., and him 500. The twelfth annual conventto the American Funeral Benefit  sociation of the Junior Order oil ed American Workmen was her Lynchburg, 50 delegates being  ent, most of them from Wash! and Maryland. Reports shot association to he in a healthy dition, with  2,000 in the trer The custom of annual meetings changed so that the body will r biennially in the future. The meeting will be at Bristol, Tar April, 1909. The officers er are President, H. T. Brow Baltimore vice president, i Derr, of Baltimore secretary,j Lillian Johnson, of Baltimore urer, J. H. Conner, of Baltimf Gen. Lawrence Simmons S who fought in nearly a hundred- ties, died at his home in S The end came shortly belC oclock A. M. General Bata been an invalid for two yew, had been helpless from since January 23. Having ated from West Point in-1851, eral Baker was a lieutenant United States Army at the b out of the Civil War, when ha rendered his commission ana ed the Confederate Army, fought with valor through tha War. He was made a brl general at the battle of Branajj tion. He Is said to have her only Southern officer who ated a general on the lew- chief service in the Unitea Army was in fighting Indian had seen service in neany State and Territory. tonerai was married in 1855 .tos.nBbn beth L. Henderson, of SaHsM, C. He is survived by his daughter, Miss Elizabeth Bata, was born at Raleigh, N. J sons  Alexander H. Balter, Mexico, but now Sheriff of tn ty, and Stuart Baker, of K He leaves also two sler8,4 ing in North Carolina, w. grandsons, both of pr  ., General Baker was Suflolhs of the Seaboard Air Line for 27 years. Little Garnett Walton,  old daughter of Mr. and Harriman was re-elected president of Southern Pacific. The Bank of England reduced its discount rate from 5 to - per cent. All advices from Wall Street were to the effect that business on the Exchange was entirely professional. There is an entire lack of public buy ing. A big drop in the price of Rio Tinto, the biggest, copper mine of Europe or the whole world, indicates the feeling about the copper metal market abroad. Mayor Reyburn, of Philadelphia, was consulting bankers with regard to the citys 13,500,000 loan, the rate of interest on which is to be in creased from 3 to 4 per cent. A number of leading Philadelphia banking firms are lending call money at 5 per cent. It is proposed to increase the size of the Executive Committee of Union Pacific in order that Harriman may not continue to have sole control of that companys affairs. So far this year the shipments of coal and coke on the Pennsylvania lines east amounted to 14,822,000 tons, an increase of 364,000 over the same period in 1906. This gain is considerable less than the gain of last year over 1905. v The Iron Age says of the pig iron trade The March product of the coke and anthracite blast fur naces was 2,225,175 tons, as com pared with 2,045,068 tons in Febru ary, a short month, and 2,235,306 tons in the record month, December. While on the face of it this looks as though March had been larger than February, as a matter of fact the daily rate of production in March was only 71,780 tons, as compared with that of 73,038 tons for Febru ary."}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "who is about 50 <mark>W</mark> age, was shot in"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "who is about 50 <mark>W</mark> age, was shot in"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [653.45, 270.81, 824.44, 937.85], "bbox_id": "f250da7910", "file": "AppomattoxNewspapers_1922-1923a_0380.pdf", "page": 1, "text": "President Roosevelt left Washing ton for his holiday vacation at Pine Knot, the Virginia cottage owned by the Roosevelts, near Charlottesville. With him were Mrs. Roosevelt and their five children, also Assistant Secretary M. C. Latta, Surgeon General of the Navy Rixey, Secret Service Agent Jam es Sloan and Miss Landon, of Oyster Bay, a friend of Miss Ethel Roosevelt. Secretary Shaw has issued a cir cular that no surety company shall accepted on bond in which the government is interested for an mount greater than 10 per cent, of Its paid up capital. The Department of Agriculture is determined to have enforced the law prohibiting railroads from confining live stock beyond the 36-hour limit. Sir Mortimer Diirand, the retiring British ambassador, called upon Sec retary Root. The sword of Paul Jones has been deposited in the Library of the Navy Department. Brig. Gen. J. Franklin Bell will be promoted to be a major general. The Supreme Court decided that the succession tax of 7,000 assessed against the board of education of Kentucky Annual Conference of the Methodist Episcopal Church is valid. The Supreme Court decided that it has jurisdiction to try Sheriff Shipp and others, of Chattanooga, Tenn., for contempt of court in connection with the lynching of Ed Johnson. The constitutionality of the North Carolina statute forbidding the oper ations of a bucket shop was upheld by the Supreme Court of the United States. Justice Moody, formerly attorney general, has been assigned to the Third Circuit, embracing Pennsylva nia, New Jersey and Delaware. The inheritance tax of Louisiana was declared by the Supreme Court of the United States to be constitu tional. Anton W inter, who made the new counterfeit two doUar certificate, was arrested in Rochester, N. Y. The Enterprise Transportation Company of Jamestown, R. I.. filed complaint with the Interstate Com merce Commission against the Penn sylvania Railroad Company and the New England Navigation Company as to existing transportation rates In his annual report Rear Admiral Rae, chief of the Bureau of Steam Engineering of the Navy Department, says th at the steam turbine presents one of the greatest problems of the day. Captain Marix, of the Navy, re ported experiments for coaling ves sels at sea to he unsuccessful. Edwin T. Sanford of Knoxville, Tenn., will succeed J. C. McReynolds as an assistant attorney general.  President Roosevelt will spend a portion of the Christmas holidays at Pine Knot, Va."}, "highlight": {"text": {"matched_tokens": ["Sheriff"], "snippet": "has jurisdiction to try <mark>Sheriff</mark> Shipp and others, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Sheriff"], "snippet": "has jurisdiction to try <mark>Sheriff</mark> Shipp and others, of"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [103.7, 337.16, 272.48, 1764.55], "bbox_id": "1ba3ee9b2a", "file": "AppomattoxNewspapers_1905-1912a_0598.pdf", "page": 1, "text": "Jonesville.  The killing of Dr. pauuea W. Walden, a prominent Dem- oerat, by Perry Wallin, a Republican tender, has fanned a smouldering poli tical feud in the Blackwater district to a threatened outbreak. All through the mountain district the clans are pining up. The coming trial of 200 paoonshlners, charged with vote sell ing, is causing the local authorities to paake preparations for the protection Of the court and jury. They fear an Outbreak paralleling the tragedy at HlUsville last March, when, with the exception of one man, the entire hu man fabric of the court was wiped out. Judge Skeen got a message from the mountains reading There are 38 in Our party. Before we will submit to going to jail we will die and go to hell. Newport News.This city over whelmingly voted a bond issue of 26,- 900 to purchase water-front property and construct a small boat harbor and municipal pier. The vote was 160 to 95. In addition to the small boat har bor and piers, the bond issue means Che purchase of 110 acres of land sur rounding the harbor tor factory sites and will give the city 2,000 feet of water front at the junction of James rive and Hampton Roads. The har bor will combine water and rail trans portation. Petersburg.A large brick building I pn Canal street, used as a branch mill f the Virginia Consolidated Milling Company, was entirely destroyed by ftre, with machinery and a large quan- tfty of flour and cornmeal. The loss, trhlch is covered by insurance, will probably be in the neighborhood of 126,000 or 30,000. The fire occurred Curing a heavy electric storm. The building, which was owned by the Vir ginia Railway and Power Company, is supposed to have been struck by light- king. Fredericksburg.The election in Caroline county on the question of issuing 126,000 of county bonds to be used in the construction of permanent good roads resulted in a defeat of the  bond issue by a majority of 164. Many  localities in the county were largely In favor of the bond issue, while other sections were just as firmly opposed The result of the election Is a great disappointment to many in the county j as well as others who regret to see any check to the movement for good roads through the State.  Fredericksburg.The season in this action this summer has been one of the finest known in years and it promises to be a great crop year, showers having fallen at intervals just as needed, and the corn crop never looked better at this date in previous  ears. More hay has been raised than aver before, especially alfalfa, and vegetables and fruits of all kinds are Plentiful and excellent in quality. i . Fredericksburg.  The failure of Caroline county to accept the bond issue for the permanent improvement of good roads will probably result in the automobile highway from Rich mond to Washington, which will pass through this city, being changed so as to go through Spotsylvania to the  Hanover line and from there to Rlch-  mond. Spotsylvania and Hanover al- -ready have good roads.  Winchester.Although Winchester has had no saloons for four years, the Anti-Saloon League will ask for a local-option election to be held early in September. Temperance leaders claim the liquor trust is about to  throw money into Winchester for capi tation taxes, and it is desired to have the issue settled by the ordinary elec torate, which at the lastelection gave the dry ticket 160 majority. Bristol.  Representative C. B. Slemp, who is now in Southwest Vir-  ginia, states that he haB appointments to fill from the Ninth Virginia district at West Point and Annapolis. He is anxious to correspond with young men from 16 to 21 years of age who may be . qualified. He advises that only per sons who have had high school or t preparatory school training should  apply. Lynchburg.If the order of State  Auditor Moore as to revenue-producing property owned by the cities of the State is not estopped by the courts, the city of Lynchburg will be assessed more than 600,000 on property in this class, the property being valued by the city at more than 1,600,000. Norfolk.The Norfolk City Council , has designated five delegates to repre-  sent the city at the Atlantic Deeper  Waterways Convention at New Lon don, Conn., September 4-6. Staunton.A suit for 26,000 dam ages brought by Dr. T. T. Fauntleroy against L. L. Bowman for alienation of Jfbis wifes affections was settled out pVEjBOurt. SyLuray.Charles Leakford, aged 22, - wietf from injuries sustained 10 days ago by being knocked from a freight . train on the Norfolk and Western Rail road at Rileyville. It was reported that he was struck by the crane of a prater tank. Fredericksburg.  Miss Elisabeth Johnson, of Baltimore, has been elect ed by the city School 3oard as an ad- f fiitional High School teacher. Miss Catherine Taylor, of Appomattox, has teen elected to fill a vacancy caused jjrF.the resignation of Miss Carrie Hun- Br, of the same place. Sjarrlsonburg.The grand jury re- ned 13 indictments at Franklin, Aadleton county. What promises to Utt sensational trial will follow the .RStments of former Sheriff Mauzy d ie rm e r Clerk O. E. Bolton on rges of misappropriation of funds longing to the county.  Lynchburg.The Steel structural fork for the big blast furnace being p a t at Reusens by the Oriskany Ore Treat Corporation is being put In lion and it is expected that the I will be ready for operation by"}, "highlight": {"text": {"matched_tokens": ["W"], "snippet": "killing of Dr. pauuea <mark>W</mark>. Walden, a prominent Dem-"}}, "highlights": [{"field": "text", "matched_tokens": ["W"], "snippet": "killing of Dr. pauuea <mark>W</mark>. Walden, a prominent Dem-"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
