{"document": {"bbox": [770.65, 243.83, 919.51, 772.91], "bbox_id": "84df881017", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "Stuart Farrar, of Pamplin, happened upon a shelf of Lyn chburg directories among the records in the court house, Ly nchburg. In the oldest directory there, 1887-1888 he found sev eral pages of interesting in formation about this county back when  Rose Bower ,  Neb raska ,  Reedy Springs etc. were post office locations.  Ne-  braska , of course was the pre sent county seat,the Town of Appomattox. Population in 1887 was 10,080 with 5,153 white and 4,927 colored. County seat was  listed as Appomattox CH the  old village, now Appom attox j Court House National Historical j Park with a population of 100.  Average assessed value of j lands in 1887-1888 was 4.13 j per acre. The Circuit Court of I the Fifth Circuit met on the 15th  of March and 15th of Sept, with  Judge John D. Horsley and Geo rge T. Peers as clerk. Henry T. Parish was county judge and Mr. Peers serving as clerk and County Court met at the Court House Thursday after the 1st Monday in each month. County officers 84 years ago were T. B. Bryant, sheriff A.S. j Swan, surveyor, J . R. Franklin, Treasurer George W. Abbitt, commissioner of the revenue and W. C. Franklin, common wealths attorney. The supervisor board, then as now, was composed of three representatives, one from each district Wm. White was chair man together with D. H. Mar shall and H. E . Gilliam. County magistrates were A. Womack, C . H. Gilliam, Pam plin City Ja s. A. Walker, Tower Hill N. W. Owen, Oakville C. W. Cardwell, Spout Spring C.B ."}, "highlight": {"text": {"matched_tokens": ["T", "B", "Bryant", "sheriff"], "snippet": "84 years ago were <mark>T</mark>. <mark>B</mark>. <mark>Bryant</mark>, <mark>sheriff</mark> A.S. j Swan, surveyor,"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "B", "Bryant", "sheriff"], "snippet": "84 years ago were <mark>T</mark>. <mark>B</mark>. <mark>Bryant</mark>, <mark>sheriff</mark> A.S. j Swan, surveyor,"}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["T", "B", "Bryant"], "snippet": "H. Gills, Cooch Plunkett, <mark>T</mark>. <mark>B</mark>. <mark>Bryant</mark>, S. P. Coleman, Frank"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "B", "Bryant"], "snippet": "H. Gills, Cooch Plunkett, <mark>T</mark>. <mark>B</mark>. <mark>Bryant</mark>, S. P. Coleman, Frank"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1904.93, 307.29, 2066.79, 1514.39], "bbox_id": "6bb707a814", "file": "AppomattoxNewspapers_1902-1905a_0361.pdf", "page": 1, "text": "Since the death of Rev. Dr. Malcolm MacVicar the Virginia Union Univer sity, near Richmond, has been without a president. Information has just been received that the executive board of the American Baptist Home Mission Society, which controls the institution, held a meeting in New York, and ap pointed Dr. George Rice Hovey to fill the place temporarily. The prospects are that he will be made president permanently. Dr. Hovey has been connected with the university for some years. He is a man of exceptional ability. The Virginia Union Univer sity is situated just outside the north ern boundaries of Richmond.  It has a number of splendid buildings and is doing a great work for the colored race. J. W. Adcock, of Amherst county, who was employed in the Buena Vista furnace yard on the cinder dump, was, a few nights ago, run over by the cinder engine and both of his legs mashed. It is thought that he was asleep, as no one saw him when the accident took place. His left leg was amputated above the ankle and it is thought that the other one will also have to be taken off. While a freight train was engaged in shifting on the Atlantic Coast Line, in Manchester, a car loaded with lum ber weighing 30,000 pounds broke away, tore the track to pieces and rushed into - Perry street, narrowly missing a crowded street car and scattering pedestrians right and left. The car toppled over and strewed the street with lumber. The Neff-Rice Camp, Confederate Verterans, held their annual reunion near Newmarket. Lieut. Gov. Joseph Willard, of Fairfax, Hon. Henry Downing, of Warren, Col. E. E. Stick- ley and Mr. Gilbert Pence, of Shenan doah, delivered addresses. A numbet of camps and several thousand peo ple were present. Robert Lee, white, 30 years old and unmarried, who said his home was al Columbia, N. C., was arrested by Depu- .ty United States Marshal West at Lamberts Point on a charge of coun terfeiting. A number of spuriout coins were found in Lees possession 1 M rs. Mary A. Knick, aged 82 years, of Collierstown, Rockbridge county is dead. She was a daughter of Mr and Mrs. William Armentrout and re sided during her whole life in th house in which she was born and died. Her husband, William Knick, died from the effects of a wound which h received in the battle of Chancellors ville, in May, 1863. Three sons survive her. After spending seven months in th inaccessible mountains of Tazewell county in order to avoid the officer! of the law, Thomas K. Leedy, t wealthy farmer, rode into Tazewe! and surrendered to, the sheriff, whe met him by appointment at the horn of State Senator J. N. Harman, whe will act as his counsel. In Januarj last according to the charge, Leed shot and killed Walter Harris, a pas senger on a train, near Graham. H immediately took to the mountains and the officers found it impossible tc arrest him. Finally, however, Leedj grew tired of being a fugitive fronr justice and agreed to give himself up In addition to being charged with the killing of Harris, Leedys defendant in a suit for damages amounting tc 10,000 brought by the relatives 01 th dead man. His trial on the charge ol murder will take place next month It is thought that Leedy will be ac quitted. He is a man well-known ir the Southwest. He posses great phy sical strength and exceptional skill in the use of the revolver and rifle. A sensational horsewhipping occur red on the streets of Leesburg ir which Mayor S. Carroll Chancelloi played the role of victim. Mrs. Geo Ferguson, who had charged the mayo with slandering her, wielded the wea pon, and mayor in defending himsell struck Mrs. .Ferguson with his cane The community has been thrown intc a perfect fever of excitement in conse quence vof the affair. It seems that about a year ago the mayor boarded at the home of Mrs. Ferguson. Re cently anonymous letters have beer, circulated concerning his conduct, and the mayor accused Mrs. Ferguson ol being their author. Harry Hoover, a young blacksmith living in Basic City, and working ir Staunton, was run over by a C.  O train while on his way to work. H later died. One foot and one arm were cut off and he was badly cut about the head and body. He was.2 years of age and has a wife at Basic It is thought he was riding a freight and tried to jump off before reaching the station, when he fell under the train. The first case under the new drug law came up Thursday when a Rich mond druggist was fined 25 for the sale of cocaine to a victim of the co caine habit. The police justice an nounced that in the future the fine would be 100 for each offense. The last Legislature passed a law forbid ding the sale of cocaine to any per sons except physicians, dentists and druggists. In Richmond many of the victims of the drug are young boys. Rockbridge Chapter of Royal Arch Masons was organized at Lexington by Mr. William J. Hubard, of Lynch burg, assisted by Mr. J. W. C. Bryant and Mr. B  F. Grove, of Clifton Forge The following officers were elected- .High priest, R. E. Hutton king, V B. McClure scribe, H. O. Dold. There were twenty applcations presented for membership."}, "highlight": {"text": {"matched_tokens": ["Bryant", "B"], "snippet": "Mr. J. W. C. <mark>Bryant</mark> and Mr. <mark>B</mark>  F. Grove, of Clifton"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant", "B"], "snippet": "Mr. J. W. C. <mark>Bryant</mark> and Mr. <mark>B</mark>  F. Grove, of Clifton"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [845.75, 435.21, 1019.04, 1626.52], "bbox_id": "e94b613327", "file": "AppomattoxNewspapers_1902-1905a_0030.pdf", "page": 1, "text": "ing poll books to Clerks office ........... Bryant, D. M. do Judge .... Moore, W. R. do do .... Swan, F. W do Clerk .... Spencer, Eugene do do Kid ridge. Itolfe do Judge and tak- . ing poll books to Clerks office....    40 Twyman, 8. H. do and Com- missioner.................................................... 8 w Spencer, J. T. do do .... Gilliam, J. E. do Clerk .... Spencer. A. P. do do  Hooper, U. Y. do Judge and tak ing poll books to Clerks office.....  Woolnridge, B. C. do do and Cum mifflionor. . .................................................. Morris. J. O. do do .................. MoCraw, W. E. do Clerk.................. J Jg 41118, I.eon P. do do ........  100 Dunevant. E. P. do Judge and tak ing poll boons to Clerks office ............. Matthews, Jno. A. do do ................ Bailey, W. E. do do ................. . Farley, J. W. do Clerk .................. Cruto, J. N. do do ....... Smith. W. A. do Judge and tak Ing poll books to Clerks office ....... Bransford, J. T. do .................. Elam, G. T. do .................. Ayres, J. R. do Clerk .................. Thomas. T. H. do do ............... Walden, N. A. do Judge and talk ing poll boc-is to Clerk8 office .............. Farter, J. J. do - Williams, S. E. do  Smith, Julian do Clerk ................... Smith, A. Rolfe do do .........  Srlnson, D. W. do Judge and tak ing polls books to Clerks office............ l.cSueur, L B., Sr. do ................ Wootien, W. H. do .............. Miller, R.H. do Clerk ............... Mann. T. M. do do .................. Harris, B. J. do Judge and tak ing poll books to Clerks office Norvell. T. F. do .................. Tapscoa, Li T. do .................. Tapscott. G. A. do Clerk ............ 1 00 Damron, Jas. W. do do .................... 1 00 Agee, K. B. do Judge and tak ing poll books to Clerks office, Ayres, Jas. E. do .............. Oslin. j. M. do .................. Agee. J. B. do Clerk ............... Ayres, Mayo G. do do .................... El is..W. p., copying registration books, James River D ist ............................ . ........ .Tones. L. D.. rent of room fer registrars and swearing registrars, Francisco Dis. Williams. Lewis, live days service on Electoral Roard........................................ 10 00 Kppes and Snider, one record of voters.. 3 75 Davidson, W. B., rations for Mrs. D. W. Morris. Francisco D ist .......................... 12 00 Harris. J. H., do do Elizabeth Spencer.James River D ist ....................... 8 00 Johnson.C.l.A Bon.dn do Polly Byrantand Martha McFadden, James River Dist ............................. 8 to Jones, P. M rations for Mary Catkins, Nancv Harris, Keziah Jones. Fran cisco Dist................................................... 3 10 Harri88. H.M.. rations for Wash Hocker. Sidney Perkins and Simon Bennett, James River Dist ...................... 6 Anlerson. J. W.  Co., rations for Au  gust us Lee. Francisco Dist. ............ . 4 Garnett, A. C. Sr Son. rations for Peter Adams. Ned Munford and wife and Harriet Gamble, Curdsville Dist ........ 28 patteson. w . I,.. Snpt. Poor, part of salary 1902 and 1908 ............................ ...100 Nowlin.Dr. J. Burton, services rendered in lunacy trials ......................................... 5 Glover. Dr. Perkins. do do prisoners in jail and lunacy trials ........ 11 Worley. S. R.. repairing jaJl... 2 Everett Wnddey Co., st tionery for Clerks office ........ 14 Tanseott. T.. T working t ublic roads. Slate River Dist ...................................... 72 price. Robt H.. am oving fallen trr-ea out of roads, Curdsville Dist ................ 8 00 Moss, W. A.. do do 1 0 Glover, Robert, repairing road. Curds- vllle 1st..................................................... 1 i0 Richardson. Mnyo C.. CommisMoiier of Roads. Dist. No. 2 .................................... 80 fO Pule, Wm building bridge across Plate River, Mayville Dist .................. 46 79 Catlett, J.W ., do. do n Curdsville Dist ................................ 7 75 Dowdy. Thos. E.. do do do 20 00 Moss. P. E.. lumber for bridge, Mays- ville Dist..................................................... 50 17 Hubard, E. W., att- rney fo Corawlth salary from July 1st, 1906, to January 1st, 190ft ........................................................ 200 01 Forbes, P. A., clerk county court allow ance frr-m July 1st, lvo2. to January, 1st, 19o3 ........................................ 200 00 Same, clerk circuit court, allowance from July 1st. 19o2, to Jan. 1st. 19o3.... 50 0C Same, clerk of Board of Supervisors, from July 1st, 19o2, to Jan. 1st 19o8.... 15 00 Same, firewood for clerks office, from July 1st, 19o2, to Jan. 1st, 19o3 ............... 20 00 Williams, Wm., sheriff allowance, from July 1st, 19o2, to Jan. 1st, 19o3............ 200 00 Griffin,Zack,Over8eer of Poor allowance from July 1st, 19o2, Jan. 1st. 19o8, ........ 7 50 Bryant, D. M Overseer of Poor allow- ance for same period................................ 7 60 Pollard. D. E., do do 7 50 Smith, J. W do do 7 50 Atkinson, Robt. do do 7 60 Baber, J. W., do do 7 50 Grigg. P. A., attending Board of Super-  visors one day ............................................  Wood, Allie C do and mileage. 3 80 Forbes, Alex., do do 4 50 Guthrie, Forrest, do do 4 50 The order of the County Court of Bucking ham county entered at the November term, thereof, 19 o 2, deciding that a bridge across James River at Wingina was a public neces sity, and should be built, and ascertain ing and determining the amount of the ex penditure to be made by the county in con structing  id bridge to be 4,ooo.oo was duly certified to he Board of Supervisors ana  eonsidered by said Board. It was then moved  by a member of the Board that no action be I taken at this time on the order of the court, and that the further consideration of th e , question be postponed until the next meet ing of the Boara. On this motion Forrest  Guthrie and Alex. Forbes voted in the affima- tive. and P. A. Grigg and A. C. Wood in the negative. The vote being a tie. Judge Jno. R. Moss being present, voted in the negative. A. C. Wood, supervisor, then offered the fol lowing resolution Resolved, That the Board of Supervisors deem the expenditure of 4.ooo.oo by the county of Buckingham for the purpose of constructing abridge across James River at Wingina. a proper expendl- ture. _ . _ , . . n On this resolution P. A. Grigg and A. C. Wood voted in the affirmative, and Forrest Guthrie and Alexander Forbes in the.nega tive. On motion it is ordered that this action of the Board of Supervisors be certi fied to the county court of this county a t the December term thereof, 19o2. __ On motion of Forrest Guthrie, Supervisor, it is ordered that the usual allowance be made to all the county officers. The account of C. I.Johnson  Son amount ing to 521.81 for road work was not allowed, said account not being endorsed by Judge John R. Moss and Wm. Peile, road commis sioner. -  . . . Ordered that W. L. Patteson, Superintend ent of Poor be allowed floo.oo on his salary. Resolved, That the Board of Supervisors adjourn to the 3rd Monday in this month lor the purpose of examing aud passing upon the reports of the several road surveyors, and that each road surveyor be notified by the clerk or this meeting of the Board. L n j Ordered that the Board adjourn to the 3rd Mondaytin December. 19o2. P. A. Grigg, chairman. A Copyteste P. A. Forbes, clerk. Things We Like Best"}, "highlight": {"text": {"matched_tokens": ["T", "B"], "snippet": "R.H. do Clerk ............... Mann. <mark>T</mark>. M. do do .................. Harris, <mark>B</mark>. J. do Judge and"}}, "highlights": [{"field": "text", "matched_tokens": ["T", "B"], "snippet": "R.H. do Clerk ............... Mann. <mark>T</mark>. M. do do .................. Harris, <mark>B</mark>. J. do Judge and"}], "text_match": 2310390567697121401, "text_match_info": {"best_field_score": "2220487540736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567697121401", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "Flood, Nathan L Hancock, <mark>Bryant</mark> Nowlin, Co. Z. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "Flood, Nathan L Hancock, <mark>Bryant</mark> Nowlin, Co. Z. E."}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [470.66, 260.16, 629.45, 1163.16], "bbox_id": "db9eaa66c0", "file": "AppomattoxNewspapers_1902-1905a_0354.pdf", "page": 1, "text": "At a meetingof tbo Board of Supeervisors of Buckingham county, held at the Court House of said county, on Monday, the 13th day of June, 1904, present P, A.Orlgg, Allie C. Wood. Alox. F rbes, Forrest Guthrie, Ii, K Nuckolsaud M. L. Lay no. Gentlemen Su pervisors. The following claims and accounts against the county wore presented to the Board which being sworn to were examined, allow-  , ordered to be entered and tnat the clerk issue warrants for the same payable out of the county levy for 1903. Patteson W L Superintendent Poor supplies for paupers .........................  42 00 Moss  Grigg..................................... 26 60 Johnson C. I.  Son, rations for Mar tha McFadden and Polly Bryant, James River District.......................... Lewis J. H., rations for Salina and DorindaPerrow and vary A. Webb, James River District ......................... 6 00 Harris H, M., rationsTor Wash Hook- e ., James River District ................... 1 00 Sharp Daniel, carrying paupers to Poor H ouse...... ................................ 2 00 White W. H., rations for Francis Wright and Susan Brown, Marshall District. ................................................ 6 00 Morriss Dr. G. I attending smallpox c a se s......... ........................................ ioooo Mitchell Dr. J.H.,.ttending smallpox . 808 ...................................................... 10 00 Anderson It. M. Co., rations for small pox cases ........................................... . 1479 Amos Stephen S., guard for smallpox cases............................... 11 SO Lead better Jackson, guard for small pox cases .................... j go Morgan Richie J guard for smallpox cases...... . ......................................... 32 60 Anderson E. P., guard for smallpox eases............................... 40 qq McCraw W. E services in smallpox tses . .................................................... 2 00 5 poneer t. a ., carrying four lunatics to White Hall ...................................... 6 00 Bransford J. T., J. P holding iuquest over said body... ................. 3 00 Christian C. L., special commission-  n summoning Jury of inquest ....... 1 50 lull 1 . ii., sitting one day as regis trar............... . ............... . ,,,, ....... 300 Moss .Jno, R salary as Judge from January 1,1904, to January 12,1904.. 13 20 Spencer Mrs. C. A., boarding two men putting down carpet in Court House 2 50 Musa  Grigg, 1 doz. cuspidors for Court House and freight................... 10 80 Grigg P. A conveyance for two men from W hit Hall to Court House and return to put carpet down in Court House.................................................... 4 -5 Forbes P. A., paid freight  n matti g for Court House steps ....................... 5 -, Anderson Geo. W.  Sons, carpet for Court House........................................ 175 Everett Waddey Co., stationery for clerks office ......................................... 24 IJ 5 Hubard E. W., attorney for common wealth, allowance January 1 . 1904, to-July i. 1904. ...................................... 200 a Forbes P. A., clerk county from Jad. 1, 1904, to July 1, 1904 ......................... 250 00 Same, clerk Bcurd Supervisors, from January 1,19M.to July 1.1904 ........... 15 o  j Williams Wm., sheriff from January 1, 1904 .10 July 1, 1904 ......................... 200 CO Shepherd B.F..Overseerof Poor.from Januarv 1. 1904, to July 1, 1904 ......... 7 50 Wright Clifford, Overseer of Poor from Jaduary 1.1904. to July 1 . 1904. 7 fo Pollard Daniel E.. Oveaseer of Pool from January 1 , 1904, to July 1, 1904 . 7 50 Sharp Daniel, Over eer of Poor from January 1.1961, to July , 1904 ........... 7 50 Atkinson Robt.,Overseorof Poor from January 1,1904, to July 1, 1904 ......... 7 50 Agee F. L Overseer of Poor from January 1,1904, to July 1,19U4 ......... 7 10 Grigg P.A., 8 ervice 8 oue day on board 3 0  Wood Allie C., services one day on Board and mileage............................. Forbes Alex., services one day on Guthrie Forrest, services one day on Board and mileage .............................. 4 50 Nuekols B. F.. services one day on Board and mileage .............................. 4 50 Oliver J. T working roads in Mays- vilie district ........................................ 14 Agee C.D.,working roads In Maysville Taylor C. i., working roads in Mays- ville district........................................ 4  Robertson T. J. S., working roads in James River district ......................... 54 41  Bryant D.M., working rouds in Jamec River district ...................................... 89 F 5 Glover Juo,U.,workf!Upoud inJumes River district ...................................... 23 15 Davidson W. B., working roads in Francisco district............................. 19 j 5 Taylor C. I., working roads in Curds- ville district............................ 7 7  Thomas T.H.,working roads in Curds- viile district ..................................... 8  Nuekols R. J working roads in Mar shall district ........... . .......................... 34 3 - Winfrey Geo, N., working roads in Marshall district ................................. 3 q  Childress Jno. M., working roadsin Marshall district ................................ J 40 81 Tapscott L.T., working roads in Slate River district............................ 30 45 Winfrey Geo. N., working roads in Slate River district ........... . ............  00 Tindal Nalson, working roads in Slate River district ...................................... 7 f, A?.e A .working roads in Slate River district ...................................... 31 61  Tindall Thus., working roads in Slato River district ...................................... 10 38 Patteson H,C.,tools for working roads in Slate river district ......................... 1 Ordered that hereafter guards in smallpox cases be paid no more than  1.25 per day. Ordered that P. a , Grigg buy four shades for the court room windows. 1904, J une 13th, balance county levy. for 1913. . ............... . . .i.....,2040 9 Maysville Road District, 1904, June  13th, balance ......... ...................... 73 hs James River Road District, 1904, June 13th, by balance ..................... Francisco Road District, 1904, Juue 13th by balance ........ ..................... Curdsville Ro d District, 1904, June 13th, by balance ............................... Marshall Road District, 1904, June 13th, by balance ........................ Slate River Road District ..........  .  P. A. GRIGG, Chairman. A copy-teste P. A. FORBES, Clerk."}, "highlight": {"text": {"matched_tokens": ["Bryant"], "snippet": "tha McFadden and Polly <mark>Bryant</mark>, James River District.......................... Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["Bryant"], "snippet": "tha McFadden and Polly <mark>Bryant</mark>, James River District.......................... Lewis"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["B"], "snippet": "by John Patteson, S. <mark>B</mark>. Co., ander Austin, Sur."}}, "highlights": [{"field": "text", "matched_tokens": ["B"], "snippet": "by John Patteson, S. <mark>B</mark>. Co., ander Austin, Sur."}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
