{"document": {"bbox": [906.5, 487.14, 1065.57, 895.98], "bbox_id": "05da8381c2", "file": "AppomattoxNewspapers_1933-1936a_0396.pdf", "page": 1, "text": "W ILLIAM E. BORAH, the liberal Republican senator from Idaho, is now a full fledged candidate for the Republican Presidential nomination. He formally put him self in the running by announcing t h a t he would enter the pri mary in Ohio which will he held May 12. That state requires t h a t the candidate shall declare himself in writing, and this Mr. Borah said he would do. The senators state ment follows After a thorough survey of the Ohio situation I am convinced that the peo ple of that state should be given an opportunity to express their choice in the Presidential primary on May 12. Under the so-called favorite son plan this privilege Is denied them. To obtain an expression of popular will It is my intention to place at least eight candidates or delegates at large In the field. I shall make a number of speeches in Ohio and present the issues as I see them. It is understood by his friends that the senator will make a contest for delegates In almost every state having a preference primary. He says the G. O. P. conventions have been dominated by the old conservative leaders through the operations of the favorite son scheme and this control he intends to destroy if possible. It is his opinion that only a liberal Republican can de feat President Roosevelt next fall, and few will deny that he is the outstand ing liberal In his party."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "he would do. The <mark>senators</mark> <mark>state</mark> ment follows After a"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "he would do. The <mark>senators</mark> <mark>state</mark> ment follows After a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2311.13, 1295.07, 2477.53, 1411.17], "bbox_id": "c08607d451", "file": "AppomattoxNewspapers_1949-1952a_0035.pdf", "page": 1, "text": "Two State Senators from Norfolk, Robert F. Baldwin, Jr., and Edward L. Breeden, plan to call for revision of existing poll tax laws, through a constitutional convention limited to the subject.The legality of such a a convention, limited to one field of law-making, has been questioned in many quarters since announce ment of the Senators plans. Many arguments on the subject will certainly be heard soon."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Two <mark>State</mark> <mark>Senators</mark> from Norfolk, Robert F."}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Two <mark>State</mark> <mark>Senators</mark> from Norfolk, Robert F."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [679.89, 240.03, 848.61, 783.93], "bbox_id": "21971bb301", "file": "AppomattoxNewspapers_1905-1912a_0045.pdf", "page": 1, "text": "There was a lively debate in the House on the possibilities of controlling insur ance companies. Mr. Cockran proposed that Congress, through its taxing power, should confine all insurance companies to the state in which they were or ganized. The House sent back to the Senate with a message refusing to consider the bill passed by the Senate removing dis abilities against the proposed Panama ca nal bonds. The Senate Committee on Interstate Commerce considered the nomination of Franklin Lane, of California, to be a member of the Interstate Commerce Commission. Of the 150,000,000 worth of sugar brought into the United States during the present year 50,000,000 worth came from Hawaii, Porto Rico and the Philippines. President Roosevelt has approved the plan of the Hawaiian government for the issuance of public improvement bonds to the amount of 750,000. Secretary Bonaparte decided to take vigorous action to stamp .out hazing at Annapolis. Mr. Loud introduced in the House a resolution providing that Con gress investigate conditions at the Naval Academy. The report of Fourth Assistant Post master-General De Graw shows there are now 32,055 rural free-delivery routes. Secretary Taft is said to object to the appointment of General MacArthur as Chief of State. Senators Teller, Tillman, Bacon and others in the Senate attacked the manage ment of the Panama Canal and Senator Scott declared his belief that a mistake was made in choosing the Panama route. Representative Bennett, of New York, introduced a bill to reduce the represen tation of the Southern States in Congress. The House debated the Presidents recommendation for the regulation of insurance, but reached no conclusion. The Panama Canal Appropriation Bill was reported in the Senate. Formal announcement was made by the President and Mrs. Roosevelt of the engagement of their daughter, Alice Lee Roosevelt, to Nicholas Longworth, rep resentative in Congress from Ohio, ported that so far as he can tell there The Comptroller of the Currency re- have been no contributions by national banks to campaign funds since 1891. The Santo Domingo Treaty was re ferred back to the Committee on Foreign Relations by order of the Senate in ex ecutive session. . President Gordon, of Howard, Uni versity, has tendered his resignation. A cablegram was received from the"}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "MacArthur as Chief of <mark>State</mark>. <mark>Senators</mark> Teller, Tillman, Bacon and"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "MacArthur as Chief of <mark>State</mark>. <mark>Senators</mark> Teller, Tillman, Bacon and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2062.11, 951.24, 2403.12, 1045.79], "bbox_id": "20b10d87c2", "file": "AppomattoxNewspapers_1947-1949a_0272.pdf", "page": 1, "text": "She was born in Appomattox CtiuntA daughter of the late Horn-1 g, . er .Curtis and Blanche Moore Bab- The classes at both Boys State , - _ _ . ,  , . j 4 . j  cock. She was graduated from Ap- an l Girls State are conducted in .. _ - ... .. . ... . pomattox Hkrh School, after which the same manner. The candidates, training at Johnston- are grouped into cities..each cityl w Richmond. After  T TOaJT   I 0   ! her graduation she followed the etc. State senators and delegates __ ______ . - _ ,_________ . , . . . . , j .. nursing profession until her health are elected and the senate and the   j"}, "highlight": {"text": {"matched_tokens": ["State", "senators"], "snippet": "she followed the etc. <mark>State</mark> <mark>senators</mark> and delegates __ ______ . - _ ,_________ . , . . . . , j .. nursing"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "senators"], "snippet": "she followed the etc. <mark>State</mark> <mark>senators</mark> and delegates __ ______ . - _ ,_________ . , . . . . , j .. nursing"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [265.44, 1103.45, 421.72, 1256.5], "bbox_id": "6f6ce429ac", "file": "AppomattoxNewspapers_1902-1905a_0165.pdf", "page": 1, "text": "Senator Thos. S. Martin announc ed in Richmond on Thursday last that he is in no way opposed to the primary plan for nominating either State officers or United States Sen ators that he has not advised any one to oppose or to throw obstacles in the way of theprimary  and that he advices all to give it a complete, fair, and impartial trial. Of State Senators thuB far nominated by the primaries, abont three-fourths are reported to be Martin men."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "and impartial trial. Of <mark>State</mark> <mark>Senators</mark> thuB far nominated by"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "and impartial trial. Of <mark>State</mark> <mark>Senators</mark> thuB far nominated by"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2416.24, 1054.92, 2593.64, 1471.27], "bbox_id": "f0fbe9391b", "file": "AppomattoxNewspapers_1939-1943a_0215.pdf", "page": 1, "text": "Richmond, Jan. .1, By VPA- With the -ong-nwaited declaration of Colgate Darden, Jr., Virginia re- presentation for the Second - Con gressional District, that he would en ter ,the primarioa next August 6 as a candidate for the Governorship, the political situation appeared to be claryifyipg, most observers seem ed to agree.  In the running with. Congressman Dlardan as formal entrants are State Senators Hunsdon Cary, of Henrico, and Vivian L. Page, of Norfolk, and Speaker of the Rouse Ashton Bo vail, of Williamsburg. Senator William M, Tuck, .of South Boston is the only candidate who has so far announced for Lieu- tenant Governor. iv y--i In announcing his candidacy, Re presentative Darden let it he known hat he wifi, resign from Congress before he begins campaigning. His formal statement follows I shall be a candidate for Gov ernor of Virginia, subject to the Democratic primary of next Aug ust. At a later date, as the campaign gets under way, I shall present a legislative program dealing with State problems that, in my opinion, require thoughtful and serious con-, siderstibn. I hope that the program will deserve and receive the appro, val of the people of Virginia  Prominently mentioned as poten tial successors to Representative Darden is Winder R. Harris, mana- s ging editor of the Norfolk Virginian Pilot, and Norman R . j Hamilton, publisher of the Portsmouth Star .and a former member of Congress from the Second District."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "as formal entrants are <mark>State</mark> <mark>Senators</mark> Hunsdon Cary, of Henrico,"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "as formal entrants are <mark>State</mark> <mark>Senators</mark> Hunsdon Cary, of Henrico,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [347.99, 1290.6, 510.07, 1614.95], "bbox_id": "232d919877", "file": "AppomattoxNewspapers_1892-1898a_0437.pdf", "page": 1, "text": "nom inated for Governor of Virginia by the Democratic Convention at Roanoke. At tho evening session of the demooratlo State convention Hon. J. Hoge Tyler, of Pulaski, was nominated by acclamation for Governor of Virginia. The convention was called to order at noon by Gen. George J. Hundley, of Amelia coun ty, acting chairman of the State central com mlttee. The Academy of Music was packed from pit to the highest gallery with dele gates and visitors, and on the stage wero Senators Daniel and Martin. Every Com gressman In the State, State Senators, mem- bers of the House of Delegates, and nearly every democratlo politician of prominence In Virginia. In calling the convention to or der, General Hundley made a short and happy speech, in which be announoed the temporary officers of the convention. The convention at 5 oclock took a reoess until 8 oclock. When the convention reassembled at 8 oclook Mr. Carter Gloss, editor ol the Lynch burg News, placed in nomination for Gov ernor Hon. J. Hoge Tyler, of Pulaski, the mention of whose name was the signal for loud and continued applause. Mr. Glass said, among other things, that Major Tyler would go into tho gubernatorial office a democrat and remain a democrat, which re mark seemed to be understood as a hit at Governor OFerral, and was received with loud and long-continued applause. Prof. Gecrge W. Miles, of Badford, seconded the nomination of Major Tyler for Governor In a short speech, alter which Hon. J. Taylor Ellyson, a candidate for the gubernatorial nomination, moved that Major Tyler be nominated by acclamation, which was done."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "gressman In the State, <mark>State</mark> <mark>Senators</mark>, mem- bers of the"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "gressman In the State, <mark>State</mark> <mark>Senators</mark>, mem- bers of the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [413.29, 647.41, 582.24, 1975.69], "bbox_id": "05457a6051", "file": "AppomattoxNewspapers_1898-1902a_0690.pdf", "page": 1, "text": "Mew O rd in an ces o f C o n stitu tio n The committee on final revision in article XVI of the constitution as submitted to the convention includes two hew ordinances not passed upon by the convention. One concerns the appointment of registration boards, who, daring this year and next year, will register vot ers under tLe provisions of the con stitution. The ordinance provides that there shall be appointed by the convention a board of registrars for each magisterial district in a county who shall register voters under a new registration prior to the 20 tb day of October, 1902, and again prior to the 20th day of October, 1903 They are required to sit at least One day at each precinct. They ère limited this year to 15 days re- histretion in a district and next year to 10 days. The number of days may be extended by the county court. This board will be author ized to register under the old soldier danse and the understanding clause which expire Jan. 1 , 1904. The roll they make up will be permanent. With them the elections will be held this and next fall. The poll tax prerequisite will not go into effect for the next two elections, that is until Jan. 1 , 1904. Another ordinance reported by the, revisioncommittee puts the new con stitution into effect. The present legislature is charged with the duty jrf putting it into operation and is isAiinited time in which to do it. Itts brciereu r-aneton the sec ond Wednesday in nexclTbreSltier. The ordinance extends the terms of most state and cbunty officers. The present judicial system is continued until Feb. 1, 1904, when the new dtcnit court will take the place of the present county and circuit courts and the clerk of the circuit court will assume the dual duties of clerk of county and circuit court. All district and county officers whose terms expire July 1, 1903, and who Would have to be elected the pre- - vious May are made to hold office until Jan. 1, 1904, and the election is fixed for November instead of May. The clems whose terms would bold until July 1, 1905, are cut back to Jau. 1, 1904, and the clerk to take their place is elected with other county aud district officers and mem bers of the legislature in November. The terms of all Capitol officers in Richmond, except those elected by the people, are ertended from Janua ry to March, 1904. State senators whose terms expire next fall will be elected for two years, and in 1905 all the senators will be elected for four years. The terms of governor and most state officers elected by the peo ple are extended! February follow ing the date of the election of their successors iu the preceding Novem ber. The registrars who are to be ap- pointed by the convention for Ap pomattox county will probably be named by our representative, Mr. Flood, and those for Buckingham- Cumberland by Mr. Hubard. We trust that these gentlemen will se lect good men to fill these responsi ble positions. These registrars are to make up the permanent lists of the voters of these counties, under the understanding and soldier claus es of the constitution. If we under stand the promise of the convention, no white man is to lose his vote. Give us good men, gentlemen  and let the good work under the new constitution start right. The Baptist Ministers Conference this morning adopted a resolution upholding the Rev. C. H. Crawford in his anti-saloon league work, and speaking of his unjust prosecution at the hands of Judge Campbell. The resolution is as follows Whreeas, the Rev. C. H. Craw ford criticised the action of the judge of Amherst county court for his course in a certain liquor case before him, and the said judge, for this critcism, cited Dr. Crawford for contempt of coart, and compell ed his attendance. Resolved, That while we do not pass upon the truth of the state ments made by Rev. Mr. Crawford, not being personally and indivuallj acquainted with the facts, we most heartily condemn the course pursued by the judge in thus denying the freedom of the press in the criticism of a course already closed. Be it further. Resolved, That we express our cordial sympathy with Dr. Craw ford in this unjust persecution, and Î ut upon record our confidence in is conduct of the noble work for temperance committed to his charge."}, "highlight": {"text": {"matched_tokens": ["State", "senators"], "snippet": "ry to March, 1904. <mark>State</mark> <mark>senators</mark> whose terms expire next"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "senators"], "snippet": "ry to March, 1904. <mark>State</mark> <mark>senators</mark> whose terms expire next"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [797.05, 583.57, 967.44, 1330.62], "bbox_id": "c1ab7a7fd3", "file": "AppomattoxNewspapers_1939-1943a_0206.pdf", "page": 1, "text": "Many citizens in this section were definitely hoping that State Senate William M. Tuck, of Halifax, would be a candidate for Governo of Virginia in the Democratic pri mary of next August. We believe that had Senator Tuck announced for Governor, he would have been a formidable candidate. We have not comini ted ours lvcs as yet, and .ill not do so until all the hats are .n the ring, but many of -us would like to support a candidate from this section of the Old Dominion, a sec tion not furnishing a governor for hirty years, and surely in line. Senator fPuck has announced for tile Lieutenant Governorship. We will support him for that of fice. So far no other candidate is seeking the Lieutenant Governor ship . We hope no other candidate will appear. Senator Tuck will ably .ill the office, and we believe that -ie will evntually become Governor of Virginia. He is still a young man, and the people of Virginia will continue to avail themselves of his services for many years, and by so doing reflect their traditional care in selecting public servants. In the meanfme, the contest for he Governorship remains a wide open issue. Three candidates have already announced. They are State Senators Cary and Page, of Rich mond and Norfolk, and Afcton Do ell of Williamsburg, former speak er of the House of Delegates It is understood that. Congressman Colgate Darden, of Norfolk, soon will enter the race. There are other possible candidates, so many tha most of us will reserve judgment until the list is complete. In passing, we must refer to the fact that the race for the Governor ship thus far is a contest of per sonalities, rather than of issues. We would prefer to eee policies dis cussed more and personalities less, There are many problems in Vir ginia and the people will want to know a lot more than the potential andidates have stated thus far er. hey commit themselves. Frankly, if the candidates actually announ- ed, we would conclude that while hey are able men, that there are others equally as capable We are sure to have a three cornered fight vhy not make it four or five, by dding either Darden, Ozlin or Weaver? This section is not likely to support either Senator Cary or Senator Pae. If Darden enters, he choice will probably be between Dovell and Darden, with Darden favored. Later we will discuss these men, hue we dont feel it proper to burden our readers with the contest before Christmas We do, however, hasten to state our support of Sena- or Tuck for the Lieutenant Gov ernorship, for the simple reason that the citizens here know him as a friend and advocate of the things hat make for well-being, and with his announcement are willing to close the lists in so far as that of fice is concerned."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "already announced. They are <mark>State</mark> <mark>Senators</mark> Cary and Page, of"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "already announced. They are <mark>State</mark> <mark>Senators</mark> Cary and Page, of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [627.57, 1634.87, 793.47, 1757.17], "bbox_id": "963411eaed", "file": "AppomattoxNewspapers_1912-1915a_0063.pdf", "page": 1, "text": "James F. Fielder To Become Governor Of New Jersey. Trenton, N. J.Democratic state senators of the next New Jersey legis- I lature in caucus here selected Senator I James F. Fielder, of Hudson county, as the majority nominee for president J of the Senate. Mr. Fielder will suc ceed Governor Wilson when the latter resigns to go to Washington. Sen- I atòr James A. C. Johnson, Bergen j county, was selected as president pro I tern."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "Jersey. Trenton, N. J.Democratic <mark>state</mark> <mark>senators</mark> of the next New"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "Jersey. Trenton, N. J.Democratic <mark>state</mark> <mark>senators</mark> of the next New"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [566.91, 1324.52, 905.46, 1476.42], "bbox_id": "e7f4821255", "file": "AppomattoxNewspapers_1947-1949a_0516.pdf", "page": 1, "text": "i Governor m erely recommends a program to the Legislature, with no authority to enact it into law or carry it through. Thirty-five of the Forty State Senators are ac tively supporting John B attle for Governor, as are over two-thirds of the members of the House of D elegates on- lX.,  Senators are supporting Mr. Edwards, two Mr. Miller, and one Mr. A rnold. The thirtv-five Senators and , ! L the members of the House of Delegates sup porting Mr. Battle do not believe th at a sales tax is neces sary at this tu n e but believe th at money we have in the Treasury of V irginia should be spent before adding addi tional tax burdens on the people of V irginia. Therefore, those people who honestly desire a constructive schocl pro gram should support Senator Battle, who is the only candi- siatui  W k a le to get his program through the Leg-"}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Thirty-five of the Forty <mark>State</mark> <mark>Senators</mark> are ac tively supporting"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Thirty-five of the Forty <mark>State</mark> <mark>Senators</mark> are ac tively supporting"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [480.0, 626.87, 642.96, 717.47], "bbox_id": "6682ebbb3a", "file": "AppomattoxNewspapers_1922-1923a_0533.pdf", "page": 1, "text": "Guild took part in the decoration and made a short address. He was lusti- j ly cheered by the Confederate veter-  ans, many of whom were present. Governor Guild and his official party were entertained at the home of Mayor Baker during their stay here. W. M. Olin, seceretary of state, and State Senators D. 13. Denny and J. F. Shaw were in the party."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "seceretary of state, and <mark>State</mark> <mark>Senators</mark> D. 13. Denny and"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "seceretary of state, and <mark>State</mark> <mark>Senators</mark> D. 13. Denny and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [363.34, 1242.87, 526.53, 1391.57], "bbox_id": "e8968c1642", "file": "AppomattoxNewspapers_1898-1902a_0237.pdf", "page": 1, "text": "Counting the 20 hold-over State Senators, more than 100 of the 140 Democratic candidates for the next General Assembly ha7e been nomi nated. A number of these are non committal. as to their choice for IJ. S. Senator. Mr. Martin claims all of the-uncommitted, and Mr. Tyler claims that he will have a part of them. Each claims that he will re ceive at least 71 of the 140 votes in the two houses of Assembly."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Counting the 20 hold-over <mark>State</mark> <mark>Senators</mark>, more than 100 of"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Counting the 20 hold-over <mark>State</mark> <mark>Senators</mark>, more than 100 of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2200.31, 512.1, 2537.65, 1008.34], "bbox_id": "bb46e4572a", "file": "AppomattoxNewspapers_1939-1943a_0237.pdf", "page": 1, "text": "Colgate Darden, for Governor,  William M. Tuck, for Lieutenaht Governor, and  Abram P. Staples, for Attorney General, .  will roll up an impressibe plurality in Apomattox county. Local polity cal leaders are solidly behind the- candidacy of Mr. Darden, who re cently resigned as Congressman, from the Second Norfolk D- trict in order to run for the Gov- ernorship He is being opposed by Ashton Dovell, of Williamsburg, who is a former Speaker of the House of Delegates and by State Senators Vivian Page, of. Norfolk, and Hunsden Cary, of Richmond. Although United States Harry Flood Byrd has indicated that he will take ho part in the contest, it is deemed likely tbt Congressman Darden will have the backing of the Byrd organization fores in the primary, and for that reason he is being favored to emerge from the primary as the winner. Mr. Tuck and Mr. Stiples as yet have no opposition. Mr, Darden will delay opening his campaign until he rol.r from Congress March 1, and pethaps will not begin campaigning untilApril. He has been invited to visit Appo mattox before the August primary, and may come here for the open ing day of June court. Local Darden wilt ____ I _______ supportera try to interest votera to registering and participating in tha primary it-l A  avili kav A navy and white accessories and a 1 so that Appomattox will have shoulder corsage of red rosebuds. commendably large vote. shoulder corsage of red rosebuds. Mrs Martin is the daughter of Mr. and Mrs. Jesse H. Reynolds of Appomattox, and a graduate of the Appomattox high school and Phillips Secretarial College. Tha bridegroom to the son of Mr. and Mrs. T. Raymond Mar tin, of Appomattox. The couple will make their home in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "of Delegates and by <mark>State</mark> <mark>Senators</mark> Vivian Page, of. Norfolk,"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "of Delegates and by <mark>State</mark> <mark>Senators</mark> Vivian Page, of. Norfolk,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1898.08, 1179.86, 2064.48, 1280.36], "bbox_id": "4b9b2879da", "file": "AppomattoxNewspapers_1936-1939a_0006.pdf", "page": 1, "text": "becue. Thomas W. Ozlin, of the state corporation commission, arid frequently mentioned a 3 a possible future Governor, will be the prin cipal speaker. Attorney- General A. P. Staples, Peter Saunders, E  R. Combs, and five state senators, sev eral members of the House of Dele gates, as well as prominent Young Democrats from all sections of the state will attend."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "R. Combs, and five <mark>state</mark> <mark>senators</mark>, sev eral members of"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "R. Combs, and five <mark>state</mark> <mark>senators</mark>, sev eral members of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1497.83, 1211.09, 1945.28, 1476.23], "bbox_id": "4bf7ce0300", "file": "AppomattoxNewspapers_1933-1936a_0526.pdf", "page": 1, "text": "Authorized by the general assem bly to investigate the probable cost of old age pensions in Virginia, a commission of seven members has been appointed and will repo  t findings to the assembly of Governor Peery named tq the commission Dr. Charles J. Smith, of Roanoke College and C. H. Mor- rissett Lieutenant Governor Price named state senators Aubre.y er and Benjamin Muse. Ashton Do- vell named E. B. Moore, of Berry- ville and Horace Edwards, of Rich mond and L.Gordon White of Scotts ville. i Mr.and Mrs. A. F. Drinkard had as their guests last Friday evening the following Mr and Mrs J E . , Chick, of Spout Spring, Mrs,Ida , Carson, of Lynchburg, Mrs. _ David Cawthorn, of Newark, N .J .. M- C E . Carson and Mrs. M. M . Dnnk- i ard. Mrs. Judson Morris is spending LinTugust and to 344 this week in Lynchourg. for 1936."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "Lieutenant Governor Price named <mark>state</mark> <mark>senators</mark> Aubre.y er and Benjamin"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "Lieutenant Governor Price named <mark>state</mark> <mark>senators</mark> Aubre.y er and Benjamin"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [287.04, 514.85, 439.84, 1141.82], "bbox_id": "0b66a6c6dd", "file": "AppomattoxNewspapers_1974-1975a_0593.pdf", "page": 1, "text": "At a news conference on I Monday. Dec. 8. Virginia State  Senators Clive DuVal 32nd District and Charles Waddell 33rd District announced that at the 1976 session of the General Assembly they will co-sponsor a bill providing for refundable deposits on throw away beer and soft drink containers. Their bill is supported by the Conservation Council of Virginia and many other citizen and conservation groups. The legislation calls for a minimum 5-cent refundable deposit on all beer and soft drink containers, effective July 1, 1977, allowing industry 18 months to adjust to the new lw Basically, the bill is an expansion of the existing deposit system on reusable containers. The deposit is part of the price paid by the purchaser of a beverage and is held by the retailer. When a retailer gets a container back, he returns the deposit, delivers the container to the distributor, and is reimbursed for the deposit and paid a sm all handling fee by th . distributor. The bill also provides for redemption centers, which may be established by retailers or local governments or as private enterprises, to receive contain ers and turn them over to distributors in return for payment of the deposit and handling fees. Our proposal is the first step in discouraging the manufac ture of wasteful throwaways and encouraging the use of refutable containers, which can provide substantial savings for the consumer on every pur chase of beer or soft drinks, DuVal and Waddell arid. This is not only a consumer bill, it is also a measure which w ill conserve energy and natural resources and save ta x e s. the two Senators pointed out. It incorporates"}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Monday. Dec. 8. Virginia <mark>State</mark>  <mark>Senators</mark> Clive DuVal 32nd District"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Monday. Dec. 8. Virginia <mark>State</mark>  <mark>Senators</mark> Clive DuVal 32nd District"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [193.9, 1145.45, 352.77, 1190.75], "bbox_id": "5074afdbe9", "file": "AppomattoxNewspapers_1902-1905a_0560.pdf", "page": 1, "text": "Arkansas offers a novelty in the i graft expose line indicting one of her State Senators forgiving instead j of receiving a bribe."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Arkansas offers a novelty in the i graft expose line indicting one of her <mark>State</mark> <mark>Senators</mark> forgiving instead j of receiving a bribe."}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Arkansas offers a novelty in the i graft expose line indicting one of her <mark>State</mark> <mark>Senators</mark> forgiving instead j of receiving a bribe."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [622.53, 552.46, 765.59, 887.9], "bbox_id": "16955a608f", "file": "AppomattoxNewspapers_1971-1973a_0082.pdf", "page": 1, "text": "and organizations on possible avenues of State action in re storing welfare recipients to self-supporting members of so ciety, ensuring that only those in need of assistance receive it, and otherwise improving the welfare system. The Commission is chaired by Delegate Russell M. Carneal. Also, serving on the Commis sion are  Delegates Carl. E. Bain, Alan A. Diamonstein, Ro bert R. Gwathmey, HI and Ran dall O. Reynolds State Senators William B. Hopkin, Henry E. Howell and David F. Thornton and Grandon OKelly Pender- graft, Jr . Persons interested in ad dressing the Commission at the hearing are asked to notify the Commission co the Division of Statutory Research and Drafting State Capitol, Post Office Box 3-AG, Richmond, Virginia 232- 19, and to submit written copies of their remarks. Commission will hold a public hearing Wed., Oct. 27, 1971 at 10 a.m . in House Room 4 of the State Capitol in Richmond."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Ran dall O. Reynolds <mark>State</mark> <mark>Senators</mark> William B. Hopkin, Henry"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Ran dall O. Reynolds <mark>State</mark> <mark>Senators</mark> William B. Hopkin, Henry"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1739.24, 803.3, 1912.34, 1256.85], "bbox_id": "c737146a04", "file": "AppomattoxNewspapers_1936-1939a_0010.pdf", "page": 1, "text": "Among the distinguished Virginia D mocrars attending t h e Young Democratic barbecue Tuesday were Senator Harry Flood Byrd Congressman A. Willis Robertson Attorney-General A. P. Staples E. R. Combs, Peter Saunders, John Wicker, of Richmond State senators Chas. T. Moses, Chas. E. Burks, William M. Tuck, Morton Goode and Robert Brock Judge Thomas W. Ozlin Judge Hutcheson, Judge Barks dale, Judge Arnold Carter Glass, Jr., Franklin Daniel, Toe Gorman, William Carter, Paul Whitehead, Aubrey Strode, Jr., and Robert Ramsey, of Lynchburg Delegate and Mrs. Lucien Shrader W. H. Overby and Lawrence Thompson William Berry, of Bedford Mayor W C Fitzpatrick, of Farm- ville Marvin L. Gray, of Waverly Mr. and Mrs. W . R , Carlton and J . Aubrey Gilliam Mr. and Mrs. Harrison Zehmer, and Mr. and Mrs. Potter Sterne, of Dinwiddia Mr. and Mrs. T. Emmett Warriner of Lawrenceville W. G. Epps, Jr., Mr. Irby and Mr Chambers, of Blackstone Mr Nelson, of Lunenburg M. E. Blanton and party of ten from Cumberland Delegate Maitland Bustard Miss GenjervievR Bogiess, Guy Hope, John A. Currie and Stuart Eacho, of Richmond Mr. and Mrs. Page Morton, H. B . Ghermside, Sr. and Jr., Sheriff Priddy, Lee Snell, and others from Charlotte county Clerk Louis Crawley of Cumber land Col. Perkins, of Fork Union William A. Watson, Farmville And. others, including Appomat tox and Buckingham officials"}, "highlight": {"text": {"matched_tokens": ["State", "senators"], "snippet": "John Wicker, of Richmond <mark>State</mark> <mark>senators</mark> Chas. T. Moses, Chas."}}, "highlights": [{"field": "text", "matched_tokens": ["State", "senators"], "snippet": "John Wicker, of Richmond <mark>State</mark> <mark>senators</mark> Chas. T. Moses, Chas."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [929.48, 1593.71, 1098.69, 1844.9], "bbox_id": "0f8f61943a", "file": "AppomattoxNewspapers_1954-1955a_0065.pdf", "page": 1, "text": ". s 32-man, bi-partisan le gislative commission, appointed Sat urday by Governor Stanley to re commend a course of action in con nection with the Supreme Court school segregation decision, will o8V? 10 meetinS on Monday Sept. 13. The all-legislator group in eludes 12 state senators and 19 mem bers of the House of Delegates The governors public announce- ment of the groups formation ask- ed the legislators to meet with him at 11 A. M., at Richmond, Sept. 13J  orj??nize and begin its work. The chief executive pointed out that any program relating to the public school system must be con sidered and acted upon by the Gen eral Assembly. Also that the more information of first hand nature that the legislators can obtain, the bet ter equipped they will be to deal with the problem at such time as legislative decisions must be made"}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "group in eludes 12 <mark>state</mark> <mark>senators</mark> and 19 mem bers"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "group in eludes 12 <mark>state</mark> <mark>senators</mark> and 19 mem bers"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [347.3, 790.8, 515.97, 1547.64], "bbox_id": "90b73ce899", "file": "AppomattoxNewspapers_1892-1898a_0413.pdf", "page": 1, "text": "your questions 1st. I am in favor of the free and unlimited coinage of both gold and ilver at the ratio of 16 to 1. 2nd. It I am elected Governor aud a vacancy should occur, by res ignation or otherwise, in either of the United States Senators from this State, I should consider it my duty to appoint a Senator thoroughly in accord with the platfbrm to be adopted at the next Democratic State Convention, which platform I am certain will contain a declara tion in favor of the free and unlim ited coinage of silver. Yours very truly, J. T aylor E llyson . Mr. A. H. Clement, Editor A. aud B. T im es  D ear sir  I suppose it is ueed less to comment on the gubernator- iol contest as far as Appomattox is conceined, for the people of Appo mattox are as sure to select Tyler and Mann delegates to Roanoke as the 10th of June rolls around. But is worthy of comment that Mr. Ellyson has in a recent issue of the Dispatch defined his position on the silver question by declaring himself n favor of the tree and unlimited coinage of gold and silver at the atio of 16 to 1, and is flooding the county with marked copies of the ssne. It is well-known that Mr. Ellyson hesitated to accept the chairmanship of the State Committee because he ra op, osed to the silver plank of the Chicago platform and feared his position would do harm us its chair man. The announcement of his changed iews at this late and critical mo ment in his canvass is a matter open to conjecture. Is-it a vote catcher? If it is it is a leaky one. The man that is elastic enough to be pressed out of his natural attitude is elastic enough to reassume it when the pressure is removed. We prefer a man that stands nat urally and easily on the Chicago platform, silver plank and all a man like J. Hoge Tyler. Four year ago Mr. Tyler was honest enough to declare himself for free silver when it was unpopular md was honest enough to stick to it, and went down to defeat clinging to his honest convictions. Now would it not be wiser in Mr. Ellyson to do the same if he would aspire to be Governor in the future. Very truly yours, X."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "of the United States <mark>Senators</mark> from this <mark>State</mark>, I should consider it"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "of the United States <mark>Senators</mark> from this <mark>State</mark>, I should consider it"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2190.71, 874.18, 2519.6, 966.41], "bbox_id": "c1b109b38f", "file": "AppomattoxNewspapers_1922-1923a_0212.pdf", "page": 1, "text": "V . TEXT OF PU RE FOOD B U T - If It meets approval ent It out. sign name and address and send to your Rep resentative I 11 Congress. Buy two or more publications from which you cut this. Keep one for reference and send the other to one of the U. 8 . Senators from your State. Ask one or two friends to do the same and the chances for Pure Food will be good.  . A BILL"}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "of the U. 8 . <mark>Senators</mark> from your <mark>State</mark>. Ask one or two"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "of the U. 8 . <mark>Senators</mark> from your <mark>State</mark>. Ask one or two"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1899.05, 1337.17, 2225.61, 1528.27], "bbox_id": "ccfa449579", "file": "AppomattoxNewspapers_1954-1955a_0111.pdf", "page": 1, "text": "to the polls. Next Tuesday, this nation will elect 435 U. S. Representatives, 32 U. S. Senators and many state and local officials. These are critical times. The world is in trouble, and every public office should be filled by the most competent, most sincere men and women who make themselves available. The task for next Tuesday is clearly defined it is the individuals responsibility to inform himself about his candidates, make up his mind, and go to"}, "highlight": {"text": {"matched_tokens": ["Senators", "state"], "snippet": "Representatives, 32 U. S. <mark>Senators</mark> and many <mark>state</mark> and local officials. These"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "state"], "snippet": "Representatives, 32 U. S. <mark>Senators</mark> and many <mark>state</mark> and local officials. These"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2141.25, 348.6, 2308.96, 489.39], "bbox_id": "75934ddf1e", "file": "AppomattoxNewspapers_1949-1952a_0457.pdf", "page": 1, "text": "their opposition to this appointment and that a copy of this resolution, attested by the Moderator of the Presbytery, be forwarded by the Stated Clerk of the Presbytery to the President of the United States of America and to the Senators of the State of Virginia. A true copy, TESTE W. Twyman Williams, Stated Clerk of Presbytery. H. Edwin Pickard, Moderator of Presbytery. Adopted unanimously."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "America and to the <mark>Senators</mark> of the <mark>State</mark> of Virginia. A true"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "America and to the <mark>Senators</mark> of the <mark>State</mark> of Virginia. A true"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [301.89, 454.83, 479.05, 2034.26], "bbox_id": "455bd8cac4", "file": "AppomattoxNewspapers_1898-1902a_0270.pdf", "page": 1, "text": "Senator McCorkle on the May Con ference and Current Politics. Senator MeCorkfe writes the fol lowing to the Rockbridge Count News Attention to many affairs bas .de toyed my making some observation, in regard to the May conference the reasons for calling it, its arrestee progress, the attitude of the sign ers aud their purposes in regard ti kindred reforms. While I admire your independent criticism of men and movements- for in a free press and an unstable judiciary, the liberty of the people and the life ot the republic find their surest hope and guarantee, yet l feel sure that your late edi torial criticism of the confereuc. will cause in the minds of man misappreheasion of the motives oi many of the signers. The call was signed by many men of many mindsall agreeing, however, in the necessity for such . movement and divided only as te thers. best plan ot action. They wished to project and prosecute it within party lines, without bring ing in any factor to imperil, by dis tension, party supremacy. They wished to agitate the important issue upon its own merits. The old method of electing U. 8 . Senators by the State Legislaturet was wisely left open, by the fram ers, though au auieuded clause, to any change that after i vents might require, its purpose was to secure equality of voting power umoug tin States. Modern conditions, however, oi political manipulation and self in terest have proved it as nugatory as another clause of the constitution guaranteeing each state against in vasion whose binding force was crushed by a bloody civil war direc ted by the Federal government. It is a common occurrence now for a State Legislature to sit all session and fail to elect a Senator. tBuTfeaViirjfliicBtates right to the appointing power fff the governoi The liberty gaiued in 177oBy people was in 1787 by politicians anxious to perpetuate sectional, frit tered away, checked and lodged so far from the people in boards, legis latures and governors that they the people lost the power, as they surely had the right, to easily re move uegligent officials. The Sen ate has refused so far to pass a reso lution asking for an amendment to elect directly. In legislative bodies so far away from the people as the Senate, and existing by long tenure, there is a tendency in class interests to strengthen themsel ves a g a in s t change. In creating the Senate to represent property and the Huose to represent the people the fathers unwittingly laid our republic in the very mortar of class distinction. Power gravitates towards power and this tendency has followed the Senate through all its changes. The furmers placed the purse the power to raise revenue by taxation in the House the sword the power to protect the people and states in the hands of the President, and the scales of justice the power of arbi tiation between citizens in the Su preuie Court, With capitalism tending to control the industrial wealth of the country and lodging in the Stnate, who holds the purse Who wields the sword? Who dis peuses justice ? Who is sovereign Instead of being a check, as the fathers hoped, on hasty legislation by the House, the Senate thus be comes a very check on the wishes and liberties of the people, holding an almighty vote power with no limit save its own will to its de mauds and privileges. In Englands House of Lords, the model and prototype of the U. Senate, capitalism baBed on beredi lary lauded estates, has fortified itself by statute and precedent an til it can obstruct at will the peo pies demands. The great bill of justice aud home rule for Ireland framed by Gladstone and approved by England, they defeated.  The tendency of sue h bodies to increase their privileges is evident Not long ago the clerk ot the.U. S. Senate sent the writer a pamphlet containing the Senates expenses paid from the contingent fund. The jieople, of course, do not object to paying any expenditures really nec essary. The miscellaneous articles, however, used by Senators makes us pause and wouder. Read hundreds of telegrams, pocket knives, visiting cards, quinine aud lithia tablets, quince seed, hair oil, bromo-caffeine, and other beverages, cuticnra salve, shoe blacking, everything indeed, for the oomfort of the outer-man and for the refreshment of the inner-man and a state funeral free, if earthly luxuries cannot prolong existence. How much longer before family expensas will be charged to the people? That way went Rome in the days of her bloated rotten ness and gaudy pomp, through tesarism arbitrary power to ruin. Snch startling abuse of power and privileges, this was the point of atract aimed at by conservative re formersthe record of the Senate and not the record of any Senator Any attack upon Mr. Martin was ih-enied by them unwise and unnec essary, indeed, it was precluded by t he call itself. The state committee declining to order any plan of pri mary election, the only resources left, was agitation among the people by primary election for or against reform. The signers were left to exercise their freedom of choice be tween men and methods. Tho can didacy of Governor Tyler the first mstance of the kind in Virginia history, alienated many who favored - be movement, and, thereby, without"}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "of electing U. 8 . <mark>Senators</mark> by the <mark>State</mark> Legislaturet was wisely left"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "of electing U. 8 . <mark>Senators</mark> by the <mark>State</mark> Legislaturet was wisely left"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [806.88, 294.46, 971.67, 1017.51], "bbox_id": "c1a01de9f9", "file": "AppomattoxNewspapers_1905-1912a_0212.pdf", "page": 1, "text": "Public sentiment has decided that the completion of the Panama Canal In 191 shall be celebrated with a great International Exposition in which all the nations of the world may participate and the question of where this Exposition is to be held will be settled by Congress at its ap proaching session. New Orleans and San Francisco are contesting for the honor of hold ing this Exposition, and both cities have guaranteed Immense sums of money as an evidence of their ability to finance so great an enterprise. An Exposition worthy of the term Worlds Fair, such as New Orleans proposes to build, will be a great ed ucational movement. Its success as such, however, will depend entirely upon the percentage of our popula tion who can secure its educational advantages, this in turn, depends up on its location, as the time in travel ing , to and from the Exposition, and the cost in railroad and Pullman fares, are the most important factors. Considering these matters, New Orleans claims to being the Logi cal Point for this Panama Exposi tion, seem to be fully substantiated by the following facts New Orleans Is 500 miles from the center of population In the United Estates. San Francisco Is 2,500 miles distant therefrom. Within a radius of 500 miles from New Orleans there are 17,500,000 people. Within the same radios from San Francisco there are only 2,000,000. Within a radius of 1,000 miles from New Orleans, there are 65,000,000. Within the same radius from San Francisco there are only 6,000,000. At an average of 900 mileB from New Orleans, there are 70 of our principal cities with a combined population of 20,000,000. Averaging 900 miles from San Francisco there are only 8 large cities, with a com bined population of just 1,000,000. The average distance of all these cities to New Orleans is 792 miles, to San Francisco 2,407 miles. Over 75 per cent, of the people of the United States could go to an Exposition there at an average ex pense for railroad fare of 12.50, as against an average of 37.50 to the Pacific Coast and for several mil lions of our people, the Pullman fare and Dining Car expenses alone, for a trip to San Francisco, would amount to more than all their trans portation expenses for a trip to New Orleans. This Is an important public ques tion to be settled by Congress at the session which convenes in December. Many of our readers will wish to visit this Worlds Panama Exposi tion, and If held in New Orleans a great many more could spare the time and money for the -trip than could go to San Francisco. There fore, we urge our readers to write to the two senators from this State and the congressman from this district, requesting them to support New Or leans in the contest."}, "highlight": {"text": {"matched_tokens": ["senators", "State"], "snippet": "write to the two <mark>senators</mark> from this <mark>State</mark> and the congressman from"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "State"], "snippet": "write to the two <mark>senators</mark> from this <mark>State</mark> and the congressman from"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1340.84, 875.37, 1649.66, 1057.09], "bbox_id": "81fd722717", "file": "AppomattoxNewspapers_1918-1922a_0559.pdf", "page": 1, "text": "priate money for the draining of suid lake to such an extent as to reclaim their flooded lands, which if done will, to a very great extent, destroy the beauly and benefits of said lake  Therefore be it Resolved by the legislature of the State of South Dakota, That the con gress of the United State and oar senators and representatives In con gress be, and hereby are, memorial ized and petitioned to appropriate a reasonable amount of money to indem nify andTelmlntTSe The owners of said flooded lands, and that no action be taken or money appropriated for the draining or lowering of said lake. To Group the Federal Government Jobs"}, "highlight": {"text": {"matched_tokens": ["State", "senators"], "snippet": "gress of the United <mark>State</mark> and oar <mark>senators</mark> and representatives In con"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "senators"], "snippet": "gress of the United <mark>State</mark> and oar <mark>senators</mark> and representatives In con"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2172.25, 1113.06, 2339.48, 1610.76], "bbox_id": "a4eebf34a6", "file": "AppomattoxNewspapers_1926-1933a_0327.pdf", "page": 1, "text": "dresses lauding the structure as an aid In perpetuating the 114 years of peace between the United States and ths Dominion. S IR RONALD LINDSAY, British un der secretory of state for foreign affairs, has been selected as ambassa dor to Washington to succeed Sir j Esme Howard, who retires from the j diplomatic service early next year. Sir Ronald to well known In this country and bto wife to an American,  a daughter of the late Colgate Hoyt of New York. Nelson Johnson, assistant secretory  of stoto in charge of far eastern  affairs, was appointed by President Hoover to be minister to China to succeed John Van A. MacMurray. re signed. He to a career diplomat who has served In China and to re markably well posted on the entire far eastern situation. William Phillips has resigned the post of American minister to Canada, to the deep regret of President Hoover and the State department He was offered another diplomatic post but wished to return to the United States on account of his children. S ENATOR BINGHAMS theory that the senate lobby committee was packed against the Republican tariff bill received a measure of substantia tion when Its chairman, Senator Cara way, asserted that Its labors would soon be concluded. For of all tho lobbies operating In Washington, tittle or no attention has been pale by the committee to any others than those whose concern Is the tariff. Joseph R. Grundy, veteran lobbyist for Penn sylvania interests, was recalled by the committee last week and Mr. Caraway demanded that he name the senators from backward state who, he con tended, have too much voice In fixing the policies of the nation. Mr. Grundy said that on reflection he had de cided this would he Improper and un becoming. and Mr. Caraway called"}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "that he name the <mark>senators</mark> from backward <mark>state</mark> who, he con tended,"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "that he name the <mark>senators</mark> from backward <mark>state</mark> who, he con tended,"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.77, 350.76, 1853.96, 1000.47], "bbox_id": "7376586f79", "file": "AppomattoxNewspapers_1926-1933a_0439.pdf", "page": 1, "text": "than the Poaching and practice of religious pre judice and hate. This campaign has developed into this to a great extent, and I dont believe the truth is being told in many instances. We hear it from the pulpits, the public rostrum andi read it in the papers. I think every man ought to be allowed to worship as he pleases. Our told give us that right, I and if he is a good citizen other- wise, honest and capable, why 8hould he not be entrusted with public office. .. When it comes to the prohibi-l , n Question, I am dry and have always been, but I dont think there is much difference between the candidates, and certainly not I between the party platforms as I read them. I dont think the! way the law has been enforced by the republican administration that it could be any worse un-i der any other administration. I believe that honesty,truthfulness integrity and efficiency are more important than whether a man is wet or dry in his personal! views. The Democratic Party has al-1 m be!n the Party of the south and for the South. It has given us the progress and de velopment we now have, and in my openion is the hope of the south in the future. Our state leaders are all splendid men arid i dry men, capable and fearless, honest and of high character. I am content to continue to follow their leadership, the leadership of Governor Byrd, Senators owanson and Glass, State Sena-1 tors Mapp and Layman, the authors of our prohibition laws, and expect to remain loyal to the. Democratic Party and its princi- Plesand support all the nominees of the party. I hope riiy friends and neighbors will do so too. Respectfully, S. E. Anderson."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "leadership of Governor Byrd, <mark>Senators</mark> owanson and Glass, <mark>State</mark> Sena-1 tors Mapp and"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "leadership of Governor Byrd, <mark>Senators</mark> owanson and Glass, <mark>State</mark> Sena-1 tors Mapp and"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1048.28, 632.82, 1333.75, 821.46], "bbox_id": "8e1e5cc585", "file": "AppomattoxNewspapers_1908-1909a_0518.pdf", "page": 1, "text": "Senator Samuel L. Ferguson. last week came out at the state T p a n h p r a A iiAn capitol with an endorsement oi  1  d C Iie rs A C lO pt Harry Flood Byrd for the Dem ocrafic nomination for presi dent- Hes upright, down right and all right, declared the senator. Mr. Ferguson is chairman i the powerful-roads commit tee of the senate and ä member of other important committees Speaking yesterday in the sen a,te he advocated a resolution calling for ten per cent cut in senators salaries from the state. The resolution was un animously passed."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "per cent cut in <mark>senators</mark> salaries from the <mark>state</mark>. The resolution was un"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "per cent cut in <mark>senators</mark> salaries from the <mark>state</mark>. The resolution was un"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1051.67, 652.93, 1211.36, 842.27], "bbox_id": "02ff617b14", "file": "AppomattoxNewspapers_1926-1933a_0518.pdf", "page": 1, "text": "Senator Samuel L. Ferguso last week came out at th.e statt capitol with an endorsement oi Harry Flood Byrd for the Den ocrafjic nomination for pres dent- Hes upright, down right and all right, declare the senator. Mr. Ferguson is chairman of the powerful roads comml. tee of the senate and a membe of other important committee Speaking yesterday in the se ate he advocated a resolution calling for ten per cent cut in senators salaries from the state. The resolution was un animously passed."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "per cent cut in <mark>senators</mark> salaries from the <mark>state</mark>. The resolution was un"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "per cent cut in <mark>senators</mark> salaries from the <mark>state</mark>. The resolution was un"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [317.73, 835.4, 494.08, 1785.48], "bbox_id": "3bb7e00895", "file": "AppomattoxNewspapers_1902-1905a_0237.pdf", "page": 1, "text": "ing on a solitary, bnt successful fiUibuster. Should the bill now pass, as Is probable, the contest for the Com- missionersbip, which is to pay a salar of 2,400 a yr, it is thought will be between Ool Button and Mr. E. G. Akers, of Lynchburg, former ly chief clerk to the Railroad Com- missioner. Senator Rbleger and Senator Dat- teson are at work on a general pri mary bill, which will shortly be presented. It is understood that this will be even more stringeut in its provisions than the Barksdale bill. Politicians who I ook below the surface think that the intent of the bill is to make primaries for United States Senators a matter of state law, to that, if the opponents i of the primary system should be in the majority at the Democratic state convention this summer, it will be ont of their power to nullify the action of the Norfolk Convention, of 1901 which provided for primar es. If the bill, when presented, is seen to buva this effect, a lively fight will be precipitated, 9 s it is no s cret that the enemies of tb? primar y system are extremely active and ng gressive. Though the Oyster himself does no talking, he is much talked aliout by Virginia legislators, and the pres ent General Assembly will pove no exception to the rule. Messrs. W. D. Caldwell and E. C. Jordan are liimly tP make another vigorous at tempt to break the Baylor Survey. The bill will be before the bod  within teu days, and the lobby jyjll again be full of tidewater people, some strongly forothers as strong ly againstthe proposed legislation. The expected happened at the Democratic joint caucus last Wednesday when Oapt, J H. OBan- non, the incumbent, defeated Mr- Horace A. Hawkins, for Public Printer, by a majority of about 40 votes but jt was the unexpected, on the other hand, which happened when the fr ends of Bop. 3 M. Newhouse succeeded in postponing the contest for Register of the Land Office. The close vote, 56 to 53, indicates that Col. Jno. W- Richard son, the incumbent, had a hard fight for re-eleoton. It is now said that a combination has been effected be tween the friends of S. M. Donald, J. N- Brenamuc mid Col. Newhouse, and that it may result in the defeat of Col, Richardson. Jfotb sides are very active nd claim tfie victory, Ihe caucus will he bpd Wednes day night, and that time .successor to tho late Hon. J. F. Hubbard, judge of the fourteenth oircuit will he .elected. The contest has prac tically narrowed down between Hon. Manly H. Barnes, pf New Kent, and ex-Senator D. Gardiner Tylor, of Charles City. Both sides tone pamphlets from day to day, and the contest is grpwing more and more interesting. The United States Senatorship has some little bearing .on this contest, as Mr- Rarpes is known to be a Martin .man, while Mr. Tyler is apti-Mrtip. Rut tRis will uot effect thecopest except as to some uncommitted new members who may allow the r senatorial pref- erac.ce to sway them, Is many strong Martin men aie known to be com mitted to Mr, Tyler, while many anti-Martin men are supporting Mr. Barnes. Those who like fair pjay in politics pre glad to see that this is the case. The Democratic caucus may have another judgeship to award in S short whileperhaps before this letter is in prints Judge B. A"}, "highlight": {"text": {"matched_tokens": ["Senators", "state"], "snippet": "primaries for United States <mark>Senators</mark> a matter of <mark>state</mark> law, to that, if"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "state"], "snippet": "primaries for United States <mark>Senators</mark> a matter of <mark>state</mark> law, to that, if"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [563.03, 929.91, 733.46, 1049.16], "bbox_id": "13724b850f", "file": "AppomattoxNewspapers_1947-1949a_0261.pdf", "page": 1, "text": "What is the rate of political illiteracy in the United States? The .sorrowful answer must be High. Public opinion polls have indicated that fewer than half of American adults know how many United States senators there are from each state. Half of them have never heard of Harold E. Sfassen. Two- thirds of them dont know where Greece is, and 40 per cent dont know who General Franco is."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "how many United States <mark>senators</mark> there are from each <mark>state</mark>. Half of them have"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "how many United States <mark>senators</mark> there are from each <mark>state</mark>. Half of them have"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [677.76, 356.2, 838.24, 949.4], "bbox_id": "393bf3b8db", "file": "AppomattoxNewspapers_1922-1923a_0408.pdf", "page": 1, "text": "Washington Special.  A settle ment of the controversy in the Paci fic Coast States arising over the ex clusion of Japanese pupils from pub lic schools has been reached. Mayor Schmitz and the members of the San Francisco school board gave assurance to the President that if the amended bill becomes a law they will abolish the oriental schools in San Francisco and will admit Ja panese pupils to the white schools. These agreements were arrived at after conferences between the Presi dent and his friends in the Senate regarding the Immigration Bill, and after two conferences between Presi dent Roosevelt and Secretary Root on one side and Mayor Schmitz and other visitors from San Francisco on the other. After a conference with the President Mayor Schmitz gave out this statement We have come to a satisfactory understanding upon the assumption that Congress will pass the amend ment to the Immigration Bill intro duced February 13. The filibustering tactics on the Im migration Bill in the Senate were brought to a close by assurances from the White House that there would be no ruling on the practice, inauguarated by South Carolina, of states importing foreign labor. Sev eral Southern senators believed that the new bill would prohibit further importations of foreign labor by states. Both Messrs. Bacon and Till man disclaimed any intention to con duct a filibuster, and many other Democratic senators stated that even if the Georgia Senator and the South Caolina Senator did entertain such a purpose theywould not follow them. During the debate on the Immigra tion Bill in the Senate a member of the Cabinet, Who was on the floor, told senators that tbe subject of state immigration had received the atten tion of the Cabinet at its meeting and that there had been a general conclusion that the terms of the bill would not require a new ruling in the South Carolina case. Instead of the Senate discussing that clause of the bill which relates to the Japanese situation, and which is really the only reason why the Im migration Bill has been resurrected, the entire day was devoted to a clause in the bill which some of the Southern senators believed will make it impossible for a state to bring im migrants from Europe. The debase degenerated simply into a wrangle between Senator Lodge, representing the cotton-mill owners of Massachu setts, and Senator Tillman, represent ing the cotton-mill owners of South Carolina."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "on the floor, told <mark>senators</mark> that tbe subject of <mark>state</mark> immigration had received the"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "on the floor, told <mark>senators</mark> that tbe subject of <mark>state</mark> immigration had received the"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [624.28, 570.01, 768.82, 927.0], "bbox_id": "de819159eb", "file": "AppomattoxNewspapers_1971-1973a_0105.pdf", "page": 1, "text": "The 1971 Christmas Seal Campaign opened in Virginia on November 10 with the presenta tion of this years Christmas Seals to Senator William B. Spong, Jr., and Senator Harry. F. Byrd, Jr., in Washington, D. C. Visiting the senators offices to present Christmas S e a l s were the states H o n o r a r y Christmas Seal C a m p a i g n Chairmen, Mr. and Mrs. David Kilgore and Muriel McAuley of the Barksdale Theatre in Han over. Mrs. James C. Rea, Jr., president of the Virginia Tub erculosis and Respiratory Dis ease Association, accompanied the chairmen. Introducing the chairmen to the U.S. Senators, Mrs. Rea said, Our state Christmas Seal Campaign Chairmen represent the millions of volunteer work ers throughout the nation who generously give of the time all year-round to make the annual Campaign possible. Without their efforts, TB- RD associations in Virginia and the nation would find it diffi cult to function. Citizens have always recognized the import"}, "highlight": {"text": {"matched_tokens": ["Senators", "state"], "snippet": "chairmen to the U.S. <mark>Senators</mark>, Mrs. Rea said, Our <mark>state</mark> Christmas Seal Campaign Chairmen"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "state"], "snippet": "chairmen to the U.S. <mark>Senators</mark>, Mrs. Rea said, Our <mark>state</mark> Christmas Seal Campaign Chairmen"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [154.82, 978.2, 321.35, 1169.34], "bbox_id": "a90c4d0186", "file": "AppomattoxNewspapers_1905-1912a_0292.pdf", "page": 1, "text": "right of this government to pass an xcluslon law. Friends of the treaty explained  that the diplom atic notes accompanying it definitely pledged th e Japanese government to prevent an Influx of undesirable coolies through the rigid scrutiny of all pass ports. M ust Have Passports. An alien without a passport would, of course, be liable to deportation.  The California senators, it is said, I became satisfied early that the change would not menace the labor ltuatlon in their state. Several othet W estern senators became alarm ed, however, at what seemed to them  unseemly haste in pressing the S en- ate to act. They desired sentim ent, to crystallize in their state and there- fore prevented action for three days, i"}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "labor ltuatlon in their <mark>state</mark>. Several othet W estern <mark>senators</mark> became alarm ed, however,"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "labor ltuatlon in their <mark>state</mark>. Several othet W estern <mark>senators</mark> became alarm ed, however,"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [815.48, 1135.94, 979.86, 1390.39], "bbox_id": "37fa490c66", "file": "AppomattoxNewspapers_1949-1952a_0367.pdf", "page": 1, "text": "Republicans, Please, Not Ones to Take Advantage PROVIDENCE, R. I.Republican senators in the Rhode Island state senate recently had an opportunity to prove the stuff of which they were made. A baby broke the 22-22 Demo cratic-Republican tie when the legis lature was straining hard for an adjournment and with many impor tant measures pending. Sen. Florence K. Murray, Dem ocrat, Newport, rose to inform her colleagues that she was going to the Lying-In hospital. The next morning she gave birth to a fine baby boybut the Demo crats had lost the deciding vote by her absence. While researchers were thumbing the record books to decide the prop er procedure, William J. Thomp son, chairman of the Republican central committee, said No Re publican gentleman would take ad- vantae of this situation."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "Advantage PROVIDENCE, R. I.Republican <mark>senators</mark> in the Rhode Island <mark>state</mark> senate recently had an"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "Advantage PROVIDENCE, R. I.Republican <mark>senators</mark> in the Rhode Island <mark>state</mark> senate recently had an"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [844.8, 1270.44, 998.78, 1580.63], "bbox_id": "0cc72b0bb3", "file": "AppomattoxNewspapers_1915-1918a_0271.pdf", "page": 1, "text": "Kentucky.President Wilsons prob able majority is about 10,000. Ken tuckys entire delegation in Congress has been re-elected. Georgia.130,000 votes were cast in this State, of which over 100,000 were Democratic. Hugh Dorsey, Democratic nominee for Governor,-the entire Con gressional delegation and all county officers as usual went to the Demo crats. Alabama.Wilsons majority in this State is 60,000. In 1912 it was 50,000. Arkansas.Wilsons majority Is 80,- 000. W. F. Kirby, United States Sen ator is re-elected. Montana.President Wilson carried this State by 20,100. Senator Myers is re-elected and the entire Democratic ticket is successful. , Indiana.This State has been car ried by Hughes by more than 30,000 plurality, and tWo Republican United States Senators have been elected. Wisconsin.The State has been carried by Hughes by more than 20,- 000. Robert SI. LaFolIette Is elected United States Senator.- Illinois.Illinois is back in the Re publican column. Hughes has carried the State by at least 150,000. Frank O. Lowden, for governor, has defeated Gov. Edward F. Dunne, the Democratic incumbent, by about the same figures."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "tWo Republican United States <mark>Senators</mark> have been elected. Wisconsin.The <mark>State</mark> has been carried by"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "tWo Republican United States <mark>Senators</mark> have been elected. Wisconsin.The <mark>State</mark> has been carried by"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1492.07, 567.53, 1656.18, 677.13], "bbox_id": "2108da6a9c", "file": "AppomattoxNewspapers_1926-1933a_0323.pdf", "page": 1, "text": "IUlnols Is expected to give Mrs. McCormick a big vote, partly be cause the state Is dissatisfied with masculine senators, as a class, con vinced that they have not done much  lately. Mrs. Schleeinger, formerly of Chicago, sayB so. She ought to know. Her grandfather was Joseph Medlll. She should be In the senate, by the way. To say that she has as much abUlty ae any one of the three rustling Ruths, is putting it moderately."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "partly be cause the <mark>state</mark> Is dissatisfied with masculine <mark>senators</mark>, as a class, con"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "partly be cause the <mark>state</mark> Is dissatisfied with masculine <mark>senators</mark>, as a class, con"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [470.41, 761.14, 631.05, 1239.09], "bbox_id": "2585d721f8", "file": "AppomattoxNewspapers_1912-1915a_0158.pdf", "page": 1, "text": "Washington.Congress, in all prob ability, will yield to the protests of foreign nations against the provision in the Underwood Tariff Bill granting a five per cent, tariff discount on im ports in American-owned or controlled vessels. That the provision can be-eliminated from the bill without harm and that Congress has no desire to insist upon legislation that will be embarrassing to foreign nations, or interfere with treaty obligations, was admitted by ad ministration leaders who are in charge of the bill. President Wilson is said to have intimated that he would not object to having the clause eliminated. This action, it was reported, would be recommended by the Senat Fi nance Sub-Committee, headed by Sen ator John Sharp Williams, which is considering the administrative features of the bill. The sub-committee also will seek to modify another clause which compels foreign merchants to submit their books to an American agent in cases of disputed valuations and provides as a penalty for refusal that the goods be excluded from entry. Germany, France and England have made strong protests against this clause and assurances were given that an effort will be made to eliminate the objectionable features. Two important conferences were held on the foreign protests. One was between Senator Simmons, chairman of the Finance Committee, and Secre tary Bryan and John Bassett Moore, counsellor of the State Department. The other conferees were Senators Williams and Shively, of the Finance Committee, and Representative Peters, of Massachusetts, who had charge of the administrative section of the tariff bill for the House Ways and Means Committee. It was reported that the State De partment held it to be unquestionable that the five per cent, debenture clause violated foreign treaties. During the conference protests against the clause from eight nations were read."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Moore, counsellor of the <mark>State</mark> Department. The other conferees were <mark>Senators</mark> Williams and Shively, of"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Moore, counsellor of the <mark>State</mark> Department. The other conferees were <mark>Senators</mark> Williams and Shively, of"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [320.4, 1791.1, 479.98, 1980.55], "bbox_id": "03c4ca110d", "file": "AppomattoxNewspapers_1898-1902a_0298.pdf", "page": 1, "text": "The Senate last week killed the resolution passed some weeks since by the House for a constitutional amendment makitig United States Senators elective bv popular vote. Thirty-four State Legislatures have! asked for such an amendment. So far as we can learn from the Con gressional Record, only two Senators Ber-y, of Arkansas, and Butler, of North Carolina, showed friendship for the measure. Seuators Pettus, Hoar, and Chandler were actively hostile, and most of the others were non-committal. The people will in sist upon popular election of U . S."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "amendment makitig United States <mark>Senators</mark> elective bv popular vote. Thirty-four <mark>State</mark> Legislatures have! asked for"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "amendment makitig United States <mark>Senators</mark> elective bv popular vote. Thirty-four <mark>State</mark> Legislatures have! asked for"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [915.07, 334.2, 1085.94, 677.1], "bbox_id": "88b4b658b3", "file": "AppomattoxNewspapers_1955-1957a_0143.pdf", "page": 1, "text": "Tampa, Florida.- Afer a few weeks of Grapefruit play, there are several observations worthy of men tion on the twelve teams now train ing in the Sundshine State. They are First, the Washington Senators showing thus far indicates both the New York Yankee and thé Boston Red Sox got the best of the Nats in trades over the winter. The Senators, once again trading established starstheir only top stars, you might say, received a mass of youthful baseball flesh none of which has yet turned into a great ball player. Bost o f, the youngsters passed off on Washing ton dont even look like future stars. Since Washington finished last n 1955, you can figure it from here. The Detroit Tigers, supposedly packing plate power this year, with the league batting champion and several coming hitters, have been , surprisingly clawless at the bat. The Tiger pitching has been better than fit might have been, but the Ben- gals are weak on punch at the plate. A1 Kalines absence from the lineup may be partly responsible, . but cannot be credited with all the  glowing weakness being shown by the Tigers."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "ing in the Sundshine <mark>State</mark>. They are First, the Washington <mark>Senators</mark> showing thus far indicates"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "ing in the Sundshine <mark>State</mark>. They are First, the Washington <mark>Senators</mark> showing thus far indicates"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [715.45, 1417.98, 879.57, 1488.82], "bbox_id": "12c30ad414", "file": "AppomattoxNewspapers_1905-1912a_0317.pdf", "page": 1, "text": "P la n s to Prevent D eadlocks. W ashington, D. C. A bill provid ing for the election of United States Senators by a plurality vote of State Legislatures was introduced in the I Senate by Senator Root, of New  York. The purpose of the measure is to prevent deadlocks in elections."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "election of United States <mark>Senators</mark> by a plurality vote of <mark>State</mark> Legislatures was introduced in"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "election of United States <mark>Senators</mark> by a plurality vote of <mark>State</mark> Legislatures was introduced in"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [542.15, 594.22, 704.83, 923.12], "bbox_id": "9b0c610686", "file": "AppomattoxNewspapers_1933-1936a_0451.pdf", "page": 1, "text": "I t is too ejarly to discuiss tihe issues at stake next November, but let us cite you three reasons why you should pay your Capitation tax at once so you will be eligible to v o te I W F rst, the New Deal has brought benefits to this county in greater volume ithan ever known b efo re. O ur needy have been, cared f o r . O ur unemployed have been given jobs O ur farm ers have seen the glorious reality of better d ay s. Oui business men saw the gloom of 32 become the golden harvest of 36. The New Deal has rem em bered Ap pom attox, and we are b etter off be cause Franklin Delano Roosevelt has been in the W hite H ouse. Appo m attox county will be b etter off if he stays th e re , If there is gratit ude in the hearts of our people, then we m ust give him a big vote in N ovem ber. T hat requires th at poll taxes be paid now . Second, th a t  Grand Man of Vir ginia ___ CARTER G LA SS------is up for reelection in N ovem ber.A nd surely you w ant to give him a vote of confidence. Virginia is generally adm itted to have the two ablest sen ato rs of any state in the union in C arter Glass and H arry Flood Byrd, They are more than senators, they are Institutions in our state and our"}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "They are more than <mark>senators</mark>, they are Institutions in our <mark>state</mark> and our"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "They are more than <mark>senators</mark>, they are Institutions in our <mark>state</mark> and our"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [438.71, 771.68, 601.39, 962.12], "bbox_id": "162d473445", "file": "AppomattoxNewspapers_1952-1954a_0048.pdf", "page": 1, "text": "c HANCF.S for F E P C  e note with interest that leading p , , ibliunns iinnoui icímí Monday that the best chance to get a FEPC with foree behind it, was to elect the Eisenhower-Nixon ticket in Nivem- ehr. Sixteen GOP officials, incl uding a goivernor, and setreral senators and couppressmen issuec1 a strong state- ment saying the Republican plat- foni i means that FEPC withi en- foreernerst powers and similar laws will be accelerated by a Repulilican vietery. Tlhis announcennint should 1ie of inte rest to the former Democratic newspapers and party members who eit hiir have or are considering bolt- ing the Democratic party. We i-all it"}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "a goivernor, and setreral <mark>senators</mark> and couppressmen issuec1 a strong <mark>state</mark>- ment saying the Republican"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "a goivernor, and setreral <mark>senators</mark> and couppressmen issuec1 a strong <mark>state</mark>- ment saying the Republican"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [195.85, 360.73, 417.17, 780.82], "bbox_id": "f899c896ff", "file": "AppomattoxNewspapers_1902-1905a_0031.pdf", "page": 1, "text": "Washington, D. C. Special. Sec retary of State Hay, for the United S tate, and Sir Michael H. Herbert, Ambassador of Great Britain, for his country, signed at the residence of Sec setary Hay, a treaty providing for the Adjustment of the Alaskan boundary Bùputc between the United States and C leat Britain. This may have a very important bear ing on the Venezuelan question, leading to a weakening of the alliance between Germany and Great Britain. The greatest secrecy has been main tained by the State Department relative to die negotiations. Western Senators Bave been consulted by the President and Secretary Hay, and it is believed that the term s of the treaty now signed will meet with the approval of those most inter ested. The Alaskan boundary is at pres ent governed by a modus vivendi agreed on by Great Britain and the United States on October 20, 1899. The basis arranged for the adjustment o f the dispute is that the entire ques tion shall be submitted to a mixed com mission of six members, three of whom will be chosen by the United States and three by Great Britain. This even num ber of commissioners has been chosen Vo that there will be no odd member who could cast the deciding vote and actually settle the entire question. To any different arrangement the State De partment feels assured the _ Western States would not agree, and it is also felt by Sir Michael Herbert that it would he opposed by Canada. O f course, the State Department and Ambassador Herbert see the possibility o f a deadlock in the commission. The treaty, besides providing for the apnointment of this commission, stipu lates that the commission shall begin its Vhtings as soon as the treaty is ratified. A t the State Department assurances have been received from prominent S e n a - ___ __ tors cognizant of the terms of the treaty Fathers inPariV."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "main tained by the <mark>State</mark> Department relative to die negotiations. Western <mark>Senators</mark> Bave been consulted by"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "main tained by the <mark>State</mark> Department relative to die negotiations. Western <mark>Senators</mark> Bave been consulted by"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [622.31, 1463.82, 1100.25, 1831.18], "bbox_id": "58db5d1c64", "file": "AppomattoxNewspapers_1898-1902a_0386.pdf", "page": 1, "text": "The State is f,fd th  Me- lation as to the possibility of his can- cans. Late return didacy and his chances for one of the Klnley s plurality will be fully 20 000  la thP 8enate. Republicans claim a gain of two lou , ________ gressmen. j West Virginia. Colonel Durbin, the Republican tu-. lection In West Virginia was bernatorial candidate, Is running cios-  ss presidential Electors, four P ___ ______ to the national t eket. j Congressmen, State officers, 13 State probability in favor of Fusionlsts. Iliiwte ! Senators, all of the members of the Illinois.  House of Delegates and county officers. McKinley has carried Illinois by a j The Legisiature chosen will elect a large majority. Hts plurality win , states Senator to succeed Hon. probably be 100,000. g g_ Elkins. Republican. The State Samuel Alschuler, Democratic can- j ticket8 are headed for Governor by didate for Governor, is probably j John H Holt Democrat, and A. B. beaten by a close vote. He ran far  White, Republican. Of the 13 hold- ahead of his ticket. .  over Senators seven are Democrats ---- ----------------- U -.-. - - The surprise of politicians is the and gjx RepubHcas. The State vote bama. His majority will be fully 7o, enormous vote cast for McKinley in , pTObablyclose and the signs are that 000. The nine Congressional districts Chicaeo which Chairman Jones, McKinjey wni win by a small majority return Democratic Representatives, in Mayor Harrison and others had claim- and that vvhite will carry off the Gub- 7our 0f the districts there was no oppo- ed to be Democratic. The total i ernatorial prixe. j sition to the pemocratic nominees, of this city was McKinley, 180,970  chairman Dawson, of the State Re- j fn the Fifth district, where the fight Rrvan 172 524 Woolley, 3335 Debs, i uubUcan Committee, claims the State j for the Democratic nomination was 6022 Barker, 189 Maloney, 295 Ellis,  for McKinley by 17,000 plurality. j very bitter, and extended o  r several 90 McKinleys plurality, 8446.  --------- - 1 months, it was feared the disaffection 9UThere is a great likelihood that the j North Carolina. ot Democrats might affect the result, Republicans will lose four Congress-, ,fhe jeetton to North Carolina was but Thompson Dem. was elected mor, inpindine William Lorimer, the  f0!r presidential electors and 9 Con- over KUstead by 12,000 majority,which gressmen. The Legislature, on which makes a contest Improbable. will devoive the election  í a  South Carolina, to United States Senator Marion But ler Populist, was chotan at the Au gust election and is largely Democrat ic A Democratic primary was also held to nominate a Senator, the candi dates being Hen. F. M. Simmons and Gen. Julian S. Carr. Returns Indicate that Bryan s ma jority in North Carolina will approxi mate 30,000 and that the Democrats have elected .ght and the Republicans one Congressman. The Democratic candidates in all the other districts arc certainly elected, in most cases by large majorities."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Congressmen, State officers, 13 <mark>State</mark> probability in favor of Fusionlsts. Iliiwte ! <mark>Senators</mark>, all of the members"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Congressmen, State officers, 13 <mark>State</mark> probability in favor of Fusionlsts. Iliiwte ! <mark>Senators</mark>, all of the members"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [494.11, 1437.42, 689.81, 1549.67], "bbox_id": "748c277193", "file": "AppomattoxNewspapers_1912-1915a_0305.pdf", "page": 1, "text": "The Senate Committee on Public In stitutions and Education voted to re port favorably the bill introduced by Senators West and Walker, authoriz ing the State Female Normal School at Farmville to change its name to the ! sinned, State Female Normal College foi Women, and empowering its board of trustees to include In the curriculum a four-year college course of standard grade, which shall be both cultural and vocational."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "the bill introduced by <mark>Senators</mark> West and Walker, authoriz ing the <mark>State</mark> Female Normal School at"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "the bill introduced by <mark>Senators</mark> West and Walker, authoriz ing the <mark>State</mark> Female Normal School at"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [262.29, 1543.46, 421.04, 1779.81], "bbox_id": "cefc3c7e98", "file": "AppomattoxNewspapers_1902-1905a_0157.pdf", "page": 1, "text": "The old war-horse last week  nickered in favor of the re-elec tion of Senator Thomas S. Martin. The old hoss says, however, that he has for more than ten years favored the election of United States Senat ors by the direct vote of the people. Failing to get this reform, he favors their nomination by a State primary. He regrets to believe that Senators Daniel and Martin are opposed to both of those methods. Xf alive in 1905, he intends to have a primary in this district, even if he has to pay for it himself. Should the primary show a change of public sentiment unfavorable to Mr. Martin, the hoss will obey the will of the majority, and vote for Mr. Martins opponent. That is génuine democracy."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "their nomination by a <mark>State</mark> primary. He regrets to believe that <mark>Senators</mark> Daniel and Martin are"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "their nomination by a <mark>State</mark> primary. He regrets to believe that <mark>Senators</mark> Daniel and Martin are"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [732.93, 317.4, 983.31, 405.4], "bbox_id": "0b6c6ac650", "file": "AppomattoxNewspapers_1952-1954a_0040.pdf", "page": 1, "text": "the av erage Cltizen j ust does not  know much allout his governm ent. Avon MillS, Va., Two-tl irds of all per sons who ail- Domonions scenic ed to vote in the last presidential ceive 1 a me odie electio n, do not know the name of August whe i the either Unite j States Seinitor from Festival beg ns its their state. n ly four out of every Sunday a fit moon ten even kmW that iach state has sylvan glen of Av two senators i ington, Va."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "even kmW that iach <mark>state</mark> has sylvan glen of Av two <mark>senators</mark> i ington, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "even kmW that iach <mark>state</mark> has sylvan glen of Av two <mark>senators</mark> i ington, Va."}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1642.52, 577.83, 1813.13, 626.23], "bbox_id": "ddb9c3020c", "file": "AppomattoxNewspapers_1943-1947a_0363.pdf", "page": 1, "text": "State Iegislature may cut auto JitiBsssuJto- Southern senators tie-up action on FEPC bill."}, "highlight": {"text": {"matched_tokens": ["State", "senators"], "snippet": "<mark>State</mark> Iegislature may cut auto JitiBsssuJto- Southern <mark>senators</mark> tie-up action on FEPC bill."}}, "highlights": [{"field": "text", "matched_tokens": ["State", "senators"], "snippet": "<mark>State</mark> Iegislature may cut auto JitiBsssuJto- Southern <mark>senators</mark> tie-up action on FEPC bill."}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1990.34, 916.34, 2155.34, 1150.04], "bbox_id": "00a5121b49", "file": "AppomattoxNewspapers_1933-1936a_0382.pdf", "page": 1, "text": "Virginias long anticipated fight over an old age pension plan began n the state senate with the ill troduetion by four senators of an old age assistance program calling for an appropriation of 875,000 for the two years beginning July 1. This step followed senate finance action in postponing until later the action on Governor Peerys re commendation to defer action for years pending additional study. The pension plrn was introduced, jointly by senators E.R.Fulley and Gordon Ambler, of Richmond S . B. Colman, of Fredericksburg and Major M. Hilliard, of Portsmouth. It would allow monthly payments to persons 65 and over, not to exceed 30 a month, including federal help. Recipients would have to be persons with no income or employment, not inmates of state pr .ity instit utions, and residents of Virginia for fivle years preceeding appli cation for the pension."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "plan began n the <mark>state</mark> senate with the ill troduetion by four <mark>senators</mark> of an old age"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "plan began n the <mark>state</mark> senate with the ill troduetion by four <mark>senators</mark> of an old age"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1847.05, 438.04, 2017.8, 799.14], "bbox_id": "87055fdb24", "file": "AppomattoxNewspapers_1939-1943a_0041.pdf", "page": 1, "text": "program recommended by the state board of education and the. Virginia education association. Other points are free textbooks and a 20 min imum average salary per teacher unit. fThe proposed retirement sy stem in the bill, raising the mini mum retirement allawance j from 500 to 1,000 a year, would pro vide for voluntary memiiirship of all present teachers and compulsory membership for those entering the school system after enactment of the law. It would make full retire ment allowance for .he present pen sions ranging up to 500. Road Study CoTnmIison Embodying the recommendations of the state road study commission, a b.ll for the consolidation of the primary and secondary road systems of the state has been introduced in the senate by Senators Weaver, Va- den and Wright. It provides a dis cretionary fund of 2,000,000 to be spent without regard to construction districts. Senator Weaver has sta ted that a provision would be add ed to the measure, calling for the expendtire of not less than 7,000,- 000 each fiscal year on farm-bo-mar ket roads. The new plan, set up in the bill, will make it possible for the state highway commission to al locate funds to the eight construc tion districts on the basis of actual traffic needs rather than On the ba sis of so much for for primary roads in a district and so much less for secondary traffic arteries."}, "highlight": {"text": {"matched_tokens": ["state", "Senators"], "snippet": "road systems of the <mark>state</mark> has been introduced in the senate by <mark>Senators</mark> Weaver, Va- den and"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "Senators"], "snippet": "road systems of the <mark>state</mark> has been introduced in the senate by <mark>Senators</mark> Weaver, Va- den and"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1759.21, 1382.33, 2021.1, 1577.93], "bbox_id": "7d983b4753", "file": "AppomattoxNewspapers_1949-1952a_0220.pdf", "page": 1, "text": "Tuesday, N ovem ber 7, is E lection Day. WILL YOU BE TH ER E?  O ne-third of our U. S. Senators and all of our R epresentatives, and many State 1-! nfficials w ill be chosen on that day. They are being chosen at one of thg most critical tim es in our n atio n s history. Tuesday, as never before, every A m erican b lesse d w ith th e sa c re d rig h t to cast a secret vote owes it to him self and to the m illio n s of h is fellow A m erican s to select the candidates he believes are best fitted for public office, and w ho w ill work"}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "of our U. S. <mark>Senators</mark> and all of our R epresentatives, and many <mark>State</mark> 1-! nfficials w ill"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "of our U. S. <mark>Senators</mark> and all of our R epresentatives, and many <mark>State</mark> 1-! nfficials w ill"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [138.49, 476.16, 304.17, 1118.35], "bbox_id": "ff08ede2ad", "file": "AppomattoxNewspapers_1912-1915a_0395.pdf", "page": 1, "text": "THREE  DEMOCRATIC SENATORS. What would the Republican minority of the United State Senate do without the leader ship of those eminent Demo crats, OGorman of New York, Heed of Missouri and H itch cock of Nebraska? The Wilson Administration has had no such consistent op position from any other quar ter. Not always acting in con cert, these three Democrats have done more than any Re publican by intrigue and an tagonism to imperil Democra tic policies.New York World And let us hope that these three will never meet again to combine against comrades who engage in well nigh sacred war against political evils and for the restoration of civic righte ousness. What are they fight ing against anyhow? The Bal timore platform? Then their iil-aimed blows must be against the personality of the Presi dent. And w hat of that per sonality? Another has well said,  the President achieves and holds his pre eminence not by being domineering or die tatorial. Quite the contrary. In his manner he is one of the most deferential men that has ever been in the W hite House. He is even meek, but his meek ness is that of one of those of whom it has been said that they shall inherit the earth. Do they object to him as a  thinking machine? or that he is always  everlastingly right? W hy dont these au gust Senators do as the Con grepsman has recently done, resign and appeal to the peo ple? Let tht m try it and know how it is to be  left. But such men are slow to die and never resign. Strange Provi dence that such party pests should be perpetuated."}, "highlight": {"text": {"matched_tokens": ["SENATORS", "State"], "snippet": "THREE  DEMOCRATIC <mark>SENATORS</mark>. What would the Republican minority of the United <mark>State</mark> Senate do without the"}}, "highlights": [{"field": "text", "matched_tokens": ["SENATORS", "State"], "snippet": "THREE  DEMOCRATIC <mark>SENATORS</mark>. What would the Republican minority of the United <mark>State</mark> Senate do without the"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [196.14, 648.04, 361.84, 1410.46], "bbox_id": "83781d14b5", "file": "AppomattoxNewspapers_1892-1898a_0457.pdf", "page": 1, "text": "The Last Call, Before another issue of this paper the votes will have been cast and the people of this county will have elected their representative in the State Legislature and the State of ficers who are to serve two jnd four years respectively. This may be said to be a serious election to Dem ocrats. Senator John W. Daniel is to be reelected, State officers are to be elected, County Judges appointed and all in all it will be a very impor tant session of the Legislature Our States finances will require at tention, and right here our man Ligon can be of great service to his State the constitntion tackled, the election of ll. S. Senators by prima nes, general road improvement, c. will be discussed. In fact the coming session promises to be one full of important business, and it is of the utmost importance that the Democrats should retain control of it and that our representative should be a member of the Democratic host which will assemble iq Richmond next December. Now then, let every Democrat re alize the great importance of un ceasing work during the few remain ing days of the canvass. Let our gallant leaders words take nothing for granted be uppermost in our minds. The ways and tricks of the enemy are dark and cunning, and it behooves ns to be vigilant and go diligently to work to poll every vote we cau against these foes of the peoples rights. It will not do for Democrats to become indifferent, and careless because of the appareut dissensions in the enemys camp. The Lamb and the Lion will be together ou election day, and it is the opinion of k- o ring ones that this difference in ti e Republican party is for no other purpose than to catch the Democrats asleep. Awake Democrats! and give your ticket the largest vote the county has ever given, for no truer names ever adorned a freemans bal lot than those of Tyler, Echols, Montague and Ligon. Tyler was your unammons choice for the nomination for Governor, Ligon your overwhelming choice for the Legislature. Sustain yonr ver dict now by getting out the entire vote. Let every man of you do yonr full duty."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "great service to his <mark>State</mark> the constitntion tackled, the election of ll. S. <mark>Senators</mark> by prima nes, general"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "great service to his <mark>State</mark> the constitntion tackled, the election of ll. S. <mark>Senators</mark> by prima nes, general"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [731.48, 413.2, 897.53, 479.8], "bbox_id": "de0d0ec582", "file": "AppomattoxNewspapers_1952-1954a_0040.pdf", "page": 1, "text": "mean that nearly half a million adult people in the state do not know the names of our two senators! We do not know the accuracy of Gallop Polls. But if this is true, then an amazing job of education has to be faced."}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "adult people in the <mark>state</mark> do not know the names of our two <mark>senators</mark>! We do not know"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "adult people in the <mark>state</mark> do not know the names of our two <mark>senators</mark>! We do not know"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [768.5, 572.92, 937.05, 726.67], "bbox_id": "1c8faf16f7", "file": "AppomattoxNewspapers_1952-1954a_0095.pdf", "page": 1, "text": "In filling the unexpired term caus ed by the the sudden death of Lieu tenant Governor Lewis Preston Coll ins, the Democratic State Central Committee faced a difficult choice. Three splendid Senators, all of whom were members of the committe, as pired to the office and their names were placed in nomination Senator Stephens, 52 Senator Edward L. Breeden, Jr., of Norfolk, 47 and Senator Charles R. Fenwick of Ar- ington, 52. All were popular, all had the confidence and affection of their colleagues. Senator Stephens was the hoice of the majority."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Coll ins, the Democratic <mark>State</mark> Central Committee faced a difficult choice. Three splendid <mark>Senators</mark>, all of whom were"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Coll ins, the Democratic <mark>State</mark> Central Committee faced a difficult choice. Three splendid <mark>Senators</mark>, all of whom were"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [265.69, 1267.4, 422.12, 1455.95], "bbox_id": "2f8dbf74ca", "file": "AppomattoxNewspapers_1902-1905a_0165.pdf", "page": 1, "text": "A State primary for the uomina- nation of United States Senators by direct vote of the people appears t.o be rapidly gaining iu popularity. It is known to be the only true way to reach the real choice of the people. This paper has been in favor of it, first, last, and all the time, and will continue to advocate it. There are signs upon the horizon that it will be fought in the next Virginia De mocratic Convention.  To be fore warned is to be forearmed. The more the subject is agitated, the stronger, will public sentiment be come in favor of this method."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "A <mark>State</mark> primary for the uomina- nation of United States <mark>Senators</mark> by direct vote of"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "A <mark>State</mark> primary for the uomina- nation of United States <mark>Senators</mark> by direct vote of"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2426.12, 395.63, 2625.39, 1638.93], "bbox_id": "2581981805", "file": "AppomattoxNewspapers_1892-1898a_0035.pdf", "page": 1, "text": "W ashington , Jan. 80.Mr. B talÉ ÍPl oould not have a private funeral. Every effort waa made to comply w tih to h et j understood wishes, and with the express-  ed desire of bis family in this regard, but g the surging wave of public interertswrpg  over harriers Imposed and made Ms j private funeral one of tbe M it lM pisiiiifi ive public demonstrations in hierdtvll the dead. Tb Prealdeut and bis Cnbtnet, Justices ot tbe. 8u pre me Ocurt, Senators and Representatives and diplomatic corps was not more significant than tho homage o f the waiting crowd w hltiijlp S respectful silence lined the streets through wnicn tno tunerai cortege, pasted. Tbe  parlor on tbe second floor, where th .  body lay in ite cedar casket, closely sealed,was fairly embioidered with floral tributes. The casket rested on if a H H i bed oí roses, viole to piilp leaves ipy terns, sent by Mi. Emmons Blatn,--! about nine feet long by fear feet wide,,,  tb Sowers artistically giving comblnn-  tion f colors to the design!, the o H m   ttTb parlor was far to small for th distinguished mourners who, by Invita-  tion, sought access to It. Th PregMent, 1 entered, accompanied by Mrs. McKe,  Privat Beertary Baltoid and I. rat. Parker, and the Vice-President jtetom- panted by Mrs. and ire Morton. Mem-  hart of the Uabiuet and many other dto- tlagutobed people followed TiÍÉre- monhto at tb honre were grand ip their Impllplty. Before the hour of ten thp I Invited guetta began,to arrive aud tah I their seats In tb fragrant and floral be- I decked front parior pf the mansion. J Thor er no ahsitf fe served for tbe President and for the lipa family of the deceased. fewmiitotfa.ailiefeleven tjtl,1, ___ era entered and tbe President and nil th .3gH distinguished concourse roe to pay fit-  iff! ting honor and sympalby to tbe sorrow of tiw . deceased, etaietman relartvva,MK The family was .followed by Rev. D r.. Ty  Hamlin, of the Church of  who, standing beside tb basket, in a low  j  ton, delivered the Prebyierian prayer -   for departed souls. As he did so Weller Damrosch touched tno keys Of thepif.n  to a alow dirge, and the torns waa an . S impressive ons. he Immediate mourn-  J era grouped around the casket were tb  f widow, her marti1 d daughter. Mrs. Dnto ?   rosefa Hauls Blame, James G. Blaine, I Mrs. Emmons Blains, Abigail Dodge . I Gull Hamilton Mr. Blaines tocrtw iM M I G. Blaine, Mother of tb dead states- 1 j  I man, and bis wife and daughter Hemp- yare I ton Denman, of Mluouri, cousin of lh.Jj I Blaines, Frank, Henry Horace I gust us Stanwood end WaiterStonera gist, m W. H. Hatch, all nephews of the decease. J  m lex-Secretary.    KmSfWmm I Dr. Hamlin returned tbftnki.to th at by hto power this Ufe wes ended if only that the life oflm mortality might be begun. He beseeched the Atanigbtgr ttifft -11 comfort might oome to every member ot the stricken household, because one thn bad gone out of this life had gone to igiíSj9H mortality. Let tbe consolation that comes  from above fell tenderly end. sweetly f upon tbem. Speak to them words of f l comfort, such as thou alona can teach. This we ask in the name of our 9avtour,,gS amen. v  , mm This completed tbe brief and Impre jjdB live services and the casket was closed n and tenderly borne to the batw! f  Solemnly and in alienoe tire family god  mourning guests left tbe honss, whioh has been so frequently invade by th - 4  angel of death, and the snd V o csretwg  fl wended ita way slowly to church. Outside thehouseth. street ws  I throng with spectators who reverently doff ? air bats as tbe pall bearers d- 1 I posited their sacred burden In tho b ea n  -i I and while the attendants temporarily  I buried it under as many flowere as oould  I be placed thereon. The cortege then .  I started for tho church. Exaotly at 19 oclock slow and solemn   I organ muslo aonounoed the arrival of li the funeral party at Ih door of tbÉ church. As the procession moved  F i3  the stole. Welter Damrosch, Blaines son-in-law, who was at tb organ, played an Improvisation mado np of several . hymns which Blulne loved more than U .  other tnnsiesl numbers. -All present ros and remained standing as tbe foneral. party moved up tbe, sitie. Dr, Hemlln,  the pastor, walked at tbe head ot tb mourners bolding In hto hand M o g H iD book containing tbe ritual of th Pres byterian worship and read, ss he d ! vanoed, selections from the scriptures.  Behind him came tb honorary p r t bearers two abreast, Senators Hale and Frye, representatives of tbe dead mans beloved State, leading tbe wey. body bearers moved wtih measured paoe  towards the chancel rail, wbwe they de- posited the oasket amid a . profusion o f   flowers. The family followed tbe body. I aud took thp front test on the left near  the remains. They knelt with totir ,  I beads bowed in prayer and remained In  I tbit attitude for some time. More 6 1 0 I tent relatives, intimate friends and  I other members of the firaeral party r t  were at the house cam In after tb I family were rested in pew rw ervti ppj I them. When all were seated end ti- deep peals of tbe organ -eased, Dr. Hantte, I lin, rising from hi place In tire PUlP  began tbe oburcb services by fen d tan jc selections from the scripture. Tbehgyl reading fioiibed, prayer whs offered hr.  I Dr. Hamlin. At theolose of the P IM M the funeral proeesston once more lormMl y aud tbe body was conveyed to O tk Hill  cemetery and there laid to rest. ."}, "highlight": {"text": {"matched_tokens": ["Senators", "State"], "snippet": "t bearers two abreast, <mark>Senators</mark> Hale and Frye, representatives of tbe dead mans beloved <mark>State</mark>, leading tbe wey. body"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators", "State"], "snippet": "t bearers two abreast, <mark>Senators</mark> Hale and Frye, representatives of tbe dead mans beloved <mark>State</mark>, leading tbe wey. body"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [550.51, 1229.25, 705.91, 1296.15], "bbox_id": "297be9fb36", "file": "AppomattoxNewspapers_1915-1918a_0319.pdf", "page": 1, "text": "The Seuate objects to Wil lsons prodding, says the Balti more American. State the case Fairly, and say a few Republi can Senators are doing the ob j acting."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "The Seuate objects to Wil lsons prodding, says the Balti more American. <mark>State</mark> the case Fairly, and say a few Republi can <mark>Senators</mark> are doing the ob j acting."}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "The Seuate objects to Wil lsons prodding, says the Balti more American. <mark>State</mark> the case Fairly, and say a few Republi can <mark>Senators</mark> are doing the ob j acting."}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [514.54, 1072.75, 857.47, 1096.4], "bbox_id": "f335de09cf", "file": "AppomattoxNewspapers_1960-1962b_0018.pdf", "page": 1, "text": "secato aro m  k well act, knowing that use affected, because two senators are ,TOtl Ta Kv t-Ke United elected in each state."}, "highlight": {"text": {"matched_tokens": ["senators", "state"], "snippet": "secato aro m  k well act, knowing that use affected, because two <mark>senators</mark> are ,TOtl Ta Kv t-Ke United elected in each <mark>state</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "state"], "snippet": "secato aro m  k well act, knowing that use affected, because two <mark>senators</mark> are ,TOtl Ta Kv t-Ke United elected in each <mark>state</mark>."}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1362.95, 542.85, 1808.7, 681.31], "bbox_id": "a66bce0587", "file": "AppomattoxNewspapers_1908-1909a_0323.pdf", "page": 1, "text": "M ature to e n a c t in to minoia la to giv, Mrs. re fe re n c e to tn e dis-1 McCormick a big vote, partly be- I o f th e g a s ta x . caase the state Is dissatisfied with I iit .i ____ -I i  masculine senators, as a class, con- IS lik e tn e r e Will oe l A they have not done much iarp skirmishes, be-1 lately. Mrs. ScMeelnger, formerly of uw6. . . . . . . . . . . ........ __   o iiv ori- Chicago, says so. She ought to know. I tick tn town. Atl they need Is good matter IS n n a u y  u g r grandfather was Joseph MedlU. j hard worfe. Golfhah I A spade beat lit w e co n fid en tly ex- j She should be In the senate, by tbs j  g0f Ct, nny day for putting a man L ruintlea to w in be-1 vay. To say that she has as much 1 counties to w in oe J ability as any one. of the three rattling  have a n g h t to re - 1 Ruths, Is putting It moderately. ie country delegates  fo r the best plan to    ble eniflneer w819M"}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "ta x . caase the <mark>state</mark> Is dissatisfied with I iit .i ____ -I i  masculine <mark>senators</mark>, as a class, con-"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "ta x . caase the <mark>state</mark> Is dissatisfied with I iit .i ____ -I i  masculine <mark>senators</mark>, as a class, con-"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [173.29, 1224.77, 332.64, 1331.96], "bbox_id": "7c105d3bcc", "file": "AppomattoxNewspapers_1922-1923a_0446.pdf", "page": 1, "text": "Kills Direct Vote Bill. Harrisburg, Pa. Special.  The house bill giving the voters of the State an opportunity to express their choice for United States Senators at the uniform primary elections, one at the most important political bills before the present legislature, failed on final passage In the senate, the Tote being 22 to 22. A majority vote of the senate, 26, was neces sary to pass the hill."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "the voters of the <mark>State</mark> an opportunity to express their choice for United States <mark>Senators</mark> at the uniform primary"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "the voters of the <mark>State</mark> an opportunity to express their choice for United States <mark>Senators</mark> at the uniform primary"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2000.39, 259.71, 2168.03, 729.29], "bbox_id": "8195157099", "file": "TimesVirginian_1983a_0150.pdf", "page": 1, "text": "By JENNIFER INGE o Four juniors at Appomattox County High School have been named to attend Boys and Girls State, the week of June 12-18. Bobby Carter and Neal Leonard will be attending Boys State at Lynchburg College. Lori Coggins and Tambra Hamlet will be attending Girls State at Longwood College. Boys and Girls States are held each year for high school juniors. The purpose of the week is to familiarise students with political activities, and to give students experience with government poli cies and leadership abilities. The week also helps them understand some of the responsibilities they assume when they become adults. Upon arrival at Boys and Girls State, the students are divided into cities which elect city officials. Each student must be a member of a political party. In a convention, the cities form a state and elect such officials as governor, representa tives, and senators. The students schedule also includes sports activities and sessions involving leadership, government affairs, and political parties. The candidates chosen for Boys and Girls State are selected on the qualities of leadership, patriotism, character, cooperativeness, hones ty, scholarship, and physical fitness. Faculty members choose the candidates by nominating two boys and two girls. Each student that receives at least two votes is placed on a ballot, and is voted on by the faculty. The two top boys and two top girls are eligible to attend. The"}, "highlight": {"text": {"matched_tokens": ["state", "senators"], "snippet": "the cities form a <mark>state</mark> and elect such officials as governor, representa tives, and <mark>senators</mark>. The students schedule also"}}, "highlights": [{"field": "text", "matched_tokens": ["state", "senators"], "snippet": "the cities form a <mark>state</mark> and elect such officials as governor, representa tives, and <mark>senators</mark>. The students schedule also"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [131.5, 300.02, 324.84, 491.96], "bbox_id": "b140cf0140", "file": "TimesVirginian_1984a_0107.pdf", "page": 1, "text": "Appomattox County Farin Bureau -President Ed Anderson and Vice president John Hhc, with leaders from County Farm Bureaus across the State iret to the nations capital to visit with Hiheir Senators and M embers of Congress March 28-30.  Anderson called the effort of 148 Bounty farm leaders that made the trip Jvery beneficial and worthwhile ... Anderson noted that in a year when we fiH elect all of the members of the spouse of Representatives and a v President of the United States, it is J im portant for all to have ah .understanding of w hat goes on in Washingtw. Some of the major issues discufesed"}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Farm Bureaus across the <mark>State</mark> iret to the nations capital to visit with Hiheir <mark>Senators</mark> and M embers of"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Farm Bureaus across the <mark>State</mark> iret to the nations capital to visit with Hiheir <mark>Senators</mark> and M embers of"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [916.09, 474.01, 1076.76, 2056.88], "bbox_id": "f16c460dbe", "file": "AppomattoxNewspapers_1898-1902a_0099.pdf", "page": 1, "text": "and men or toe army ana or tne navywbc remained in their departments and stations faithfully performing most Important du. tira connected with the war, and whose re quests for assignment in the field and at sea I was compelled to refase because theb services were indispensable here,  e en titled to the highest commendation. It Is my regret that there seems to be no pro vision for their suitable recognition. In tracing these events we aje constantly reminded of onr obligations to tbe Divine Master for His watchful care over us and His safe guidance, for which the nation makes révèrent acknowledgment and of fers humble prayers for the continuance ol His favor. Spain Sacs For Feacs. Spaio, having realized that she had lost, tbe President states, now - sued. for eace. The signing of the protocol is re ferred to, and then tbe Message relates the details of the negotations which ended In a suspension of hostilities, the appoint ment of the military commissions to superintend the evacuation of Cuba, Portò Rico and the adjacent islands and the peace commission. Continuing, he says Peace Commissions Work. Pursuant to the fifth article of the proto col, I appointed William B. Day, lately Secretary of State Cushman K. Davis, William P. Frye and George Gray, Senators of the United States, and Whitelaw Reid to be the Peace Commissioners on the part of the United States. Proceeding in due season to Paris, they there met on the 1st of October five Commissioners similarly appointed on the part of Spain. Their negotiations hare made hopeful progress, so that I trust soon to be able to lay a definite treaty of peace before the Senate, with a review of the steps leading to its signature. Government of New Possessions. .1 do not discuss at this time the govern ment or the fatare of tbe new possessions which will come to us as a result of the war with Spain. Such discussion will be ap propriate after the treaty of peace shall be ratified. In the meantime, and until Con- tress has legislated otherwise, it will be mÿ Suty to continuetbe military Governments which have existed since onr occupation, and give to tbe people security in life and property and encouragement under a just and bénéficient rale. Independence Alone For Caba. As soon ns we are in possession of Cuba and have pacified tbe island, it will benec- essary to give aid and direction to its people to form a government for them- selves. This should be undertaken at thè earliest moment consistent with safety and assured success.  It is important that onr relations with this people shall be of the most friendly oharacter and our commer cial relations close and reciprocal. It should be our duty to assist in every prop er way to build up the waste places of the Island, encourage the industry of the peo ple, and assist them to form a government which shall be free and Independent, thus realizing the best aspirations of the Caban people. Spanish rule must be replaced by a just, benevolent, and humane Government, created by the people of Cuba, capable of performing all international obligations, and wbich shall encourage thrift, industry and prosperity, and promote peace and good will among all of the inhabitants, whatever may have been their relations in the past. Neither revenge nor passion should have a place In the new Govern ment. Until there is a complete tran quillity in the island and a stable Govern ment inaugurated military occupation will be continued. Friendly Relations Witn All Nations. With the one exception of the rapture with Spain, the Intercourse of the United States with the great family of nations has been marked with cordiality, and tbe close of the eventful year finds most of the is-, sues that necessarily arise in the complex relations of sovereign States, adjusted or. presenting no serious obstacle to a just and honorable solution by amicable agreement. The President dwells at some length on the long unsettled- boundary dispute be tween the Argentine Republic and Chile, and expresses pleasure that his efforts to induce them to resort to arbitration have been successful. He also refers to the strong hope he has that the rates charged on the cables of American corporations in tho transmission - between Buenos Ayres and the cities of Uruguay, Brazil and the Atlantic cities of South America may be freed from an almost prohibitory discrimin ation. He favors an international agree ment for an interenange of messages over connecting cables. Then taking up home topics he says Austria and the Lattimer Strike. On the 10th day of September, 1897, a conflict tcok place at Lattimer, Penn., be tween a body of striking miners -and the Sheriff of Luzertie County and his depu ties, In which twenty-two miners were killed and forty-four wounded, of whom ten of the killed and twelve of the wound ed, were Austrian and Hungarian subjects. The deplorable event naturally aroused tbe solicitude of the Austro-Hungarian Government, which, on the assumption that the killing and wounding involved tbe unjustifiable misuse of authority, claimed reparation for the sufferers. Apart from tbe searching investigation and peremptory action- of the authorities of Pennsylvania, the Federal Executive took appropriate steps to learn the merits of the case, in order to be In a position to meet the urgent complaint of a friendly power. The Sheriff and bis deputies, hav ing been indicted for murder, were tried and acquitted after protracted proceedings and the hearing of hundreds of witnesses, on the ground that the killing was in the line of their official duty to upnold law and preserve publie order in the State. A rep resentative of the Department of Justice attended the trial and reported its coarse fully- With all the facts in its possessioni this Government expects to reaah a har monious understanding on the subject with that of Austria-Hungary, notwithstanding the renewed claim of- the latter after learn ing the rèsult of the trial,for indemnity for Us,injured subjects. After an extended reference to the y e  s events in Central America, he devotes the following pagraph to the Nicagus Canal Nicaragua Canal a Necessity The Nicaragua Canal Commission, under the Chairmanship of Bear-Admiral John C. Walker, appointed July 24, 1897, under the authority W a provision in the Sundry Civil aot of Jane 4 of that year, has nely com pleted its labors, and the results ot its ex haustive inquiry tntotheproper route, the feasibility and- the cost of construction of an lnteroeeanio oanal by a Nicaraguan route will be laid before you. In the per formance ot its task the commission re ceived all the possible courtesy and assist ance from the Governments oLJJicaragua and Costa Bica, which thus testified their appreciation of the importance of giving a speedy and practical outcome to the great projeot that bas fqr so many years en grossed the attention of the respective countries. As the scope of the recent inquiry em braced the whole subject, with the aim of making plans and surveys tor a canal by tbe most convenient route, it necessarily included a review of the results ot previous surveys and plans, and in partioul those adopted by the Maritime Canal Company under its existing concessions from Nica ragua and Costa Blea, so that to this extent those grants necessarily hold as. essential a part in the deliberations and conclusions of the Oanal Commission as they have held and must of need hold In the discussion ot the matter by the Congress. Under these elrenmstances, and in view of Overtures made to tbe Governments ot Nicaragua and Costa Rlep by other parties for a now canal concession, predicated on the as sumed approaching lapse of the contracts of the Maritime Canal Company with those States, I have not hesitated to express my conviction that considerations of expedi ency and international policy as between the several Governments Interested in the construction and control of an interoceanic canal by this route require tbe maintenance of the status quo until the Canal C ommls sion shall have reported and the United States Congress shall have had the oppor tunity to pass financially upon tbe whole matter daring the present session without prejudice by reason of any change in the .existing condifious. Nevertheless, it appears that tbe Gov ernment of Nicaragua, as one ot its last sovereign sets before merging Its powers In those Of the newly formed Cqlted States ot Central America, has granted an optional concession to another association, to be come effective on the expiration of the present grant. It, does not appear what .surveys have been made or what route is proposed under tjtts contingent grant so that an examination of the feasibility of its plans is necessarily not embraced in the report of the Canal-Commission. AU these elreumstanaessuggest tbe urgency of some fltflaltT mtfw -C 9 PgcflJ at. thia"}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "Day, lately Secretary of <mark>State</mark> Cushman K. Davis, William P. Frye and George Gray, <mark>Senators</mark> of the United States,"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "Day, lately Secretary of <mark>State</mark> Cushman K. Davis, William P. Frye and George Gray, <mark>Senators</mark> of the United States,"}], "text_match": 1157451470233141369, "text_match_info": {"best_field_score": "2211897278464", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470233141369", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["State", "Senators"], "snippet": "furnished the fol lowing <mark>State</mark> <mark>Senators</mark>Col. Wyatt Elliott, Col. Samuel"}}, "highlights": [{"field": "text", "matched_tokens": ["State", "Senators"], "snippet": "furnished the fol lowing <mark>State</mark> <mark>Senators</mark>Col. Wyatt Elliott, Col. Samuel"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [760.29, 426.59, 917.47, 1977.82], "bbox_id": "1ea84278aa", "file": "AppomattoxNewspapers_1898-1902a_0412.pdf", "page": 1, "text": "The New York Jury in the case of Louis H. Hilliard, who died at Belle vue Hospital, gave a verdict that he came to his death from injuries caused by Davis, Dean and Marshall, the nurses. The accused were held for the grand jury. Myles McDonald and Thomas Ken nedy, a pair of gamblers in New York, had a pistol duel, the result of which was the mortal wounding of Edward Courteney and George Price. In his address before the Southern Educational Association, Professor Branson attributed the backwardness of education in the South to the lack of co-operation. Andrew and Elizabeth Noel, of Jack- son township, Pa., were arrested on the charge of burning their house to defraud the insurance company. The threatened strike on the Wilkes- barre and Wyoming Valley Electric Railway was avoided, a compromise being amicably agreed upon. D. A. Jennings, of Columbus, Ohio, sued 20 people of Washington county, Ind., for 200,000 damages for perse cuting him and his family. A fortune In government bonds was found in the cave of Ypsulantl Smith, a hermit, who died near Fletcher, Ohio. The Red Mountain stage was over turned near Ouray, Col., and six pas sengers precipitated over a cliff. William Westlake, widely known as an inventor, died at his home in Brooklyn. Prof. Moses Coit Tyler, of Cornell University, died at Ithaca, N. Y. William H. Smythe, grand secretary of the Masonic Order in Indiana, was shot and seriously wounded in his of fice in Indianapolis. He says a woman shot him. At the second quarterly meeting of the American Physical Society, held in New York, Prof. Rowland, of the Johns Hopkins University, Baltimore, was re-elected president. Samuel D. Miller, whose son was ab ducted from Indianapolis, Ind., by the hoys mother, recovered the child at Lawrence. Mrs. Lulu C. Jenkins, whose husband was lynched in Ripley county, Ind., will receive 4000 damages from the bondsmen of the Sheriff. Abraham Johnston and his wife, an aged couple, were tortured and robbed at their home, near Marietta, O. Mrs. Mary Kennedy was burned to death and several other women were injured in a fire in Chicago. Michael Maloney, a farmer, died at bis home, in Lenox township, Pa., at the age of 107 years. John F. Welshaus, a former resident of Shepherdstown, W. Va., died sud denly in Chicago. The general meeting of the Ameri can- Chemical Society was held in Chi cago. The wife of Samuel D. Miller, son of former United States Attorney General Miller, kidnapped her seven-year-old son, who, with his father, was living at the home of his grandfather in In dianapolis. . The couple have been liv ing apart, but are not divorced. The fifth annual convention of the National Commercial Teachers Fed eration was opened in Detroit, W. C. Stevenson, of Port Deposit, Md., presi dent of the federation, made an ad dress on the progress of commercial education. Mr. Bryan, in a speech at a Jefferson banquet in Lincoln, Neb., said that whether he would ever be a candidate for office again was a question which must be determined by events. Charles H. Cramp says he received a cablegram announcing the signing of the contract with the Turkish Minister of Marine for the construction of a cruiser. Deputy John Usher and Charles Bowline, a saloonkeeper, were killed, and Birch Hillen wounded, in Mayfield, Ky., as the result of an effort to arrest Hiller. Physiologists of the University of Chicago announced as the result of ex periments made upon turtles that salt causes the heart to beat. Handsome Elk, a dangerous Indian, of South Dakota, beat his squaw near ly to death and scalped another Indian woman. Colonel Asa Bird Gardiner sur- repdered his office as district attorney of New York to Eugene A. Philbin un der protest. Prof. D. W. Batson, dean of Ken tucky Wesleyan College, resigned on account of his opposition to football playing. Mr. Cleveland wrote a letter to the Atlanta Journal stating that he did not vote for McKinley at the recent elec tion. Rev. Dr. Thomas Murphy, an emi nent Presbyterian clergyman and ec clesiastical writer, died in Philadel phia. Frank Corcoran, while skating on Loucks Dam, near York, Pa., broke through the ice and was drowned. The strike of the miners at the En terprise colliery, in Shamekin, was set tled. The new Rocky Mountain smelter started up at Florence, near Pueblo, Col. Mr. Bryan, in a greeting to political friends in Kansas, says, The princi ples of Democracy still live, and the policies for which the fusion forces fought will yet be vindicated. There is rowing doubt as to Mr. Ad- dicks abHlty to capture one of the-Del- aware senatorshlps, to be filled when he legislature of that State meets in January. The pony supposed to have been rid den by one of young Cudahys ab ductors has been found in a barn 23 miles south of Omaha, where it was abandoned. Hughes Dillard, a well-known resi dent of Martinsville, Va., was probably fatolly shot by a negro. The latter probably escaped lynching by flight. Mrs. Sarah Frank, of Brooklyn, N.Y., took a dose of paris green in mistake for headache powder, and died an hour afterward. The Agricultural Department an nounces a successful experiment near Hartford, Conn., in the growth of Su matra tobacco. Noble Lindsey, president of the First National Bank of Alexandria, died sud denly after a few hours illness. Senator Hanna attended a dinner given to 1500 poor people at Cleveland by the Salvation Army and made a short speech. Mr. R. B. Cooke has been elected traffic manager of the New York, Philadelphia and Norfolk Railroad Company, with headquarters in Nor folk. Farmers around Newport News are endeavoring to have the study of ag riculture introduced into public schools. Because Louis Lombardo persisted in singing love songs in serenading his sweetheart, in Brooklyn, he was shot in the head by the girls father."}, "highlight": {"text": {"matched_tokens": ["senators", "State"], "snippet": "one of the-Del- aware <mark>senators</mark>hlps, to be filled when he legislature of that <mark>State</mark> meets in January. The"}}, "highlights": [{"field": "text", "matched_tokens": ["senators", "State"], "snippet": "one of the-Del- aware <mark>senators</mark>hlps, to be filled when he legislature of that <mark>State</mark> meets in January. The"}], "text_match": 1157451436007620729, "text_match_info": {"best_field_score": "2211880566784", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451436007620729", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [181.46, 1028.35, 350.63, 1804.56], "bbox_id": "575fc2692f", "file": "AppomattoxNewspapers_1892-1898a_0280.pdf", "page": 1, "text": "Young Law Tinkers. The Richmond Dispatch of last Sunday publishes brief sketches of four of Virginias young Lawmakers, viz. Senators Eugeue Withers and H. D. Elood, Hon. John Wood Fish- burne, and Joseph E. Willard, mak ing special mention of the two young Senators as having been the most active workers in this session of the legislature. Speaking of- the Senator from Appomattox, the Dispatch says Mr. Flood, who represents the Appomattox District in the Senate, was 30 years old on the 2d of last September, and is next to the youn gest member of the body. He has been a member of the General As sembly since he was 22 years old. He is chairman of the committee on Fish and Game of the Senate, second on Privileges and Elections, fourth on Courts of Justice, and is a mem berof the Committee on Printing. He is a close attendant upon the ses sions of his committees and a good worker. He was the leader in the Senate of those who favored our present election laws, without radi cal changes, and made one of the ablest speeches on this, subject that has been made in the Senate. In his defence of our election laws he was supported by many of the stron gest senators. He isbold and aggressive in what ever he advocates, and rarely fails in his undertakings. He represents a section in which party feeling is higher than in any other sectiou of the State, and the last contest in his district was very bitter but the re suit was a splendid triumph for Mr. Flood. He carried the district by I, 000. which was lost by the Demo crats in 1894. He has a large and extensive law practice, which he never neglects for anything except to perform his political duties. He is considered particularly strong as a jury lawyer. As Attorney for the Commonwealth for his county he has been particularly successful, rarely ever failing to secure a convic tion when he asks for it. Mr. Flood is spoken of as a for - midable candidate for Congress in the coming fight. If he is nomi nated, it is certain that the eastern part of the district, which is the doubtful end, will give the Demo cratic ticket a splendid majority. He redeemed his county from re publicanism in 1887, when he was"}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "Virginias young Lawmakers, viz. <mark>Senators</mark> Eugeue Withers and H."}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "Virginias young Lawmakers, viz. <mark>Senators</mark> Eugeue Withers and H."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [668.64, 949.77, 830.0, 1120.02], "bbox_id": "b423756322", "file": "AppomattoxNewspapers_1933-1936a_0324.pdf", "page": 1, "text": "yiCE PRESIDENT JOHN GARNER  and a large number of senators and representatives sailed from Seattle for Manila to represent the United States at the formal establishment of the Philippines commonwealth and the Inauguration of President Manuel Quezon on November 19. For the first time in history both the President and the Vice President were outside United States territory at the same time. Secretary of State Hull was the ranking official left in Washington and consequently was the temporary head of the government. However, Mr. Roosevelt was In close and continual communication with the capital by wireless throughout his cruise."}, "highlight": {"text": {"matched_tokens": ["senators"], "snippet": "a large number of <mark>senators</mark> and representatives sailed from"}}, "highlights": [{"field": "text", "matched_tokens": ["senators"], "snippet": "a large number of <mark>senators</mark> and representatives sailed from"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1262.85, 463.91, 1423.57, 795.21], "bbox_id": "9ec4c624f5", "file": "AppomattoxNewspapers_1898-1902a_0180.pdf", "page": 1, "text": "xWaia Member of tlio Houso From Ioul 0 . iaua In tho Last Congress. Washington, D. CL, Special.Represen tative Samuel T. Baird, of Louisiana, died in Washington from a complication of di- eases. The remains were taken to Bastrop, La., for interment. In addition to the family the following named Senators and Representatives accom panied tbe remaihs Senators Cuffrey, of Louisiana, and Bacon, of Georgia Repre sentatives Meyer and Davey, of Louisiana Bartlett, of Georgia Morris, Eddy and Me- Cfeary, of Minnesota Marsh, of Illinois Gibson and Brownlow, of Tennessee Cum mings, of New York, and Ciayton, Under wood and Bankhead, of Alabama, who will act as honorary pall-bearers. Samuel T. Baird was well-known In north ern Louisiana, where for seventeen years he has been a prominent factor at tbe bar, on the bench aud in politics. He was a native of that State and was thirty-eight years old. Born at Oak Ridge on May 6 , 1861, his prim ary instructions were begun very early aud he received uls education both at home aud at Vincenues, Ind. In 1870 he commenced the study of law, and three years later was admitted to the bar. Iu 1884 he was elected district attorney of the sixth judicial circuit, served in this capacity for four years, and then vacated it to become district judge for the same district. He occupied this bench for four years and then relinquished it to resume his private practice. In April, 1896, he was elected to tbe State Senate. He was a delegate to the national Democratic con vention in Chicago in 1896. Mr. Baird bad just finished his first term in tbe House of Representatives and had been re-eiocted to the fifty-sixth Coogresj."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "family the following named <mark>Senators</mark> and Representatives accom panied"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "family the following named <mark>Senators</mark> and Representatives accom panied"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.06, 198.55, 1719.74, 862.25], "bbox_id": "d9c221df7a", "file": "AppomattoxNewspapers_1908-1909a_0273.pdf", "page": 1, "text": "Wnft hjpit mirfcnces is pro-, blematical.  Some of tile lead ing teachers and heads of teachers organizations say the movement is meeting with scant support. - The mystery of the death of Harry Rohm may be solved by a grand jury which Will meet in Richmond Hustings Court June 2. Police claim they have enough evidence to warrant an arrest in the death of the leather dealer who was shot to death in his home two weeks ago but because of the action of the court in recent years in regard to circumstantial evi dence the authorities prefer for the grand jury to pass on the case before making an arrest. The all-important missing link is the weapon from which four shots were fired.- Reservoir Lake here is being drained in the hope of l o c a t i n g the weapon. So far as the records show, nothing was said at the meet ing of the Virginia Federation of Labor at Petersburg abou  United Senators Claude Swan son and Carter Glass for their support of Judge John J. Par- kei However, the question was a hot one at one session and was precipitated by the introduction of a resolution by the Clifton Forge delegation censuring the senators for sup porting President Hoovers nominee to the United States Supreme Court. The resolu-, -ion brought such spirited top- position it was finally with drawn and all reference to it was ordered stricken from the records. Divorces granted in Virginia .n 1929 reached a total of 3f- 054 which is 102 in excess of the total for 1928, according to statistics made public by Dr. W. A. Plecker, State registrar of vital statistics. Divorces among white persons last year totaled 2,138, among Negroes, 646, with 240 cases in which the race of the persons is not indicated. In 1920 the maxi mum of 3,690 iwas reached. Of these 1,882 were white and 1,- 134 were Negroes."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "at Petersburg abou  United <mark>Senators</mark> Claude Swan son and"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "at Petersburg abou  United <mark>Senators</mark> Claude Swan son and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [144.0, 305.26, 309.1, 778.68], "bbox_id": "49d16a9901", "file": "AppomattoxNewspapers_1912-1915a_0076.pdf", "page": 1, "text": "Will Gather At Capitol and Cast Vir ginias Vote. Virginias members of the electoral college will mest at the Capitol on Monday, January 13, and cast their votes for Woodrow Wilson for Presi dent and for Thomas R. Marshall for Vice-President of the United States. ,Tbla duty is demanded by the Consti tution and laws of the United States. The electors were chosen by the voters at the polls in November, for Presidents are not elected direct by toe suffrages of the people. Each party had its list of candidates for electors, the successful men having been nominated by the Democratic tate Convention in Norfolk last May. The State is entitled to as many Totes as she has representatives in Congresstwelve, counting Senators end Representatives. -There is one lector for each congressional district end two at large, representing the membership in the upper house. The electors will meet in the office cf Secretary of toe Commonwealth B. A James and elect a chairman. The .secretary is usually the chief clerk in toe office, who arranges for the meet ing and who at this time is James M. Hayes, Jr. It is customary also to alect the chief clerk as the messenger to Washington.  This done, the electors will cast toeir ballots for the Democratic nomi nees and then adjourn. The messen ger will carry the result to Washing ton and file it with the president of the United States Senate for canvass in open session on thé second Wednes day in February. - The presidential electors in Virginia re as follows Judges R. T. W. Duke, of Charlottesville, and J. Norment Powell, of Wythe, electors-at-large R. L. Beale, Caroline, First District Nor man R. Hamilton, Portsmouth, Sec ond DifVrict Hill Montague, Rich- mond, 1 t rd District J. Gordon Bo- nannoniirry. Fourth District J. T. ClemenDittsylvania, Fifth District - - -"}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "Norfolk last May. The <mark>State</mark> is entitled to as"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "Norfolk last May. The <mark>State</mark> is entitled to as"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [515.52, 636.0, 1984.58, 1306.9], "bbox_id": "d31f0fc342", "file": "AppomattoxNewspapers_1908-1909a_0342.pdf", "page": 1, "text": "will come the deciding dull days for these that By EDWARD W. PICKARD A lex a n d er legg e , chairman of - tiie federal farm board. Intends that the money put at the disposal of the board shall be handled  with a reasmble measure of safety, and he doesnt wish his appointment to be confirmed under the mistuken impres sion that any other policy will be fol- lowed. If the senate does not approve of this policy, Mi. Legge is perfectly willing to give up his office and return to his home In Chicago and his private business. , So much, and a lot more to the same purpose, the chairman told the senate committee on agriculture which was considering his appointment. The Democratic and radical Republican members of the committee questioned Mr. Legge sharply for many hours and made plain their displeasure be cause the board In the two months of its existence had not more rapidly organized stabilization corporations and placed at their disposal large funds with which to enhance -the pricea of farm products. Senators Brookhart of Iowu and Wheeler of Montana were especially vexed by the fallare of the farm board to take steps . assuring  the stabilization of wheat prices daring the present crop season. Senator Wheeler said that If the  board. bad announced that a stabilization corporation would be prè- pared to operate the farmers would have held their wheat. Senator Frazier -f Nerth Dakota -aid the.4anneMf -of. his state had lost from 23 to 40. cents a bushel on wheat because of the fail ure of the board to take action. Mr. Legge explained that stabiliza tion corporations would be organized as rapidly as It is possible to deter mine that they cun operate with a reasonable prospect of success. It IS intended, he said, that1 the grain marketing corporation, -which was organized at Chicago conferences, shallact us a stahiiiy.atloq corpora tion. He explained that steps toward the formation of this corporation were taken within nine days after the board Organized. Wheeler Intimated thut the boards loan to the Sun Muld Hulsln Growers association was made for the benefit of a Wall street house that floated the bonds of the Sun Maid Ilalsln corpora tion, but Mr. Legge effectively scotched that idea by explaining that the loan prevented the financiers from fore closing on the companys property. He also took the wind oat -of the salii, of. those who sought to attack him per sonally in the matter of bits connec tion with the International Harvester company by a detailed statement of earnings- and market values of that concerns Stock and of bis financial Interest In it. ."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "pricea of farm products. <mark>Senators</mark> Brookhart of Iowu and"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "pricea of farm products. <mark>Senators</mark> Brookhart of Iowu and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [474.7, 878.61, 799.44, 986.27], "bbox_id": "e96789ba7d", "file": "AppomattoxNewspapers_1905-1912a_0365.pdf", "page": 1, "text": "whom he would have indicted, b u t ! representation his rem ark created a profound im- I The bill provides for 42 represen- PIM8iu . .  Itat,ves over the Present num ber and Mr. Hines first testimony that at- was fram ed so as to prevent a de tracted deep interest was his detail-  crease of th e m em bership from any ed account of how he said P re sid e n t, state. Three of the 10 members Taft, form er Senator Aldrich and  Present, Senators La Follette, Du- Senator Penrose had him exert his ! p n t and McLean, voted in the nega- influence to have Mr. Lorim er elected t,v but while expressing disapproval I of tha inflpaooa tv k _ ______ to the Senate. I of the increase the other seven de- Mr. Hines then detailed in its e n - !c,ded to allow the House to have Ifc tirety the testim ony of Clarence S. J way in the m atter so peculiarly per-"}, "highlight": {"text": {"matched_tokens": ["state"], "snippet": "sid e n t, <mark>state</mark>. Three of the 10"}}, "highlights": [{"field": "text", "matched_tokens": ["state"], "snippet": "sid e n t, <mark>state</mark>. Three of the 10"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1389.61, 539.93, 1557.71, 1742.57], "bbox_id": "12234119bb", "file": "AppomattoxNewspapers_1926-1933a_0273.pdf", "page": 1, "text": "WHATS HAPPENING IN VIRGINIA Whether there was any law I fixing the salary of treasurers of Class A cities in Virginia from the time the general fee let was adopted in 1926 until the expiration of the incum ents term will be decided by fudge Julien Gunn of Rich- lond .City Circuit Court. Her ert L. Hulce, treasurer o J tichmond, contends that the rest Fee bill was experimental n nature and to serve a tern orary purpose. When the ermanent act was adopted in L926 it suspended the opera- lion of the compensation limit in g feature until the end of the Berm. Approximately 129,- j00 indirectly are involved in he case, as treasurers of all 31 ass A treasurers will be ef fected by the decision. Leslie C. Garrett, former Jnited States assistane at- rney general and assistant Ittomey general of Virginia nder Dr. John Garland Pol- ird, has been recommended to resident Hoover for the dis net of Columbia Court of Ap- leals by Senators Swanson and lass. He is a native of Math- ra county. Dr. Thomas W. Currie, presi- ent of Austin Theological iminary, Austin, Texas, was lected moderator of. t h e juthern Presbyterian Church the seventieth general as- mbly at Charlottesville. He n over Dr. T. K. Young of nchburg, Dr. C. R. Nisbel Charlotte, N. C., and Dr. IB. Hutton of Jackson, Miss., Sd succeeds pr. William R. Dobyns of Birmingham, Ala. jD u e to the delay of Rear Ad- lj Iral Richard Evelyn Byrd in aching New York from his atartic explorations, the Vir- tiia Military Institute cadet rps, of which Byrd is a grad- te, will not be able to wel- ime him on his arrival. The U lous explorer will not ar- re in New York .until June 19, ider latest plans, and the in- tute at Lexington will close r the session on June 11. jowever, if the admiral should jach this country on or before p e 14 the corps will make trip. i Confederate veterans and dows and Negroes who rved as body servants during e War between the States 11 receive pension checks on he 1 under the new system ovided in an act passed by 1930 General Assembly Inch provides for monthly taiead of quarterly payments, n June 1 each pensioner will ceivehis regular payments as ell as the new monthly pay- int and thereafter checks il be mailed out on the first W of each month. A reward of 1 for each ails nest saved in fields of alfa, hay, wheat or oats has p offered to the farmers of rginia by G. B. Collings of wport News, it was an- pcqd yesterday by M. D. rt, executive secretary of . State Commission of Game Inland Fisheries. Mr. -jas written all game war- requesting them to use best efforts to prevent the ruction of quail nests .when p s are mowed. line with the action of the fihia Federation of Labor indorsing unionization of school teachers of Virginia, is ate under way in Rich- d.,to organize the teachers  are threatened with a sal- reduction because of the able decrease in the Citys ssment of real estate. Miss ia M. Borchardt of Wash- n, yice-president of the jc i . a n Federation of iners, in the capital city PSg with l e a d e r s of ers organizations, but hything . will come"}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "of Ap- leals by <mark>Senators</mark> Swanson and lass. He"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "of Ap- leals by <mark>Senators</mark> Swanson and lass. He"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [489.85, 613.58, 658.08, 783.18], "bbox_id": "86f76ea23e", "file": "AppomattoxNewspapers_1954-1955a_0182.pdf", "page": 1, "text": "We do not believe that the State of the Union Address proposal of President Eisenhower, that the age limit for voting be lowered, will be enacted into law. We believe Vir ginia Senators and Congressmen will favor leaving the law as it is, with age twenty-one the minimum. About the only argument we ever heard for letting eighteen year olds vote was If they are old enough to fight, they are old enough to vote. That argument was effec tively answered long ago with the reply Then if they are too old to fight they are too old to vote, so do not allow anyone over 40 to vote."}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "not believe that the <mark>State</mark> of the Union Address"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "not believe that the <mark>State</mark> of the Union Address"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [366.92, 1583.53, 525.92, 1796.33], "bbox_id": "9855feed96", "file": "AppomattoxNewspapers_1892-1898a_0125.pdf", "page": 1, "text": "we believe in ninety instances in ev ery one hundred is honestly admin istered. While the Timesjsengaged in the reform movement why dont it broad en out and go for 11 the rascals? Why not caution the Senators and Delegates against that Tobacco Trust which came in an ace, a few years ago, of getting a monopoly of the to bacco business in the State for fifty years to come, thereby enabling it to fix the price upon every pound of tobacco raised in Virginia. Sudden conversions are open to suspicion, and when the conversion is onesided, that suspicion is. well founded,"}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "Why not caution the <mark>Senators</mark> and Delegates against that"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "Why not caution the <mark>Senators</mark> and Delegates against that"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1079.46, 440.6, 1245.81, 1350.34], "bbox_id": "5a06a00511", "file": "AppomattoxNewspapers_1933-1936a_0374.pdf", "page": 1, "text": "WASHINGTON.There will be a lot of oratory about the iniquities of the Canadian reciprocal trade agreement on the floors of the house and senate In the next few months, but a good deal of. the steam has been removed from the punches expected from the Washington and Oregon lumber inter ests. Lumber had to be in that treaty. Canda was more wrought up about the imposition of that special duty on lumberadded when the copper, oil and coal Interests were getting their specific protectionsthan about any thing else. Her point appealed par ticularly to Secretary of State Cordell Hull because she could easily demon strate that she had been buying two dollars worth of American goods for every one dollar of Canadian goods bought In the United States. And Mr. Hull doesnt like tariffs anyhow. But once lumber was put in the Canadian treaty, the Pacific Northwest hit the ceiling, and stayed there for some timefait the ceiling so hard that trusty scouts reported to Post master General James A. Farley that If the election were held today both Washington and Oregon would go Re publicanor rather, would go anti- Roosevelt. There were plenty of conferences here on that news. No one not familiar with the electoral vote tables, which Insiders have been jiggling here for i the last few months, would realize how big that news washow bad to i the New Dealershow grand to Re publicans. For with New England concededly l out the windowas confirmed by every  pollit is imperative for President i Roosevelt to make a pretty clean sweep  in the West Washington has eight  electoral votes, Oregon five, but those  thirteen become mighty important if  the whole Northeast is leaning Re publican. Woodrow Wilson carried Washington, but lost Oregon, but he carried Ohio, and that big bloc of elec toral votes is far from safe for Roose velt, from all present reports.  Promises Made As a result of all this worry there was some conferring with officials of I the lumber associations. All sorts of promises were made. Canada was to stagger her shipments to the United States, so that Canadian lumber would not be dumped up to the full quota allowance during any one period. Lum- I ber was to be give more consideration In various other treaties which are on the fire. Big efforts will be made by the State department to open up new markets for American lumber. Some of the lumber men have been pretty well taken into camp as a re sult They promise to smooth down their senators and representatives on Capitol Hill. They even promise kind words for the administration. But some of the promises made are not so easy of fulfillment The trouble lies In that most favored nation clause, which is dear to Secretary Hulls heart To illustrate, this coun try might induce some country anx ious to buy a lot of lumber to re duce its tariff, and thus open up a new market for the American lum ber interests. But the moment that nation did that she would also be reducing the tariff to precisely the same degree to every other nation. Which would mean that Canada would have the same oppor tunity, on an equal basis, and probably without any quota restriction. So the net result would be the same as if Canada shipped that lumber into the United States. Mr. Hull, it is learned, hopes to wiggle out of this problem by more quota Juggling, though admittedly quotas run contrary to the spirit of the most favored nation clause."}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "ticularly to Secretary of <mark>State</mark> Cordell Hull because she"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "ticularly to Secretary of <mark>State</mark> Cordell Hull because she"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [678.69, 553.83, 835.41, 1564.87], "bbox_id": "95e85d2ee9", "file": "AppomattoxNewspapers_1918-1922a_0524.pdf", "page": 1, "text": "Washington.The treaties of peace with Germany, Austria and Hungary were ratified by the Senate. The vote on the ratification of the German treaty, which came first, was 66 to 20. A few minutes later the Austrian treaty was approved by tbe same vote. Ratification of the Hungarian treaty followed quickly by a vote of 66 to 17. The difference in the vote was due to the departure from the chamber of three opposition Senators Before the Hungarian treaty was acted upon. The action concludes the three-year struggle to make peace with the Cen tral Powers of Europe. Peace with Germany and Austra will become an accomplished fact immediately upon the formal exchange of ratifications. Hungary has not yet ratified the treaty. The margin in favor of ratification exceeded themost optimistic estimate of Administration leaders. Fourteen Democrats, led by Senator Underwood, of Alabama and Senator Hitchcock, of Nebraska joined the Republicans in support of the treaties while only two Republicans were recorded against ratification. Here is the way the Senate lined up in the final roll-call on ratification For RatificationRepublicans Ball, Brandegee, Bursum, Calder, Cameron, Capper, Colt, Cummins, Curtis, Dil lingham, du Pont, Edge, Elkins, Ernst, Femald, France, Frelinghuysen, Gooding, Hale, Harreld, Johnson, Kel logg, Kenyon, Keyes, Lenroot, Lodge, McCormick, McCumber, McKinley, McLean, McNary, Moses, Nelson, New, Newberry, Nicholson, Norbeck, Oddie, Page, Penrose, Poindexter, fiortridge. Smoot, Spencer, Sterling, Sutherland, Townsend, Wadsworth, Warren, Wat son, Indiana, Weller and Willis. Total, 52. Democrats Ashurst, Broussard, Dial, Fletcher, Gerry, Kendrick, Myers, Owen, Pomerene, Ransdell, Shields, Trammell, Underwood and Walsh, Massachusetts. Total, 14. Against RatificationRepublicans Borah and La Follette. Total, 2. Democrats Caraway, Gulbersan, Glass, Harris, Harrison, Heflin, Jones of New Mexico, King, McKellar, Over man, Pittman, Reed, Shepard, Sim mons, Stanley, Walsh of Montana, Watson of Georgia and Williams. Total 18. With the vacancy caused by the death of Senator Knox the total mem bership of the Senate was 95. Nine Senators were. paired as follows Hitchcock, Democrat, Nebraska Jones, Republican, Washington Ladd, Republican, North Dakota Phipps, Re publican, Colorado Smith, Democrat, South Carolina, and Stanfield, Repub lican, Oregon, for ratification and Norris, Republican, Nebraska Robin son, Democrat, Arkansas, and Swan son, Democrat, Virginia, against rati fication. The Senate action completed the Administrations immediate peace pro gram and brought a full state of peace with the principal enemy powers. Re maining now only are the formal ex changes of ratification except in the case of the Hungarian treaty, as that Government alone has yet to complete parliamentary action on the treaty. The Senate attached two conditions to its ratification in the form of reser vations previously recommended by the Foreign. Relations Committee. One of the reservations reserves to Con gress the power to control American participation in the Reparations Com mission under the Versailles treaty. Before the Administration can appoint an American representative to that commission, it will have to secure a legislative act from Congress specific ally authorizing the appointment, and then it will have to submit the ap pointment to the Senate for confirma tion. The other reservation is designed to prevent Germany from escaping pay ment of claims which may he pressed against her as a result of damage to life and property paused by the sink ing of the Lusitania. Both of these reservations were adopted without a rollcall."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "chamber of three opposition <mark>Senators</mark> Before the Hungarian treaty"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "chamber of three opposition <mark>Senators</mark> Before the Hungarian treaty"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [641.28, 726.49, 806.73, 1249.84], "bbox_id": "d7855b1b6d", "file": "AppomattoxNewspapers_1912-1915a_0311.pdf", "page": 1, "text": "Washington.-The Mexican situa tion, which was centered chiefly for the last few days upon efforts to de termine how and why the constitu tionalists executed Dr. E. Benton, a British subject, was broadened when Consul Garrett, at Nuevo Laredo, was instructed to inquire into hanging by Mexican federals of Clemente Ver gara, an American citizen. The Consul was directed by the State Department to demand the body of the dead American from officers of the Huerta government in the vicinity of Hidalgo, Mexico, where Vergara was killed. Earlier in the day Marion Letcher, American consul at Chihu ahua, had been instructed to insist that General Villa permit the delivery of the body of Benton to the widow for burial where she may wish. General Villas message offering to permit the widow of Benton or relatives and an American official to  see the body when exhumed is being taken to mean by the American gov ernment that a complete medical ex amination may be performed. Secre tary Bryan told the senators that the United States was insisting that two American representatives be permitted to see the body and that one of these be an army surgeon. He also has made Inquiry as to exactly where the grave is located. General Villa has not replied to the last request of Secretary Bryan for the surrender of Bentons body, but It is understood that the British Am- basador, Sir Cecil Spring-Rice, for the present, will be satisfied if there is an opportunity for an autopsy which would determine whether Benton was shot by a pistol bullet or. by rifle bul lets from a firing squad. , It is thought the British Ambassa dor is anxious that evidence be secured first, believing discussion of the disposition of the body can be taken up afterward. The same army surgeon who will he detailed by Gen eral Scott, at Fort Bliss, to act with the British Consul, Charles A. Per ceval, when he arrives at El Paso, will report to the AmeMcan govern ment on the condition of the Benton corpse."}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "was directed by the <mark>State</mark> Department to demand the"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "was directed by the <mark>State</mark> Department to demand the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [371.28, 453.83, 584.87, 1256.22], "bbox_id": "c6b75a3a57", "file": "AppomattoxNewspapers_1915-1918a_0318.pdf", "page": 1, "text": "Washington.President Wilson has ed t y announ Broken off diplomatic reIations with can ships and tQermany and warned the Kaiser that ess contraven xathless sacrifice of Am encan lives sonatble cndei and rights means war. law and the Sim ilar action is wait!ng for Aus- manity he w trim when she notifies this Govern ment that she joins in the campaign of unrestricted submarine warfare. The President made formal an nouncement of his action to the coun try and to the world Saturday at a joint session of Congress. .Passports have been handed to Count Ton Bernstorff Ambassador Oarard with ail bis staff and al! Ameri c a n consuls have been ordered out of Germany. A ll German consuls in the United States are expected to with draw, that the severance of relations may be complete. American diplo matic interests in Berlin have been turned over to Spain German diplo matic interests in the United States bare been taken over by Switzerland Foreign diplomatic interests which the United States had in charge in Germany have been turned over to various neutrals. Two years of c lions, marked wit end attended with than 200 American seas, have culm in which in all the world has always led to war. Every agency of the American Government has been set in motion to protect the country against acts of German sym pathizers. These moves are of neces sity being kept secret. W ith the notice of severance ot rela tions the United States sent to Berlin a demand for the immediate release of M Americans taken from ships cap tured by German raiders in the South Atlantic. At the request of the President, Congress immediately after hearing his address began work on new laws framed by the Department of Justice to check conspiracies and plots against the United States which cannot now be reached under existing statutes. The question of convoying American ! merchant ships through the submarine blockade has been taken up and is be-j lng considered as one of the next j moves by this Government. Neutral governments have been noti- j tied of the action of the United State! and have openly been invited to fol- j low its action if the new submarine j campaign violates their rights. The breaking off ot relations came j with a crash, despite the fact that it j had been discounted and practically determined upon Friday night. The j President returned from his night con-! ference with the Senators determined that a break in relations was the only j act  consistent with the dignity and j the honor of the United States. Count von Bernstorff while ap parently deeply moved, was not sur prised. His first act was to ask Dr. Paul Bitter, the Swiss Minister, to come to the German Embassy and prepare to take over its affairs. Then he informed his wife, an American- horn woman, of the development and likewise told the embassy staff. His passports were not actually delivered until 2 oclock in the afternoon. While the President was addressing Congress one of Secretary Lansings confidential assistants called at the embassy and delivered the passports and a note in reply to the German declaration. President Wilson kept himself in seclusion during the morning, except for a brief conference with Secretary"}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "action of the United <mark>State</mark>! and have openly been"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "action of the United <mark>State</mark>! and have openly been"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.28, 517.75, 1779.65, 1051.89], "bbox_id": "a2c3d26e82", "file": "AppomattoxNewspapers_1918-1922a_0613.pdf", "page": 1, "text": "WashingtonPresident Harding in formed Congress he considered a gen eral sales tax the only feasible method of raising funds for a soldier bonus. The executive in a letter addressed to Chairman Fordney of the House Ways ttd Means Committee suggested that unless Congress saw fit to enact a sales m passage of bonus legislation should he postponed. I 1 believe, the President wrote, the American people will accept the levy of i , general sales tax to meet the pro- posed bonus payments, and we should tribute thereby no added difficulties to the problems of readjustment. li Congress will not adopt such a plan It vonld be wise to let the legislation go over until there is a situation which rill justify the large outlay.  Declaring that the Government had gnder consideration the disposition of  mrplus war properties and other trans-  tetlons which should bring great re- I lief to the treasury, the President said I It would be wise to let the legislation i go over if Congress did not deem it I advisable to adopt the sales tax.  The Presidents letter was regarded  generally at the Capitol as leaving the bonus situation even more complicated than before. Senate and House sub- I committees were to meet late in the  fay to receive and consider the White  House communication, f- When the sales tax was discussed In the sub-committees last week it 19  tnderstood that Senators were inform ed that less than 100 Republican votes t In the House could be mustered for a tales tax as a method of financing the t adjusted compensation. Such a tax E ld been considered by House leaders 1  a possibility but virtually had been  discarded. Praised By Calder. I Senator Calder of New Cork, a Re- Rhllcan member of the Senate Finance I Committee, issued a statement com- Bending President Hardings stand md declaring that all proposals for a  cash bonus should be abandoned. In the present state of the nations .nances, said Senator Calder, it , id be a mistake to pay a cash f tonus."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "it 19  tnderstood that <mark>Senators</mark> were inform ed that"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "it 19  tnderstood that <mark>Senators</mark> were inform ed that"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [872.34, 745.0, 1027.48, 1322.4], "bbox_id": "cf00ee9793", "file": "AppomattoxNewspapers_1918-1922a_0520.pdf", "page": 1, "text": "Washington.Philander Chase Knox Senator from Pennsylvania and Secre tary of State under President Taft, died suddenly at his home here. He was stricken with paralysis after de scending the stairway on his way to the dining room for dinner and passed away 15 minutes later withbut regain ing consciousness. Mrs. Knox and the Senators secre tary W. F. Martin were near the Sen ator and hurried to his aid. Dr. Sam uel Adams was summoned immediate ly, but he found Mr. Knox bey ond med ical aid. Senator Knox returned to Washing ton only last Monday night from a trip to Europe with Mrs. Knox, and he at tended the sessions of the Senate Tuesday and Wednesday. Leaving the chamber about 5 oclock, the Senator took an automobile ride through Po tomac Park and stopped on his way home to purchase tickets for a theatre performance. Reaching home, the Senator went to his library, where he remained until summoned to dinner. President Harding, Chief Justice Taft Senator Lodge of Massachusetts, the Republican leader Senator Pen rose, Pennsylvania, and other friends and close associates of Mr.- Knox were soon notified of the Senators death. The news came as a shock to all offi cial Washington, for the Senatoi through his services, first as Attorney- General under Presidents McKinley and Roosevelt and later as Secretary of State under President Taft, had a wide circle of friends in ail walks of public life, Congressional, diplomatic and legal. When Congress took a recess late in August Senator Knox left for Europe with Mrs. Knox for a vacation and was absent slightly more than three weeks He sought to reach Washington in time to vote on the Panama Canal tolls repeal, but arrived some hours after the vote had been taken. He told his associates that while he had been benefited by his vacation, he fell somewhat tired. Senator Knox was 68 years old and was serving in the Senate for a second time, having first .been appointed in 1904 to succeed the late Senator Mat thew Stanley Quay. He was elected to succeed himself in 1905, but re signed four years later to become Sec retary of State."}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "and Secre tary of <mark>State</mark> under President Taft, died"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "and Secre tary of <mark>State</mark> under President Taft, died"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1823.03, 584.23, 1979.58, 1067.98], "bbox_id": "58ab0e9f88", "file": "AppomattoxNewspapers_1918-1922a_0133.pdf", "page": 1, "text": "Washington.Definite, final notice that he will pocket the peace treaty if it comes before him with the Lodge reservation attached was served on the Senate by President Wilson. In a letter to Senator Gilbert M. Hitchcock, minority leader, the Presi dent brands practically every reserva tion in the Lodge program as a nulli fication of the covenant. Either we should enter the League fearlessly, his letter declares, accept ing the responsibility of not fearing the role of leadership which we now enjoy, contributing our efforts toward estab lishing a just and permanent peace, or we should -retire as gracefully as pos sible from the great concert ot powers by which the world was saved. For my own part, I am not willing to trust to the counsel ot diplomats the work ing out of any salvation of the world from the -things which it has suffered. The effect of the Presidents letter, written with all his old-time force and hitting power, assures defeat of the treaty, according to the opinion gen erally expressed in Senate quarters. Administration Senators, who for sev eral days -have been showing a dispo sition to weaken, now for the most part will stand firm against the Lodge program, it is believed. Their votes, added to those of the lrreconcilables, will be sufficient to prevent the two- thirds majority necessary for ratifica tion. The President shows clearly and un mistakably that he stands precisely where he stood when the matter of reservations was first proposed. The maximum he would consent to would be interpfbtationsreservations that would simply state well-recognized facts as to the constitutional limita tions which surround every treaty negotiated by this Government, al though even these he would regard as works of supererogation. -So far as Article 10 is concerned, he still looks upon it as the cornerstone of the whole document of the League of Nations."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "in Senate quarters. Administration <mark>Senators</mark>, who for sev eral"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "in Senate quarters. Administration <mark>Senators</mark>, who for sev eral"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [589.42, 561.06, 899.46, 1241.6], "bbox_id": "bb2b538e9f", "file": "AppomattoxNewspapers_1922-1923a_0074.pdf", "page": 1, "text": "Washington.Defeat of the Repub lican party in 1912 was attributed In the Senate by Chairman McCumber of the Finance Committee to the re fusal of that committee three years previously to heed the demands of newspaper publishers that newsprint paper be placed on the free list in the Payne-Aldrlch Tariff Act. His declara tion brought demands from the Demo cratic side for full details, and was followed by recitals by Senators Wat son, of Indiana Smoot, of Utah, and McCumber of Incidents which, they said, had taken place behind the scenes in Congress a decade ago. Senator Robinson, Democrat, of Arkansas, declared that if Senator McCumbers statement that the news papers of. the country, because they could not intimidate the Finance Committee into giving free newsprint had turned against the Republican party and defeated it, were true, it was a terrible indictment against the press of the United States, the men who own it and ttiW men who control its policies. Asserting that he could not accept it without first having definite and complete information, the Arkansas Senator, and later Senator Stanley, of Kentucky, demanded that Senator McCumber give the names of repre sentatives of the publishers who had made threats to the committee. Stating that he wanted to give the Senate the facts, Senator Smoot said the late John I. Norris, repre senting the Newspapr Publishers Association, had appeared before a finance sub-committee of which Mr. Smoot was a member, had refused to compromise on the matter of a duty on newsprint and had stated that if a duty were imposed the Republican party will be driven from power. The Utah Senator said he supposed this was the statement from which Senator McCumber. had drawn his conclusions, and added that he did not think Mr. Norris had been author ized by the publishers to make such a statement. Later, reiterating his original state ment that spokesmen for the publish ers had told the committee give us free print paper ànd we will support the Republican party and the Admin istration refuse to give It and we will destroy you If we can, Senator Me- attempt would be made to obtain rec- -- - - . _  . . ognition of the right claimed by the Cumber said he had been present at  o A n f o r r m o o o n n t l i r o n n r n f l m i h l i c l l P r o Treasury Department to search ves sels outside of territorial water for contraband liquor shipments. For al most a year British craft have been seized from time to time beyond the three-mile limit in connection with search for such contraband, and American courts have not passed final ly upon the Britisfi protests against the legality of this alleged extension of maritime jurisdiction."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "followed by recitals by <mark>Senators</mark> Wat son, of Indiana"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "followed by recitals by <mark>Senators</mark> Wat son, of Indiana"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [737.05, 560.06, 909.08, 1571.3], "bbox_id": "cdd04b7bf8", "file": "AppomattoxNewspapers_1922-1923a_0073.pdf", "page": 1, "text": "Washington.Defeat of the Repub lican party in 1912 was attributed In the Senate by Chairman McCumber of the Finance Committee to the re fusal of that committee three years previously to heed the demands of newspaper publishers that newsprint paper be placed on the free list in the Payne-AIdrich Tariff Act. His declara tion brought demands from the Demo cratic side for full details, and was followed by recitals by Senators Wat son, of Indiana Smoot, of Utah, and McCumber of incidents which, they said, had taken place behind the scenes in Congress a decade ago. Senator Robinson, Democrat, of Arkansas, declared that if Senator McCumbers statement that the news papers of, the country, because they could not intimidate the Finance Committee into giving free newsprint had turned against the Republican party and defeated it, were true, it was a terrible indictment against the press of the United States, the men who own it and ttt men who control its policies. Asserting that he could not accept it without first having definite and complete information, the Arkansas Senator, and later Senator Stanley, of Kentucky, demanded that Senator McCumber give the names of repre sentatives of the publishers who had made threats to the committee. Stating that he wanted to give the Senate the facts, Senator Smoot said the- late John I. Norris, repre senting the Newspapr Publishers Association, had appeared before a finance sub-committee of which Mr. Smoot was a member, had refused to compromise on the matter of a duty on newsprint and had stated that if a duty were imposed the Republican party will be driven from power. The Utah Senator said he supposed this was the statement from which Senator McCumber. had drawn his conclusions, and added that he did not think Mr. Norris had been author ized by the publishers to make such a statement. Later, reiterating his original state ment that spokesmen for the publish ers had told the committee give us free print paper and we will support the Republican party and the Admin istration refuse to give it and we will destroy you if we can, Senator Mc- i Cumber said he had been present at conferences between the publishers representatives and members of the committee and remembered details of them. He added that on one occasion, when there was a discussion of a compromise as between a duty of 6 a ton and 2.40 a ton on the paper, a publishers representative had stated that he would not yield one damn cent, and that if the committee failed to make the recommendation for newsprint the publishers would drive the party from power If they could. Senator Watson, of Indiana, told the Senate of what he said had been his personal experience with these same gentlemen In 1908, when he was a member of the House. He related that Mr. Norris and the late Herman Ritter, another representative of the publishers, had sought to force through a bill by the then Represen tative John Sharp Williams, of Mis sissippi, placing newsprint and wood pulp on the tariff free list. He de clared that Mr. Norris had visited the then Speaker Cannon in the Speakers office and told him in the presence of Mr. Watson and others that if Mr. Cannon would permit the Williams bill to go through, the publishers would start a campaign that would make him President, and that if he refused to let the bill go through they would drive him from power. The Indiana Senator related that Mr. Cannon sent for his negro mes senger and instructed him to throw Mr. Norris out of the office if he saw him there again. Mr. Cannon then ordered Mr. Norris from his office. Senator Watson continued, adding that later these same men with the same proposition appeared before the Finance Committee when the Payne- AIdrich bill was being considered and their threats had to be heard again."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "followed by recitals by <mark>Senators</mark> Wat son, of Indiana"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "followed by recitals by <mark>Senators</mark> Wat son, of Indiana"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1211.46, 1147.5, 1363.02, 1732.24], "bbox_id": "54612b0954", "file": "AppomattoxNewspapers_1918-1922a_0398.pdf", "page": 1, "text": "Washington.Breaking a precedenl which has stood since the days of Washington and Jefferson, President Harding appeared at an executive ses sion of the Senate to present nomina tions of his Cabinet officers. Within less than 10 minutes after he had finished bis address of five minutes the Senate confirmed all 10 nomina tions. The new President submitted no other nominations besides his Cabinet officers and in presenting -those to the Senate, saild he desired to maintain close and amicable relations with the Legislative body during his Ad ministration and had, therefore, pre sented the nominations in person. Mr. Harding submitted the nomina tions orally, reading the names one by one from the list he held In his hand. They were referred immediate ly to committees, which had. polled In advance, and as the names were read the chairman of each interested com mittee arose and gave the unanimous and favorable report of the committee for confirmation. After confirming the Cabinet, the Senate, still behind closed doors, dis cussed the program for the extra ses sion. Several Senators objected to suggestions for talcing up the Colom bian tieaty, but no decision was reached. It was believed that the President would not ask for consid eration of the treaty until the regu lar session in April. Nations Cabinet Personnel. The Cabinet officers as confirmed were Secretary of State, Charles Evans Hughes, of New York. Secretary of Treasury, Andrew W Mellon, of Pennsylvania. Secretary of War, John W. Weeks of Massachusetts. Secretary of the Navy, Edwin Den by, of Michigan. Secretary of the Interior, Albert B Fall, of New Mexico. Secretary of Agriculture, Henry C Wallace, of Iowa. Secretary of Commerce, Herbert Hoover, of, California. . Attorney General, Harry M. Daugh erty, of Ohio. Postmaster General, Will H. Hays of Indiana. Secretary of Labor, James j. Davis of Pennsylvania."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "extra ses sion. Several <mark>Senators</mark> objected to suggestions for"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "extra ses sion. Several <mark>Senators</mark> objected to suggestions for"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [588.47, 773.91, 744.62, 1374.09], "bbox_id": "076baebe9d", "file": "AppomattoxNewspapers_1922-1923a_0140.pdf", "page": 1, "text": "Washington.Administration forces in the Senate lost the first major leg islative contest of the extra session when Democrats and Progressive Re publicans united to recommit the res olution authorizing a loan of 5,000,- 000 to Liberia. The motion to recommit the resolu tion to the Finance Committee with out Instructions, which was offered by Senators Simmons, Democrat, of North Carolina, was adopted, 42 to 33. Republicans who voted with the Democrats to send the measure back to committee were Cameron, of Ari zona Cappdt, of Kansas Fernald, of Maine Harreld, of Oklahoma Jones, of Washington Ladd, of North Da kota LaFollette, of Wisconsin Mc- Nary, of Oregon Nicholson of Colo rado Norris, of Nebraska Poindex ter, of Washington Sutherland, of West Virginia and Watson, of Indiana. The vote was generally interpreted, as killing the resolution which was advocated by- the State Department and was passed by the House last May. Attached to the resolution as an amendment was a provision au thorizing an appropriation of 20,000,- 000 for reclamation work in the West, and another for employment by the Interstate Commerce Commission of 35 additional locomotive boiler in spectors. , The Senate rejected, 38 to 34, an amendment offered by Senator Mc- Nary, to send the resolution back to committee with instructions, p elim inate the Liberian loan feature and re port back the reclamation and loco motive boiler inspectors provisions. Administration leaders urged adop tion of the resolution on the grounds that the United States was morally obligated to extend a credit of 5,000,- 000 to Liberia as a result of Liberias participation on the side pf the Allies in the World War. Opponents con tended no moral obligation existed and charged Republicans with en deavoring to put through the loan in order to-carry political favor with the negroes in the United States. After disposing of the Liberian loan resolution the Senate took up the Dyer anti-lynching bill, but got no further than a motion to take it np. The fight over the Dyer bill, which was passed by the House last session, Is expected to occupy the remainder of the special session and continue into the regular session, beginning next Monday."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "which was offered by <mark>Senators</mark> Simmons, Democrat, of North"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "which was offered by <mark>Senators</mark> Simmons, Democrat, of North"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1757.51, 437.71, 1924.52, 1176.35], "bbox_id": "7d6482057d", "file": "AppomattoxNewspapers_1912-1915a_0184.pdf", "page": 1, "text": "WashingtonA new policy toward Nicaragua, involving the virtual con trol of the affairs of that republic by the United States through a protec torate similar to that now exercised over Cuba, was outlined by Secretary Bryan at a private conference with members of the Senate Foreign Rela tions Committee. Mr. Bryans proposal, coming as a complete surprise to most of the mem bers of the committee, has been taken by many Senators as the first pro nouncement of a general policy on the part of the Administration to extend American control over the countries surrounding the Panama Canal and to assure the stability of Central Amer ican republics and the domination by the United States of their relations with other great powers. Secretary Bryan went before the committee with a revised draft of the proposed Nicragran treaty, negotiated first in the Ten administration by which the United States would secure xcluslve canal rights across Nicaragua and a new naval base in exchange for a 3,000,000r gold payment Az a new feature of the treaty, how ever, the Secretary of State proposed that language similar, if not lndeni.ical, with the so-called Platt amendment relating to Cuiba be injected in the treaty, giving the United States sweep ing control of Nicaraguan affairs and the power to regulate her foreign re lations and her finances. Under the proposed plan Nicaragua would agree in substance That war should not be declared without the consent of the United States. That no treaties would be made with foreign governments that would tend to destroy her independence or that would give those governments a foothold in the republic. That no public debt would be con- treated beyond the ordinary resources of the Government, as indicated by the ordinary revenues. That the United States should have the right to intervene at any time to preserve Nicaraguan Independence or to protect life or property. That the United States should have the exclusive right to build a canal across Nicaragua and should have a 99-year lease to a naval base in the bay of Fonseca and to the Great Corn and Little Corn Islands In the Carrl- bean, with the privilege of renewing the lease. U. 8 . Would Pay 3,000,000. The United States in return would pay Nicaragua 3,000,009 to to be used in public works and education. It is understood the Nicaraguan Government ia willing to enter into the proposed treaty because of the star bility It would give to the present Diaz Government and to the proposed reorganization of the fiscal affairs of the republic. It is understood a re funding of the Nicaraguan debt, for which about 15,000.00 is required, does not form a specific part of the negotiations laid before the Senate committee."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "been taken by many <mark>Senators</mark> as the first pro"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "been taken by many <mark>Senators</mark> as the first pro"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [945.29, 717.65, 1102.33, 1320.65], "bbox_id": "2c8127b6ca", "file": "AppomattoxNewspapers_1915-1918a_0333.pdf", "page": 1, "text": "Washington.A controversy over what part women shall, take in the inauguration ceermonies came to a head here with an announcement by Mrs. James H. Boggs, president of the Womens Wilson Union, and a mem ber of the inaugural committee, that because of a ruling barring from the inauguration ceremonies came to a floats being organized under her di rection, she had declared, the with drawal of all women from the parade. Robert N. Harper, chairman of the committee, replied to the announce ment with the statement that Mrs. Boggs had no authority to declare such a withdrawal. He said women were wanted in fche parade, and that the state floats had been barred only be cause the plans for them were in so uncertain a stage that he feared they could not be completed in time to con form to the committees standards. The decision to withdraw, Mrs. Boggs declared, had the endorsement of the executive hoard of the Wilson Union, including the wives of many senators and representatives and other public officials, and would re ceive the backing also of millions of women throughout the country. Her announcement, issued as chairman of the womens division of the inaugural committee said Women Withdraw. The chairman of the womens divi sion of the inaugural committee an nounces the withdrawal of all women from the parade, which will take place on March 5. This decision was reached after it became known that Chairman Harper had arbitrarily ruled that state floats and automobile representations which had been planned for and financed by prominent men and women of the various states, would not be allowed in the line of parade. Although she would not add to this statement, Mrs. Boggs indicated clear ly that it only feebly expressed her indignation over the incident and that the women of the Union might have something more to say on the subject later. Mr. Harper declared there never had been such an organization as a womans division of the inaugural committee and Intimated that he would take no further notice of Mrs. Boggs announcement No one except Major General Scott, who Is grand marshal, and my self has authority to say who shall or shall not take part In the parade, said Mr. Harper. We want women to participate, provided only they con form to the same requirements that are laid down for the men."}, "highlight": {"text": {"matched_tokens": ["state"], "snippet": "parade, and that the <mark>state</mark> floats had been barred"}}, "highlights": [{"field": "text", "matched_tokens": ["state"], "snippet": "parade, and that the <mark>state</mark> floats had been barred"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [452.15, 544.44, 775.06, 1021.64], "bbox_id": "dc1dc6aff1", "file": "AppomattoxNewspapers_1898-1902a_0424.pdf", "page": 1, "text": "Washington Special.That sena tors regard seriously the prospect of an extra session of Congress, in view of the Presidents urgent recommenda tion- of legislation concerning the Phil ippine Islands, is evidenced by the ac tivity of those who desire to avoid an extra session. The speculation con cerning the probability of a called ses sion was rendered more definite by the - fact that senators known to be gener ally well informed concerning the Presidents plans joined in the discus sion ot the outlook. Capitol inquiry also developed the fact that the President has canvassed the subject with a few senators. He does not appear to have indicated any fixed determination of Issuing a call, but rather to have consulted them as to the advisability of such a proceed ing. In all such instances he seems to have bad the necessity o! Philippine legislation in view, and senators gen erally express the opinion that in case a meeting is called, the Philippine question will receive the lions share of attention. The urgency of the admin istration on thki point is due to the importunity of the Taft commission, the members of which appear to have supplemented their official recommen dations for early action with private letters not only to the President, but to members of the Cabinet and sena tors as well. They insist upon the necessity of early recognition of the civil rights ot the Filipinos, and of a government for them other than mili tary, in form. The senators who. oppose the Ship Subsidy Bill are especially opposed to an extraordinary session, and will do S t reitocBON,  Attorney-at-Law, and Commissioner In Chancery, West Appomattox, Va. CourtsFederal and State. R. HOKSLE V,Notary Public, P. O. Spanish Oaks, Va noun ty Surveyor of Appomattox County. Lands promptly Kail accurately surveyed s onnty Surveyor of Appomattox County. Anda promptlr  INHÉ tnd plots made. A h . clement ,  Attorney-at Law and Notary Public West Appomattox. T Practice in the Courts of Appomattox, Buckingham, Campbell and Amherst. O. FRANKLIN."}, "highlight": {"text": {"matched_tokens": ["senators"], "snippet": "by the - fact that <mark>senators</mark> known to be gener"}}, "highlights": [{"field": "text", "matched_tokens": ["senators"], "snippet": "by the - fact that <mark>senators</mark> known to be gener"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [391.42, 547.16, 538.36, 1068.55], "bbox_id": "148a73f46d", "file": "AppomattoxNewspapers_1918-1922a_0615.pdf", "page": 1, "text": "Washington.- -President Harding in formed Congress he considered a gen eral sales tax the only feasible method of raising funds for a soldier bonus. The executive in a letter addressed to Chairman Fordney of the House Ways and Means Committee suggested that unless Congress saw fit to enact a sales tax passage of bonus legislation should be postponed. I believe. he President wrote, the American people will accept the levy of a general sales tax to meet the pro posed bonus payments, and we should contribute thereby no added difficulties to the problems of readjustment. li Congress will not adopt such a plan it would be wise to let the legislation go over until there is a situation which will justify the large outlay. Declaring that the Government had under consideration the disposition of surplus war properties and other trans actions which should bring great re lief to t!m treasury, the President said It would be wise to let the legislation go over if Congress did not deem it advisable to adopt the sales tax. The Presidents letter was regarded generally at the Capitol as leaving the bonus situation even more complicated than before. Senate and House sub committees were to meet late in the day to receive and consider the White House communication. When the sales tax was discussed In the sub committees last week it it understood that Senators were inform ed that less than 100 Republican votes In the House could be mustered for a sales tax as a method of financing the adjusted compensation. Such a tax had been considered by House leaders as a possibility but virtually had been discarded. Praised By Calder. Senator Calder of New Cork, a Re publican member of the Senate Finance Committee, issued a statement com mending President Hardings stand and declaring that all proposals for a cash bonus should be abandoned. In the present state of the nations finances, said Senator Calder, It would be a mistake to pay a cash bonus."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "it it understood that <mark>Senators</mark> were inform ed that"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "it it understood that <mark>Senators</mark> were inform ed that"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [368.64, 223.66, 532.0, 692.94], "bbox_id": "0868af4d79", "file": "AppomattoxNewspapers_1892-1898a_0376.pdf", "page": 1, "text": "Washington Letter. From our regular Correspondent. W ashington , Jan. 25, 1897. Senator Gray, of Delaware, will this week present the credentials of Mr. Kenney, who was last work elected Senator by the legislature, and whose credentials are properly certified by the governor of that state. A hard fight is going to be made tiy the republicans to keep Mr. Ken- uey, out of his seat. Inasmuch us Mr.Kenney, who is a silver democrat, will receive the support of all the silver Sena tors, it is expected that the repub licans will devote their effort to trving to stave off a vote until after the 4th of March, when they will be stronger in the Senate. It is said that Litte Billee handlers scheme of reopening the Dupout application will be aban doued because of the refusal of some of the republican Senators to support it, and that instead the claim of the gas millionaire, Ad- dicks, which has already been pre sented to the Senate by Chandler, he is always around when any thing dirty in the political line is neededwill be urged against that of Senator-elect Kenney. Addicks has got plenty of money and if there are any votes in the Senate that can be bought, he is will ing to spend it.  Senator Turpie called up the Cam eron Cuban resolution and made a h thereon, in which he made that while he was just as in favor of the indepen- f Cuba as ever, he was re strongly in favor of ac- oh would declare the Seu- liidepeudeut of Executive"}, "highlight": {"text": {"matched_tokens": ["state"], "snippet": "the governor of that <mark>state</mark>. A hard fight is"}}, "highlights": [{"field": "text", "matched_tokens": ["state"], "snippet": "the governor of that <mark>state</mark>. A hard fight is"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [524.64, 233.37, 714.34, 1763.62], "bbox_id": "b5718a2ed4", "file": "AppomattoxNewspapers_1892-1898a_0384.pdf", "page": 1, "text": "Washington Letter. From our regular Correspondent. W ashington . Feb. 22nd, 1897. Hon. W. J. Bryan will visit Wash ington this week,but he will not prob ably stay untill Inauguration day. He will be the guest of Mr. John R. McLean, who will giye a dinner to about one hundred guests in his honor. This dinner will not be a political event, as the guests will in clude a number of personal friends of Mr. Bryan in all the parties.  Bnt-ikiring Mr. Bryans slay their I will be a conference, perhaps several, to discuss the immediate future ol the democratic party. Senator Daniel, of Va., is one of he best elocutionists in the Senate consequently Washingtons farewell address, which, in accordauc with the usual resolution was read imme Ldiately after the Senate convened, in honor of Washintons birthday. 1 8 much better rendered than- usual, and was listened to by an un usually large number of Senators, j in addition to the crowded galleries. It is unfortunate in more senses than obe that there should be a-i I investigation at this time into an act of the administration by which the step-father of the Presidents j wife will be largely benefitted. And! everybody sincerely wishes that the! Senate Committee on Public Lands will find everything straight about the Florida land patent for 23,000 lucres, which was recently issued to Mr. Perriue, the husdand of Mrs. I Clevelands mother, and which the Committee is now investigating. Ex Congressman Brookshire of In diana, is counsel for the settlers on this land, who claim that the grant was forfeited many years ago.  The Civil Service Commission has made answer to Senator Allens res olution, adopted by the Senate last week, as to the alleged dismissal of two women from a branch of the Agricultural Department, at South Omaha, Neb., for displaying pictures j lot Mr. Bryan in the late campaign. The answer says the Commission investigated the complaint when first made and that Secretary Morton denied that the discharges were! made for the cause specified, or tha I he knew the politics of those dis- I charged. The most significant por tion of the answer, especially to I those in office who regard themselves as being protected by the Civil Service Commission, is the following The Commission is not i an appointing, or reinstating, or removing body. Representative McRae, of Ark., who was one of the democratic mem bers of the coingage committee wbo I voted for the favorable report, with amendments, of the Senate bill auth orizing the President to appoint del egates fur any international nione  tary conference, called by any na tion or by himself, took occasion to I briefly state the attitude of the democrats toward the bill. He said the democrats had no faith whatever in such a method of. bring ing about the free coinage of silver, I but that they had no desire to place any obstacle in the way of the repub licans trying to carry out the prom ise made by their national platform   on the contrary, that they were anx ious for the next administration to demonstrate to the country what could be done along that line. Notwithstanding Senator Kyles assertion that he did not get the republican votes which reelected him by making promises, the repub- licaus in Washington are now count- mg upon his voting with them to obtain control of the Senate organi zation and to fill Committee vacan cies that will exist March 4th This confidence of the republicans 13 not bied upon any vague expec tation or hope they do not say Sen ator Kyle may vote with us, bin that Senator Kyle will vote with us In voting with the republicans in this particular case, should his vote settle the question, Senator Kyle will betray the principles he has professed ever since he entered the! Senate. As most people know, the Senate finance committee, as at pres ent made up, is controlied by silver although seven of its thirteen mem- bers, including the chairman, are republicans. There will be two vacancies in this committee on March 4th. Senator Sherman will enter the Cabinet and Senator Voorhees will retire to private life. The re publican leaders consider it necessary as this is the committee that will handle the new tariff bill, that both of these vacancies shall be filled by men .who can be counted upon to support the new tariff bill and to oppose any silver legislation that niay be proposed and they are say ing that Senator Kyle, whose advo- cacy of silver and free trade is widely known, will vote with them. If he does what will be the natural infer ence ? Representative Walker, of Mass, couldnt upset the Reed rules, but he conld and did express himself very vigorously on the subject, sav in part Under the rules of this House, we get mighty few rights. When you goto see about  bill, you are referred to a sub committee, and then you may cool your heels there day after day before you can get so much ar one member nf the snb- committee to bear you. And when you do he tells you he knows all about it and intimates that you are boring him. Then when he reports and -vou trJ to appeal to the fuU committee, yon get no satisfaction. He called this a sys tem of tyranny, and adned much more to the same effect."}, "highlight": {"text": {"matched_tokens": ["Senators"], "snippet": "usually large number of <mark>Senators</mark>, j in addition to"}}, "highlights": [{"field": "text", "matched_tokens": ["Senators"], "snippet": "usually large number of <mark>Senators</mark>, j in addition to"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1081.43, 475.13, 1246.73, 1141.27], "bbox_id": "f1fd57bfbb", "file": "AppomattoxNewspapers_1933-1936a_0405.pdf", "page": 1, "text": "Washington. A careful listener could have heard long sighs of relief over the collapse of the senatorial ef fort to write a more drastic neutrality law. The relief was most pronounced at the White House and State depart ment, but it was evident in many other quarters, notably among senators rep resenting states whose ports and the railroads leading to them thrive on foreign trade. And among Southern congressmen, who feared that in some way or other they would find cotton  embargoed if the law were made too drastic. All of which makes all the activities 1 of Senator Gerald P. Nye so far this session just about a perfect batting average in futility. He tried to smear ! j p. Morgan, and the elderly financier i emerged with even Nye unable to hate I him. -He tried to make Woodrow Wil- i son both putty in the bankers hands I and a liar, and got thoroughly spanked.  He tried to force a drastic neutrality law, and the committee on foreign rela- I tions, after long consideration, decided j merely to extend the present law. ! Then he attempted an insurgent meet- I lng, even threatening to block exten-  sion of the present law in order to force one more drastic, and that is petering out. There is a great deal of hypocrisy I being displayed on this whole neutral-  ity business. Lots of senators and  members of the house would like to see  the present law die, and nothing what I ever put in its place. They know per I fectly well, for example, that the pres ent embargo on arms, ammunition and Implements of war is just divert ing business, which would give employ ment in New England and other arms 1 and ammunition plants, to similar plants in England, Japan, Belgium and Czecho . I Slovakia. Which is especially annoy I ing because the shipments of those countries to Halle Selassies army are being paid for in gold and silver. So  there is no danger of either loss or of becoming involved through exten sion of credit. Avoid Quotation But very few people indeed in politl cal life or out of it are willing to talk that way for quotation. They know they would be denounced by the Nye crowd as being willing to take blood money, at the best, or as being in the pay of the Du Fonts, at the worst. Meanwhile, of course, the very notion that the chairman of the foreign rela tions committee, Senator Key Pitt man, says is likely to make war on the United Statesthat is Japanis building up her munitions industry as a result of Americas neutrality law. But that is something else again. The relief over the collapse of Nycs attempt to make the present embargo more drastic, both for the present war"}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "the White House and <mark>State</mark> depart ment, but it"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "the White House and <mark>State</mark> depart ment, but it"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [948.68, 421.26, 1111.53, 914.8], "bbox_id": "53e0725bb6", "file": "AppomattoxNewspapers_1915-1918a_0357.pdf", "page": 1, "text": "Washington.  The resolution de claring that a state of war exists be tween the United States and Germany whs passed in the Senate by a vote of 82 to 61 - Senators who cast the negative votes were Gronna, of North Dakota La Foilette,1 of Wisconsin Norris, of Nebraska Lane, of Oregon Stone, of Missouri, and Vardaman, of--Miss issippi.    Senator McCumbers substitute, to declare the existence of a state of war upon the sinking of another American ship by Germany was defeated with out a roll call. The resolution, drafted after consul tation with the State Department and already accepted by the House Com mittee, says the state of war thrust upon the United States by Germany is formally declared and directs the President to employ the entire mili tary and naval forces and the re sources of tie Government to carry on war and bring it to a successful termination. Text Of the Resolution. The text of the resolution follows Whereas, The Imperial German Government has committed repeated acts of war against the Government and people of the United States of America therefore be it Resolved by the Senate and House of Representatives of the United States of America in Congress As sembled, That the state of war be tween the United States and the Im perial German Government which has been thrust upon the United States is hereby formally declared and that the President be and he is hereby au thorized and directed to employ the entire naval and military forces of the United States and the resources of the Government to carry on war against the Imperial German Government and to bring the conflict to a success ful termination, all of the resources of the country are hereby pledged by the Congress of the United States. Hollweg Outdone By La Foilette. While few voices were raised in the Senate In opposition to war, Senator"}, "highlight": {"text": {"matched_tokens": ["state"], "snippet": "de claring that a <mark>state</mark> of war exists be"}}, "highlights": [{"field": "text", "matched_tokens": ["state"], "snippet": "de claring that a <mark>state</mark> of war exists be"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1750.3, 443.38, 1915.57, 1019.23], "bbox_id": "0be32f3f7a", "file": "AppomattoxNewspapers_1912-1915a_0156.pdf", "page": 1, "text": "Washington.  Secretary of State Wiiliam J. Bryan was the central figure in an historic scene Saturday, when he signed the proclamatioii making ef fective the Seventeenth Amendment to the Constitution, an amendment which provides that United States Senators shall be elected by direct vote of the people. , From this day on the States must follow the new constitutional mandate in selecting their Senators or else go unrepresented in the upper branch of Congress. No Senator now holding a seat in that body, however, is affected dicing his current term of office. The ceremony was simple, though necessarily formal. It took place1 In the big reception room of the Secre tarys suite of offices. Surrounding Mr. Bryan were a number of states men who had played a part in the long fight for this reform, department heads and perhaps twos core of corre spondents. Mrs. Bryan There Too. Seated at the Secretarys left w h s Mrs. Bryan. She rejoiced in no less degree than the Secretary himself In the lest act of the gret battle which her husband had led for 20 years. She, as aid all the other witnesses to the signing of the proclamation, realized the appropriateness of Mr. Bryan, the Secretary, putting into effect a reform which Mr. Bryan, the citizen, had urged so long before the country. Uked Four Pens In 8ignlng. Mr. Bryan provided himself with four pens for the occasion. The first was used to sign the word William and then given to Mr. Tucker as a souvenir. With the second the Secre tary signed the word Jennings, then handing the pen to Representative, Rucker. The third was used in writ ing the word Bryan, and this the Secretary kept himself. The date of the proclamation was written with the fourth pen, which Senator Borah re ceived as a memento. As soon .as the signature had been affixed Mr. Bryan expressed gratifica tion over the fact that the duty of officially announcing the ratification of the Seventeenth Amendment had fal len to him as Secretary of State. He remarked that the short time required for the States to act proved. that the sentiment In favor of the reform was practically unanimous throughout the country."}, "highlight": {"text": {"matched_tokens": ["State"], "snippet": "Washington.  Secretary of <mark>State</mark> Wiiliam J. Bryan was"}}, "highlights": [{"field": "text", "matched_tokens": ["State"], "snippet": "Washington.  Secretary of <mark>State</mark> Wiiliam J. Bryan was"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
