{"document": {"bbox": [437.05, 222.05, 596.0, 412.04], "bbox_id": "351dcf1954", "file": "AppomattoxNewspapers_1892-1898a_0084.pdf", "page": 1, "text": "W e herald with pleasure the an nouncement of the Rustburg Demo cratic Convention that Sterling C. Stratton will be our next Represen tative in the House of Delegates. Hr. Stratton is the man for the place. His character is so widely known and so highly respected that no encomium of ours could increase his splendid reputation. Knowing him as we do, we can most emphat ically pronounce him worthy of the hearty support of every man in this county."}, "highlight": {"text": {"matched_tokens": ["Sterling", "C", "Stratton"], "snippet": "Demo cratic Convention that <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark> will be our next"}}, "highlights": [{"field": "text", "matched_tokens": ["Sterling", "C", "Stratton"], "snippet": "Demo cratic Convention that <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark> will be our next"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2148.2, 353.26, 2318.7, 497.65], "bbox_id": "7659c09c42", "file": "AppomattoxNewspapers_1955-1957a_0582.pdf", "page": 1, "text": "Visitiag Mrs. Sterling C. Stratton Mr. and Mrs. Charles W. Lyons snd children, Sally, 12 Charles, 11, and Ann, 8, have been residing in London, England, where Mr. Lyons was assigned to .the American Em bassy. They have been visiting with Mrs. Lyons mother, Mrs. John D. Taylor, of Richmond, slater of Mrs. Sterling C. .Stratton, while on leave in the U. S. The Lyons will return abroad Sept. 15, to Athene Greece, where he will be attached to the American Embassy."}, "highlight": {"text": {"matched_tokens": ["Sterling", "C", "Stratton"], "snippet": "Visitiag Mrs. <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark> Mr. and Mrs. Charles"}}, "highlights": [{"field": "text", "matched_tokens": ["Sterling", "C", "Stratton"], "snippet": "Visitiag Mrs. <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark> Mr. and Mrs. Charles"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.55, 776.52, 1889.85, 1395.82], "bbox_id": "dc8f4a9dc6", "file": "AppomattoxNewspapers_1892-1898a_0268.pdf", "page": 1, "text": "Marriage of Hon. Sterling C. Stratton. Hon. Sterling C. Stratton, our esteemed Representative in the House of Delegates, was married on Wednesday Jan. 15 at 930 A. M., to Miss Lena Myers, o fHollins, Va. The marriage occurred in the par lor of the brides parents beautiful country home, situated some six miles from the city of Roanoke aud m sight of the famous Hollius In stitute. A large company gathered to witness the marriage Judge Woods, Dr. Woods, aud others came from Roanoke. Mr. J. Rolfe Hors ley and Dr.Taylor from Appomattox and from Hollins Institute, Dr. Cocke the president, and a number of the teachers. The wedding march played by Miss Pleasants, sounded forth as the bride attired in a handsome travelling dress, with beautiful pink carnations in her hand, entered the parlor on the aim of the groom. The ceremony was performed by Rev. J. M. Luck, assisted by Rev. Dr. Geo. Braxton Taylor. A handsome and elaborate breakfast was served after which the hndal party drove to Roanoke to catch the 1215 east bound N.  W. train. Mr. and Mrs. Stratton go at once to Richmond where they will remain until the adjournment of the Legislature, when they will return to Mr. Strattons home near Spanish Oaks. The bride, a graduate of Hollins Institute, is an especial pet of her former teacher, Dr. Cocke, and a general favorite among the teachers of her Alma Mater and throughout her neighborhood. She won all hearts also by her grace and atteact- iveness in the Stonewall neighbor hood, where she spent last winter. The presents were numerous and handsome. We extend our congratulations to Mr. Stratton and our best welcome to Mrs. Stratton as she comes to live among ns."}, "highlight": {"text": {"matched_tokens": ["Sterling", "C", "Stratton", "Sterling", "C", "Stratton"], "snippet": "Marriage of Hon. <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark>. Hon. <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sterling", "C", "Stratton", "Sterling", "C", "Stratton"], "snippet": "Marriage of Hon. <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark>. Hon. <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark>,"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [507.57, 264.74, 673.74, 1489.83], "bbox_id": "864e31a54b", "file": "AppomattoxNewspapers_1892-1898a_0103.pdf", "page": 1, "text": "Appomattox, Sterling C. Stratton. Angnsta,T. R. N. Speek and G. W. Koiner. Bath, A. F. Withrow. Bedford, Samnel M. Bolling and W. P. Burks. Bland and Smyth, J. P. Shelly. Botetourt, E. J. Brugh. Brunswick, Judge D. 8. Hicks. Bnchanan, R. Tate Irvine. Buckingham, and Cumberland, Camm Patteson. Carroll, S. E. Wilkinson. Campbell, W. M. Murrell. Charles City, James City, New Kent, Warwick and York, R. W. Per kins. Charlotte, A. S. Priddy. Chesterfield, W. W. Baker and Geo. K. Macon. Clark and Warren, H. H. Down ing. Craig and Roanoke, M. C. Thomas and  H. Logan. Cnlpeper, J. C. Gibson. Dickinson, R. Tate Irvine. Diuwiddie, Knox Thomson. Elizabeth City and AccomacBaker P. Lee. Essex, John R. Segar. Fairfax, Joseph E. Williard. Fanqnier, Eppa Hun ton, Jr., floater, and T. C. Pilcher. Floyd, Peter F. Shelton. Fluvanna, W. B. Brooking. Franklin, Peter F. Shelton, floater, and E. W. Saunders. Frederick, Charles F. Nelson. Gloucester, John N. Tabb. Goochland, W. B. Brooking. Giles, James B. Caddall. Grayson, J. W. Cox. Green, J. C. Utz. Halifax, R. L. Dejamette and T. B. Clarke. Hanover, R. H. Cardwell. Henrico, W. J. Binford. Henry, W. B. Eanes. Highland, A. F. Withrow. Isle of Wight, R. C. Boykin. James City, R. W. Perkins. King George, J. E. Mason. King and Queen, James T. Jones. King William and Hanover, Isaac Diggs. Lancaster, Howard Hathaway. Lee, Dr. W. B. Spencer. Londonn, J. F. Ryon. Louisa, A. J. Richardson. Madison, John C. Utz. Mathews, John N. Tabb. Montgomery, John N. Sumpter. Nansemond, J. E. Booker. Nelson, Bland Massie. Norfolk, M. S. Newbume. Northampton, Dr. Charles Smith. Northumberland, R. B. Spilman. Nottoway, R. G. Southall. Orange, R. P. Graves. Page, B. W. Pettis, floater. Patrick, S. A. Thompson. Pittsylvania, Engene Withers, R. J. Anderson, J. L White and N. A. HalL Powhatan, W. W. Baker and G. K. Macon. Prince George, Dr. S. B. Barham. Princess Anne, George W. Leggett. Pulaski, James B. Caddall. Rappahannock, John B. Miller. Richmond county, Howard Hath away. Roanoke, Colonel R. H. Logan and M. C. Thomas. Rockbridge, J. K. Edmondson and R. G. Paxton. Rockingham, W. H. Blakemore and C. E. Fahnney. Russell, L. M. Wilson. Scott, Miles Craft. Shenandoah, J. G. Neff. Smyth, John P. Sheffy. Southampton, W. D. Pretlow. Syotsyl vania, Solomon T. Coleman. Stafford, J. E. Mason. Sorry. S. B. Barham. Warren and Clarke, H. H. Down ing. Washington, E. S. Kendrick and W. H. Tomney. Westmoreland, R. B. Spilman. Wise, R. Tate Irvine. Wythe, Dr. R. W. Saunders."}, "highlight": {"text": {"matched_tokens": ["Sterling", "C", "Stratton"], "snippet": "Appomattox, <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark>. Angnsta,T. R. N. Speek"}}, "highlights": [{"field": "text", "matched_tokens": ["Sterling", "C", "Stratton"], "snippet": "Appomattox, <mark>Sterling</mark> <mark>C</mark>. <mark>Stratton</mark>. Angnsta,T. R. N. Speek"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1835.72, 387.85, 2157.68, 475.59], "bbox_id": "6ce7ef8904", "file": "AppomattoxNewspapers_1892-1898a_0433.pdf", "page": 1, "text": "LeGraud and M ist, , , , , ,, , , . . , , i day and sprained her ankle. Lucy Thornhill have returned from 1 , . . . . , , ,, , ,  , doing very well but her injuries are attending tl e Normal at Charlottes- . , . J n very painuil. V1 . c, c c Mr. and Mrs. Sullivan and both Miss Sterling Stratton went to -r,.-  , , , , - -c of their bright little children Eliza Roanoke last week on a visit. i , ,, , , T , v , , , land Walter attended the James Miss Anna Wood who has been i . . . . . tiiver Association."}, "highlight": {"text": {"matched_tokens": ["Sterling", "Stratton", "c"], "snippet": "Sullivan and both Miss <mark>Sterling</mark> <mark>Stratton</mark> went to -r,.-  , , , , - -<mark>c</mark> of their bright little"}}, "highlights": [{"field": "text", "matched_tokens": ["Sterling", "Stratton", "c"], "snippet": "Sullivan and both Miss <mark>Sterling</mark> <mark>Stratton</mark> went to -r,.-  , , , , - -<mark>c</mark> of their bright little"}], "text_match": 1736172819114360953, "text_match_info": {"best_field_score": "3315704201216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819114360953", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1586.1, 762.59, 1754.32, 1391.11], "bbox_id": "7a144fd887", "file": "AppomattoxNewspapers_1908-1909a_0559.pdf", "page": 1, "text": "Mrs. A. B. Chick, a well known and highly esteemed Christian lady of Appomattox county, died on Saturday, Feb ruary 26. She had been in de clining health fw several years. Although her death was not unexpected, she will be greatly missted by a large num ber of relatives and friends. She is survived by her hus band, one daughter, Mrs. C. D. Carson, one son, Claude Chick, of Danville, and the following brothers, Rev. A. L. Carson, Richmond Rev. E. V. Carson, Crozet Emmett Carson, Gaits Mill Aurelius Carson, Camp bell county .Eldridge and Vol- ney Carson, of Appomattox. Funeral service! were held Sunday afternoon iat 230 P. M., from Bethel Methodist church, with interment in the enurch cemetery. The services were conducted by Rev. A. S. J.  Rice, fromer pastor of the deceased, assisted by Rev. E. . Lewis, pastor of Bethel hurch and Rev. W. T. Hender son, pastor of Hebron Baptist church. A oui.rtet composed of Al bert Stratton, Sterling Scruggs, Russel Turnes and Elisha King sang Rock of Ages and Dome of the Soul, at the church, and In the Sweet Bye a?d Bye at the grave. Active pallbearers were Joe Carson, Eugene Roberts, Marvin Drinkard, Lester Car- son, Alien Chick and Esthmus Carson, Honorary pallbearers were  B. L. Wheeler, B. W. Hamilton, R, L. Moore, T . A . King, O. R. Turnes, Dr. R. H. Cross, Tom Caldwell, Philip Moore, Percy Garrette, Wat son Chick, Dr. C. F. James, W. C. Chick, G. O. Thornhill, C. W. Thomas and Charlie Chick. Flower bearers were Vir ginia Chick, Mary Willie Car- son, jMabel Carson, Mrs. Lyle Caldwell, Lucy Jane Chick, Mrs. Mary Clayton, Mrs. Clyde White, Mrs. Essie Chick, Alva Moore, Mrs. B. W. Franklin, Louise Carson andRachel Chick."}, "highlight": {"text": {"matched_tokens": ["Stratton", "Sterling"], "snippet": "composed of Al bert <mark>Stratton</mark>, <mark>Sterling</mark> Scruggs, Russel Turnes and"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "Sterling"], "snippet": "composed of Al bert <mark>Stratton</mark>, <mark>Sterling</mark> Scruggs, Russel Turnes and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1593.35, 785.77, 1760.46, 1414.78], "bbox_id": "c47190f189", "file": "AppomattoxNewspapers_1926-1933a_0559.pdf", "page": 1, "text": "Mrs. A. B. Chick, a well known and highly esteemed Christian Jady of Appomattox county, died on Saturday, Feb ruary 25. She had been in de clining health for several years. Although her death wa3 not unexpected, she will be greatly missed by a large num ber of relatives and friends. She is survived by her hus band, one daughter, Mrs. C. D. Carson, one son, Claude Chick, of Danville, and the following brothers, Rev. A. L. Carson, Richmond Rev. E. V. Carson, Crozet Emmett Carson, Gaits Mill Aurelius Carson, Camp bell county .Eldridge and Vol- ney Carson, of Appomattox. Funeral services were held Sunday afternoon at 230 P. M., from Bethel Methodist church, with interment in the enurch cemetery. The services were conducted by Rev. A. S. J. Rice, fromer pastor of the deceased, assisted by Rev. E. i. Lewis, pastor of Bethel hurch and Rev. W. T. Hender son, pastor of Hebron Baptist church. A Quartet composed of Al bert Stratton, Sterling Scruggs, Russel Turnes and Elisha King sang Rock of Ages and Dome of the Soul, at the church, and In the Sweet Bye and Bye at the grave. Active pallbearers were Joe Carson, Eugene Roberts, Marvin Drinkard, Lester Car- son, Alien Chick and Esthmus Carson. Honorary pallbearers were B. L. Wheeler, B. W. Hamilton, R. L. Moore, T. A. King, O. R. Turnes, Dr. R. H. Cross, Tom Caldwell, Philip Moore, Percy Garrette, Wat son Chick, Dr. C. F. James, W. C. Chick, G. O. Thornhill, C. W. Thomas and Charlie Chick. Flower bearers were Vir ginia Chick, Mary Willie Car- son, Mabel Carson, Mrs. Lyle Caldwell, Lucy Jane Chick, Mrs. Mary Clayton, Mrs. Clyde White, Mrs. Essie Chick, Alva Moore, Mrs. B. W. Franklin, Louise Carson and Rachel Chick."}, "highlight": {"text": {"matched_tokens": ["Stratton", "Sterling"], "snippet": "composed of Al bert <mark>Stratton</mark>, <mark>Sterling</mark> Scruggs, Russel Turnes and"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "Sterling"], "snippet": "composed of Al bert <mark>Stratton</mark>, <mark>Sterling</mark> Scruggs, Russel Turnes and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [363.33, 586.69, 523.98, 993.77], "bbox_id": "2bb9ef965a", "file": "AppomattoxNewspapers_1892-1898a_0358.pdf", "page": 1, "text": "Hon. S. C. Stratton. Mr. S. C. Stratton, member of the Aigislatnre from Appomattox, is an applicant for the position of register of the land office, the place hereto fore occupied by Mr. Sidney ppes, recently elected to Congrees from the Petersburg district. Under the aw, Mr. Eppea cannot hold a State nd Federal office at the same time, i.nd therefore, the position of regis ter of the land office will have to be filled by Governor OFerrall. Mr. Stratton, it is understood, is being warmly supported for the office by his friends and admirers. Mr. Stratton has served for two sessions u the Legislature, and by his ser- ices has given eminent satisfaction to his constituents.Lynchbnrg News. Mr. Stratton and Hon. H. D. lood are in Richmond now. There can be no doubt about Mr. Strattons qualifications, and Governor OFer rall could pay the citizens of this county no greater compliment than the appointment of this faithful and honored servant of Appomattox. There are other applicants for the place, but none so prominent and favorably-known as our Sterling. Hon. Sidney P. Eppes, - the present imeumbent will not resign until March, when his term as Congress man commences. Mr. Eppes pres ent term would expire Jan. 1, 1898."}, "highlight": {"text": {"matched_tokens": ["C", "Stratton", "C", "Stratton"], "snippet": "Hon. S. <mark>C</mark>. <mark>Stratton</mark>. Mr. S. <mark>C</mark>. <mark>Stratton</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "Stratton", "C", "Stratton"], "snippet": "Hon. S. <mark>C</mark>. <mark>Stratton</mark>. Mr. S. <mark>C</mark>. <mark>Stratton</mark>,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
