{"document": {"bbox": [1278.92, 1059.54, 1402.36, 1090.67], "bbox_id": "c075d5abf8", "file": "TimesVirginian_1983a_0248.pdf", "page": 1, "text": "Stratton"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "<mark>Stratton</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "<mark>Stratton</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [611.51, 1529.94, 653.46, 1541.94], "bbox_id": "4ce0a4452c", "file": "AppomattoxNewspapers_1926-1933a_0580.pdf", "page": 1, "text": "Stratton."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "<mark>Stratton</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "<mark>Stratton</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [609.61, 1505.9, 651.32, 1517.9], "bbox_id": "ed88ca3d09", "file": "AppomattoxNewspapers_1908-1909a_0580.pdf", "page": 1, "text": "Stratton."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "<mark>Stratton</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "<mark>Stratton</mark>."}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1064.4, 1216.37, 1185.41, 1306.95], "bbox_id": "2bccf11ec1", "file": "TimesVirginian_1981a_0041.pdf", "page": 1, "text": "ZVzJi? 21 Self-Propelled Mower WHITES IMPERIAL. Briggs  Stratton engine has quick rewind start, engine shroud and automatic ChO ke. 87-757 ft"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "ZVzJi? 21 Self-Propelled Mower WHITES IMPERIAL. Briggs  <mark>Stratton</mark> engine has quick rewind start, engine shroud and automatic ChO ke. 87-757 ft"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "ZVzJi? 21 Self-Propelled Mower WHITES IMPERIAL. Briggs  <mark>Stratton</mark> engine has quick rewind start, engine shroud and automatic ChO ke. 87-757 ft"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1544.67, 1037.53, 1784.51, 1584.67], "bbox_id": "d91a86341d", "file": "AppomattoxNewspapers_1943-1947a_0202.pdf", "page": 1, "text": "Zt will be a surprise to anyone to receive a letter from somebody whom you do not know and it will be more to you if you will al low me to inroduce myself as just Ralph. Maybe you are wonder ing now who am I. My name is Rafael M. Atencio of a large city in the Philippines. JI am thirteen years old and second year in the high school when the war broke Mrs. J street, ou . I am a son of a dentist in were the city, which was once a beauti ful city in the Orient. My pur pose in sending you this letter is to convey to you all in America how the Filipino boys feel proud of your soldiers where your son, Stratton Franklin belongs. I, as all o her Filipinos feel the grati tude we owe to your beloved country as a genuine liberator of our beloved Philippines from the tentacles of the wily oc opus-like Japan, which sucked the blood and life of our race and crumpled be yond human, endurance the tem- . t red-steel -like patience of the Filipino people. It is but human for me otherwise, not if I not express the, burning seniment from my heart the real apprecia tion of a true Filipino toward the realization and importance of Feb ruary, 1945, which marked the date in the page of the Philippine his ory the sudden victorious thrust of the American forces in the city against the Japanese. It wao abou five oclock P. M. day light saving time, when the first bursting of bombs land bullets heralded the victorious thrust o f the American forces in this city thus the dark clouds of uncertain ty that covered over here for al most four years has been torn in to new dawns of hopes. We have now a real new life! Especially now I have many new and lovely American friends, veiiy kind sol diers they are. One is your dear est ion, Who requested me to write to you. I wish I could be be with him in America! He is in the best of health without a scar nor a scratch, because they al ways won the battle! Let iis pray for them all to win to Victory!"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "soldiers where your son, <mark>Stratton</mark> Franklin belongs. I, as"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "soldiers where your son, <mark>Stratton</mark> Franklin belongs. I, as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [676.78, 675.8, 843.0, 802.24], "bbox_id": "17e05db236", "file": "TimesVirginian_1983a_0061.pdf", "page": 1, "text": "Zoology first dace - Ann Nolen, Kim McClenny, Susan LeGrande second place - Bryan Fulcher tbrd place  Jennifer Coleman, Robin LeGrand, Monica Stratton honor able mention - Kathy Beasley, Beth Marston. Chemistry first placp - Anita Wells second place - Donna Hamlett, Tammy Irby third place - P.D. Myrick honorable mention  Wendy Harris, Wayne Martin."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Coleman, Robin LeGrand, Monica <mark>Stratton</mark> honor able mention - Kathy"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Coleman, Robin LeGrand, Monica <mark>Stratton</mark> honor able mention - Kathy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [724.09, 718.2, 1237.68, 919.94], "bbox_id": "e66c752fc3", "file": "AppomattoxNewspapers_1955-1957a_0180.pdf", "page": 1, "text": "You have al most as many styles as when buying a more conventional type hat. Cosmetic houses are advertising lipstick, mascara, in fact all of the usual beauty aids, in waterproof editions. This is a boon to the girl 3 STONEWALL HOME DEMONSTRATION CLUB The Stonewall Home Demonstra tion Club held its regular meeting at the Community Center on May 10, with a large attendance. The demonstration was on Management of Time in Home Making and was given by Mrs. Bert Stratton and Mrs. W. E. Bondrunat, Jr. Plans were discussed for a mens beauty contest, to be held some time in June. Mrs. Stratton and Mrs. Bon- durant were hostesses for the meet ing."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "given by Mrs. Bert <mark>Stratton</mark> and Mrs. W. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "given by Mrs. Bert <mark>Stratton</mark> and Mrs. W. E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.81, 289.62, 2656.2, 414.22], "bbox_id": "d443ecaf25", "file": "AppomattoxNewspapers_1971-1973a_0210.pdf", "page": 1, "text": "You get one with a Pilot Life plan. Its the instantaneous way to get guaranteed security for yourself and your family. Check your situation. Make sure with Pilot Life insurance. I B. D. Stratton returned the University Hospital and will have to go back fetment. john Lawhorn is in a L home in Richmond. He kiday. Eugene Cyrus underwent i Monday and again Sat- IHope he may be home"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "insurance. I B. D. <mark>Stratton</mark> returned the University Hospital"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "insurance. I B. D. <mark>Stratton</mark> returned the University Hospital"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1276.56, 1004.52, 1620.87, 1099.34], "bbox_id": "4ba1ab96fc", "file": "TimesVirginian_1983a_0204.pdf", "page": 1, "text": "yilM - n sjsn v f . u Sincerely, G. Daniel Stratton Crusade Chairawa, Appawattax Uaft af the American Cancer Society Tourney benefits cause"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "yilM - n sjsn v f . u Sincerely, G. Daniel <mark>Stratton</mark> Crusade Chairawa, Appawattax Uaft af the American Cancer Society Tourney benefits cause"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "yilM - n sjsn v f . u Sincerely, G. Daniel <mark>Stratton</mark> Crusade Chairawa, Appawattax Uaft af the American Cancer Society Tourney benefits cause"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.87, 1012.51, 1604.05, 1795.8], "bbox_id": "3f8ddc6afa", "file": "AppomattoxNewspapers_1926-1933a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first, M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third, M F Moon. White potatoes, first, Mrs W A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, H ailey  Inge second, Mrs T H Inge. Mixed peas first, S L Ferguson second, Howard Inge third, T H I Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, Homer Babcock. Potato pumpkin, first, G W Reynolds second, R A Jones third, Miss Annie Caldwell. Watermelon, first, L E Smith second, M F Moon. Three squash, first, Mrs Wi P Gills, Egg plants, first, Mrs E L Smith. Navy beans, first, Mrs R F Jamerson second, Ira Burrell, third, C F Moore. Butter beans, first, Mrs Guy Smith second, Ira Burrell third,  Mrs E M Stratton. ! Lima beans, first, Mrs M C  Smith. Sheaf wheat, first, Willie Moon. Irish potatoes, first, J E Bur nett second, Guy Smith third, M C Smith. Green mountain potatoes, first, F T Cawthorn second, BessieI Gunter. Stalks cane, first, M F Moon, second, RC Jones third, C S  Cawthorn.  Sweepstakes, first, W W Far rar, second. W W Farrar, third, Mrs J R Caldwell. Peanuts, first and second none third, George Carson. Buckwheat, first, Mrs. H B Marshall. Celery, first, Mrs C R Cald- I well, second, Mrs. C R Caldwell. Beets, first, Mrs W A Moon, second, Raymond Tinsley Craw ley, third, Guy Smith. Stalks corn, first, Stratton Bros. Sheaf of wheat, first, none, second, William Moon. Bale hay, first, E L Smith. Bunch soy beans, first, Mrs 0 L Scheffler, second Ira Burrell, third, W W Farrar."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "second, Mrs C M <mark>Stratton</mark> third, Homer Babcock. Potato"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "second, Mrs C M <mark>Stratton</mark> third, Homer Babcock. Potato"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1421.5, 1003.7, 1592.79, 1423.27], "bbox_id": "961cf33820", "file": "AppomattoxNewspapers_1908-1909a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first 1 M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third. M F Moon- White potatoes, first, Mrs A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, Hafvèy Ipgé second, Mrs, T H Inge. I Mixed peas first, S L Ferguson I second, Howard Inge third, T H  Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, I Homer Babcock. I Potato pumpkin, first, G W Reynolds, second, R A Jones third, Miss Annie Caldwell. Watermelon,..first, L E Smith I second, M F Moon. Three I squash, first, Mrs Wj P Gills. - ?. pi Egg plants, first, -Mrs E L- Smith. . I Navy beans, first, Mrs R F IJamerson second, Ira Burrell, third, C F Moore. Butter beans,  first, Mrs Guy Smith second, Ira Burrell third, Mrs E M Stratton. Lima beans, first, Mrs M C Smith. Sheaf wheat, first. WilMfe."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "second, Mrs C M <mark>Stratton</mark> third, I Homer Babcock."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "second, Mrs C M <mark>Stratton</mark> third, I Homer Babcock."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [848.38, 221.28, 990.58, 640.71], "bbox_id": "d82a084137", "file": "AppomattoxNewspapers_1971-1973a_0141.pdf", "page": 1, "text": "Ye belong to Christ, Mark 941 Mr. and Mrs. Richard Krantz, Connie and Kimberley and Mrs. Elsie Krantz arrived homefrom Orlando, Fla. Tuesday. All had a grand time. They saw Disney- Land which was really wonder ful. Mr. and Mrs. Howard Elder and Mrs. Mary Gilliam, Mr. and Mrs. Melvin Stratton were din ner guests of Mr. and Mrs. Bert Stratton last Wednesday. Mrs. Annie D. Horsley under went surgery on Tuesday. Our prayers are with her. Mrs. Elsie Krantz visited her sister in Virginia Baptist Hos- sister, Mrs. Dorothy Morris, in Virginia Baptist Hospital last week. Mr. and Mrs. I. B. Wheeler went to Colonial Heights, Va., Sunday and spent the night with her sister, Mr. and Mrs. Sep Spencer. Mr. and Mrs. Hop Elliott vis ited her sister, Mrs. Jewel Trent, in Lynchburg last week. Mr. and Mrs. Howlett Martin visited Mr. and Mrs. I. B. Wheeler last Friday afternoon. Mr. Crawford Davidson goes everyday to visit his sister, Mrs. Horsley at Virginia Bap tist Hospital. The Tuesday morning Prayer Meeting met with Mrs. Penny Davis on Tuesday."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Melvin <mark>Stratton</mark> were din ner guests"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Melvin <mark>Stratton</mark> were din ner guests"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [840.7, 226.6, 990.72, 969.06], "bbox_id": "ccc033b941", "file": "AppomattoxNewspapers_1971-1973a_0467.pdf", "page": 1, "text": "Ye are strong and the word of God abideth in you. I John 214 Mr. and Mrs. Bruce Strat ton, of Thomas Terrace, spent Sunday with Mr. and Mrs. Marshall Stratton and attend ed church at Hebron. Mr. and Mrs. William Alvis, of Lynchburg, spent Sunday with Mr. and Mrs. J. P. Alis, Sr. Mr. and Mrs. Claude Trent and Dana, of Charlottesville, spent the week end with her parents, Mr. and Mrs. Wallace Bondurant. Miss Rhonda Trent spent the week end with Miss Mary Davidson. Mr. and Mrs. J. L. Harrison visited her father, Mr. J. O. Davidson, Saturday. Mr. John Laughon is in Lynchburg General Hospital and is doing fine. Welcome to The Curran and Ewers families who have just moved into the neighborhood. Mr. and Mrs. Bob Harris visited Mrs. Nina Caldwell and Mrs. Elsie Caldwell Sunday. Mr. and Mrs. H. B. Jones and family and Ben Wheeler visited Mr. and Mrs. I. B. Wheer over the week end. Mr. and Mrs. I. B. Wheeler received word from Airman Brad Wheeler, who is in North Dakota for training. He likes fine and would spend the week end in Canada. We wish a lot of luck for this young man. Master Scott Elliott is a patient in intensive care at Lynchburg General Hospital having had an accident with a Bush Hog Saturday at his home. We wish him a speedy recovery. Mr. and Mrs. Jimmy Lowe, of Va. Beach, and sons spent the week end with his mother, Mrs. Hop Elliott. Mr. and Mrs.Hatcher King are in Christiansburg with his sister, Miss Josie King, who is in the hospital. We wish her a speedy get-well. Mr. and Mrs. Wallace Bondurant and Richard, Mr. and Mrs. Claude Trent and Dana visited Mr. and Mrs. I. B. Wheeler Saturday night. Mr. and Mrs. I. B. Wheeler went to Colonial Heights Wednesday to visit Mr. and Mrs. Sep Spencer. They are both doing fine."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Marshall <mark>Stratton</mark> and attend ed church"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Marshall <mark>Stratton</mark> and attend ed church"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1674.7, 360.45, 1839.69, 504.94], "bbox_id": "a93aad0ce4", "file": "AppomattoxNewspapers_1898-1902a_0428.pdf", "page": 1, "text": "XR OFFICERS. APPOMATTOX, OOUNTT OrriOIRS. Judge of Circuit CoimOeo. J, Hundley Courts, tin t day of April itnd October. Judge of County CourtD. A. Christian Courts, Thursday after first Monday. Clerk of Circuit and county CourtsGeo. T. Iter. - a tto rn e y for CommonwealthH. D. Flood r-benffS- P. Coleman. TreasurerD. Mott Bvbertson. C om m issioner of Revenue-L. K. Smith. B oard of Supervisors W. h . Ligón, chair- man 8. C. Stratton and J. C. Jones. Board j m eats on Wednesday after first Monday In March, June, September, end December."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "chair- man 8. C. <mark>Stratton</mark> and J. C. Jones."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "chair- man 8. C. <mark>Stratton</mark> and J. C. Jones."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.24, 464.88, 1689.67, 1442.32], "bbox_id": "696ee9f1d1", "file": "AppomattoxNewspapers_1926-1933a_0417.pdf", "page": 1, "text": "Xmas holidays passed off very quietly. Lots of visitors came back to spend Xmas with the home folk and some went away for the holidays. Quite a numoer of parties for the younger set Miss Virginia Chick entertained a number her friends at a birthday party on the evening of the 26th. Mis Hazel Taylorwas hostess to the younger set Monday night. The flu epidemic is quite serl ous around here. Some families are ali in bed. The schools wi remain closed until an. 17th on account of flu. Rev. A. I. Caudle spent Sat night with Mr. W. S. Taylor and family. On account of flu there was no services at Hebron last Sunday. Rev. Caudle motorec to Durham, N. C-, Sunday p. m or his family, where they were spending the holidays. Mr. J. H. Elder and family, lrs. G. A. Jacobs and children returned to Richmond Sunday after spending the holidays with Mr. and Mrs. C- M. Stratton. Miss Hazel Taylor left Sunday or Richmond to resume her duties in school. Mrs. J T. Whitten spent part of the holidays in High 3oint, N. C., with her daughter Mrs. Whitten is sick with flu. Mrs. J. W. Neighbors visitec her son, Jim, in Lynchburg few days last week. Mr. and Mrs. W. D. Parris are happy over the arrival of their twins, boy and a girl. Mr. and Mrs- C. M. Stratton spent Wednesday with their daughter, Mrs. D. A. Christian Mr. and Mrs. S. E. Anderson Mrs. C. M. Stratton, Mr. and Mrs. W. H. Drinkard, Mr, anc Mrs. C. T. Drinkard and Cla,yton Jr., attended the funeral of S P. Taylor in Bedford county Monday. Rev. H. B. Jennings Jr., of Leesburg, was Xmas guest of his brother, F. E. Jennings and family. Parks Jennings returned from Richmond Saturday nite after a stay of several weeks. While there tie contracted flu and re mained longer than expected Mrs. Jennings and four children were all in bed with flu when he reached home. Glad to say they are improving. Doctors are kept busy in this community as there is so much sickness. Mr. and Mrs. Clayton Drink ard and Clayton, Jr., returned Thursday from Franklin, where they spent the holidays. Miss Annie Alvis left Tuesday for Farmville, after spending the holidays at home.. She had as her guests Miss Alice Street Davis and Jeffers Street o f Lowesville, and Miss Evelyn Smith of Farmville. Prof. Kenneth Alvis of Athens Ga., visited home people Xmas."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. C- M. <mark>Stratton</mark>. Miss Hazel Taylor left"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. C- M. <mark>Stratton</mark>. Miss Hazel Taylor left"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.49, 415.68, 1646.72, 1391.67], "bbox_id": "4da4b1663c", "file": "AppomattoxNewspapers_1908-1909a_0417.pdf", "page": 1, "text": "Xmas holidays passed off very quietly. Lots of visitors came back to spend Xmas with the home folk and some went away for the holidays. Quite a numoer of parties for the younger set Miss Virginia Chick entertained a number her friends at a birthday party on the evening of the 26th. Mis Hazel Taylor was hostess to the younger set Monday night. The flu epidemic is quite serf ous around here. Some families are all in bed. The schools wil remain dosed until Jan. 17th account of flu. Rev. A. I. Caudle spent Sat, night with Mr. W. S. Taylor and family. On account of flu there was no services at Hebron last Sunday. Rev. Caudle motorec to Durham, N. C., Sunday p. m jor his f amily, where they wen spending the holidays. Mr. J. H. Elder and family lire. G. A. Jacobs and children returned to Richmond - Sunday after spending the holidays with Mr. and Mrs. C M. Stratton, Miss Hazel Taylor left Sunday or Richmond to resume her duties in school. Mrs. J. T. Whitten spent part of the holidays in High oint, N. C., with her daughter. Mrs. Whitten ib sick with flu. Mrs. J. W. Neighbors visited her son, Jim, in Lynchburg few days last week. - Mr. and Mrs. W. D. Parris are happy over the arrival of their twins, boy and a girl. Mr. and Mrs. C. M. Stratton spent Wednesday with -their daughter, Mrs. D. A. Christian. Mr. and Mrs. S. E. Anderson, Mrs. C. M. Stratton,- Mr. and Mrs. W.-H. Drinkard, Mr, and Mrs. C. T. Drinkard and Clayton Jr,, attended the funeral of S P. Taylor in Bedford county Monday. - Rev. H. B. Jennings Jr., of Leesburg, was Xmas guest of his brother, F. E. Jennings and family. Parks Jennings returned from Richmond Saturday nite after a stay of several weeks. While there he contracted flu and re mained longer than expected, Mrs. Jennings and four children were all in bed with flu when he reached home. Glad to say they are improving. . Doctors are kept busy in this community as there is so much sickness. Mr. and Mrs. Clayton Drink- ard and Clayton, Jr., returned Thursday from Franklin, where they spent the holidays. Miss Annie Alvis left Tuesday for Farmville, after spending the holidays at home.. She had as her guests Miss Alice Street U av im n d Jeifers Street o f Lowesville, and Miss Evelyn Smith of Farmville. Prof. Kenneth Alvis of-Athens  Ga., visited home pdople Xmas."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. C M. <mark>Stratton</mark>, Miss Hazel Taylor left"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. C M. <mark>Stratton</mark>, Miss Hazel Taylor left"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1521.14, 720.74, 2187.98, 787.84], "bbox_id": "402c787e6a", "file": "AppomattoxNewspapers_1943-1947a_0155.pdf", "page": 1, "text": "xi y M. L. M. I    -      , . 7  performed by ,he Rev. H. F len Wheeler and Joe Meggin- Kmgnam 01 u ue e a 1 Stratton, of Concord Depot, Vir- Jones in the Baptist parsonage at inentilast Saturday in Rich- Mr. and Mrs. Watt Stanley and ginia, has been chosen by popular Appomattox Saturday, February  daughter are now occuping an vote at Lynchburg College to pre- 10, at 230 P. M. in the presence I apartment in the dormitory. I side as Queen over the Spring of Mrs. H. P. Jones, Mrs.  Festival, which will take place in Page Miss Mary Judy O Brien,Au- De-  drey and Carolyn Page."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "ue e a 1 <mark>Stratton</mark>, of Concord Depot, Vir-"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "ue e a 1 <mark>Stratton</mark>, of Concord Depot, Vir-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [543.59, 288.08, 691.47, 1035.35], "bbox_id": "d1777f1581", "file": "TimesVirginian_1976_0137.pdf", "page": 1, "text": "Xi Gamma Tau Chapter of Beta Sigma Phi sorority met Monday at the home of president, Janet Noble. Faye Stratton, service chair man, announced that 70 of the 9150 goal to purchase a Book Drop Box for the Appomattox County Library, has been collected. Members have been asking Appomattox citizens interested in the library to donate, a dollar or more, toward providing the County library with a facility where patrons can leave books when the library is closed. Anyone interested in donating to the fund is asked to contact Mrs. T. L. Stratton or any member of the chapter to make a contribution. The library pro vides an invaluable service to our community. This is one small way our citizens dm serve the library and at the same time make returning books more convenient for themselves. Xi Gamma Tau announced new officers elected at the previous meeting. Serving the chapter during this coming fiscal year are Janet Noble, president Elaine Stanley, vice president Anne Harris, record ing secretary Faye Stratton, corresponding secretary Shei la Smith, treasurer and Martha Stimpson, extension officer. In other business, plans were finalized for a free Blood Pressure Clinic to be held in co-operation with the Appo mattox County Rescue Squad on two consecutive Saturdays in May. May 8th a clinic station will be set up at Kings in Triangle Plaza from 10 a.m.  2 p.m., and on May 15 a station will be set up at Wilbuns on Rt. 460 from 10 a.m.  2 p.m. Adults, regardless of age, are encouraged to take advantage of this free service, it is painless and takes very little time, yet it can help pinpoint early signs of cardiovascular problems. A couple of moments to check your blood pressure can uncover high blood pressure, a condition which can lead to stroke or heart attack. You owe it to your loved ones, so mark it me- your, calender -uuri-malro-a- real effort to gb. You health really matters! Do something about it."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "president, Janet Noble. Faye <mark>Stratton</mark>, service chair man, announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "president, Janet Noble. Faye <mark>Stratton</mark>, service chair man, announced"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.9, 1008.99, 1564.6, 1123.38], "bbox_id": "882fe1991c", "file": "AppomattoxNewspapers_1955-1957a_0305.pdf", "page": 1, "text": "x community was so saddened Friday to hear of the death j its most beloved citizens, pent Stratton. He will surely .sed by his many, many friends. as orn and reared in our com- J and had spent the most of if j e among us. We want to J deepest sympathy to his wife daughter, brother and sisters, Mer loved ones."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "most beloved citizens, pent <mark>Stratton</mark>. He will surely .sed"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "most beloved citizens, pent <mark>Stratton</mark>. He will surely .sed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [945.58, 841.49, 1120.88, 1475.28], "bbox_id": "85a5e6aad7", "file": "AppomattoxNewspapers_1955-1957a_0396.pdf", "page": 1, "text": "writing. We hope she will soon be feeling much better. Mrs. A. A. Babcock is visiting her mother and her sister, Mrs. W. R. Stratton. Mrs. R, H. Routon and sons, Wal ter, John and Shelton, and Mr. and Mrs. E. L. Chick were the dinner guests of Mr. and Mis. Wilton Rou ton on last Saturday. 1 S 0 glad to hear Mr. Marvin Stratton is improving, in Charlottes ville, Va. Mrs. Stratton visited him on Saturday and found him feeling lots better and he looked better. We hope he will soon be well and back home. Rev. Aaron Smith preached at Bethel on Sunday morning at 11 oclock, and he was the dinner guest of Mr. and Mrs. C. M. Strat ton. He also visited other friends in the afternoon. He is always a wel comed guest in our community. Mr. and Mrs. E. L. Chick visit ed their daughter, Mrs. Henry Beard and her family on Sunday. Mrs. Beard is on the sick list. She has an abscessed tooth. We hope She will soon be well of this ter- 1 rible painful thing. Mr. and Mrs. Frank Moore and children, of Brookneal, and Mr. and Mrs. Bud Gauldin, of Lynchburg, spent the week-end with Mr. and Mrs. Melvin Moore. iMr. and Mrs. Vinson Russel and children, Mark and Bonnie Lynn, of Richmond sp,ent the week-end with her parents, Mr. and Mrs. Lyle Thomas. Mr. and Mrs. Tilbon Lee and fam ily visited her parents, Mr. and Mrs. Wash Wheeler on Sunday. Siorry to know Mr. Wheeler is .still on the sick list. Mr. and Mrs. Parks Jennings vis ited her brother, Mr. Tom Christ ian in Virginia Baptist Hospital on Sunday. Mr. and Mrs. Harold Stratton and baby, of Oakville visited her .parents, Mr. and Mrs. Bert Strat ton over the week-end- Sorry to hear that Mrs. J. L Beard is on the sick list. Her son, Henry and grandson, Lawrence, vis ited her Sunday morning. We hope for her a speedy get well. Mr. Wallace Bondurant received word Monday that his brother, Tom mie, who is in a Richmond hospi tal, had another operation last Week, and was getting better. We"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "sister, Mrs. W. R. <mark>Stratton</mark>. Mrs. R, H. Routon"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "sister, Mrs. W. R. <mark>Stratton</mark>. Mrs. R, H. Routon"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [190.31, 1042.8, 349.68, 1387.1], "bbox_id": "2e4f4a8fe5", "file": "AppomattoxNewspapers_1902-1905a_0570.pdf", "page": 1, "text": "Wright . ....... 1 58 43 7 1 1 104 Treut ............... KJ 30 2 28 ! 120 Huunah ......... 17 42 44 17 ! 1 120 Johnson ......... 40 47 1 17 ! 110 Paulette ........  17 44 0 70 LeGrand ....... 50 7iJ 27 150 1 .igon............... 02 8ÍI Hi 1 I 221 Jones .............. 127 1 12 i 140 Coleman......... 30 14 20 I 78 Lee, .................. 125 0 24 155 M o ses ............ 30 11 21 , 09 Howerton , 1 10 25 114 P uryeor ........ 37 44 101 182 Thorpe ........... lu 48 5 IIS Stratton ....... 30 02 80 180 Cunum 7 28! 21! 5C Thorufetll  41.Mi 971 207 K y le . ............... 8 21 H 35 Robert son __ 89 1 1 80 It will be observed by the returns that a change of six votes in Clover Hill district in favor of Captuio Johnson would have elected tha gentleman on the committee instead of Mr. Presley Hannah. Captain Johnson, at the very first news of the returns, expressed himself us beirg dissatisfied, and he may look into the Rocks precinct, where he is only given one vote by his old Confederate friends. Other rumdrs of irregularities have been made, but none of tlv defeated candidates bo far as knowi have any idea of contesting the re sult with the lucky nominees. The total vote is probably 100 short of the full Democratic vote."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "lu 48 5 IIS <mark>Stratton</mark> ....... 30 02 80 180"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "lu 48 5 IIS <mark>Stratton</mark> ....... 30 02 80 180"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [891.6, 1685.3, 1199.52, 1723.93], "bbox_id": "a0cb9a69fd", "file": "AppomattoxNewspapers_1922-1923a_0077.pdf", "page": 1, "text": "wounoea uy   7T hot Hnquent. Mr. Stratton was charged fired by Lawson before Arthur collecting 217,058.80, by Commis-   S i  - S i ?"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "wounoea uy   7T hot Hnquent. Mr. <mark>Stratton</mark> was charged fired by Lawson before Arthur collecting 217,058.80, by Commis-   S i  - S i ?"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "wounoea uy   7T hot Hnquent. Mr. <mark>Stratton</mark> was charged fired by Lawson before Arthur collecting 217,058.80, by Commis-   S i  - S i ?"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1438.58, 390.13, 1565.74, 606.31], "bbox_id": "da6709cafe", "file": "AppomattoxNewspapers_1955-1957a_0320.pdf", "page": 1, "text": ".work of the Childrens Home K Virginia, the largest seency in Virginia, is be- oit this year by Mrs. Al f r e d and a host of oth- nterested in this agency. Mrs. md. of Appomattox, has been Jthsiman of the 1956 drive ppomattox County, according luel M- Bemiss, president of Society . drive, which will begin Mon- Nov, 5 , and extend through 10 will have the following co- ors throughout the county 5 John Kent Hamilton, Ever-.  Mrs. 0. W. Martin, Jr., Oak- Mrs. Nell D. Walton, Spout gey, w . M . Black, Pamplin C. M. Stratton, R. F. D. 2, rd Mrs. C. R. Addington, and Crawford Davidson, He-"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Black, Pamplin C. M. <mark>Stratton</mark>, R. F. D. 2,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Black, Pamplin C. M. <mark>Stratton</mark>, R. F. D. 2,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.09, 1135.85, 1860.77, 1355.4], "bbox_id": "6d8fd9c68d", "file": "AppomattoxNewspapers_1943-1947a_0003.pdf", "page": 1, "text": "Woodland, Aug. 25.- Mrs. Odell Howe .ton has returned home after visiting her sister, Mrs. J. P. Mar shall. Mr. and Mrs. Twyman Coleman  and sons and Mr. and Mrs. W. L. oleman visited Mr. and Mrs. B. D. Stratton at Boonsboro Sunday. Miss Jean Cheatham is visiting i relatives in Williamsburg. Mrs. Hus on Reams and daugh ters from Green Village, N. J.,were recent visitors of Mr. and Mrs. Russell Woodson. Mrs. Bertha Austin is visiting her sister, Mrs. W. L. Coleman. Miss Mary Ellen Coleman and Mr. and Mrs. Lewis Carroll and Boiby spent the week-end with Mr. and Mrs. W. L. Coleman. Mr. and Mrs. H. C Thomas and son, from Richlands, Va., were re cent visi ors in the home of Mr. and Mrs. J. P. Marshall."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. B. D. <mark>Stratton</mark> at Boonsboro Sunday. Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. B. D. <mark>Stratton</mark> at Boonsboro Sunday. Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [209.53, 1621.2, 2100.03, 1670.61], "bbox_id": "f1e3b78ecc", "file": "TimesVirginian_1984a_0088.pdf", "page": 1, "text": "wn is onb one leader.. .Wheel Horse. Shop around and compare, fou wont find a beHir value m town tractor, anpriwre. 11-horsepower. Syndro-batanrad  Optiond attodmarita inciudt your chaica 8rigga  Stratton engine preuMw u u fe eff 5 ful-Hoetiwg. onti-tafe marner Slacks - Reg. 26.00"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "inciudt your chaica 8rigga  <mark>Stratton</mark> engine preuMw u u"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "inciudt your chaica 8rigga  <mark>Stratton</mark> engine preuMw u u"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2394.25, 1190.68, 2559.45, 1688.12], "bbox_id": "45cb8dd959", "file": "AppomattoxNewspapers_1892-1898a_0046.pdf", "page": 1, "text": "wm broughttwfore themeetina and broughtbefore the meeting and accepted the nomination. He a m that he wm Democrat, and would do his utmost to scour a victory for the Democratic patty in this oontest and if elected would render the beat service in his power to the people of the Bounty, Speeches were then made by H. D. Flood, T. J. Stratton, J. W. Flood, W, J. Trent, J. H. Abbitt, and Dr. Morton. All of these gen tlemen regretted the attitude of Mr. Peers in this contest and urged Upon all Democrats the duty of support ing the nominees oi the meeting. Dr. Morton said that he wm a Peers man before the nomination, butneup he was lo t the namiaeek AbbHt H. D. Flood gave a history of the consideration shown Mr. Peers, by the Democratic committee before they decided to have  nomiaatim deferring action in defacenoe to lb wishes until our opponents hud pot a ticket in the field, and of the num ber of proposition made h ty Mr. Abbitt, by which Peers ooulu have become the Demoorotie nomi nee all of which he declined, life. - Flood said if the party desmed fo  maintain its organisation and ft self-respect and n tein the resptetef jrave and true men, there was but one course and that wm the course pursued by the party. the full ticKet put in the field by the meeting would be elected, but if it went down in defeat it would have the respect alike of M end ipd fori The meeting then adjourned amid .great enthusiasm. a"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "D. Flood, T. J. <mark>Stratton</mark>, J. W. Flood, W,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "D. Flood, T. J. <mark>Stratton</mark>, J. W. Flood, W,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [671.74, 205.09, 1000.52, 444.58], "bbox_id": "640bcc5a5d", "file": "AppomattoxNewspapers_1892-1898a_0417.pdf", "page": 1, "text": "Wm. A. Moses true bill. Ann Maria Wheeler  true bill. Alexander Christian  not a true bill. Will of Mrs. L. A. Owen admitted to record. A. H. Clement on motion allowed  to practice the law in this court.  F. W. McKinney qualified as con stable for Clover Hill district, with J. W. McKinney. C. II. Sackett, and Geo. T. Peers as suretiesbond  2,000 D. P. Ferguson, Overseer Poor m Clover Hill district, qualified, with w S. L. Ferguson as surety, bond 500. Fnris, O. W. Blanton, ir., W. _. W. II. Ligon, Supervisor for  Jackson, B. A. Wilson, W. A. W Clover Hill district, qualified with S. C. Stratton as surety, bond 1,000. S. C. Stratton, Supervisor for"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "qualified with S. C. <mark>Stratton</mark> as surety, bond 1,000."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "qualified with S. C. <mark>Stratton</mark> as surety, bond 1,000."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1398.0, 1635.61, 1540.51, 1808.17], "bbox_id": "bd711e38dc", "file": "TimesVirginian_1978_0459.pdf", "page": 1, "text": "wm  l Traci Schmutz spent the week end with Charlotte Moore. Jennifer Schmutz visited during the week end with Monica Stratton. Mr. and Mrs. Tom Schmutz and Edward visited Mr. and Mrs. Raymond Hamilton, of Richmond Sunday. Mrs. H. C. Moore returned home with them. Mr. nid Mrs. Aired Moore visited Mr. and Mrs. Sherman Hunter Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "week end with Monica <mark>Stratton</mark>. Mr. and Mrs. Tom"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "week end with Monica <mark>Stratton</mark>. Mr. and Mrs. Tom"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.56, 997.04, 1476.45, 1673.51], "bbox_id": "780625d2fd", "file": "TimesVirginian_1980a_0133.pdf", "page": 1, "text": "with venise lace. The sheier bishop sleeves were trim med at the cuffs with venise lace. The skirt had a center front insert ..of pleated organza and an attached chapel length train.She wore a fingertip veil of silk illusion appliqued with flowers, which was edged with complimentary lam. The cap was Juliet style covered with laced flowers and decorated with pearls. She carried a bouquet of white rose buda, white daisies and babys breath. Mrs. Patsy Pierce of Appomattox, sister of the bride, was matron of honor. She wore length , beige floral dress-leatunng a cowl neck, sleeveless with draw strings on shoulders and tie belt. She carried a bouquet of pink daisies with pink and blue streamers. Other attendants were Miss Janet Fitzgerald, Miss Nancy Stratton, Mrs. Cindy Watson, and Mrs. Debbie Drinkard, all of Appomatt- tox. They .wore a slipper length light blue satin dress made identical to the matron , of honor and carried a bouquet of pink daisies with blue streamers. Mr. McClary served as his sons best man. Ushers were Mr. Jimmy McClary, brother of the groom, Mr. Greg Love, Mr, Dwayne Scruggs and Mr. H. L. Williamson, Jr., all of Appomattox. Misses Lori Goin and Susan Cheatham of Appo mattox were flower girls and Master Scott Goin of Appomattox was ring bear er. Directors were Mrs. Her bert Garrett of Spent Spring and Mrs. Robert Garrett of Appomattox. Miss Sue Thomas of Appomattox and Miss Deb bie McFadden of Gladstone registered the guests. Following the ceremony the brides mother was host for a reception in the church social hall. The reception was hostedby Mrs. fienault and Mrs. Edith"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Janet Fitzgerald, Miss Nancy <mark>Stratton</mark>, Mrs. Cindy Watson, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Janet Fitzgerald, Miss Nancy <mark>Stratton</mark>, Mrs. Cindy Watson, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1899.82, 217.28, 2032.28, 531.37], "bbox_id": "5cd7d26c90", "file": "TimesVirginian_1980a_0221.pdf", "page": 1, "text": "with rice-steamed or fried. Peanut oil is recommend ed for use in Chinese cooking because it can reach the very high tem peratures without smoking. . When the meal was completed cooking the group gathered around the dining room table and were served Beef Sukiyaki with rice, tea. fruit compote, fortune cookies, and frozen cake,the group using chop sticks if preferred. Mrs. Helen Stratton en tertained by playing Chop Sticks on the piano.  The meeting was called to order by Mrs. Dixie Staten, club president. Devoitons and prayer were given by JArs. Harden, who read from God in My Kitchen - article A Woman With No Trouble. . Mrs. Margaret Lee, sec retary, gave the minutes of the May meeting and the treasurers report was given and approved."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "if preferred. Mrs. Helen <mark>Stratton</mark> en tertained by playing"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "if preferred. Mrs. Helen <mark>Stratton</mark> en tertained by playing"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [778.29, 1173.54, 1062.9, 1267.54], "bbox_id": "1097d78919", "file": "AppomattoxNewspapers_1962-1965a_0320.pdf", "page": 1, "text": "with Mrs. Twyman Coleman. Tuesday, Jan. 7   Lee- burg. Also, Mr. and Mrs. Lloyd Vaughan and son. Bill Mr. and Club will meet at 130 p.m. at M rs. Jacob Lewis, Katherine, the Home Agents office. Ray, John, Bill, and Nancy, all Thursday, Jan. 9  Stonewall I of Appomattox. Also, Luther Club will meet at 2 p.m. with  Lewis, of Lynchburg. Also, Mr. Mrs. Kelly Stratton. j and Mrs. James Vaughan, Jr. Thursday. Jan. 9  Clover Hill Jimmy, Lynn, and Miss Ann Club will meet at 730 p.m. with Vaughan and Mr. Ronnie Vaug- Mrs. Verna Conner. 1 han, all of Richmond."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Also, Mr. Mrs. Kelly <mark>Stratton</mark>. j and Mrs. James"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Also, Mr. Mrs. Kelly <mark>Stratton</mark>. j and Mrs. James"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [949.87, 484.31, 1244.73, 943.41], "bbox_id": "09054faf3f", "file": "AppomattoxNewspapers_1960-1962b_0683.pdf", "page": 1, "text": "with her sister, Mrs. Parks Mrs irby Wheeler visited j Jennings and her family. ! Mrs. Parks Jennings and Mrs. Mr. and Mrs. Earl Agee and I Agnes Carson on last Thursday, baby son, of Appomattox, spent Mr anj Mrs. Wilton Burton j Sir day with her parents, Mr.  anj nttle grandson, Mike Woot- and Mis. Gilden Lee. en visited Mr. and Mrs. E. L, The Rev. and Mrs. John Leit- Chick last night, ner and Mr. and Mrs. Alex Cy-  - __ _ ____ _  rus visited with Mr. -and Mrs. E. L. Chick last Tuesday eve ning and night. Mrs. Sallie Younger and two grandchildren and Mrs. Ruby Oaks, of Rustburg, Mrs. Agnes Carson, Mrs. Ida Stratton and Mr. and Mrs. Richard Bondur- ant were dinner guests 6 f Mr. and Mrs. Wallace Bondurant, Sr. on Sunday. The Rev. and Mrs. W. L. Ayers and children and Mr. and Mrs. E. L.-Chick joined the chil dren of Mr. C. p. Drinkard at he home of Mr. and Mrs. Wes ley Bethel on Sunday for a family get together. Mr, Drink- Merlvn Martin ard was feeling fine and all had such a nice day together, and a most grand dinner with every thing you can name to eat. Mr. and Mrs. Billy Burnette, of West Virginia, spent the week end here with Mr. and Mrs. Ru- ful Burnette. Mr. and Mrs. Tom Christian, 3 f Covington, spent the week end here with relatives. Mrs. W. R. Stratton, of Ap- I pomattox, visited in our com munity on Sunday. Mr. Martin Krame has returned  home from a Richmond hospital j and is much improved. Mr. and Mrs. Sam  Davidson and children and Mr. and Mrs i Tommie Davidson and Joy at-"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Agnes Carson, Mrs. Ida <mark>Stratton</mark> and Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Agnes Carson, Mrs. Ida <mark>Stratton</mark> and Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2204.41, 328.7, 2370.75, 404.0], "bbox_id": "8bb84ce49f", "file": "AppomattoxNewspapers_1939-1943a_0547.pdf", "page": 1, "text": "with her parents, Mr. and Mrs. O. R. Turnes. She spent the week-end with Mrs. Ruth Downs, in Norfolk. Miss Margaret Stratton, of Lynch burg College spent the week-end with her parents, Mr. and Mrs. P B. Stratton."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "in Norfolk. Miss Margaret <mark>Stratton</mark>, of Lynch burg College"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "in Norfolk. Miss Margaret <mark>Stratton</mark>, of Lynch burg College"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.38, 540.01, 1299.59, 753.96], "bbox_id": "6a019e99c9", "file": "AppomattoxNewspapers_1962-1965a_0001.pdf", "page": 1, "text": "with her ----- . ----- Jennings and her family.  Mrs. Parks Jennings and Mrs. Mr. and Mrs. Earl Agee and l Agnes Carson on last Thursday, baby son, of Appomattox, spent jr and Mrs. Wilton Burton Su-day with her parents, Mr. L nd littie grandson, Mike Woot- and Mrs. Gilden Lee. en visited Mr. and Mrs. E. L. The Rev. and Mrs. John Leit- chick last night, ner and Mr. and Mrs. Alex Cy- ---- - ----------------- rus visited with Mr. and Mrs.  i i i A s s o c i a t i o n E. L. Chick last Tuesday eve- I H   X l A h s U L ld U i oing and night. Mrs. Sallie Younger and two grandchildren and Mrs. Ruby Oaks, of Rustburg, Mrs. Agnes Carson, Mrs. Ida Stratton and Mr. and Mis. Richard Bondur- ant were dinner guests of Mr. and Mrs. Wallace Bondurant, Sr. on Sunday. The Rev. and Mrs. W. L. Ayers and children and Mr. and Mrs. E. L. Chick joined the chil-"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Agnes Carson, Mrs. Ida <mark>Stratton</mark> and Mr. and Mis."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Agnes Carson, Mrs. Ida <mark>Stratton</mark> and Mr. and Mis."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1682.87, 856.0, 2163.95, 994.95], "bbox_id": "7548fcb981", "file": "AppomattoxNewspapers_1926-1933a_0507.pdf", "page": 1, "text": "with equal success in the coun ties of Buckingham, Charlotte and Prine Edward, and other counties in the Dark-Fired belt. Mr. and Mrs. E. H. Canon and Mrs. O. R. Steeves attended the Presbyter at Farmville last Wednesday. Mrs. Lester Canon has been sick with flu. , Mrs. O. R. Tumes, Mn. C. M. Stratton, Jr., and Miss Alva Moore attended the missionary meeting at Memorial church, Appomattox, Friday."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Tumes, Mn. C. M. <mark>Stratton</mark>, Jr., and Miss Alva"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Tumes, Mn. C. M. <mark>Stratton</mark>, Jr., and Miss Alva"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2106.27, 827.95, 2269.57, 879.15], "bbox_id": "17be912f38", "file": "AppomattoxNewspapers_1908-1909a_0347.pdf", "page": 1, "text": "Willie Gutherie Anderson, Mandane Anderson, Louise Gills, Nina Jones, M. Anna Jones and Mr. Frank Stratton."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Willie Gutherie Anderson, Mandane Anderson, Louise Gills, Nina Jones, M. Anna Jones and Mr. Frank <mark>Stratton</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Willie Gutherie Anderson, Mandane Anderson, Louise Gills, Nina Jones, M. Anna Jones and Mr. Frank <mark>Stratton</mark>."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2347.85, 1021.0, 2472.13, 1246.75], "bbox_id": "a88f251c68", "file": "AppomattoxNewspapers_1939-1943a_0419.pdf", "page": 1, "text": "Williams, 255.80 Holley, 25.25 Stratton, 265.15 M tB wu a w tt, -140.46 McGehee, 49.00 Gensler, 6.30 Crawley, 30.00 Roberts, 80.90 Christian, 78.20 Byran, 128.00 Welch, 172.80 Edmunds, 58.45 Myers, 386.05 Pankey, 132.25 N.Burkey, 57.75 M.Burkey, 5.00 Webb, 3.00 Dudley, 75.00 K. Franklin, 6.00 Turner, 40.00 Coleman, 2.25 Smith, 110.55 Furbush, 586.45 Miscellaneous, 74.65 TOTAL to date 2,027.1"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Williams, 255.80 Holley, 25.25 <mark>Stratton</mark>, 265.15 M tB wu"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Williams, 255.80 Holley, 25.25 <mark>Stratton</mark>, 265.15 M tB wu"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "C. W. Smith, W. <mark>Stratton</mark> Taylor, Jennings Ferguson. T."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "C. W. Smith, W. <mark>Stratton</mark> Taylor, Jennings Ferguson. T."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [279.35, 236.92, 415.8, 580.5], "bbox_id": "86f66d52d2", "file": "AppomattoxNewspapers_1974-1975a_0396.pdf", "page": 1, "text": "William Broadua Taylor. 75, Jonesboro, died Saturday night at Johnson City Memorial Hospital. A member of Jonesboro United Methodist Church, he was a member of the administrative board of the church. He belonged to Rhea Lodge No. 47 F and AM, Kerbela Temple Shriners of Knoxville, and served as sales manager of the Dobyns-Taylor Hardware Company for 35 years in Kingsport, Elizabeth- ton, Jonesboro and Rogersville until his retirement in 1971. He was the son of the late James B. and Lula Jones Taylor. Survivors include his widow, Mrs. Zella Lee Walker Taylor, Jonesboro four sisters, Mrs. F. W. Stratton, Alexandria, Va., Mrs. Howard Slaughter, Lynch burg, Va. Mrs. B. D. Stratton, Concord, Va., and Mrs. John Watson, Staunton, Va. one brother, Marvin Taylor, Appo mattox, Va. several nieces and nephews. Dillow-Taylor Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "sisters, Mrs. F. W. <mark>Stratton</mark>, Alexandria, Va., Mrs. Howard"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "sisters, Mrs. F. W. <mark>Stratton</mark>, Alexandria, Va., Mrs. Howard"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [412.3, 1220.66, 576.78, 1409.3], "bbox_id": "65ee0c83e6", "file": "AppomattoxNewspapers_1908-1909a_0440.pdf", "page": 1, "text": "will learn with regret that she is i seriously ill in Lynchburg, where I she went to consult a specialist. I Mr. and Mrs. Irby Wheeler and sons were guests of Mrs. Jennie I Bondurant Sunday. Miss Virginia Chick was given a surprise party Saturday nite  by quite a number of the young- 16r set. Mrs. Mollie Stratton of Lynch- I burg, visited Mrs. S. E. Ander- I Bon and family last week-end. Mr. Emory Martin is entertain- jing a number of his friends tq- fdftv. TBejAw- with f  K ma E"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "16r set. Mrs. Mollie <mark>Stratton</mark> of Lynch- I burg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "16r set. Mrs. Mollie <mark>Stratton</mark> of Lynch- I burg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1058.61, 563.6, 1199.49, 823.89], "bbox_id": "72a51f60df", "file": "AppomattoxNewspapers_1974-1975a_0238.pdf", "page": 1, "text": "will contact appropriate chairman listed below as soon as possible as participation in certain areas will be limited due to space or time. Thus, first come, first served will have to be the basis for assignment of space and time choice. Festival co-chairmen Mrs. Robert G. Stewart, Rt. 1, Appomattox and Mrs. Charles R. Perkins, Box 158, City. Parade Chairman Mrs. John L. Wilson, Rt. 1, Box 658,Appomattox. Arts and Crafts Chairman Mrs. John R. Booker, Rt. 2, Gladstone 24553 Historic Displays Chairman - Mrs. William A. Stratton, Rt. 1, Appomattox. Entertainment - Musical Groups Chairman - Mrs. Samuel R. Martin, Rt. 1,"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Chairman - Mrs. William A. <mark>Stratton</mark>, Rt. 1, Appomattox. Entertainment"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Chairman - Mrs. William A. <mark>Stratton</mark>, Rt. 1, Appomattox. Entertainment"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1512.5, 637.9, 1671.01, 842.61], "bbox_id": "2d4abde49e", "file": "AppomattoxNewspapers_1926-1933a_0452.pdf", "page": 1, "text": "Wilbur P. Stratton, 75, son of w. D. and Frances Stratton, died at his home near Stonewall Friday night, after a short illness of bronchial pneumonia. He is survived by his wife Mrs. Mollie Anderson Stratton, and three children, Marvin A. and Samuel M. Stratton and Mrs. W. R. Seay. Funeral services were held from Stonewall Pres byterian church and interment was made in the church burying ground. Deceased was a splen did type of the old Virginia gentleman a n d had been a patient sufferer for years."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Wilbur P. <mark>Stratton</mark>, 75, son of w."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Wilbur P. <mark>Stratton</mark>, 75, son of w."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2075.51, 565.23, 2239.31, 1062.62], "bbox_id": "425472b01c", "file": "AppomattoxNewspapers_1892-1898a_0055.pdf", "page": 1, "text": "Whooping cough is prevalent in this section. Mr. C. M. Strattons little girl has been very ill with whooping cough, so much so that for a time its life despared of.  Dr, Rrice was was promptly called ih,who soon checked the disease, and the little one is now restored to health. Mr. T. J. Stratton State inspec tor and sampler of fertilizers, has completed his labors for the sprjng season. Mr. Stratton reports that fertilizers have been very largely used all over the State this spring, and that he is satisfied that. Appo mattox farmers buy a larger per cent, of their goods direct from first lids for Gash, ilittu tile fui iiiefs of any, other section, of the State. Miss Belle Porter, of Farmville, who is visiting M ibb Lizzie Rice, was quite ill last week. Our people are jubilant over the result of the late election. The old Stonewall district did nobly, and is entitled to the banner. We are for Hoge Tyler for Gov ernor, Taylor Berry, of the old Dem ocratic free State of Amherst, for Lieutenant Governor, and for Thos. lit Martin for United States Senator. Ey r. Chap Jones was in the neigh borhood last Sunday. The Dr. visits us quite often of late. We are always glad to see him, but we cant help but think that there. is a lady stopping here to whom we are in debted for his frequent visits. S tonewall . Spanish Oaks, Va., June 7."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "health. Mr. T. J. <mark>Stratton</mark> State inspec tor and"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "health. Mr. T. J. <mark>Stratton</mark> State inspec tor and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1864.79, 615.77, 2013.44, 773.87], "bbox_id": "f5a6bb1f6c", "file": "AppomattoxNewspapers_1971-1973a_0385.pdf", "page": 1, "text": "Who so trusteth in the Lord, happy is he. Proverbs 1620. Mr. and Mrs. Bruce Stratton and Mr. and Mrs. Marsnall Strat ton have returned from a trip to Missouri. They report a fine trip. Mr. and Mrs. Clinton Gallispi visited his brother in Roanoke Sunday afternoon. Mr. and Mrs. L B. Wheeler took Mr.and Mrs. Sep Spencer home Tuesday and came back Friday. They had been up for ten days and visited with them."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Bruce <mark>Stratton</mark> and Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Bruce <mark>Stratton</mark> and Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [149.8, 857.57, 271.2, 891.12], "bbox_id": "2236e96ebc", "file": "TimesVirginian_1978_0135.pdf", "page": 1, "text": "Whites deluxe edge trimmer. 2 HP Briggs  Stratton engine. 87245"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Whites deluxe edge trimmer. 2 HP Briggs  <mark>Stratton</mark> engine. 87245"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Whites deluxe edge trimmer. 2 HP Briggs  <mark>Stratton</mark> engine. 87245"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.04, 301.55, 1796.79, 388.59], "bbox_id": "e2f6d3f056", "file": "TimesVirginian_1978_0135.pdf", "page": 1, "text": "Whites best 5HP riding mower. Briggs  Stratton engine is rear mounted for better traction. 25 floating deck, forward and reverse speeds. Auto style steering. Manual and quick cutting height adjustments. 87-400"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "5HP riding mower. Briggs  <mark>Stratton</mark> engine is rear mounted"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "5HP riding mower. Briggs  <mark>Stratton</mark> engine is rear mounted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1125.09, 684.8, 1220.81, 804.75], "bbox_id": "6562fb26f0", "file": "TimesVirginian_1978_0135.pdf", "page": 1, "text": "Whites 21 inter nal drive self- propelled mower with a 4 HP Briggs  Stratton engine with pull- in-go starter. Equipped with safety features  folding chrome handle. 87-305"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Whites 21 inter nal drive self- propelled mower with a 4 HP Briggs  <mark>Stratton</mark> engine with pull- in-go starter. Equipped with safety features  folding chrome handle. 87-305"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Whites 21 inter nal drive self- propelled mower with a 4 HP Briggs  <mark>Stratton</mark> engine with pull- in-go starter. Equipped with safety features  folding chrome handle. 87-305"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [134.13, 645.29, 288.47, 1463.1], "bbox_id": "d39d1c2811", "file": "TimesVirginian_1976_0236.pdf", "page": 1, "text": "White summer flowers bank ed with palms and lighted catherdral candles decorated Red Oak Baptist Church June 19 for the wedding of Miss Julie Lee Moore and Edward Thompson Stratton. The bride is the daughter of Mr. and Mrs. Wallace D. Moore of Appomattox and the bridegroom is the son of Mr. and Mrs. E.- Marshall Stratton. Jr. of Concord. The double ring vows were read at 800 P.M. by the Rev. Dennis Moore of Chamblissburg.VA. Mr. Daniel Stratton, organist and brother of the groom and Mrs. Ralph D. Reynolds, soloist and aunt of the bride, presented a program of nuptial music. Songs which were sung included A Time for Us, The Twelfth of Never. and The Wedding. Benedic tion. Escorted by her father and given in marriage by her parents, the bride wore a traditional southern belle for-  mat gown of Chantilly lace over a full hoop skirt. The gowq was pi aetihtirVilli  a sabrina neckline and fitted bodice and fashioned with a natural - waistline. The long fitted sleeves were tapered to a V point over the hand. A full skirt r of cascading deep ruffles extended into a full cathedral length train. A Camelot headdress of lace and pearls secured her fingertip length three tier veil. Each tier was L edged in Chantilly lace. She r carried a bridal bouquet of Ljly of the Valley, white roses and I centered with white orchids.  Miss Sherri ONeil Harris,  cousin of the bride, was maid of j honor and Mrs. Neville P,  Moore, aunt of the bride was  matron of honor. They wore a , formal gown of orchid organza  fashioned with a square I neckline edged with a Cluny . lace ruffle elasticized at the  shoulders forming cap sleeves. ! The empire waistline was accented with a wide band of  Cluny lace. The softly Haired  A-line skirt was designed with  a wide flounce at the hemline.  They wore white ripple picture . hats with corresponding orchid 1 ribbon. They carried baskets of pink roses, lavender minature  carnations and purple statice tied with lavendar and piny ribbon. The bride was also attended by Miss Traci Harris Moore, sister of the bride, who was junior bridesmaid. Bridesmaids were Miss Cynthia Lynn Harris and Miss Lynn Renee Rey"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Moore and Edward Thompson <mark>Stratton</mark>. The bride is the"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Moore and Edward Thompson <mark>Stratton</mark>. The bride is the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1849.9, 637.27, 2011.63, 727.67], "bbox_id": "5e9181280c", "file": "AppomattoxNewspapers_1933-1936a_0118.pdf", "page": 1, "text": "White Sulphur Springs and Wash ington, - D .. C. Miss Edith OBrien is spending the winter in Boston, Mass. and s taking a course at the Bryant- Stratton School of business. Recent visitors in the home of Mrs. W. W. Godsey were Mrs.Boy- I er and snn Mr. and Mrs. Lee Don- oner ard son, of Washington."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "course at the Bryant- <mark>Stratton</mark> School of business. Recent"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "course at the Bryant- <mark>Stratton</mark> School of business. Recent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.56, 805.39, 1780.52, 1021.74], "bbox_id": "f75b2e1495", "file": "AppomattoxNewspapers_1922-1923a_0415.pdf", "page": 1, "text": "Whistles With Sweet Sounds. If the present plans of the Board of Supervising Inspectors of the Steamboat Inspection Service are carried into effect all craft plying in New York harbor will be equipped with whistles that will discourse sweet music Instead of ear-splitting sounds that disturb the peace of the people In the greater rilty living close to the North and East Rivers. The subject was discussed at a meeting of the Board. Director Stratton of tbe Bureau of Standards said that it was possible, by applying exact scientific principles, to measure the carrying power of a whistle o r a siren, and also to determine the In tensity of lights carried by vessels at night. M t . Stratton urged the Board to  require the use .In New York harbor of whistles giving forth soft, melodious tones, Instead cif those that shriek out hideous noises and make life miserable by day .and sleep Almost Impossible at night."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "of the Board. Director <mark>Stratton</mark> of tbe Bureau of"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "of the Board. Director <mark>Stratton</mark> of tbe Bureau of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1619.76, 808.99, 1781.76, 1230.09], "bbox_id": "19f217ffe9", "file": "AppomattoxNewspapers_1922-1923a_0414.pdf", "page": 1, "text": "Whistles With Sweet Sounds. If the present plans of the Board of Supervising Inspectors of the Steamboat Inspection Service are carried into effect all craft plying in New York harbor will be equipped with whistles that will discourse sweet music Instead of ear-splitting sounds that disturb the peace of the people in the greater city living close to the North and East Rivers. The subject was discussed at a meeting of the Board. Director Stratton of the Bureau of Standards said that it was possible, by applying exact scientific principles, to measure the carrying power -of a whistle -or a siren, -an-fl also to determine the in tensity -of lights carried by vessels at night. Mr. Stratton urged -the Board to  require the use .in New York harbor of Whistles giving forth soft, melodious tones, instead eff those that shriek out hideous noises and make life miserable by day and sleep almost impossible at night. TO of orman Frozen At His Post. Frank Antonio, a motor man on the Crosstown line in Brooklyn, was overcome by the cold early the other morning while on his way from Erie basin to the barn at Box Street and Manhattan Avenue, Greenpoint. When the car reached Jay and Wil loughby Streets, Inspector John Thompson noticed that the car was passing streets where the motorman should have slowed down. The in spector boarded the car and found that Antonio was apparently frozen at his -post. One hand was on the controller handle and the other on the brake, bui th e motorman was powerless to operate either. The In spector took charge -of the -car and had Antonio taken inside, where he became unconscious. The car was raced to the Greenpoint barn, whence Antonio was -removed to th e Eastern District Hospital."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "of the Board. Director <mark>Stratton</mark> of the Bureau of"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "of the Board. Director <mark>Stratton</mark> of the Bureau of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.55, 296.95, 1850.91, 554.11], "bbox_id": "75db2548f2", "file": "AppomattoxNewspapers_1898-1902a_0246.pdf", "page": 1, "text": "what nominal for the preses iw - _ hat Umifsualuuaimtv2.J,,dre of  treult Court-Geo. .1. Hi i there will not tie much April and October, i .?   ? .8ee!s- it is ot County Court P. A. ChJ I yet known howthe Thursday after flm Wonilaj. Pfc,IllHHClerk of Circuit aud county Court H er. Atorney for CommouweaHhII. D. 8lwriff8. P, Coleman.  Treftsurw-D. Mott Robertson. Bcwrd of SupirrviaorsW. II. U k  ii J iaii S. C. Stratton and J. C. Jones teeth on Wednesday after first M iaruba JunOa Settcmber. and Doeen  Attention, Farmers! We it I file hove in low prices on Hard J Vfouei, aud Farm Tools. T uce for luck. We never slt-ei M eyers  M artin . Hardware Huslert Lynch burg, M C  --------------------- - -- FINE HOR5ES FOR SALE. As i do not travel anyone in lm counties of Appornaitox uckiiighani, and often find ossiblo to attend these counsel will be glad to answer an"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "J iaii S. C. <mark>Stratton</mark> and J. C. Jones"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "J iaii S. C. <mark>Stratton</mark> and J. C. Jones"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [710.14, 510.88, 851.52, 730.17], "bbox_id": "2457996c0d", "file": "AppomattoxNewspapers_1974-1975a_0297.pdf", "page": 1, "text": "What can I offer the Lord for all his goodness to me. Psalm 11612 Mr. and Mrs. Marshall Stratton had a family get together Sunday. The Tabor children came and all had a very good time. Mrs. Elsie Caldwell and Mrs. Nina Caldwell were dinner guests of Mr. and Mrs. Bob Harris and Will Sunday. Mr. and Mrs. Bob Wheeler, Becky and Joan, of Richmond, were dinner guest of his parents, Mr. and Mrs. I. B. Wheeler, Sunday. Mr. and Mrs. H. B. Jones, Ronnie and Richard spent afternoon with them. Ben Wheeler was Saturday night visitor."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Marshall <mark>Stratton</mark> had a family get"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Marshall <mark>Stratton</mark> had a family get"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [300.5, 1082.22, 418.95, 1348.32], "bbox_id": "43872e3cf4", "file": "AppomattoxNewspapers_1898-1902a_0108.pdf", "page": 1, "text": "WeWiaTffl would reappc Commissionei  ---------- - 3 more term in  closed his bus regretted thi prevented th career in the i Amherst lose and Appomatt Inspector m tl Stratton. Th true men, Ion party and h As to Hoh. Ge ner, of Augnfl tain Whiteheai ity and publl questioned. B one of the large ley. He will m office."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Appomatt Inspector m tl <mark>Stratton</mark>. Th true men, Ion"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Appomatt Inspector m tl <mark>Stratton</mark>. Th true men, Ion"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2313.1, 958.8, 2456.75, 1287.73], "bbox_id": "fd64c44364", "file": "AppomattoxNewspapers_1971-1973a_0350.pdf", "page": 1, "text": "were Virginia H. Bondurant , Betty S. Booker, Anne B- Cof fey, Mary Sue Moore, iuiftua George, Maraget H a r v e y , , Frances P. Lewis, R o s a l i e Mitchell, Harriet S. Readding, Sudie E. Rowe, Virginia Stratton Betty K. Connor, Sandra Mitch ell, Barbara G. Radcliff, Betty Rhodenizer. Audry L. Lenon, Yvonne D. Franklin, Glenna Hix, Catherine R. Jackson, Frances S. Murray, Brenda L o u is e Walker, Joette Torrence and Merlie Lawson. Eugene Peyton, director of education , announced that 150 children were enrolled in the Summer School Readiness Pro gram. There is a potential of 200 children the program is available to, however, Mr. Peyton added, with those in a kindergarten program the per centage rises to 90 percent that will have had a readiness program by the time the fall term begins. Board member Lyle Garrett stated that this total should he Contd on Page IB"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Sudie E. Rowe, Virginia <mark>Stratton</mark> Betty K. Connor, Sandra"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Sudie E. Rowe, Virginia <mark>Stratton</mark> Betty K. Connor, Sandra"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1698.68, 1126.36, 1841.58, 1291.85], "bbox_id": "97e8c2f2ff", "file": "AppomattoxNewspapers_1974-1975a_0208.pdf", "page": 1, "text": "were served by February hostesses, Mrs. Anne Reynolds, .Mrs. Anne Robinson and Mrs. Arlene Stratton. The club also held its Fine Arts Show the same evening with members exhibiting their arts and crafts projects. Mrs. John Booker, chairman of the A rts D epartm ent of the Appomattox Junior Womans Club, expressed her thanks to all members who exhibited their projects and to the judges, Mrs. Lloyd Walton and. Mrs. Richard Bartelt."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Robinson and Mrs. Arlene <mark>Stratton</mark>. The club also held"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Robinson and Mrs. Arlene <mark>Stratton</mark>. The club also held"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1386.21, 1655.77, 1859.17, 1796.86], "bbox_id": "a65aee3651", "file": "AppomattoxNewspapers_1926-1933a_0394.pdf", "page": 1, "text": "were mostly rainy and cloudy Mrs. C. N. Price, of Lynch burg, spent the holidays with her parents, Mr. and Mrs. C. M. Stratton. Be sure to aee the Deacon Entangled at Stonewall Sat urday night. Come and bring your girl and enjoy the fun.  ere conducted in Cuba in  1200 to 100 ip. m. Lunch. News was received today of 0 to P m Choosing i the death-of Mr. Doc Martin j"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>. Be sure to aee"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>. Be sure to aee"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1543.46, 1635.07, 1851.96, 1774.77], "bbox_id": "87721466f5", "file": "AppomattoxNewspapers_1908-1909a_0394.pdf", "page": 1, "text": "were mostly rainy and cloudy Mrs. C. N. Price, of Ljmch- burg, spent the holidays with her parents, Mr. ,and Mrs. C. M. Stratton. Be sure to see the Deacon Entangled at Stonewall Sair Dis-1 urday night. Come and bring your girl and enjoy th e fun.!. 12 00 to 100 jp. m. Lunch- j Newa was recebad today of L00 to 145 p. m. Choosing ithe death-of Mr. Doo Martin"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>. Be sure to see"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. C. M. <mark>Stratton</mark>. Be sure to see"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1152.51, 159.37, 1294.91, 213.52], "bbox_id": "ade8db5d05", "file": "TimesVirginian_1976_0070.pdf", "page": 1, "text": "were dinneK guests of Mr. and Mrs. Marshall Stratton Sunday. Mrs, I. B. Wheeler and Mrs. Hazel Gillaspie were shoppers in Lynchburg Friday.,"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "were dinneK guests of Mr. and Mrs. Marshall <mark>Stratton</mark> Sunday. Mrs, I. B. Wheeler and Mrs. Hazel Gillaspie were shoppers in Lynchburg Friday.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "were dinneK guests of Mr. and Mrs. Marshall <mark>Stratton</mark> Sunday. Mrs, I. B. Wheeler and Mrs. Hazel Gillaspie were shoppers in Lynchburg Friday.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.53, 704.28, 1726.32, 1222.66], "bbox_id": "e3c2e0b671", "file": "AppomattoxNewspapers_1926-1933a_0077.pdf", "page": 1, "text": "Wennie Roast Friday night at Stonewall School. All reported a fine time Miss Margaret Caudil was dinner guest of Miss Virginia j Chick Sunday. I Rev. A I. Caudil preached a Nettie Lucado was the Sunday I very fine inspiring sermon at night guest of the Barlow girls. I Hebron Sunday a. m. Small Madaline Bingham took a fly- crowd present owing to bad ing trip to Lynchburg last week. I weather and roads. The Mitchell boys are very! Mr. S. E. Anderson and fam frequent visitors of a certain I By, Mr. and Mrs. J. T. Whitten, party of Piny Mountain. and Earl and Alton Drinkard, Mrs. W. H. S. Barlow is at- af Lynchburg, were Sunday din tending her daughter in Lynch-Jner guests of T. A. Drinkard and burg, Mrs, I. L. Lucado. J family. Mr. Walter Shelton has caught I Miss Frances Stratton, stn two skunks in the past week. I dent of R. M. W. C. is expected The roads from Piny Mountain I home last of this week for the to Oakville are so bad that one I spring holidays, of the Piny Mountain-boys can-1 Misses Margaret Caudil, Vir- not get over them to fill his ginia Chick, Landis and Maekey dateg ILaughan, Harold Caudil, and Mr. K. V. Barlow while return-1 Francis Hamilton, spent last ing home from his work, heard I Wednesday night with Clyde an awful noise in the woods but I Thomas. All had a great tune, the animal has not yet been dis- Mr. and Mrs. Emory Jennings covered. and famlly have moved near Mr. Leonard Pippin is work-1 Hebron Church. We are glad to ing with Mr. L. T. Lucado this have these good people in our coming year. Stick to your work midst. boy you will have success. Mrs- c lyde Carson and little We hope the Nowlin boys will I daughter, Louise, spent last soon return home, because w iweek n Lynchburg, all would like to see them.  Mr. and Mrs. E. S. Chick re cently entertained in honor of VT1TW I their daughter, Virginias 13th E U K fc I V m W I anniversary. Games of all kinds .  were played. Delcious refresh- N ew sis just as scarce aa 11 mets were served about 930 p. be, this morning. The jm by Mrs Chick assisted by and Mrs. A. I. Caudle, F. E Jennings"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "caught I Miss Frances <mark>Stratton</mark>, stn two skunks in"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "caught I Miss Frances <mark>Stratton</mark>, stn two skunks in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [722.65, 767.88, 866.38, 993.18], "bbox_id": "2471cec81f", "file": "TimesVirginian_1976_0106.pdf", "page": 1, "text": "well. Mr. and Mrs. I. B. Wheeler visited Mr. Tommy Davidson Sunday afternoon. He has spent the winter with his sister, Mrs. Davis Smith. Mr. and Mrs. Dale Campbell and daughters went to Penn sylvania for the week end. Mr. and Mrs. Lyle Gilbert spent the week end i Richmond. Mr. C. D. Wilburn really gave a grand sermon Sunday at Hebron. Mr. and Mrs. Bruce Stratton spent Sunday with his parents. Mr. and Mrs. Dallas Gillespie and Mrs. Hazel Gllespie visited Mr. and Mrs. Lonnie Reynolds Saturday night He"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Bruce <mark>Stratton</mark> spent Sunday with his"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Mr. and Mrs. Bruce <mark>Stratton</mark> spent Sunday with his"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2086.1, 960.14, 2278.0, 1036.64], "bbox_id": "7ec0d1d946", "file": "AppomattoxNewspapers_1943-1947a_0271.pdf", "page": 1, "text": "well J. Thomais Almond, W. S.l Taylor, C. S. Jenkins and c - Stratton. George E. Allen, Osoar Shpw- tnake and T. Nelson Parker, at torneys representing Cnas. It. ren- flre wick in the election contest filed arG I by L. Preston Collins, sent letters"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "S. Jenkins and c - <mark>Stratton</mark>. George E. Allen, Osoar"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "S. Jenkins and c - <mark>Stratton</mark>. George E. Allen, Osoar"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1351.68, 432.16, 1445.64, 515.46], "bbox_id": "0029e9cc1d", "file": "AppomattoxNewspapers_1908-1909a_0328.pdf", "page": 1, "text": "Welch and Mr. were visitors in iy- Stratton killed Tuesday  that Inches tip to tip,"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Welch and Mr. were visitors in iy- <mark>Stratton</mark> killed Tuesday  that Inches tip to tip,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Welch and Mr. were visitors in iy- <mark>Stratton</mark> killed Tuesday  that Inches tip to tip,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1319.05, 437.25, 1453.08, 521.0], "bbox_id": "40d8c8ce0c", "file": "AppomattoxNewspapers_1926-1933a_0328.pdf", "page": 1, "text": "Welch and Mr. were visitors in ay. Stratton killed Tuesday that     in c h e s tip to tip."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Welch and Mr. were visitors in ay. <mark>Stratton</mark> killed Tuesday that     in c h e s tip to tip."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Welch and Mr. were visitors in ay. <mark>Stratton</mark> killed Tuesday that     in c h e s tip to tip."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1376.63, 1662.16, 1616.89, 1805.81], "bbox_id": "85ec05fc6a", "file": "AppomattoxNewspapers_1962-1965a_0183.pdf", "page": 1, "text": "weeks seniors, now graduates of Appomattox High  afe spending the summer days applying for per- work  already working on summer jobs, or lazily t the good-weather. Theres college or technical train- for about 25 out of the 75 graduates pictured above, right on first row are Robert Brown, James Harse. whitehead, Pat Wells, Nancy Jo Kidd, Blaine Carter,  urks, Harry Ranson, John Harrison, and Tony Mann, second row are Margaret Johnson, Linda Thomas, helps, Thomas Richardson, James McCormick, Robertson, Mary McClenny. Randoph Smith, Kyle  ,chrd Harris, John Alvis, Mary Ranson. In the .7 Ahen Conner, Thacker Cheatham, Bill Stratton, vrawley, Mary Watkins Booth, and Barbara Thomas."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Conner, Thacker Cheatham, Bill <mark>Stratton</mark>, vrawley, Mary Watkins Booth,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Conner, Thacker Cheatham, Bill <mark>Stratton</mark>, vrawley, Mary Watkins Booth,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1574.87, 535.09, 2486.98, 945.68], "bbox_id": "65b1216912", "file": "AppomattoxNewspapers_1949-1952a_0580.pdf", "page": 1, "text": "weeks now Slates of delegates to district and state conventions were elected at a Democratic mass meeting last Fri day night at the court house. The meeting adopted two resolutions one endorsing Watkins M. Abbitt for renomination and re-election to Congress from the Fourth District, introduced by Calvin Robinson and one endorsing the record of United States Senator Harry F. Byrd, in troduced by C. W. Smith. Congressman W. M. Abbitt was present and addressed the meeting. Charles F. P. Crawley served as the presiding officer of the meeting and C. W. Smith served as secretary. The following delegates, instruct ed to vote as a unit, were named to the Fourth District Convention in Petersburg, May 24 J. A. Bingham, George Abbitt, Jr. G. T. Moses, Sr. G. B. Buchanan, J. H. OBrien, Wal lace E. Bondurant, John E. Burnett, Mrs. N. A. Wagers, N. E. Farrar, C. C. Harvey, Mrs. J. W. Flood, Mrs. Hazel R. Mann, Grover E. Smith, E. T. Guill, C. T. Moses, Jr. H. C. Pulliam, Mrs. Margaret Calcott, R. C. Hubbard, P. B. Stratton, Calvin H. Robinson, J. A. Burke, D. A. Conner, J. W. Cawthorn, F. J. Smith, Irby B. Wheeler, David T. Robertson, Chas. F. P. Crawley, T. C. Ligon, W. W. OBrien, Mrs! C. H. Robinson, Mrs. F. C. Dresser, J. W. Conner, Tobey E. Inge, Eula M. Burke, R. D. Robinson, W. D. Fer guson, H. A. Williams and John P."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "C. Hubbard, P. B. <mark>Stratton</mark>, Calvin H. Robinson, J."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "C. Hubbard, P. B. <mark>Stratton</mark>, Calvin H. Robinson, J."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.98, 611.22, 2149.67, 835.31], "bbox_id": "3088ec44ff", "file": "TimesVirginian_1978_0272.pdf", "page": 1, "text": "Weeks. Miss Patty Stratton is a patient at Virginia Baptist Hospital and had surgery on her knee. Just hope she will have a successful operation this time. Mr. Hugh Braford is some better. Mrs. Maude Braford and Mrs. Minnie Burnett went to Lynchburg General Hospital Saturday to visit Mrs. Mable Robertson who fell in the bath room and broke her hip last Tuesday. She is doing just fine. Mr. and Mrs. H. B. Jones and Mr. and Mrs. Ben Wheeler, Mr. and Mrs. Lawrence Wheeler of Lynchburg visited Mr. and Mrs. I. B. Wheeler Sunday."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Weeks. Miss Patty <mark>Stratton</mark> is a patient at"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Weeks. Miss Patty <mark>Stratton</mark> is a patient at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1767.58, 346.11, 1934.23, 573.31], "bbox_id": "562cc9a6af", "file": "AppomattoxNewspapers_1908-1909a_0192.pdf", "page": 1, "text": "week on account of the ill of Mr. Stratton. Mrs. A. A- Babcock and little! daughter, June Starke, of Glad stone, visited the formers par- ents, Mr. and Mrs. S.L.Scruggs,  last week- Mr, Babcock spent Saturday night in the ScruggsI home and Mrs. Babcock andl baby accompanied him home! Sunday. Misses Frances Stratton and Anna LeGrand, of Lynchbturg, were week-end guests of Mr. J. A. Stratton and family. Mr. and Mrs. H. A. Drinkard and Glenn Drinkard, of Lyhch- burg, were Sunday guests of W. H. Drinkard and family."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "the ill of Mr. <mark>Stratton</mark>. Mrs. A. A- Babcock"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "the ill of Mr. <mark>Stratton</mark>. Mrs. A. A- Babcock"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1971.33, 715.07, 2140.08, 862.17], "bbox_id": "cdfcca2a60", "file": "AppomattoxNewspapers_1960-1962b_0617.pdf", "page": 1, "text": "Week of June 11-15 Demonstration   tritious Meals Federation Program - Tjangement Monday, June 11 Club wiN meet at f p V. L. Hudson. Thursday, June 14 Chib will meet at p. m. with Mrs. Kelly Stratton. Thursday, June 14  Glover Hill Ghib will not meet as scheduled. Will meet instead, Thursday, June 28."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "m. with Mrs. Kelly <mark>Stratton</mark>. Thursday, June 14  Glover"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "m. with Mrs. Kelly <mark>Stratton</mark>. Thursday, June 14  Glover"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1815.84, 292.55, 1987.31, 935.23], "bbox_id": "4ab0d18188", "file": "AppomattoxNewspapers_1908-1909a_0359.pdf", "page": 1, "text": "week. Mrs. H. B. Jennings, of Florida, was also guest in these homes. Misses Ethel Alvis and Hazr el Taylor attended the short course at V. P. J. last week. Prof. Kenneth Alvis, of V. P. I., was a week-end guest of home folk. Mi Margaret Neighbors is spending some time with her brother, Jim, and family, of Lynchburg.  Mr. and Mrs. Clyde D. Car- son are happy-knottier girl, Ann Elizabeth, July 20th. Mr. S. L. Scruggs attended the Appomattox Association held in Rice last week. Mr. and Mrs. Clyde Taylor, of Burkeville, were dinner guests of Mrs. J. R. Taylor last Wednesday. Mrs. D. L. Taylor and child ren, of Lynchburg, are spend ing some time with her mother, Mrs. J. B. Taylor. Mrs. B. D. Stratton and son, Jimmie, visit- ed Mrs. Taylor gome days last week. Mr. and Mrs. Victor Burn ette, of Lynchburg, are receiv ing congratulations on the birth of a son, Victor, Jr., July 21st. Mrs. H. S. Jennings and daughters, Virginia and Bobye, of Cheraw, S. C., and Mrs. Nan-1 nié Lou Stratton, of Lynchburg were Sunday guests of Mr. and Mrs. F. E. Jennings. I Harold Caudle, of U. S. N., stationed at Hampton recently vifiited friends in the neigh borhood. Harry, James and Herbert I Cobb, of Franklin, visited their aunt, Mrs. C. T. Drinkard and Mr. Drinkard Saturday and Sunday. Miss Virginia Chick was I guest of relatives in Lynch-"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Taylor. Mrs. B. D. <mark>Stratton</mark> and son, Jimmie, visit-"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Taylor. Mrs. B. D. <mark>Stratton</mark> and son, Jimmie, visit-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1624.17, 748.78, 1939.78, 909.47], "bbox_id": "55f6c6f8ae", "file": "AppomattoxNewspapers_1892-1898a_0178.pdf", "page": 1, "text": "week. from  Mr. James C. Flood, accompanied i by his cousin, Mr. Lacklanji Blank Miss Traylor is visiting at Miss I ingship, of Richmond, is spending Jane Farrells several weeks at his home near this We are always glad to wel Mrs. R. W. Stratton left yesterday 1 place for Scottsville. come them in 0Ur mldst Misses Anua and Bessie LeGrand are visiting their aunt, Mrs. B. W. Babcock near this place. Miss Deiskill, who has been spend ing her vacation with Miss Martha Evans, left Saturday for her home been visiting her sister Mrs. Spencer."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "wel Mrs. R. W. <mark>Stratton</mark> left yesterday 1 place"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "wel Mrs. R. W. <mark>Stratton</mark> left yesterday 1 place"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1120.12, 752.47, 1259.49, 794.12], "bbox_id": "ee2a297c5c", "file": "AppomattoxNewspapers_1971-1973a_0352.pdf", "page": 1, "text": "week end. Mr. and Mrs. I. B. Wheeler visited Melvin Stratton Satur day."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "week end. Mr. and Mrs. I. B. Wheeler visited Melvin <mark>Stratton</mark> Satur day."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "week end. Mr. and Mrs. I. B. Wheeler visited Melvin <mark>Stratton</mark> Satur day."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [557.29, 994.75, 1215.12, 1225.9], "bbox_id": "d6a18b8714", "file": "AppomattoxNewspapers_1926-1933a_0219.pdf", "page": 1, "text": "week ago last Thursday at his home in Charlotte County. His death was attributed to a di seased heart. Funeral services conducted by the Rev. Mr- White, of Selections which will be! yjn Stratton, colored one fo r Played during the evening are, shooting his wife and the sec. .. - . .. God Bless You, Randolph- ond for carrying concealed f7?P m were _ held at th Jfiac.on  fg, from weapons. An indictments was   d e Chapel Methodist n ercolate into the nockets of Hood, Tell Not of at brought against Nora McCor- P1?1?1 of which Mr. St. John F h T d M M h ? m i c k for shooting her husband.   member for MtJ the drought stricken farmers -1 Now Let Every Tongue Adore! nd one for illal nossession one years. n Ty Tinion Thee, Still, With Thee, A- 0f ardent spirits and an indict- Surviving him are his wife, e doubtful as a means of re- dormaua pp  t Mirror 01 aaent Pirs ana an inaict Mrs-MarvL- St John and four avincr nnpinnlovmpnt for few oornmus i e Lttes Mirror, ment was brought against Jvr., j iVAay, e unemployment tor lew Moonlight On The Lake,, Leonard McCormick on the children besides Mrs. Mann, worth-while farmers can ever An Thru The Night, Lassie j fftter chafse alTo The last Cullen St. John, Mrs- E. W. Cov afford to Quit their farms for Q, Mine, Mosquitoes, Integer L w0 indictments were held ington, Crafton J. St. John and any length of time to engage Vitae and the Bell of St.  er  r theText term of court ------ I in highway construction. Marris  Alonsm Hava and W. V j tne j16, term OI QU  Mr. Horsley urgea tnat raxn T u arry both of Prospect, were er the solution to the problem wjjj sjng jn chorus, lies with the farmers themsel- fbe orchestra, known ves. He added that numerous Reed Battins Jacketeers"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "which will be! yjn <mark>Stratton</mark>, colored one fo r"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "which will be! yjn <mark>Stratton</mark>, colored one fo r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1497.11, 910.2, 1611.34, 1036.15], "bbox_id": "2443918597", "file": "AppomattoxNewspapers_1947-1949a_0464.pdf", "page": 1, "text": "Weakley, Mrs. W. A fss Mollie Paris and Lee attended the Dis- . meeting in Huddleston y- . ,  Irs. B. D. Stratton had ests during the week- limy Stratton, of Ken- fiss Jean Stratton, of Jimmy Sratton and er, Diane, of South Mr. Gerald Maxey,, of"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "y- . ,  Irs. B. D. <mark>Stratton</mark> had ests during the"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "y- . ,  Irs. B. D. <mark>Stratton</mark> had ests during the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1489.18, 1470.59, 1658.1, 1569.18], "bbox_id": "06cfbed5dc", "file": "AppomattoxNewspapers_1947-1949a_0405.pdf", "page": 1, "text": "We were telling our friend P. B. Stratton, the Kasco czar, about the poultry business on Cluncoteague, and found him well posted on its amazing size. Its a feed dealers ten strike. Pocomoke and Salisbury on Marylands Eastern Shore, are ideal locations. But Stratton says wc ought to raise more poultry here in Appomattox. Good business"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "our friend P. B. <mark>Stratton</mark>, the Kasco czar, about"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "our friend P. B. <mark>Stratton</mark>, the Kasco czar, about"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1692.48, 777.43, 1836.72, 992.42], "bbox_id": "0e8bdd570f", "file": "TimesVirginian_1976_0190.pdf", "page": 1, "text": "We were sorry to hear of the death Monday night of Mr. Bert Stratton. Our deepest sympa thy is extended to Mr. Harold Stratton and other members of the family. Mr. and Mrs. Buster Lucado ,are visiting her father,Mr. C.C. Bass in Halifax County several days this week. Week end visitors in the home of Mr. and Mrs. Roland Smith were Mr. and Mrs. Coleman B. Moore, of Virginia Beach, Mr. and Mrs. Curtis B. Moore, Jr. and boys and Mr. and Mrs. Joel W. Smith and s ra  y  m e h b u rg , also and Mrs. T7 K. Moore and MBs. Mollie Rogers."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "night of Mr. Bert <mark>Stratton</mark>. Our deepest sympa thy"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "night of Mr. Bert <mark>Stratton</mark>. Our deepest sympa thy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [957.79, 826.22, 1102.72, 1354.61], "bbox_id": "bed90a3042", "file": "AppomattoxNewspapers_1962-1965a_0172.pdf", "page": 1, "text": "We were really blessed with a nice rain last week, of which we are all so thankful. Dr. and Mrs. Thomas Jennings and children, of Bedford City, visited with his mother, Mrs. Parks Jennings and her family for Mothers day. Mr. and Mrs. Hugh Braford and children visited with his parents, Mr. and Mrs. Braford at Natural Bridge, last Sunday. Rev. and Mrs. John Leitner and Mr. and Mrs. E. L. Chick visited with Mr. C. D. Drink ard and Mrs. Wesley Bethel at Oakville last Thursday evening. So glad Mr. Drinkard has return ed home from the hospital and much improved. So sorry our pastor, Rev. Leit ner is on our sick list. Do hope for him a speedy recovery. Mr. and Mrs. Irby Wheeler visited her sick sister, Mrs. Sept Spencer in the hospital in Rich mond Sunday. Do hope for her a speedy get well. Mr. and Mrs. Rufus Burnette and Mrs. Minnie Burnette visit ed with Mr. and Mrs. Harry Lawson and family Sunday! Mr. and Mrs. E. L. Chick visi- ed with Mr. and Mrs. Henry Beard and Lawrence Sunday. Mr. and Mrs. Albert Hedge- path, of Richmond, spent Sun day with their parents, Rev. and Mrs. John Leitner in the parson age. We are happy to know Steve Tanner and Debbie Stratton are both getting better after being sick with measles. Hope they will soon be real well again. Rev. and Mrs. Leitner visited with Mr. and Mrs. Chick and Mr. and Mrs. Rufus Brunette last Monday afternoon. They al ways carry sunshine where ever they go. Mr. and Mrs. Tilden Lee and Barbara Jean visited her ill father, Mr. Wheeler in the hos pital on Sunday. Hope he is im-"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Steve Tanner and Debbie <mark>Stratton</mark> are both getting better"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Steve Tanner and Debbie <mark>Stratton</mark> are both getting better"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2319.58, 447.93, 2490.45, 577.92], "bbox_id": "b240b2d485", "file": "AppomattoxNewspapers_1939-1943a_0345.pdf", "page": 1, "text": "We welcome back to our com munity Misses Mary Mills, Mary West and Katherine Mathews, mem bers of the Stonewall faculty. Mrs. George Cheatham and daugh ter, Nancy, and Miss Elva Stratton, of Apponnaittox, spent the week end at their home here. Mr. and Mrs. Elkon Hamilton, of Lynchburg, were guests Sunday of his parents, Mr. and Mrs. B. W. Hamilton."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Nancy, and Miss Elva <mark>Stratton</mark>, of Apponnaittox, spent the"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Nancy, and Miss Elva <mark>Stratton</mark>, of Apponnaittox, spent the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1707.57, 689.97, 1872.77, 719.12], "bbox_id": "cf22071a94", "file": "AppomattoxNewspapers_1952-1954a_0608.pdf", "page": 1, "text": "We want to extend deepest sym pathy to the Stratton family in the loss of a loved one,"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "We want to extend deepest sym pathy to the <mark>Stratton</mark> family in the loss of a loved one,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "We want to extend deepest sym pathy to the <mark>Stratton</mark> family in the loss of a loved one,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [860.9, 402.51, 1024.4, 442.51], "bbox_id": "03c450ca1e", "file": "AppomattoxNewspapers_1952-1954a_0206.pdf", "page": 1, "text": "We want to extend deepest sym pathy to M r,. and Mrs. Marshall Stratton in the loss of their precious baby."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "We want to extend deepest sym pathy to M r,. and Mrs. Marshall <mark>Stratton</mark> in the loss of their precious baby."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "We want to extend deepest sym pathy to M r,. and Mrs. Marshall <mark>Stratton</mark> in the loss of their precious baby."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [603.13, 1755.85, 759.89, 1900.05], "bbox_id": "2efccbad77", "file": "AppomattoxNewspapers_1898-1902a_0667.pdf", "page": 1, "text": "We understand that Judge Chris- tain will appoint Mr. Beauregaid Thornhill to be a member of the Board of Supervisors from Stone wall district, to fill the vacancy caused by Mr. Stratton resigning. Should Mr. Thornhill accept the position, he will do doubt make an excellent father, and will take a lively interest in all that pertains to the countys progress and good government."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "vacancy caused by Mr. <mark>Stratton</mark> resigning. Should Mr. Thornhill"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "vacancy caused by Mr. <mark>Stratton</mark> resigning. Should Mr. Thornhill"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [603.85, 1758.73, 761.07, 1903.13], "bbox_id": "fe022a6dea", "file": "AppomattoxNewspapers_1898-1902a_0666.pdf", "page": 1, "text": "We understand that Judge Chris- tain will appoint Mr. Beauregaid Thornhill to be a member of the Board of Supervisors from Stone wall district, to fill the vacancy caused by Mr. Stratton resigning. Should Air. Thornhill accept the podtiou, he will no doubt make an excellent father, and will take a lively interest in all that pertains to the countys progress and good government."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "vacancy caused by Mr. <mark>Stratton</mark> resigning. Should Air. Thornhill"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "vacancy caused by Mr. <mark>Stratton</mark> resigning. Should Air. Thornhill"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [149.08, 620.98, 560.73, 909.37], "bbox_id": "7e2a6c0320", "file": "TimesVirginian_1983a_0238.pdf", "page": 1, "text": "we try to bring in a speaker to address an issue pertinent to dairy farming in Appo m attox County at each meeting. The Glover farm is situated in an area of the county which at one point contained seven separate dairy operations. There are now five the Glover farm, the Hix farm, the Covington farm, the Doss farm ana the Robinson farm. Marvin recalls that his father went into Grade A dairy farming in 1962. He had been selling manufactur ed milk since 1945 and before that he had been selling cream. The farm has been ui his family since 1907. The Stratton Farm"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "family since 1907. The <mark>Stratton</mark> Farm"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "family since 1907. The <mark>Stratton</mark> Farm"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1033.19, 297.05, 1175.99, 749.83], "bbox_id": "0dbb119fc7", "file": "TimesVirginian_1976_0283.pdf", "page": 1, "text": "We know all things work together for good to them that love God. Romans 828 Mrs. Tommy Tanner is a patient at Lynchburg General Hospital. So glad to report Mr. Carey Carson was at Sunday School Sunday at Hebron. So glad to have him back. Mr. Will and Jack Harris spent the week end with their grandmother, Mrs. Nina Cald- well. Mr. and Mrs. A. F. Elliott, Jr., Mark and Scott got home Sunday afternoon after a three week visit to Hermit, Calif. They report a grand trip. Mr. and Mrs. J. P. Alvis, Jr. spent the week end with her family at Orange. The Roope family reported a hot trip in the Smokey Mountains. They got home Friday. Mrs. Eleanor Roach spent Sunday with her father, Mr. J. O.Davidson and unde, Craw ford. Mrs. Mary Barr ell came Monday for a weeks visit. Mrs. Hazel Gillespie is still with her sister in Greenville, S.C. The Rev. Hawks gave a fine sermon at Hebron Sunday. Mr. and Mrs. Don Halding, Denise and Mark arrived Monday for a visit with Mr. and Mrs. F. B. Wheeler. Miss Monica Stratton spent a few days last week with her"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "B. Wheeler. Miss Monica <mark>Stratton</mark> spent a few days"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "B. Wheeler. Miss Monica <mark>Stratton</mark> spent a few days"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1498.32, 821.99, 1671.02, 1453.63], "bbox_id": "ccce47664a", "file": "AppomattoxNewspapers_1926-1933a_0411.pdf", "page": 1, "text": "We have had real winter for- the last week, snow, hail, rain and wind. Bad i-oads. Mr. and Mrs. C M Stratton, Jr., and Mrs E. H. Carson visit- pd relatives in Lynchburg Sun day afternoon. Miss Mary Connor, of Lynch burg, was the guest of Mrs. Dunkley Gunter for thé week end. Dunkley Gunter, of Lynch burg. has been at home sick with flu for several days. Mrs. E. H. Carson spent last I week in the home of Mr. Carey CerBon and family near Hebron Church. ...Mr, W. H. Drinkard celebrat ed his 80th birthday Sunday. He enjoys good health all the time, just had flu, but has recuperated from that. Mr. and Mrs. H. A. Drinkard and Glenn Drinkard, of Lynchburg, and Paul Drink ard, of Appomattox, visited their father Sunday. We are sorry to hear of the death of Mr. Joe Obrien. Such a good Christian man gone. Quite a number of Lynchburg friends and relatives were here to attend the funeral of Mr. T. 0. Davidson last Sunday. This consecrated Christian man was! an invalid for years and always bore his suffering with patience, waiting to be called to his Heavenly Home. Supervisor S. Ë. Anderson and Mr. J. T. Whitten spent Monday, night in Lynchburg. Mr.. W. D. Sandidge, who has been receiving medical treatment fromî doctors in Staunton for sometime, spent last week at I home, returning to Staunton Saturday. Miss Myrtle Smith spent the week-end with home folk at Ap pomattox. It was with deep sorrow when I the news was spread over the county of Lina Carsons death. I"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. C M <mark>Stratton</mark>, Jr., and Mrs E."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. C M <mark>Stratton</mark>, Jr., and Mrs E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2468.16, 261.35, 2620.93, 694.03], "bbox_id": "5a327ea0cd", "file": "TimesVirginian_1981a_0372.pdf", "page": 1, "text": "We had 105 to register and five. were deferred. There were five first time donors. To donate for the first time John O. Baxter Gayle P. Taylor, Renessa Doss, Sharon R. Cheatham and Phyllis M. Mayberry. Cathryn Godsey received a 7 gallon pin and William  D. Barnes received a 6 gallon pin. Three gallon pins went to Ottoway Guill and Loretta Layne. Dale H, Franklin was a two gallon donor. One gallon pins went to Linda Ruhf, Marietta Irby, Becky Mayber ry, Daniel Stratton, Elizabeth Oxner, Janet H. Morgan, Marvin V, Francis, Wayne C. Jennings, and Leslie Nash.. Thanks to the many faithful donors who helped to reach our goal. Blood is so much needed that I do hope you will come out to donate on our next Visit. Please mark your calendars for our most important visit which will be on December 22, 1981 and our quota is 200 units. You may think this sounds like a lot but with the number of people in Appomattox County this is just a very small fraction. Please do your share and dont always leave it to this same group of donors to keep Appomattox in the Blood program. Would you believe that 536 people are supplying the blood for our entire county? Alice C. Martin, Blood chm."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Becky Mayber ry, Daniel <mark>Stratton</mark>, Elizabeth Oxner, Janet H."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Becky Mayber ry, Daniel <mark>Stratton</mark>, Elizabeth Oxner, Janet H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [448.56, 1019.36, 596.9, 1232.65], "bbox_id": "497cdc8f05", "file": "AppomattoxNewspapers_1974-1975a_0509.pdf", "page": 1, "text": "We extend our sympathy to Mr. Marvin Taylor and Mrs. Bert Stratton on the loss of their sister, Mrs. Pearl Stratton, of Alexandria. We thank God for such a long and useful life he gave her. Mr. and Mrs. I. B. Wheeler had as their guest Sunday Mr. and Mrs. Bob Wheeler, Joan and Joe Wheeler, of Richmond, Mr. and Mrs. Ben Wheeler, Mr. and Mrs. H. B. Jones, Richard and Kathy and Mrs. Neal Williams, of Lynchburg. Mr. Bob Harris and Mrs. Neal Williams visited Mrs. Elsie and Mrs. Nina Caldwell. Master Will Harris is a visitor  in this home."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Taylor and Mrs. Bert <mark>Stratton</mark> on the loss of"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Taylor and Mrs. Bert <mark>Stratton</mark> on the loss of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1742.9, 264.07, 1903.36, 357.32], "bbox_id": "bcb98b8fad", "file": "AppomattoxNewspapers_1892-1898a_0053.pdf", "page": 1, "text": "We direct especial attention to thé advertisement of R. W. Stratton, Concord Depot, agent for Waltèr A. Woods harvesting machines, which he will sell cheap. He also handles- rakes, reapers and mowers, and will, sell them low down. If yon need anythingin his line, give him a call."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "advertisement of R. W. <mark>Stratton</mark>, Concord Depot, agent for"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "advertisement of R. W. <mark>Stratton</mark>, Concord Depot, agent for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [620.62, 451.68, 776.54, 485.68], "bbox_id": "5b7d0bc9e1", "file": "AppomattoxNewspapers_1898-1902a_0547.pdf", "page": 1, "text": "We are very glad to learn that Mr, Wilbur Stratton is now well enough to walk about the house."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "We are very glad to learn that Mr, Wilbur <mark>Stratton</mark> is now well enough to walk about the house."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "We are very glad to learn that Mr, Wilbur <mark>Stratton</mark> is now well enough to walk about the house."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [449.49, 335.2, 605.53, 486.59], "bbox_id": "30ae7cace5", "file": "AppomattoxNewspapers_1918-1922a_0016.pdf", "page": 1, "text": "We are very glad ditionB seem to be in our neighborhood, though there are quite a few sick. Mr. Johnny Harris and fami ly are down with fla. Alex, ic right sick at this writing rest of the family seem improving. Mr. 0. E Carson is confined to bis room, suffering from several broken ribs. Miss Susie Stratton has been"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "broken ribs. Miss Susie <mark>Stratton</mark> has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "broken ribs. Miss Susie <mark>Stratton</mark> has been"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1571.06, 402.96, 1904.08, 665.54], "bbox_id": "bd494516a3", "file": "AppomattoxNewspapers_1908-1909a_0472.pdf", "page": 1, "text": "We are sorry to state that Mr I W h e Old Maids Club will be Johnnie Marshall is not so well. Jkiven at Stonewall School Feb. Mrs. J T. Hix spent Sunday j  t 45 p m. Refreshments with her mother, Mrs. Harwood. I be sold before and after the The Junior League of Hixburg I Py- School has recently donated 20 1 Mr, end Mrs. C. M. Stratton, new books to the school. library. I Sr.. v are spending a few days, _ Mr- Willie Smith and Curtis I with their daughter, Mrs. D. A. Sans, of Danville, are at homelhristian and Dr. Christian, in for a few weeks. j Appomattox. Mrs. W. K. Graves, of Blue-1 Kenneth Alvis, of V. P .1., field, W. Vg., was the week-end I spent Monday night at home be guest of her sisters, Mesdames Ifore lCavipg for Toledo, Ohio, J. T. and Wilson Hix. I where he has a position with the Mrs. Annie McPhillips had theG .S. Burodu as agricultural en- misfortune to fall down the steps I gineer. Monday and sprain both wrists I Miss Iva Taylor is spending a arid scar her face. We hope she j few days with her sister, Mrs. B. will soon be feeling better. ID. Stratton. Miss Ruth Mi 11am spent Tues-I Mr. and Mrs. H. A. Drinkard day with A. F, Millam. Jand Glenn Drinkard, of Lynch ------- -  j burg, visited home people Sun."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "end Mrs. C. M. <mark>Stratton</mark>, new books to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "end Mrs. C. M. <mark>Stratton</mark>, new books to the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [391.15, 675.31, 534.64, 975.46], "bbox_id": "7d428556c8", "file": "AppomattoxNewspapers_1962-1965a_0189.pdf", "page": 1, "text": "We are so very thankful for the nice rain we have been blessed with. Mr. and Mrs. John Aivis and family spent Sunday with her i parents. Mr. and Mrs. Herbert Mathews, Jr., at Orange. Mr. and Mrs. Tom McVetty and girls, of Royal Oak. Mich., are spending their vacation with her mother Mrs. R. H. Thorn hill and other relatives. Mrs. Agnes Carson spent part of last week with her sister. Mrs. Davis Smith and her family in Lynchburg. Mr. and Mrs. E. L. Chick spent Sunday with their daughter. Mrs. Henry Beard and her family at Appomattox. Mrs Beard cele brated her fathers birthday and Fathers Day all together. Mrs. Agnes Carson spent the day with the Beards also. AD had a good time together. Mr. and Mrs. C. D. Carson joined their children and their families at Issac Walton Lake for a Fathers Day picnic on Sunday. The Stratton reunion was held at the home of Mr and Mrs."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "picnic on Sunday. The <mark>Stratton</mark> reunion was held at"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "picnic on Sunday. The <mark>Stratton</mark> reunion was held at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.55, 686.89, 1808.08, 1116.21], "bbox_id": "064f10322e", "file": "AppomattoxNewspapers_1908-1909a_0098.pdf", "page": 1, "text": "We are having some Spring weather again after a very cold spell. Mrs. Annie Odor, Miss Bessie Martín, Mrs. J. A. Martin and Mr. GordonLayne made a ing trip to the Hill City Monday afternoon. Miss Maggie Nash and Perlie Jones visited in the home of R. W. Martin last Sunday night. Miss Erna Woolridge enter-  tained a number of her friends  last Saturday night. Mr. Berkley Nash, of Lynch- J burg, Mr. and Mrs. Davis Evans j and children, of Campbell, Mr. I and Mrs. Loyd Nash, and child ren, spent last Sunday with their father, T. J. Nash. ..  _ Mr. and Mrs. Lawrence Laugh- Mary and, linj and little girl, Hellas, Mr. Lynchburg. ! and Mra. Carl Ewers, Miss Ber- Mr. and Mrs. J. A. Stratton nice Ford, of Lynchburg, spent holiday guest, list included last Sunday w th their parents, Misses Fannie, Isa, Anna, Saltie Mr. and MrsT. H. Ford. They LeGrande, Frances Stratton and were accomiianied by Mr. Good- Mr. Blankenship, of Lynchburg.  man. Mr. and Mrs. J. A. Martin spent last Sunday pj m. in the  home of A. S. Wooidrige. .  We are sorry Mr. Bill Overby  is sick. Hope he will soon be out again."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "and Mrs. J. A. <mark>Stratton</mark> nice Ford, of Lynchburg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "and Mrs. J. A. <mark>Stratton</mark> nice Ford, of Lynchburg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [702.49, 404.36, 848.37, 604.4], "bbox_id": "278581c621", "file": "AppomattoxNewspapers_1962-1965a_0201.pdf", "page": 1, "text": "We are all so thankful for the nice rain we have had. Mrs. Terry Brown and M.lss Joy Davidson, of Lynchburg, spent Sunday with their father,  Mr. Tommie Davidson, and other home folks. Mrs. Ida Stratton, Mr. and Mrs. Kelly Stratton and children, Mr. and Mrs. James Newland and children, of Lynchburg, spent j last Sunday with Mrs. Etta Ron ton and boys. Mr. and Mrs. Emmett Milton, of Roanoke, spent part of last j week with Mr. ard Mrs. Kern Mays and other loved ones here. Mr. and Mrs. Lyle Moore and Bonne spent the week end in Indianna. Mrs. Davis Smith, of Lynch"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "home folks. Mrs. Ida <mark>Stratton</mark>, Mr. and Mrs. Kelly"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "home folks. Mrs. Ida <mark>Stratton</mark>, Mr. and Mrs. Kelly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1006.26, 641.17, 1173.44, 661.52], "bbox_id": "05934d09e2", "file": "AppomattoxNewspapers_1960-1962b_0620.pdf", "page": 1, "text": "We are all so glad to know Mis. Ida Stratton bap returned to her"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "We are all so glad to know Mis. Ida <mark>Stratton</mark> bap returned to her"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "We are all so glad to know Mis. Ida <mark>Stratton</mark> bap returned to her"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1587.54, 870.91, 1756.02, 990.81], "bbox_id": "f3f383f07a", "file": "AppomattoxNewspapers_1943-1947a_0214.pdf", "page": 1, "text": "We acknowledge a greatly ap preciated letter from Pfc. Stratton H. Franklin, who is on duty in the Philppines. Pfc. Franklin sent us a 100 Pesos note to add to our growing collection of war souve nirs. He aks that his home town newspaper be sent o him and we are glad to add his name to our list of overjeas subscribers. Pfc. Franklin, .wrote interestingly of his war experiences."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "preciated letter from Pfc. <mark>Stratton</mark> H. Franklin, who is"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "preciated letter from Pfc. <mark>Stratton</mark> H. Franklin, who is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [114.24, 974.76, 244.3, 1497.63], "bbox_id": "24e51ca469", "file": "TimesVirginian_1980a_0164.pdf", "page": 1, "text": "Wayne Bowman were conferred the Honorary Chapter Farmer Degree. This award is presented to individuals who have ren dered outstanding assist ance and guidance to the local chapter. It is the highest award that can be given by a local FFA chapter.  Following the Honorary Chapter Farm er cere- mony, proficiency awards were presented to 12 members. Awards and recipients were Tobacco Proficiency  Ray Cheat ham Poultry Production   Richard Jones Forest Management - Dennis Stratton Agricultural Mechanics - Vince McEl roy Turf and Landscape Management - David Doss Extemporaneous Public Speaking - Ralph Totty Prepared Public Speaking - Dennis Stratton Soil and Water Management  Phil Paulette Home Improve ment - Dale Garrett Ag. Sales and Services - Roy Hopkins Swine Profi ciency - Duane Blanks Sheep Proficiency - Tom my Gilliam Beef Produc tion - Roger Walton and Diversified Livestock - Duane Blanks. The evening culminated with the awarding of the three top awards for Chapter members. Star Chapter Farmer was pre sented to Phil Paulette. Star Chapter Agribus inessman was won by Gary Campbèll and Chapter Leadership award was presented to Dale Garrett."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Jones Forest Management - Dennis <mark>Stratton</mark> Agricultural Mechanics - Vince McEl"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Jones Forest Management - Dennis <mark>Stratton</mark> Agricultural Mechanics - Vince McEl"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2327.43, 194.55, 2469.24, 511.78], "bbox_id": "d42088941d", "file": "AppomattoxNewspapers_1971-1973a_0510.pdf", "page": 1, "text": "Watson, Monica Ewers, Paula Franklin, Brenda Garrett,Kar en Marshall, Mary McCraw, Debbie Netherland, Debbie Stratton, Kay Stratton, Deborah Tweedy. SOPHOMORE CLASS PRINCIPALS LIST - David Marshall, Michael Quinn, Mary Parris, Cathy Paulette, Donna Paulette, Debbie Rush. HONOR ROLL Allen Austin, Warren Coleman, Gary Harris, Steve Lamb, Kaye Chenault, Annette Conner, Brenda Gar rett, Lynn Glover, Cindy Guill, Denise Hamlett, Gay Honeycutt, Marcella Lively, Teressa Lu cas, Debbie Martin, Nancy May berry,. Julia Moore, Pam Moo re, Joanne Scott. HONORABLE MENTION - Lewis Martin, Marvin Watson, Lacy Webb, Ricky Wingfield, Patricia Doss, Joyce Foster, Shelin Franklin, Delophine Le wis, Stephanie Martin, Diane Parson, Carla Verner, Joan Wright NINTH GRADE"}, "highlight": {"text": {"matched_tokens": ["Stratton", "Stratton"], "snippet": "McCraw, Debbie Netherland, Debbie <mark>Stratton</mark>, Kay <mark>Stratton</mark>, Deborah Tweedy."}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton", "Stratton"], "snippet": "McCraw, Debbie Netherland, Debbie <mark>Stratton</mark>, Kay <mark>Stratton</mark>, Deborah Tweedy."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [525.36, 379.28, 695.14, 647.97], "bbox_id": "89c366993c", "file": "AppomattoxNewspapers_1952-1954a_0241.pdf", "page": 1, "text": "Watkins M. Abbitt, representative of the Fourth Congressional District, I praised farming as a life work in his address before the 1953 Father-Son Banquet of the Appomattox Chapter, Future Farmers of America here on Friday night. Congressman Abbitt reviewed agri cultural progress in southern Vir ginia during the present century and stressed particularly the improve ment that has been made in farm family living. Farm families no longer need to do without the con veniences city people enjoy, he said. Jack Stratton, president, served as toastmaster for the banquet, attend ed by nearly 100 Future Farmers, their fathers and invited guests. The welcome address was made by Ben. jamin Beasley. Everett Beal, vice-president, spoke on Grass as an Investment. Rep. Abbitt was introduced by Lloyd Walton, chapter secretary. H. B. Pack, Advisor of the Appo-"}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "enjoy, he said. Jack <mark>Stratton</mark>, president, served as toastmaster"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "enjoy, he said. Jack <mark>Stratton</mark>, president, served as toastmaster"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [359.05, 878.92, 541.1, 1642.81], "bbox_id": "0d0558a7c7", "file": "AppomattoxNewspapers_1908-1909a_0361.pdf", "page": 1, "text": "was-frolic and fun spirit over all. 6 30 Awake and then a cold dip. 7 15 Oh! So hungry. 815 Mornipg worship. 9- 9 45 G. As, talk over G. work. 10- 11 Please Stand By Mission Study. 1215 Dinner Starved to death. 2-4 Quiet hour. 4-6 As you like it. 6 Supper Tastes so good. 7 Vesper talks. 10 p. m., Sweet good-night. The officers of Whip-po- will camp Camp Mother, Miss Gladys Smith 1 st Lieutenant, Lucile Cralle 2nd Lieutenant, Virginia Carson Pep leader, Virginia Lee Thompson. Girls in camp Lucile Cralle, Virginia Carson , Edith Franklin, Josephine LeGrand, Thelma Morris, Hilda Moore, Virginia OBrien, Sarah Fran ces Pretlow, Iris Reynolds, Mary Lena Stratton, Caroline Smith, Leonard Smith, Jr., Vir ginia Lee Thompson, Frances Torrence. Headlights of Camp Life Cooking over open fire burnt fingers. Eating off the floor. 1st Lieutenant stepping in the din ner plate. Girls have lio secrets in camp Sarah Frances Broadcasting, Iris the dainty, Virginia Lee Life GuafdHmbtto Let 11 m sink  Virginia Carson, camp vamp Virginia OBrien, the ghost Frances,the handy girl Misg Gldvs. warer-Hnck rcrfitK fortune teller Josephine, pull down that sign Mary Lena, Spring bather  Hilda, River Shampoo Caroline, Camp art? ist Thelma, Sweets to, the sweet Len, .the only girl camp. ,  Many thanks to our big sister Y. W. A. for the most enjoy- ableweqnie roast, To our most loyal neighbors for the use of our camp and the freezer of cream, oh, so good."}, "highlight": {"text": {"matched_tokens": ["Stratton"], "snippet": "Iris Reynolds, Mary Lena <mark>Stratton</mark>, Caroline Smith, Leonard Smith,"}}, "highlights": [{"field": "text", "matched_tokens": ["Stratton"], "snippet": "Iris Reynolds, Mary Lena <mark>Stratton</mark>, Caroline Smith, Leonard Smith,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
