{"document": {"bbox": [388.29, 359.31, 552.06, 1009.39], "bbox_id": "13d420cf9f", "file": "AppomattoxNewspapers_1926-1933a_0042.pdf", "page": 1, "text": "August 18, 1926. Hon. Harris Hart, Supt. Public Instruction, Richmond, Va. Dear SirAs you will recall Mr. N. R- Featherston recently re signed as Superintendent of Schools of Appomattox County, Va., a position he has held since July 1, 1913, and Mr. J. A. Burke was appointed as his suc cessor. At that time there ap peared in The Times-Virginian, a weekly paper published in Ap pomattox County, the following article. Supt. Featherston has re signed and has secured a position we learn in Richmond with the new tax Commission. J. A. Burke has been appointed Supt. of Schools. The fight made against Mr. Featherston when he was up for re-appointment. last year resulted in an agree ment whereby he was to res i after one year. Then ProL Crawley, who was opposing him I withdrew from the contest the school board raised his sal e  to 2,000. The net result of ti , efforts of those opposing the  Superintendent was that t o Professors salary was raised and Mr. Burke gets the Supc.M  tendency and Mr. Featherston is taken care in a State Office n Richmond-all are now on the pay roll and all have our I eat wishes for the proper admini tration of their offices. Tin friends of Mr. Burke assert that he will make an efficient Super intendent. I think in fairness to Mr. Featherston, the people of Appo mattox County should know the facts in this matter as they actu ally exist, that Professor Craw leys salary was not raised by the school board because of any agreement entered into between him and Mr. Featherston, or with the School Board. I can definitely make this statement upon my own personal knowledge because it was my suggestion that the School Board of Appo mattox County increase the sal ary of Professor Crawley, from 1800.00 at which it had re mained for 15 years, to 2,000.00 a year. This was done after Mr. Featherston was appointed Sup erintendent of Schools and there"}, "highlight": {"text": {"matched_tokens": ["N", "R", "Featherston", "Superintendent", "of", "Schools", "of"], "snippet": "you will recall Mr. <mark>N</mark>. <mark>R</mark>- <mark>Featherston</mark> recently re signed as <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> <mark>of</mark> Appomattox County, Va.,"}}, "highlights": [{"field": "text", "matched_tokens": ["N", "R", "Featherston", "Superintendent", "of", "Schools", "of"], "snippet": "you will recall Mr. <mark>N</mark>. <mark>R</mark>- <mark>Featherston</mark> recently re signed as <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> <mark>of</mark> Appomattox County, Va.,"}], "text_match": 3472336863207882873, "text_match_info": {"best_field_score": "6627123724288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863207882873", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2334.04, 255.25, 2481.58, 1236.74], "bbox_id": "7cdaa51b7a", "file": "AppomattoxNewspapers_1962-1965a_0371.pdf", "page": 1, "text": "pomastox system1 been in the caliber of men who have filled - the office of superintendent. The fact that only five men filled this position in almost a century attests to their dedication and excellent accomplishments. In addition to those superintend ents already mentioned may be added these Mr. J. Kirk Hannah 1889-1912 who served as a board member, before becoming superintendent Mi N. R. Featherston 1913- 1926 who was the son of the first public school teacher of the county and a teacher himself. Mr. J. A. Burke 1926-19621 who was a graduate of Appomat tox High School as well as a teacher there. The following statistics will il lustrate in a small way the re sults of Mr. Burkes foresight and leadership No. of white schools. 1926.1962 One-teacher 16 0 Two-teacher 3 1 Three-teacher 5 1 Four-teacher 2 2 Seven-teacher 0 1 Nineteen-teacher 0 I High School 2 l No. of Negro Schools One-teacher 13 1 Two-teacher 4 1 Sixteen-teacher 0 1 High School 0 1 Total Value of school property 1926  196,800 1962!2,119,414 In 1962 Mr. Earl J. Smith, Jr. was appointed to succeed Mr, Burke. No history of a rural school system of by-gone days is com plete that does not mention the place of the school as a com munity center and the teacher as the leader in the community. Appomattox is no exception. Be cause the school was usually near the center of the communi ty  therefore, in walking dis tance or later driving distance it was used for religious meet ings, especially for Sunday School for those too far to go to churoh, the Grange and other farm organizations. How many people have enjoyed the fellow ship of each other while plann ing and executing box parties, pie suppers, sings, oyster supp ers and bazaars to make money for the school, but at the same time have a little fun along with it. The teachers visit in the home was once a great occasion to teacher, pupil and! parents. Her visit warded off trouble with Johnny as he great to know her as an individual. She could know Johnny better as she saw him in his natural surroundings. After she had spent the night in ihis home she was usually his friend. The teacher was able to introduce new ideas into the home since she usually was one of the most respected individuals of the com munity. She taught Sunday School, played the organ, may be .got up a play or Christmas program at church or school. Unconsciously she was molding opinions. Sometimes she capti vated the heart of a young swain who saw to it that she remained in the community where she reared a family and in turn be came .a patron yes, a better patron than some she had had. As schools grew and roads im proved the whole faculty was invited to supper in a number of the homes. There good food and good fellowship were in such abundance that each person pre sent felt inspired to return to his job and do a better piece of work. To the unknown teacher be longs much of the credit for the progress of the system."}, "highlight": {"text": {"matched_tokens": ["superintendent", "N", "R", "Featherston"], "snippet": "board member, before becoming <mark>superintendent</mark> Mi <mark>N</mark>. <mark>R</mark>. <mark>Featherston</mark> 1913- 1926 who was"}}, "highlights": [{"field": "text", "matched_tokens": ["superintendent", "N", "R", "Featherston"], "snippet": "board member, before becoming <mark>superintendent</mark> Mi <mark>N</mark>. <mark>R</mark>. <mark>Featherston</mark> 1913- 1926 who was"}], "text_match": 3467833264251601017, "text_match_info": {"best_field_score": "4428100796416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264251601017", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.02, 398.11, 1605.36, 1042.4], "bbox_id": "240ef6d393", "file": "AppomattoxNewspapers_1955-1957a_0014.pdf", "page": 1, "text": "from public taxes. In 1870, this in novation met with considerable op position. Good judgment finally prevaield and the County Public School System was begun on a very modest scale. The first public school in this county was located in a log cabin near the Old Court House. The first teacher in the public school system was J. H. Featherston. The first County Superintendent of Schools was C. H. Chilton, 1870- 1881. He was succeeded by J. B. Bristow, who continued in office un til 1885. Mr. Chilton returned to office in that year and served until 1897. Sucessors in office were J. K. Hannah, 1897-1913 N. R. Feather ston, 1913-1926 and J. A. Burke, 1926 to date, The first public school house built with county funds was erected at Hurtsville. Other school structures were added as fast as funds from school taxes made these accomoda tions possible. Mr. N. R. Featherston, in his his tory of Appomattox County, re ports that the school term in the early days of the system was five months. Teachers average monthly salary was 25.00. In 1908, Professor Lindsay Craw ley was apointed principal of the high school at Appomattox. The frame building housing the high school stood on the lot where the present T. W. Moses residence is located. There were three teachers and 160. students. Funds allocated by the legislature in this year, with matching donations by private citi zens, financed the building of a new high school at the present site. Appomattox High School open ed in September, 1909, with the im posing name of Tenth Congression al District High School. Our public school system has made great advances in the years since 1909. In the past ten years alone, we have seen the construc tion of a new and up-to-date agri cultural vocational building at the high school addition of a hew gym nasium construction of the Carver- Price High School and elementary school for Negroes, and the build ing of the new elementary school in the town of Appomattox. For the current session, total enrollment in county public schools is 2,300 pupils, with 93 teachers."}, "highlight": {"text": {"matched_tokens": ["Featherston", "Superintendent", "of", "Schools"], "snippet": "system was J. H. <mark>Featherston</mark>. The first County <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> was C. H. Chilton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Featherston", "Superintendent", "of", "Schools"], "snippet": "system was J. H. <mark>Featherston</mark>. The first County <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> was C. H. Chilton,"}], "text_match": 3467833263983165561, "text_match_info": {"best_field_score": "4428100665344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263983165561", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1210.95, 520.6, 1366.3, 1212.4], "bbox_id": "c3014b37d6", "file": "AppomattoxNewspapers_1918-1922a_0402.pdf", "page": 1, "text": "The State Board of Education an nounced the election of sixty-four di vision school superintendentsthese having no opposition. Elections were made for all the cities except Alex andria, Danville and Newport News. There is a single applicant for Dan ville, and the -passing of the city is a surprise. C. E. Crossland, president of Averett College, is understood to be the choice ot certain persons. Dr. Crossland and the trustees of his col lege are said to bare suffered a mis understanding over the question of dancing, and it is reported that he may resign. His friends are now urg ing that he be made superintendent of schools. Following aro the elections as an nounced Accomac, G. C. Joynes, Onancook Albemarle, A. L. Bennett, Charlottes ville Arlington, Fletcher Kemp, Rosslyn Alleghany, J. G. Jeter, Cov ington Amelia, W. R. Wrlggles- worth, Blackstone Amherst, W. L. Tucker, Amherst Appomattox, N. R. Featherston, Pamplin Augusta, F. M. Somerville, Staunton, R. F. D. 6 . Bedford, C. M. Abbot, Bellevue Botetourt, E. A. Fainter, Fincastle Brunswick, W. B. Balen tino, Raw lings Buchanan, M. L. Combs, Grundy. Charles City, Herman L. Harris, Toano Charlotte, E. H. Hall, Drakes Branch Clarke, L. D. Kline, Win chester. Dinwiddle, O. B. Zehmer, Dinwid dle. Elizabeth City, J. H. Brent, Hamp ton Essex, W. G. Rennolds, Center Cross. Fauquier, F. Osgood Smith, Wart renton Franklin, R. A. Prlllamn, Rocky Mount. Giles, R. H. Farrier, Newport Grayson, Lyle T. Cox, Independence. Halifax, H. J. Watkins, South Bos ton Hanover, J. Walton Hall, Ash land Henrico, A. C. Cooper, Rich mond, Henrico Courthouse Henry, W. B. Gates, Martinsville Highland, R. E. Mauzy, Hlghitown Isle of Wight, Gavin Rawls, Carrsville. Lancaster, Frank W. Lewis, Morat- tico Loudoun, O. L. Emerick, Pur- cellville. Mecklenburg, C. B. Green, Boyd ton. Nelson, W. E. Kidd, Lovingston Norfolk, James Hurst, Norfolk. Prince Edward, T. J. Mcllwaine, Hampden-Sidney Prince William, Woodstock -Smyth, B. E. Copenhaver, Pulaski, E. L. Darst, Dublin. Rappahannock, H. D. Hite, Front Royal Roanoke, R. E. Cook, Salem Rockbridge, R. M. Irby, Lexington Rockingham, John C. Myers, Harri sonburg Russell, R. N. Anderson, Le banon. Shenandoah, C. V. Shoemaker, Woodstock Smyth, B. E. Copenhaver, Marion Southampton, R. M. Newton,"}, "highlight": {"text": {"matched_tokens": ["superintendent", "of", "schools"], "snippet": "that he be made <mark>superintendent</mark> <mark>of</mark> <mark>schools</mark>. Following aro the elections"}}, "highlights": [{"field": "text", "matched_tokens": ["superintendent", "of", "schools"], "snippet": "that he be made <mark>superintendent</mark> <mark>of</mark> <mark>schools</mark>. Following aro the elections"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
