{"document": {"bbox": [133.66, 711.42, 282.18, 1164.24], "bbox_id": "063281faf0", "file": "TimesVirginian_1976_0394.pdf", "page": 1, "text": "The list of schools below was  found in a notebook kept by my j grandfather. Chapman H. Chil- f ton. He was the first j Superintendent of Appomattox County Schools, beginning in j 1870 and serving until 1897, j with the exception of the period I from 1881 until 1885, when the ! Rev. J. B. Bristow occupied j that post. He listed the schools by ! District, stating that these j schools were the ones establish- j ed by the first boundary. j There are twenty two schools ! listed in the Southside District, thirteen in Stonewall, and j twenty eight in Clover Hill. It is j interesting that the Districts j have remained the same until  the present day. Mr. Jerry A. Burke, Superin- j tendent from 1926 until 1962 stated that as far as he knew, j there is no other list of early schools in Appomattox County, as the records were burned in j fires at the School Board Office and at the Courthouse. In order to compile accurate 1 records about the early schools, ! it would be worthwhile to j determine the location of each of these schools if possible. It is suggested that any person with any knowledge of where these schools were held, either from personal recollec tion or from local hearsay, come into the School Board office and share that knowledge. Both"}, "highlight": {"text": {"matched_tokens": ["j", "Superintendent", "of", "Schools", "j"], "snippet": "He was the first <mark>j</mark> <mark>Superintendent</mark> <mark>of</mark> Appomattox County <mark>Schools</mark>, beginning in <mark>j</mark> 1870"}}, "highlights": [{"field": "text", "matched_tokens": ["j", "Superintendent", "of", "Schools", "j"], "snippet": "He was the first <mark>j</mark> <mark>Superintendent</mark> <mark>of</mark> Appomattox County <mark>Schools</mark>, beginning in <mark>j</mark> 1870"}], "text_match": 3467833264117383289, "text_match_info": {"best_field_score": "4428100730880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264117383289", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.02, 398.11, 1605.36, 1042.4], "bbox_id": "240ef6d393", "file": "AppomattoxNewspapers_1955-1957a_0014.pdf", "page": 1, "text": "from public taxes. In 1870, this in novation met with considerable op position. Good judgment finally prevaield and the County Public School System was begun on a very modest scale. The first public school in this county was located in a log cabin near the Old Court House. The first teacher in the public school system was J. H. Featherston. The first County Superintendent of Schools was C. H. Chilton, 1870- 1881. He was succeeded by J. B. Bristow, who continued in office un til 1885. Mr. Chilton returned to office in that year and served until 1897. Sucessors in office were J. K. Hannah, 1897-1913 N. R. Feather ston, 1913-1926 and J. A. Burke, 1926 to date, The first public school house built with county funds was erected at Hurtsville. Other school structures were added as fast as funds from school taxes made these accomoda tions possible. Mr. N. R. Featherston, in his his tory of Appomattox County, re ports that the school term in the early days of the system was five months. Teachers average monthly salary was 25.00. In 1908, Professor Lindsay Craw ley was apointed principal of the high school at Appomattox. The frame building housing the high school stood on the lot where the present T. W. Moses residence is located. There were three teachers and 160. students. Funds allocated by the legislature in this year, with matching donations by private citi zens, financed the building of a new high school at the present site. Appomattox High School open ed in September, 1909, with the im posing name of Tenth Congression al District High School. Our public school system has made great advances in the years since 1909. In the past ten years alone, we have seen the construc tion of a new and up-to-date agri cultural vocational building at the high school addition of a hew gym nasium construction of the Carver- Price High School and elementary school for Negroes, and the build ing of the new elementary school in the town of Appomattox. For the current session, total enrollment in county public schools is 2,300 pupils, with 93 teachers."}, "highlight": {"text": {"matched_tokens": ["J", "Superintendent", "of", "Schools"], "snippet": "public school system was <mark>J</mark>. H. Featherston. The first County <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> was C. H. Chilton,"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "Superintendent", "of", "Schools"], "snippet": "public school system was <mark>J</mark>. H. Featherston. The first County <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> was C. H. Chilton,"}], "text_match": 3467833263714730105, "text_match_info": {"best_field_score": "4428100534272", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263714730105", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1617.59, 444.2, 1906.8, 646.9], "bbox_id": "3bb05096ce", "file": "AppomattoxNewspapers_1962-1965a_0312.pdf", "page": 1, "text": "and Dr. Wm D. Christian, J. H. Springs Academy Marshall and W. T. Pankey No. 3 Clover Hilli District. From 1870 to around 1920 each Magistratial district of the ty had its own board which or less guided the schools in their district in following the direc tions of the entire county school board. Many were the problems of these men, not the least of which was securing money for the operation of the schools. In j every grade, degree and merit. 1872, the earliest record avail- But as time advanced, our schools able, the school board agree to in a hvely degree fell into the , ask the Board of Supervisors hne of progress on the book ques-1 to levy a tax of three fourth of tion and the most approved books one mill on the dollar or seven were introduced and are now and one-half cents on the one  1885 in use- said Rev. J. B. hundred dollars, for county school Bristow, Superintendent, purposes for the next scholastic ! In 1879 the question of the"}, "highlight": {"text": {"matched_tokens": ["J", "B", "Bristow", "Superintendent"], "snippet": "in use- said Rev. <mark>J</mark>. <mark>B</mark>. hundred dollars, for county school <mark>Bristow</mark>, <mark>Superintendent</mark>, purposes for the next"}}, "highlights": [{"field": "text", "matched_tokens": ["J", "B", "Bristow", "Superintendent"], "snippet": "in use- said Rev. <mark>J</mark>. <mark>B</mark>. hundred dollars, for county school <mark>Bristow</mark>, <mark>Superintendent</mark>, purposes for the next"}], "text_match": 3467833263714730105, "text_match_info": {"best_field_score": "4428100534272", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833263714730105", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1055.27, 509.8, 1207.32, 1804.99], "bbox_id": "4d3279e3fc", "file": "AppomattoxNewspapers_1918-1922a_0365.pdf", "page": 1, "text": "Norfolk.Mrs. Ruth White was shot to death on the doorstep of her home ln -this city. The entire police force is searching for her husband, J. Weldon White. Lexington.Captain David E. Moore, aged 80, formerly for many years Commonwealths Attorney for Rock bridge and well-known Confederate veteran, died at the home of his sister, Mrs. Alexander L. Nelson, here. Manassa.Karl J. Austin, on trial tor the murder of J. R. B. Davis, shot and killed on the street here May 3 by Austin, was acquitted after Mrs. Austin had testified regarding her re lations with Davis. The jury was out only twenty-five minutes. Pulaski.There were 1,650 women in Pulaski county who paid their poll- taxes, registered, qualifying -to vote in the presidential election on November 2. One-half the number were in Pu laski City. In all 135 negro women registered. Danville.The . local aircraft cor poration has found that commercial Eying is not a financial success. The machine owned here, and which has been filling fair contracts, returned Saturday, and it was announced that the affairs of the concern, would be wound up-without further delay and the machine sold. Pulaski.A. J. Hailey was fatally In jured by a premature explosion of a dynamite hole at the Pulaski Stone Company quarries. He was manager ot the company and was tamping a loaded hole when, it is presumed, he struck a spark. He died soon after the accident. He leaves a widow and several small children. Lynchburg.  Senator Warren G. Harding has accepted an invitation to make an address at the Elks National Home, Bedford, Va., December 5, ac cording to a telegram received from Marion, Ohio, by Mayor Fred Harpor, ot this city. The occasion will be the annual memorial services to the dead members of-the order. Lynchburg.Exactly 1,642 women qualified themselves here to vote at the November election, 300 being reg istered the last day. Of the 1,765 who were assessed for capitation taxes only 125 failed -to register or were dis qualified by the registrars. The new registration placed 320 negro women on the books, ninety-one who were assessed failing to register. Winchester.Mystic Shriners be longing to Acca Temple, of Richmond, Will hold a ceremonial session at Staunton on October 15, when, it is expected, a large class of novices, drawn principally from towns in the Shenandoah Valley, will be initiated. Plans for entertaining the Shriners are under way, and it is proposed to have the city decorated. The ceremonies are to take place at the Staunton Mili tary Academy, and it will be virtually a twenty-four-hour jubilation, it .is stated. Richmond.Four division superin tendents were chosen to fill vacancies In Virginia schools at a meeting of the State Board of Education. These va cancies were caused by the resigna tions to accept other positions. W. W. Edwards was selected to fill the unexpired term of A. B. Bristow, re signed, from Prince George and Sus sex, who has accepted the position of principal at Maury High School in Norfolk city. Mr. Edwards was ap pointed with the understanding that he would give his whole time to the work. W. K. Barnett was chosen as acting superintendent of Bedford City, to succeed J. P. Whitt, who resigned that he might continue educational work. Charlottesville.Paul Goodloe Mc- Intlre, of this city, who recently gave the University of Virginia 60,000 for the erection of a Greek amphitheatre at that institution, has just contributed an additional 24,000 to be spent on the building itself, and in the installa tion of an immense pipe organ. The ampitheatre, now under course of con struction, will have a seating capacity of 3,600. The structure was designed by Professor Fiske Kimball, and the erection is being supervised by Pro fessor Makielski, of the school of architecture. It will he completed by the centennial next June, and will be the only one of its kind in the South and West. It will rank with the Bebeli Gardens, of Florence, Italy. . Petersburg.Stricken while attend ing the Parent-Teachers Association, of which she was vice-president, Mrs. John R. Rose, a prominent Petersburg woman, died. Mrs. Rose had just fin ished taking up the usual collection and was in the act of handing it to the president, when she staggered and fell. Medical aid was summoned, but death was declared to have been instantane ous. Heart disease was given as the reason for Mrs. Roses death. She was a native of Lunenburg county, hut had been in this city for a number of years. Danville.John C. Blair, of Witt, has been chosen chairman of the Chatham district unit of the Virginia Tobacco Growers Association, and he has called a meeting to be held there to perfect local organization."}, "highlight": {"text": {"matched_tokens": ["of", "J", "B"], "snippet": "trial tor the murder <mark>of</mark> <mark>J</mark>. R. <mark>B</mark>. Davis, shot and killed"}}, "highlights": [{"field": "text", "matched_tokens": ["of", "J", "B"], "snippet": "trial tor the murder <mark>of</mark> <mark>J</mark>. R. <mark>B</mark>. Davis, shot and killed"}], "text_match": 3465581464572133497, "text_match_info": {"best_field_score": "3328589234176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464572133497", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1093.68, 548.91, 1254.58, 1795.79], "bbox_id": "4d7c803739", "file": "AppomattoxNewspapers_1918-1922a_0247.pdf", "page": 1, "text": "Lexington.Captain David E. Moore, aged 80, formerly for many years Commonwealths Attorney for Rock bridge and well-known Confederate veteran, died at the home of his sister, Mrs. Alexander L. Nelson, here. Manassa.Karl J. Austin, on trial for the murder of J. R. B. Davis, shot, and killed on the street here May by Austin, was acquitted after Mrs, Austin had testified regarding her re lations with Davis. The jury was out only twenty-dive minutes. Pulaski.There were 1,650 women in Pulaski county who paid their poll- taxes, registered, qualifying to vote in the presidential election on November 2. One-half the number whre in Pu laski City. In all 135 negro women registered. Danville.The local aircraft cor poration has found that commercial flying is not a financial success. The machine owned here, and which has been filling fair contracts, returned Saturday, and it was announced that the affairs of the concern would be wound up without further delay and the machine sold. Pulaski.A. J. Hailey was fatally in jured by a premature explosion of a dynamite hole at the Pulaski Stone Company quarries. He was manager of . the company and was tamping a loaded hole when, it is presumed, he struck a spark. He died soon after the accident. He leaves a widow and several small children. Lynchburg.  Senator Warren G. Harding has accepted an invitation to make an address at the Elks National Home, Bedford, Va., December 5, ac cording to a telegram received from Marion, Ohio, by Mayor Fred Harper, of this city. The occasion will be the annual memorial services to the dead members of the order. LynchburgExactly 1,642 women qualified themselves here to vote at the November election, 300 being reg istered the last day. Of the 1,765 who were assessed for capitation taxes only 125 failed to register or were dis qualified by the registrars. The new  registration placed 320 negro women on the books, ninety-one who were assessed failing to register. Winchester.Mystic Shriners be longing to Acca Temple, of Richmond, Will hold a ceremonial session at Staunton on October 15, when, it is expected, a large class of novices, drawn principally from towns in, the Shenandoah Valley, will be initiated. Plans for entertaining the Shriners are under way, and it is proposed to have the city decorated. The ceremonies are to take place at the Staunton Mili tary Academy, and It will bo virtually a twenty-four-hour jubilation, it is stated. Richmond.Four division superin tendents were chosen to fill vacancies 1n Virginia schools at a meeting of the State Board of. Education. These va cancies were caused by the resigna tions to accept other positions. AV. W. Edwards was selected to fill the unexpired term of A. B. Bristow, re signed, from Prince George and Sus sex, who has accepted the position of principal at Maury High School in Norfolk city. Mr. Edwards was ap pointed with the understanding that lie would give his whole time to the work. W. K. Barnett was chosen as acting superintendent of Bedford City, to succeed J. P. Whitt, who resigned that he might continue educational work. Charlottesville.Paul Goodloe Mc- Intire, of this city, who recently gave the University of Virginia 60,000 for the erection of a Greek amphitheatre at that institution, has just contributed an additional 24,000 to be spent on the building itself, and in the installa tion of an immense pipe organ. The ampitheatre, now under course of con struction, will have a seating capacity of 3,600. The structure was designed toy Professor Fiske Kimball, and the erection is being supervised by Pro fessor Makielski, of the school of architecture. It will be completed by the centennial next June, and will be the only one of its kind in the South and West. It will rank with the Bebeli Gardens, of Florence, Italy. Petersburg.Stricken while attend ing the Parent-Teachers Association, of which she was vice-president, Mrs. John R. Rose, a prominent Petersburg woman, died. Mrs. Rose had just fin ished taking up the usual collection and wasin the act of handing it to the president, when she staggered and fell. Medical aid was summoned, but death was declared to have been instantane ous. Heart disease was given as the reason for Mrs. Roses death. She was a native of Lunenburg county, but had been in this city for a number of years. Danville.John C. Blair, of Witt, has been chosen chairman of the Chatham district unit of the Virginia Tobacco Growers Association, and he has called a meeting to be held there to perfect local organization."}, "highlight": {"text": {"matched_tokens": ["of", "J", "B"], "snippet": "trial for the murder <mark>of</mark> <mark>J</mark>. R. <mark>B</mark>. Davis, shot, and killed"}}, "highlights": [{"field": "text", "matched_tokens": ["of", "J", "B"], "snippet": "trial for the murder <mark>of</mark> <mark>J</mark>. R. <mark>B</mark>. Davis, shot, and killed"}], "text_match": 3465581464572133497, "text_match_info": {"best_field_score": "3328589234176", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464572133497", "tokens_matched": 6, "typo_prefix_score": 0}}
