{"document": {"bbox": [351.6, 1365.37, 516.16, 1794.32], "bbox_id": "5d8b4a41d9", "file": "AppomattoxNewspapers_1892-1898a_0394.pdf", "page": 1, "text": "H on . R. T. S cott , A ttorney General of Vir ginia, Richmond, Va, d b a r s ib  In Feb. 1896 the School Board of Appomttos by a unanimous voto allowed Mr. H. D Flood a foe of 150.00 fof the prosecution of four chancery suits he had brought against two Ox-Treasurerof the Cointv and in which lie had recovered a large sura for the school fund  nt the time tills allowance was made Mr. Flood was Attorney for the Jommon- wc ilth of said County, and on that account the Superintendent of Schools.contende-i that he was not ontit ed to a fee. Mr. Flood de clined to accept, the warront unless in your Opinion he was entitled to a fee and at hi sug gestion a committee was appointed to make a statem ent of the facts iu the case to you, The undersigned is the committee. We subm it the attached statem ent signed by the members of the School Board when Mr. Flood was retained, ns a true statem ent of tlife acts of the case and desire your opinion, from these facts, as to whether we had power to allow a fee to Mr. Flood, out of the fund re covered by him in the four chancery suits. That there are bu t three School D istricts n Appomattox and were bu t three in 1890, so there were only nine trustees. Respectfully, T. A. S mith , J. T. M oses , J. W. G ii . i , iam , Committee, To Messrs. .1. T. Moses, T. A. Smith and J. W. Gilliam Committee of the School Board appointed to ascertain the facts in connec tion with allowing a fee to H. D. Flood at the moeting of the School Board of Appo m attox county on February 6 th 1896. We the undersigned desire to state th at we were mombers of tho School Beard of Appo mattox county on the 8 th day of January 1890 and for sometime th ereafter that there was a meeting of sad board on that day for the purpose of having settlem ents with Mr. J. R. Franklin late treasurer of said oounty that anticipating some trouble in securing a set tlem ent with Mr. Franklin and the A ttorney for ihe Commi nwealth of said oounty being W. C. Franklin, esq., the son of Mr. J H Franklin the board a t the instance of Mr c  H. Chilton, superintendent of schools for Ap pomattox county retained Mr. H. D. Flood as their counsel to bring about this settle ment. Mr. Flood was present and a sottie ment was reached by which it was agreed that Air. Franklin should pay 108.47 and th at this should he accepted in full of the amount due by Mr. Franklin and if tins was paid that the question of the 2 percent of the penalty lidded after December 1st In each year should not be raised as to Mr. Franklins term. Sub sequently Mr. Franklin raised some question About this settlem ent and Mr. Flood as the representative ef the Bourd some two years later brought suit fer a new settlem ent, Mr. Hood was isscruetod to investigate Mr! Shearer liability for tile 2 per cent of the 5 p ercen t penalty added after December 1st in"}, "highlight": {"text": {"matched_tokens": ["c", "H", "Chilton", "superintendent", "of", "schools"], "snippet": "the instance of Mr <mark>c</mark>  <mark>H</mark>. <mark>Chilton</mark>, <mark>superintendent</mark> <mark>of</mark> <mark>schools</mark> for Ap pomattox county"}}, "highlights": [{"field": "text", "matched_tokens": ["c", "H", "Chilton", "superintendent", "of", "schools"], "snippet": "the instance of Mr <mark>c</mark>  <mark>H</mark>. <mark>Chilton</mark>, <mark>superintendent</mark> <mark>of</mark> <mark>schools</mark> for Ap pomattox county"}], "text_match": 3472336863744753785, "text_match_info": {"best_field_score": "6627123986432", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863744753785", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1434.02, 398.11, 1605.36, 1042.4], "bbox_id": "240ef6d393", "file": "AppomattoxNewspapers_1955-1957a_0014.pdf", "page": 1, "text": "from public taxes. In 1870, this in novation met with considerable op position. Good judgment finally prevaield and the County Public School System was begun on a very modest scale. The first public school in this county was located in a log cabin near the Old Court House. The first teacher in the public school system was J. H. Featherston. The first County Superintendent of Schools was C. H. Chilton, 1870- 1881. He was succeeded by J. B. Bristow, who continued in office un til 1885. Mr. Chilton returned to office in that year and served until 1897. Sucessors in office were J. K. Hannah, 1897-1913 N. R. Feather ston, 1913-1926 and J. A. Burke, 1926 to date, The first public school house built with county funds was erected at Hurtsville. Other school structures were added as fast as funds from school taxes made these accomoda tions possible. Mr. N. R. Featherston, in his his tory of Appomattox County, re ports that the school term in the early days of the system was five months. Teachers average monthly salary was 25.00. In 1908, Professor Lindsay Craw ley was apointed principal of the high school at Appomattox. The frame building housing the high school stood on the lot where the present T. W. Moses residence is located. There were three teachers and 160. students. Funds allocated by the legislature in this year, with matching donations by private citi zens, financed the building of a new high school at the present site. Appomattox High School open ed in September, 1909, with the im posing name of Tenth Congression al District High School. Our public school system has made great advances in the years since 1909. In the past ten years alone, we have seen the construc tion of a new and up-to-date agri cultural vocational building at the high school addition of a hew gym nasium construction of the Carver- Price High School and elementary school for Negroes, and the build ing of the new elementary school in the town of Appomattox. For the current session, total enrollment in county public schools is 2,300 pupils, with 93 teachers."}, "highlight": {"text": {"matched_tokens": ["Superintendent", "of", "Schools", "C", "H", "Chilton"], "snippet": "Featherston. The first County <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> was <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, 1870- 1881. He was"}}, "highlights": [{"field": "text", "matched_tokens": ["Superintendent", "of", "Schools", "C", "H", "Chilton"], "snippet": "Featherston. The first County <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> was <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, 1870- 1881. He was"}], "text_match": 3472336863610536057, "text_match_info": {"best_field_score": "6627123920896", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3472336863610536057", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2040.46, 633.81, 2176.86, 745.6], "bbox_id": "73fca8c7cf", "file": "TimesVirginian_1980a_0296.pdf", "page": 1, "text": "Hannah for .25c. The dates of beginning and ending of the, school sessions for the fourteen-year period are given. C. H. Chilton was appoint - ed the first Superintendent of Appomattox County  Schools when the public schools were begun in 1870, a post he held for almost"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton", "Superintendent", "of"], "snippet": "fourteen-year period are given. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was appoint - ed the first <mark>Superintendent</mark> <mark>of</mark> Appomattox County  Schools when"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton", "Superintendent", "of"], "snippet": "fourteen-year period are given. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark> was appoint - ed the first <mark>Superintendent</mark> <mark>of</mark> Appomattox County  Schools when"}], "text_match": 3470085063394197625, "text_match_info": {"best_field_score": "5527612096512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3470085063394197625", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.87, 381.47, 1980.9, 693.66], "bbox_id": "130aac4e50", "file": "TimesVirginian_1976_0308.pdf", "page": 1, "text": "we desire to place before the minds of our representatives the name of Mr. C. H. Chilton, of Appomattox county, who with twenty years or more experience as teacher, and for twelve years Superintendent of Public Schools in Appomattox county, besides for scholarship, holding an A. M. diploma of one of our highest institutions will rank hhw second to none in qualification that may apply. Mr. Chilton, although a cripple, has for several years devoted his entire attention to his farm, being actively engaged in driving the axe, plying the hoe, and guiding the plow, and in this occupation his success will testify of his energy, industry and sldll. A greater reason till is presented to our minds in this, that one so well qualified morally, mentally, socially and politically does not court this or any other office, and hence we think the office would be honored in having such a"}, "highlight": {"text": {"matched_tokens": ["C", "H", "Chilton", "of"], "snippet": "the name of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, <mark>of</mark> Appomattox county, who with"}}, "highlights": [{"field": "text", "matched_tokens": ["C", "H", "Chilton", "of"], "snippet": "the name of Mr. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, <mark>of</mark> Appomattox county, who with"}], "text_match": 3467833264385818745, "text_match_info": {"best_field_score": "4428100861952", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264385818745", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [2188.14, 253.8, 2335.22, 1235.29], "bbox_id": "f154d4aa0f", "file": "AppomattoxNewspapers_1962-1965a_0371.pdf", "page": 1, "text": "languages, math, English, social subjects and physical education. With a library of more than 5,000 volumes, audio - visual equipment and a growing guid ance program, the school has a bright future. From time to time salaries were discussed. In 1S72 the County Board adopted a salary sohedule A teacher holding a full certi ficate to receive 35 per month. A teacher holding an Inter mediate certificate to receive 25 per month. A teacher holding a Primary certificate to receive 20 per month. Teachers who had no certifi cate received less than 20. Mr. Chilton, as have other county superintendent, made a strong effort to help the teachers im prove their professional prepa ration. At the beginning of the school system in our county our efficient County Superintendent, Capt. C. H. Chilton, organized a County Teachers Institute, which met under a constitution and by-laws adopted by the soc iety for instruction in pedagogics regularly every month. The pro- meter of all school work found here a wide and inviting field. Captain Chilton did a good Work in this direction. Textbooks w e r e regularly studied to recite in these teach ers meetings in connection with recitations on theory and prac tice of teaching. Young teachers found aid and stimulus to their work. The more experienced be- oame more deeply impressed with the dignity, importanoe and responsibility of their avo cation. None but madmen and fools could ever aim to suppress such a helpful institution and adjunct to our admirable sys tem of free education. Gradually Capt. Chilton less ened the number of meetings, unfit an annual Institute was all that necessity seem to him to require. Even then steps to re quire teachers to attend had to be taken. As toe years passed a committee made up of the sup erintendent and teachers plann ed the Institute. The board was foresighted enough to recognize the value to be derived from the Virginia Journal, so in 1907 it was sent to each teacher for six months at the boards expense. The board did this on other occasion also. It was agreed to try to induce all the teachers who could do so to attend the Teach ers Meeting in Roanoke, Octo ber 5, 1907, and to receive their usual pay during the time lost from school.  Many teachers, maybe all, had to go to the Court House each year to take examinations for two days. Those examina tions were far different from what most of us would give to day. The Board granted a 2.50 per month raise in salary to those who attended the State Normals Summer School. The early schools were heated by fireplaces if heated at all. The big boys, and there must have been big boys in every school since the board allowed people up to 25 years of age to attend without paying tuition, went Into near-by woods and either broke up or cut wood which they dragged or brought. As money became available the board hired people to deliver wood to school to be cut. Later cut or sawed wood was deliver- jed. The big Girls swept the one - room sohool. The water  bucket and gourd, later the dipper was a necessary part of"}, "highlight": {"text": {"matched_tokens": ["Superintendent", "C", "H", "Chilton"], "snippet": "county our efficient County <mark>Superintendent</mark>, Capt. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, organized a County Teachers"}}, "highlights": [{"field": "text", "matched_tokens": ["Superintendent", "C", "H", "Chilton"], "snippet": "county our efficient County <mark>Superintendent</mark>, Capt. <mark>C</mark>. <mark>H</mark>. <mark>Chilton</mark>, organized a County Teachers"}], "text_match": 3467833264251601017, "text_match_info": {"best_field_score": "4428100796416", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3467833264251601017", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [850.07, 191.73, 987.17, 622.95], "bbox_id": "e11ac7a7b7", "file": "AppomattoxNewspapers_1974-1975a_0278.pdf", "page": 1, "text": "Retirement, to a lot of people means long, lazy days of doing nothing. Not so with Miss Harriett A. Chilton of Falls S u rc h . Va. A native of Appomattox County. Miss Chilton grew up near Spout Spring and graduated from Appomattox High School in 1929 . She attended Madison College and served in the Womens Army Corps in World War II, being stationed in the Southwest Pacific area. Miss Chilton is the daughter of the late William C. and Jemima Chilton and granddaughter of Chapman Hunter Chilton who was Principal of Union Aca demy near Spout Spring in the 1860s and became the first Superintendent of Schools in the County when the public school system was begun in 1870. With a background such as hers it is only natural that Miss Chiltons love of Appomat tox County and its people runs deep. Being a lover of history, since her retirement from Federal government service, Miss Chil ton has been doing historical and genealogical research as a hobby. She has found time to write and her books include Abstract of Appomattox Quar terly Meeting Conference of the Methodist Church 1861-1875, and the Register of Old Concord Presbyterian Church"}, "highlight": {"text": {"matched_tokens": ["Superintendent", "of", "Schools"], "snippet": "and became the first <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> in the County when"}}, "highlights": [{"field": "text", "matched_tokens": ["Superintendent", "of", "Schools"], "snippet": "and became the first <mark>Superintendent</mark> <mark>of</mark> <mark>Schools</mark> in the County when"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
{"document": {"bbox": [570.67, 982.23, 902.66, 1838.39], "bbox_id": "80675a87c4", "file": "AppomattoxNewspapers_1898-1902a_0252.pdf", "page": 1, "text": "Appomattox Chapter, United j Daughters of the Confederacy, has I purchased a handsome new irjjn I eiice for the Confederate Soldiers I Cemetery. It is to be put up at happiest j tlllCe The cemetery will soon haye Semite made one of the speecllCof the.day, which was re-.j he appearance of careful attentio ceived witlKjvpplause. ft was M r. as the head-stones, flowers and ass first appearance before many ! mounds, etc., will be protected by this fence. The Chapter has w orked of this people and it is ,gfe to eay I aS5luou8lx ever since M rs, C. W. that Lynchburg and Campbell will fjunter gave a graphic description have an able and fearless represen-i.uf the dilapidation and utter neg- tative in Mr. Glass. Mr. Glass never was a candidate for political prefer ment, bnt the Democracy of his city recognized his ability and gave him the nomination without a strug- le on his part. Mr. Glass is en tirely a self-made man and lias by his studious habits and strict fidelity dimed the ladder of fame and sne- jess, until his people havp called him to serve them in a public way. The Democracy of Campbell and Lynchburg has honored itself by placing the standard iu Mr. Glass bauds. Senator Floods speech was de voted almost exclusively to the veil tilation of Mr. C. H. Chiltons re cord. who is the independent candi date for floater delegate from Appo mattox and tamp bell. He read anonymous let ers, which he charged Chilton with having written during the spring campaign four years ago these letters Mr. Flood declared were written for the purpose of inspiring a mob to assassinate him. He said he did not cifi-e to say anything against Mr. Chilton, hut the slanderous charges made iu a recent circular against the people of Appomattox should not go unanswered. He re viewed Mr. Chiltons record while superintendent of schools of this county and chaiged him with doc toring and changing the records of the board meetings. Mr. Floods speech was an eye-opener, and sounded the death-knell of the in dependents. Captain Featherstone, the nomi nee for the House from Canfpbell reviewed his record in the Ilous- last session, which appeared t hi satisfactory to himself and hear ere. and contrasted the meetings widen nominated the two candidates Hi charged that Mr. Evans, his oppo nent, was the candidate of tluvi people, that number having voted for him in the mass meeting at Hust- bn re. There was pleuty to eat and even one seemed to enjoy the occasion, and that a grand success and much good was done in the name ol Democracy is the vote of all, whose good fortuue it was to be present."}, "highlight": {"text": {"matched_tokens": ["superintendent", "of", "schools", "of"], "snippet": "Mr. Chiltons record while <mark>superintendent</mark> <mark>of</mark> <mark>schools</mark> <mark>of</mark> this county and"}}, "highlights": [{"field": "text", "matched_tokens": ["superintendent", "of", "schools", "of"], "snippet": "Mr. Chiltons record while <mark>superintendent</mark> <mark>of</mark> <mark>schools</mark> <mark>of</mark> this county and"}], "text_match": 3465581464706351225, "text_match_info": {"best_field_score": "3328589299712", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "3465581464706351225", "tokens_matched": 6, "typo_prefix_score": 0}}
