{"document": {"bbox": [1459.23, 1619.43, 1526.78, 1631.43], "bbox_id": "3ac9206bb2", "file": "TimesVirginian_1978_0073.pdf", "page": 1, "text": "Thomasville"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark>"}], "text_match": 578730123365711993, "text_match_info": {"best_field_score": "1108091339008", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365711993", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [926.41, 468.78, 1121.14, 1076.31], "bbox_id": "d77c6845a7", "file": "TimesVirginian_1984a_0107.pdf", "page": 1, "text": "Y M C A . . Mr. Finch assumed the presidency of Thomasville Furniture in 1961, a position his father, T. Austin Finch, and grandfather, Thomas Jefferson Finch, both held before him. It was under Tom A.. as he was affectionately called throughout the industry, that the 80-year-old furniture company became à powerful force in the national marketplace. Mr. Finch served as a director of Inlegon Corporation and Wachovia Bank ana Trust Company, both in Winston Salem, NC, Armstrong World Industries hi Lancaster, PA, and the Norfolk Southern Railway in Washing ton, DC. He was a past president of the Southern Furniture of the South. In 1963. he was selected as Furniture Man pf the Year by the American Furniture Mart.  Mr. Finch was a trustee of the Medeira School. Greenway, VA Duke University, Durham, NC and Wood- berry Forest School, W oodberry Forest, VA. He also served as a trustee of the Davidson County Public Library System as well as Thomasvilles Community General Hospital. He was act ive in the development of the Thomasville Family YMCA, serving on the board of directors, and in 1975 received the YMCA Industrialist of the Year Award. Mr. Finch sat as a member of the Davidson County Bicentennial Commit tee and was à member mid past president of the Thomasville Rotary Club. He was graduated with honors from Woodberry Forest in 1940 and from Princeton University in 1943, where he was a Phi Beta Kappa. He then served as lieutenant in the United States Navy in 1946. He was a member of the Everglade Çlub in Palm Beach, FL, and the Met ropolitan Club in New York City. rived by his w ilv. i Clark Slane of- , PMVIfe five children  TfirtifiâsAusnlIfT IH .ofNew York City John Lambeth of High Point Sumner Slane of Chapel Hill David Slane and  Meredith Kempton, both of Thomàs- ville, and three grandchildren. Services were held at 400 p.m. on"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "assumed the presidency of <mark>Thomasville</mark> Furniture in 1961, a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "assumed the presidency of <mark>Thomasville</mark> Furniture in 1961, a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2005.22, 1145.7, 2296.11, 1480.86], "bbox_id": "7997d81edf", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "with the wage adjustment we have scheduled to go into effect on July 31, will go a long way toward offsetting the effects of the sharply-rising inflation we are now experiencing in this country, Finch said. Also,the additional time off with pay is som ething th a ts of great interest to employees and their families today, and wè believe its important to reflect that interest in our benefit pro grams. The new benefits will apply to all Thomasville Furniture Industries employees except those employees at the companys W est Jefferson Plant who are represented by a recently-certified union. Wa ges and benefits for bargaining unit members at West Jeffer son are mandatory subjects for negotiations with the union as required by law, he said. Competency Tests Required Before H. S. Graduation"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "will apply to all <mark>Thomasville</mark> Furniture Industries employees except"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "will apply to all <mark>Thomasville</mark> Furniture Industries employees except"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [804.94, 1130.91, 966.34, 1557.53], "bbox_id": "0d9fc570fc", "file": "AppomattoxNewspapers_1898-1902a_0403.pdf", "page": 1, "text": "Winter Tourist Kates Via Southern Railway. Beginning November 1st, 1900 and continuing until April 30Cb, 1901, the Southern Railway will sell excursion tickets to the various wiu- ter resort points located in the south aud southwest at greatly re duced rates. Tickets will be on sale daily and the maj .rity of them will bear return limit May 31st, 1901. Among such points included are Columbia, S. C., Aiken, S. C., Charleston, S. C., Asheville, N. C., Hot Springs, N. C., iryon, N. D., Augusta, Ga., Savaunah, Ga., Bruns wick, Ga., Thomasville, Ga., Jack- souville, Fla., St. Augustine, Fla., Miami, Fla., Nassau, N. P., Havana, Cuba, and many other points in Florida and the south also ,New Orleaus, La., and to various points iu Texas, Mexico, New Mexico and California. The Southerns facili- lies for handling such travel are un surpassed, operating as it does the, most superb aud luxurious trains, composed of Pullmans latest de signed sleeping cars and Southern liy. Dining-cars and Thoroughfare coaches, with fast and convenient schedules. Iu addition to the stan dard service operated daily on ths various trains of the Southern, tour ist sleepers are operated three times a week between Washington, Dan ville, New Orleans, San Francisco and Pacific coast points without change of cars-. For detail infor mation apply to any agent Southern Railway. C. W. W e s t b u b y , T. P. A. Richmond, Va."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Ga., Bruns wick, Ga., <mark>Thomasville</mark>, Ga., Jack- souville, Fla.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Ga., Bruns wick, Ga., <mark>Thomasville</mark>, Ga., Jack- souville, Fla.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1794.24, 765.04, 1941.35, 851.14], "bbox_id": "c6f64fb50a", "file": "TimesVirginian_1978_0210.pdf", "page": 1, "text": "William Lowe, vice president  and manager at the Appomat tox based Armstrong Furniture Division of Thomasville Furni ture Industries, has announced that J. E. Jamerson  Sons of Appomattox have been award ed a contract for the"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Armstrong Furniture Division of <mark>Thomasville</mark> Furni ture Industries, has"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Armstrong Furniture Division of <mark>Thomasville</mark> Furni ture Industries, has"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1214.17, 1451.19, 1333.16, 1480.54], "bbox_id": "2f70f1316f", "file": "AppomattoxNewspapers_1974-1975a_0374.pdf", "page": 1, "text": "WILLIAM L. LOWE Vice President and General Manager Transmark Operations. Division of Thomasville Furniture Industries"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "WILLIAM L. LOWE Vice President and General Manager Transmark Operations. Division of <mark>Thomasville</mark> Furniture Industries"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "WILLIAM L. LOWE Vice President and General Manager Transmark Operations. Division of <mark>Thomasville</mark> Furniture Industries"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1765.19, 1433.5, 1889.08, 1728.14], "bbox_id": "738cc4adee", "file": "TimesVirginian_1980a_0090.pdf", "page": 1, "text": "When he had to work, he worked. When he had to build, he built. When things went wrong, he tried again. His Maker never gave up on him. See I Corinthians 1545. He left a heritage. Ah yes, when you are No. 1, more is expected of you. That is true, too, of our nation. .    Some years ago while on a Southern trip,. I kept a diary. On thé way back to Appomattox We passed through a town in North Carolina and I noted that it hai a fine furniture factory. I wrote in my diary... ThomasvUle is a fine town and has a large furniture factory. Wish we had Thomasville in Ap pomattox. Worked out pretty good, didnt it! Our Thpmasville plant is one of our big assets and helps make us  No. 1."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "factory. Wish we had <mark>Thomasville</mark> in Ap pomattox. Worked"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "factory. Wish we had <mark>Thomasville</mark> in Ap pomattox. Worked"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1718.85, 756.7, 1864.41, 1046.33], "bbox_id": "401132ec75", "file": "TimesVirginian_1981a_0102.pdf", "page": 1, "text": "went to Roanoke Sunday afternoon. V isitors of Mrs. Lucille Barrett on Sunday were Mr. and  Mrs. Michael Neighbors and Katrina. Mr. Eldridge Jordan and grandson Jason of Winston Salem, N. C. and Mrs. Mattie Pillow of Phienix visited Mr. Walter Jordan Tuesday. Mrs. T C. Torrence is spending Some time in Saint Petersburg! Florida visiting her motnjr who is in the hospital there. We wish for her a speedy recovery. . Mrs. Evelyn Torrence spent the week end in Thomasville, N. C. on a business trip. Mr. and Mrs. Harold Walker and daughter, Lorie of Rust burg visited Mr and Mrs. Pat Davis and Sharon Sunday. Miss Sharon Davis spent Thursday, Friday, and Satur day in Richmond attending the F.H.A. Leadership Conference."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "the week end in <mark>Thomasville</mark>, N. C. on a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "the week end in <mark>Thomasville</mark>, N. C. on a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [705.08, 235.15, 836.97, 509.51], "bbox_id": "4199634f80", "file": "TimesVirginian_1980a_0326.pdf", "page": 1, "text": "weekend with his parents, Mr. and Mrs. Ed Davis. The Pamplin Chapter of AARP will meet Thursday October 9 at the Pamplin United Methodist Church in the friendship hall at 730 p.m. Susan Bailey of the personnel departm ent of Thomasville Furniture Co mpany w ill show color pictures and also give a talk on the operation of the company. Refreshments will be served and the public is .invited. Mrs. C. V. Wingfield returned home Saturday after spending some time in Norfolk with her sister and brother-in-law, Mr. and Mrs. Harold Southern. They attended the funeral Satur day of their cousin, Mrs. Mary Williams Bonwèll Brown in Keysville on Saturday."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "personnel departm ent of <mark>Thomasville</mark> Furniture Co mpany w"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "personnel departm ent of <mark>Thomasville</mark> Furniture Co mpany w"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [294.67, 1072.85, 816.29, 1350.2], "bbox_id": "c21bc727e8", "file": "AppomattoxNewspapers_1974-1975a_0461.pdf", "page": 1, "text": "We reserve the right to limit quantities TO THE EDITOR Dear Mr. Vaughn, I would like to take this opportunity to express through your paper, my most sincere appreciation to all of those that helped in making the Blood mobile a success. I would like to express deep appreciation to the Junior Womens Club here in Appoma ttox, Virginia, along with Mrs. Lucy Harvey, the local radio station, W.T.T.X. and its manager Mr. Joe Cusaac, the Appomatox Garment Factory, the local grocery stores, Thomasville Furniture Plant, and all of thosewho made public announcements in helping us reach our goal, especially in the matter of securing that blood which was short at the Blood Bank. I would also like to express my appreciation to the employ-"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "the local grocery stores, <mark>Thomasville</mark> Furniture Plant, and all"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "the local grocery stores, <mark>Thomasville</mark> Furniture Plant, and all"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2460.68, 953.66, 2604.58, 1198.85], "bbox_id": "3202acbcae", "file": "AppomattoxNewspapers_1971-1973a_0384.pdf", "page": 1, "text": "We aredesigningtheplantto facilitate future expansion, he commented,  if this becomes desirable Uh the growth in our busines1 Thomasville Furniture In dustries is an affiliate of Arm strong Cork Company, Lancast er, Pennsylvania. Armstrong and its associated companies are leading producers of inter ior furnishings, including re silient flooring, carpeting, and ceiling systems, as well as fur niture. The parent company also makes a variety of specialty products for the textile, auto motive, shoe and construction industries. The new Appomattox plant will be the 20th Thomasville Furniture Industries manufact- contd. to Page 2"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "growth in our busines1 <mark>Thomasville</mark> Furniture In dustries is"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "growth in our busines1 <mark>Thomasville</mark> Furniture In dustries is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.89, 776.92, 1618.19, 1043.45], "bbox_id": "ecad2509fa", "file": "AppomattoxNewspapers_1974-1975a_0134.pdf", "page": 1, "text": "was not bad in 1974. mattox County continued progressive. Thomasville stries opened its new pture manufacturing facili- re. A new high school was ated in October, and the jl is one of the most ptete educational com ps in Virginia. fee County Office Building  dedicated in December, jnew plant is housing the Inile and Domestic Rela- s Court, the Department of al Services, the Coopera- Extension Service and the Inty Health Department, t was a meiocre year for the! Jjom attox County sports ns, except for the girls ns which won the SemlBfc ,rict basketball and softball is and was runner-up for the eyball championship. The s also won the Western"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "mattox County continued progressive. <mark>Thomasville</mark> stries opened its new"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "mattox County continued progressive. <mark>Thomasville</mark> stries opened its new"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1688.86, 430.22, 1830.48, 559.72], "bbox_id": "803eb24c9b", "file": "TimesVirginian_1976_0227.pdf", "page": 1, "text": "W L OBrien Equip Co. 13 0 Best Fum. 10 3 NAPA s 7 5 Evergreen Rur. 5 6 Hilltoppers 4 5 Extension Office 2 6 Amoco Car Wash 2 9 Thomasville 1 10 These are standings through 6-10-76 on games that have been reported."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Car Wash 2 9 <mark>Thomasville</mark> 1 10 These are"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Car Wash 2 9 <mark>Thomasville</mark> 1 10 These are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2015.52, 657.3, 2591.5, 1145.13], "bbox_id": "99c2fffe54", "file": "AppomattoxNewspapers_1974-1975a_0115.pdf", "page": 1, "text": "W. L. LOWE, Vice-President and Plant Manager at the Appomattox plant, Thomasville Furniture Industries, Inc., spoke to management Thursday morning of last week just prior to the first carload shipment of furniture made at the new plant. Production at the plant, the largest and most modern furniture manufacturing facility in the world, is at or above expectations at this time and according to Lowe the, is only one way to go and that is up!  . s r ,,. v w ? .vi Approximately 200 persons are now employed at TFIs Appomattox plant. Additional workers will be hired to meet production needs in the future. y a cooperative venture which came into existence when the Consortium of Colleges, the Greater Lynchburg Chamber of Commerce, the Central Vir ginia Planning District Com mission and City Gate discov ered that they were all involved in goals setting for Central Virginia. A steering committee was organized with members from each of the groups serving on the committee. Modeled after the Hartford Process, CVT was hired representatives of Am erican City Plan as advisors to the Process. The eventual oal of allowing the citizens of each eontmunity to choose what- they think Is belt for their community in business, economics, education jind social welfare, and th e 1 members of steering committee think the- best way to obtain that goal is through workshops with residents of a jurisdiction actually doing their own plan ning and goals setting. Unlike the weather, wfaich you cant do anything about, you can make your community a better place to live. The first step is recognizing what will help, and then implementing plans and projects to change it for the better. That is the purpose of todays workshops."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "at the Appomattox plant, <mark>Thomasville</mark> Furniture Industries, Inc., spoke"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "at the Appomattox plant, <mark>Thomasville</mark> Furniture Industries, Inc., spoke"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [407.05, 1316.92, 567.95, 1745.64], "bbox_id": "12abcaefcf", "file": "AppomattoxNewspapers_1898-1902a_0387.pdf", "page": 1, "text": "W inter Tourist Rates Via Southern Railway. Beginning November 1st, 1900 and continuing until April 30th, 1901, the Southern Railway will sell excursion tickets to the various win ter resort poiuts located in the south and soutiiwest at greatly re duced rates. Tickets will be on sale daily and the majority of them will bear return limit May 3lst, 1901. Among such points iucluded are Columbia, S. C., Aiken, S. C., Charleston, S. C., Asheville, N. G.J Hot Springs, N. C., Xryon, N. C., Augusta, Ga., Savanuah, Ga., Bruns wick, Ga., Thomasville, Ga., Jack sonville, Fla., St. Augustine, Fla., Miami, Fla., Nassau, N. P., Havana, Guba, and many other points in Florida aud the south also New Orleaus, La., aud to various points iu Texas, Mexico, New Mexico and California. The Southerns facili ties for handling such travel are un surpassed, operating as it does the most superb and luxurious trains, composed of Pullmans latest de signed sleeping cars and Southern Ry. Dining-cars and Thoroughfare coaches, with fast aud convenient schedules. In addition to the stan dard service operated daily on tbs various trains of the Southern, tour ist sleepers are operated three times a week between Washington, Dan ville, New Orleans, San Francisco and Pacific coast points without change of cars. For detail infor mation apply to any agent Southern Railway. C. W. W e s t b d r y , T. P. A. Richmond, Va."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Ga., Bruns wick, Ga., <mark>Thomasville</mark>, Ga., Jack sonville, Fla.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Ga., Bruns wick, Ga., <mark>Thomasville</mark>, Ga., Jack sonville, Fla.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [983.72, 459.27, 1155.81, 1028.96], "bbox_id": "40aa4cad8d", "file": "AppomattoxNewspapers_1939-1943a_0331.pdf", "page": 1, "text": "Visitors in the home of J. R. Marshall Sunday were Mr. and Mrs. J. D. Ford, E. M. Sears and Mrs. J. T. Hix and daughters. Witt Bristow, of Chicago spent last week in the home of E. P. Sears. Misses Lavalette Sears and Bar bara Hix jiaittended !he 4-H Club meeting at Pamplin Thursday morn ing. Mrs. Lillian Gilliam and son, Her bert, of Roanoke, spent several days last week with Mrs. Mollie Glenn. They spent Friday in the home of E. P. Sears. Rev. and Mrs. W. M. Black, Miss dary Rives Black and Miss Eurlean Josser and Miss Lillian Fauver, of ynehburg were supper guests in the iome of Mrs. N. S. Topping Wed- lesday. Revival services closed here Fri- lay night. Services were well at- ,ended and there were Beven addi- .ons to the church. Crote Carson spent several days ast week in Washington, D. C. Mrs. H. C. Wheeler is visiting in Crewe and Rirhmond this week. Mr. and Mrs. James Rosser visit ed Mrs. R. R. Young last week. J. S. Hix, of Thomasville, N. C. spent last week at his home here. J. E. Dinwiddie, of Sweet Briar, was in town last week on business. Mr. and Mrs. Wilson Hix and family called in the home of T. B. Hix, of Prospect, Sunday after noon. Mrs. Bessie Grinstead and Mrs. G. G. Reynolds, are spending this week at Massanetta Springs. Miss Carrie Hix is visiting rela tives in North Carolina. Mr. and Mrs. Nelson Hix, Miss Kitty Carson, C. B. Carson, and Eural Carson spent Sunday with their parents, Mr. and Mrs. E. H. Carson. Miss Jessie Carson Is spending t he week with her sisters in Lynchburg. Mr. and Mr. J. K. Marshall and son, Mrs. Pearl Marshall and Mary Elizabeth Brooks went to Holliday Lake Sunday afternoon. Mrs. J. T. Hix, Barbara and Fan Hix visited Mrs. E. W. ftUliim Sunday P. M. E. M. Sears was a visitor in the same home."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "J. S. Hix, of <mark>Thomasville</mark>, N. C. spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "J. S. Hix, of <mark>Thomasville</mark>, N. C. spent last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [872.14, 1452.3, 1041.78, 1744.8], "bbox_id": "95c8caa045", "file": "AppomattoxNewspapers_1955-1957a_0200.pdf", "page": 1, "text": "Visitors expected in the home of Mr. W. D. Hix, Jr. this week are Mrs. W. M. Erwin, Sr., of Mount Ulla, N. C. Mr. J. I. Hix, of Thomasville, N. C. Mrs. Joe Ar rington, of Lubbock, Texas Miss Frances Earle, of Waco, Texas Mrs. Joe Early, of Corpus Christi, Texas, and Miss Mazie Gills, of Richmond. Dinner guests of Mr. and Mrs. Ernest Harwood on Tuesday even ing were Mrs. Alfred Harwood, Sr., of Appomattox Mrs. W. B. Ford, of Pamplin, and Miss Carrie Hix. Mr. Sidney Walter Brockweli, Sr., of Warwick, passed away last Sat urday morning. Surviving are his wife, Mrs. Ruth Swan Brockweli two sons, a daughter, and three grandchildren. The funeral services were1 held at Temple Baptist Church with burial in Claremont Cemetery on M6nday. Those who attended the fimeral from here were Mr. and Mrs. Henry Covington, Mr. and Mrs. Rob Martin, Anne and Louella Mrs. Jennie Young, Mrs. Edwin Fore and Rosalie."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "J. I. Hix, of <mark>Thomasville</mark>, N. C. Mrs. Joe"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "J. I. Hix, of <mark>Thomasville</mark>, N. C. Mrs. Joe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1796.4, 279.72, 1956.44, 1504.76], "bbox_id": "67e2487bbf", "file": "AppomattoxNewspapers_1902-1905a_0086.pdf", "page": 1, "text": "Virginia PensionsJames W. Love. Sydnorsville. 6 Addison D. Barrett, Norfolk. 8 John M. K. Anderson, National Soldiers Home, Elizabeth City count-, 8 Fred L. Matteson, Na tional Soldiers Home, Elizabeth .City county, ig Henry L. Cabell, Cedar- ville, 12 Edward W. Goodwyn Mex ican War, .Lunenburg, 12 Christian G. Merritt, Greenville, 12 John Mc- Cartv, Latana, 6 William T.. Clark, Meherrim, 12 Sidney Stout, Luckets.  6  Mrs. Elizabeth C. McKenna died at Charlottesville Wednesday night. A part of the house in which her body ay fell on account of excavations. The workmen narrowly escaped. The observance of .Confederate Me morial Day in Lexington has been set or Saturday. May 23. The chief mar shal will be Col. W. T. Poague, of the Virginia Military Institute. Mrs. Samuel T. Early, wife of S. T. Early, of Alcorn, Miss., died at the ionie of her late father, Mr. Samuel Adair, near New Monmouth, Rock bridge county, aged 40 years. She was martied on Christmas Day. Miss Margater Hockenberry, of Mar- iinsburg, died at the age of 91 years. The old lady arose during the night and began to dress and expired about 30 minutes later. She had retired in her usual health. The engagement of Miss Bena Faun- tleroy Harrison, daughter of Mrs. Pow ell Harrison, of Leesburg, and Mr. Walter H. Taylor, City Engineer at Norfolk, Va., has been announced. The marriage will take place on June 24 at the home of the brides mother. Two large factories owned and oper ated by Suhling  Co., Lynchburg, were destroyed by fife. When the alarm was given flames were issuing from the tops of both structures, and before the firemen got to work all ef forts to save them were hopeless. Many nearby factories were in danger. The Suhling Buildings were connected by an archway of wood, and it is supposed that the fire spread through this. Suh ling  Co. ship annually millions of pounds of tobacco to Germany. The value of the two buildings is about 30,- 300 and of fixtures 10,000. The stock on hand is variously estimated at from 30,000 to 100,000. The loss is about 75,000. While the Messrs. Suhling vould make no statement, it is thought that the loss will be covered by insur- ince. The Norfolk Common Council re fused to approve the action of the Se lect Councils in relieving social clubs tf taxation and adopted Section 152. of the tax ordinance requiring such organ izations to pay at license tax of 250 an nually. The Virginia Club and Board of Trade come within the provisions of ,his section. The Orkney Springs Hotel property, situate at Orkney Springs, Shenan doahcounty, a popular resort, formerly owned b y Mrs. Henrietta Stuart, ol Washington, has been exchanged to Mr. Romaine Dally, of Washington, D. C., for the Imperial Hotel of Pe tersburg. G. T. Alphin has sold his farm near the mouth of Kerrs creek, Rock bridge county, to Frank Brown, of. Lexington, for 2500. It contains about 76 acres. Mr. Alphin has purchased a farm for 3500. News has been received in Lexington of the death by yellow fever of Rev. Charles R. Morton, a missionary in the Southern Presbyterian Church in Brazil. Mr. M. C. Bayless, 52 years old. ? farmer of near Winchester, died Thurs day night. A widow and four children survive him. The capital stock to the Peoples Na tional Bank of Roanoke has been over subscribed by 10,000. More than two- thirds is taken by local merchants ant1 business men. Dr. George H. P. Cole a well-known local capitalist, was slat ed for president. Frost is reported from the Bac Creek pippen belt, but the crop was but slightly injured. The apple prospects in Roanoke, Bedford, Franklin anc Campbell county have never been bet ter. The lumber steamer Francis H. Leg gett sailed for San Francisco. The ves sel has just been completed at New port News, and is for the redwood lum ber trade in California. She takes ou two American locomotives for Japanese consignees, and has also on board a lo of steel rails. The Finance Committee of the Pe tersburg City Council opened the bidt for 190,030 4 per cent. 40-year refund jjig bonds and awarded them to lo cal bidders at an average price of 103.59 The Petersburg Savings and Insurance Company bid par for the entire amount These bonds are issued to refund a likt amount of 8 per cent, bonds due on th first of May. William Englcnian, a farmer o Greenville. Augusta county, was throwr from his horse a few lays ago and i now in a critical condition. Mr. En  glenian wal sitting on his horse whili pouring some feed into a hogpen, wher the horse made a sudden leap. Mr Engleman was thrown headforemost tc the ground and struck, a sharp stake There is little hope of his recovery. The Washington and Southwesterr vestibule limited No. 38 of the Southerr Railroad ran into the rear end of 1 freight train near Lynchburg. The en gine was demolished, two mail and twe freight cars were completely burned and the engineer of the passenger Charley R. Kinney, of Thomasville N. C., was killed. No 38 was goin down a heavy grade at the time. Or seeing the freight ahead of him. Kin ney reversed his engine and jumped As he struck the-ground the front jmi car turned over on him, killing hitr instantly."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Charley R. Kinney, of <mark>Thomasville</mark> N. C., was killed."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Charley R. Kinney, of <mark>Thomasville</mark> N. C., was killed."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.65, 1544.26, 2334.94, 1723.51], "bbox_id": "070447eda1", "file": "AppomattoxNewspapers_1960-1962b_0372.pdf", "page": 1, "text": "ving. There will be a cook-out dem onstration. Mr. J. S. Hix, of Thomasville, N. C., was overnight guest of Miss Maggie Hix on Tuesday and Wed nesday. -i ,  4-H Club members who went to Holliday Lake for a week on Mon day were Anne Stewart Farrar, Sru an Williams, Malcolm Inge, Kathy Davis, David Reeve, Harry Davis, Ruth Messie, Gary Jamemos and Pat Covington. Visiting for a few days in the home of Miss Maggie Hix are her nephews in law and niece, Mr. and Mrs. Arhur Eddie, of Boone, Iowa."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "J. S. Hix, of <mark>Thomasville</mark>, N. C., was overnight"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "J. S. Hix, of <mark>Thomasville</mark>, N. C., was overnight"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1889.0, 723.39, 2028.05, 806.09], "bbox_id": "e838384e21", "file": "AppomattoxNewspapers_1974-1975a_0226.pdf", "page": 1, "text": "ty High School and attended Virginia Commonwealth Uni versity in Richmond. A native of Appomattox County, she is married to Michael Shatter of Springfield, an employee at Thomasville Furniture Indus tries, Inc. She is the daughter"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Springfield, an employee at <mark>Thomasville</mark> Furniture Indus tries, Inc."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Springfield, an employee at <mark>Thomasville</mark> Furniture Indus tries, Inc."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2281.56, 1526.83, 2426.21, 1785.72], "bbox_id": "46d344f47a", "file": "TimesVirginian_1976_0096.pdf", "page": 1, "text": "trial revenue bonds that were issued at the time the plant was built for Virginia Metal Products in 1973. In announcing plans for the new manufacturing facility, Tom A. Finch, president of Thomasville Furniture, said, We look forward to being a part of the Brookneal commu nity. , Weve had a fine experience with our new plant at Appomattox, about 35 miles north of here, and we know that one reason for this is the character of the people in this section of Virginia. They re capable, industrious people, and they care about the communities they live in. We - try to be good corporate citizens wherever pur plants are located, and this is the kind contd on page 6"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "A. Finch, president of <mark>Thomasville</mark> Furniture, said, We look"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "A. Finch, president of <mark>Thomasville</mark> Furniture, said, We look"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2191.87, 805.55, 2333.43, 1094.64], "bbox_id": "43b839eb3c", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "tive, and Mr. W. D. Allen, attorney, for Lawyers Title Insurance Corporation, were also present. Others attending the meeting were Mr. Fred Lawson, President, and Mr. Sam Ferguson, III, Secretary, representing Courtland Realty Company Mr. and Mrs. Ronald Paulette, owners of the Dairy Queen Mr. Robert Gray, attorney for the Industrial Authority and W. Sam Kerr, attorney representing Court- land R ealty Company and Armstrong Cork Company. During the brief business session, settlement of real estate was made involving three parcels of land under option by Thomasville Furni ture Industries. The three parcels involved land owned by Mr. and Mrs. Paulette, owners of the Dairy Queen land owned by Courtland"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "land under option by <mark>Thomasville</mark> Furni ture Industries. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "land under option by <mark>Thomasville</mark> Furni ture Industries. The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1312.1, 288.12, 2113.91, 533.59], "bbox_id": "93b8781eba", "file": "AppomattoxNewspapers_1943-1947a_0281.pdf", "page": 1, "text": "THURSDAY KINNEY  TILLMAN The marriage of Mi js Gertrude Tillman, daughter of Mrs. P. L. Tillman, and the late Mr. Tillman, of Thomasville, Ala., to Cpl. Ken- n n Sv. Kinney, of Turner Field, was solemnized at the First Meth odist Church Thursday, August 9, at 730 oclock. The double ring ceremony was p.rformed by the paste1, the Rev. Horace T. Freeman, in the pres ence of relatives and close friends. The bride,an attractive brunette was given in marriage by Mr. Al ton Hall, a close friend. She was attired in a white two-piece dress, with white accessories, and wore a shoulder corsage of yellow rose buds. Mrs. Opal Adams, sister of the bride was her only attendant. She wore a navy blue dress with white accessories, and her corsage was of"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "late Mr. Tillman, of <mark>Thomasville</mark>, Ala., to Cpl. Ken-"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "late Mr. Tillman, of <mark>Thomasville</mark>, Ala., to Cpl. Ken-"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [342.24, 963.05, 487.73, 1057.59], "bbox_id": "bfc28b3a61", "file": "TimesVirginian_1981a_0135.pdf", "page": 1, "text": "three peittml? Who art not affiliated with the company. Tom A. Finch, chairman of Thomasville Furniture, pre sented the scholarship awards at the banquet Tuesday night which was attended by students, their parents and high school administrators."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "A. Finch, chairman of <mark>Thomasville</mark> Furniture, pre sented the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "A. Finch, chairman of <mark>Thomasville</mark> Furniture, pre sented the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2183.27, 263.18, 2327.49, 1026.74], "bbox_id": "d4487706f0", "file": "AppomattoxNewspapers_1971-1973a_0178.pdf", "page": 1, "text": "Those who visited in the home of Mrs. C. W. Slayton over the holiday week end were Mr. and Mrs. C. W. Slayton, Jr. and daughter, Sonya, of Hunt ington, West Va. Mrs. George Dalton and son, Kevin, of Oxen HiU, Md., and Mr. and Mrs. C. J. Slayton of Florida and Mr. and Mrs. Bernard Slayton and family of Pamplin.    Tammy and Eddie L e w is, children of Mr. and Mrs. Ray Lewis spent several days last week in Victoria with their grandparents, Mr. and Mrs. Edwin Vaughan.    Mr. and Mrs. Ray Lewis and family spent the week end in Victoria, with her parents, Mr. and Mrs. Edwin Vaughan. Also visiting in Victoria were Mr. and Mrs. Bill Vaughan from Thomasville, North Carolina.    Mr. and Mrs. George R. Kruer of Arlington were guests of her mother, Mrs. Irvin C. Moses, for the Christmas holidays.    Mr. and Mrs. L. C. Garrett and family, Gerlynn, Bettie and Teddy were dinner guests in the Irvin C. Moses home for Christ mas Eve dinner. Also, Mr. and Mrs. Frank Leveque of Rich mond.  .   The George R. Kruers and Mrs. Irvin C. Moses w e r e guests for breakfast of Mr. and Mrs. L.C. Garrett and fam ily on Christmas morning. They also had aU their family for dinner Christmas Day.    Mrs. Irvin C, Moses had a number of visitors during the holidays and New Years Day, including Mr. and Mrs. Billy Coleman and daughters, Dianne and Sharon. Also, Mrs. Ray Hudson and three sons of Tex as Mrs. Robert Totty, Mrs. Len Love, Mrs. Linda Guill, Mrs. R. N. Spiggle, Mrs. Virginia SPiggle, Mr. and Mrs. Floyd Fleshman of Appomattox and Mr. and Mrs. Jimmy Garrett of Lynchburg. Also, Mrs. Mar garet S. OBrien,, Mrs. Emma Lemon, Mrs. Ed Eubank and her mother, Mrs. Preston Cole man and Eva and Mrs. Pulliam from Madison Heights. Also, Mrs. Spurgeon Coleman and daughter, Mrs. Aubrey OBrien and son, Mike of Gladstone, Va. Mrs. William OBrien and Mrs. Phoebe McGee of Washington, D. C."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Mrs. Bill Vaughan from <mark>Thomasville</mark>, North Carolina.    Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Mrs. Bill Vaughan from <mark>Thomasville</mark>, North Carolina.    Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2132.27, 1483.86, 2400.52, 1788.83], "bbox_id": "5f16392772", "file": "TimesVirginian_1976_0096.pdf", "page": 1, "text": "Thomasville Plans Expansion In Brookneal Tentative plans for a new manufacturing plant at Brook neal, Campbell County, Va., were announced today by Thomasville Furniture Indus tries. The new plant, which would be used for the production and warehousing of household furniture, would occupy an existing 191,000-square-foot bulding formerly used by the Virginia Metal Products Com pany, a subsidiary of Gray Manufacturing Company. Thomasville Furniture has reached agreement with the Industrial Development Auth ority of Campbell County for a long-term lease including pur chase options on the building and its 110-acre industrial site. The agreement is subject to approval by holders of indus"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Plans Expansion In Brookneal"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Plans Expansion In Brookneal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [394.09, 198.86, 538.33, 792.98], "bbox_id": "c2b36e23f8", "file": "TimesVirginian_1976_0099.pdf", "page": 1, "text": "THOMASVILLE PLANS EXPANSION IN BROOKNEAL contd from page 1 of community spirit we like to share.   . Finch said that no timetable has been established ss to when the plant would beginproduc tion, nor has an employment figure been determined. It is expected, he said, that most of the employee force for the new facility would be hired from the Brookneal area and other parts of Campbell County, although some supervisory personnel would probably be transferred from other Thomaaville plants. The plant site is situated just west of Brookneal. It fronts on U. S. Route 501 and is served by the Norfolk and. Western Railway. Thomasville Furniture Indus tries is a maker of high quality bedroom, dining room, and living room furniture sold under the Thomasville, Found ers, and Huntley names. It is based a t Thomasviild, N.C. and is a subsidiary of A rm strong jCork Company, Lancaster, Pa. Armstrong and its associated companies are also leading producers of interior furnishings, including resilient flooring, carpeting, and ceiling systems. H ie parent company also makes a variety of specialty products for the building, textile, automotive, and other industries. The new plant at Brookneal would be the 21st Thomasville Furniture Industries manufact uring facility. All of the other 20 are located in the Southeast-one in Virginia at Appom attox, T8 in. North Carolina, and one in Mississippi .Another Armstrong affiliate, E  B Carpet Mills, Inc., operates a carpet yarn spinning plant at Keysville, Va."}, "highlight": {"text": {"matched_tokens": ["THOMASVILLE"], "snippet": "<mark>THOMASVILLE</mark> PLANS EXPANSION IN BROOKNEAL"}}, "highlights": [{"field": "text", "matched_tokens": ["THOMASVILLE"], "snippet": "<mark>THOMASVILLE</mark> PLANS EXPANSION IN BROOKNEAL"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [286.55, 471.27, 438.05, 1157.73], "bbox_id": "fa24fe46cb", "file": "TimesVirginian_1978_0571.pdf", "page": 1, "text": "THOMASVILLE, N.C. Thomasville Furniture In dustries today announced wage increases and benefits im provements for its employees at the Phenix Chair Plant in West Jefferson, N.C. Employees wifi receive a general wage increase, im proved vacation pay, and im provements in the medical in surance plan and accident and sickness benefits, effective today. Beginning in January, em ployees wifi receive additional vacation time off, as well as the addition of Memorial Day as a paid holiday. Tom A. Finch, president of Thomasville Funiiture In dustries, said, The adjustmen ts are being made by the com pany because contract negotiations with the United Furniture Workers Union Local 267, which represents the West Jefferson employees, have readied an impasse. After 24 bargaining sessions held over the past four months, negotiations between the Phenix Chair Company and the union have clearly reached an impasse, Finch said. The companys proposals for a con tract were rejected last week by the union committee and the membership. Accordingly, the company is putting the economic proposals into effect in their entirety, ef fective immediately, Finch said. Since an impasse has oc curred, in the absence of a con tract with the union, the com pany may put into effect these wage and benefit adjustments.  The wage increase ranges from 20 cents to. 37.. cents per hour. The average increase will beaboigM cents per bour. , Major medical insurance maximum coverage is being doubled, hospital room and board coverage is being in creased and weekly accident and sickness benefits are being increased. Christmas Tree Is a Tradition In Many Lands"}, "highlight": {"text": {"matched_tokens": ["THOMASVILLE", "Thomasville"], "snippet": "<mark>THOMASVILLE</mark>, N.C. <mark>Thomasville</mark> Furniture In"}}, "highlights": [{"field": "text", "matched_tokens": ["THOMASVILLE", "Thomasville"], "snippet": "<mark>THOMASVILLE</mark>, N.C. <mark>Thomasville</mark> Furniture In"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2019.06, 861.61, 2160.27, 946.51], "bbox_id": "727ebed55b", "file": "TimesVirginian_1978_0425.pdf", "page": 1, "text": "Thomasville, N. C., Septem ber 22 - The National Labor Relations Board in Winston-Sa lem will dismiss an unfair labor practice charge brought against Thomasville Furniture Indus tries by the Industrial Union D ep artm ent nf the AF1.-C10."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark>, N. C., Septem ber"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark>, N. C., Septem ber"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [574.7, 799.72, 731.12, 1087.56], "bbox_id": "9ed39d3620", "file": "TimesVirginian_1978_0004.pdf", "page": 1, "text": "Thomasville Furniture was producing furniture of excellent quality and to market a good s line of furniture, popular in price, would in some instance be misleading to the Thonfas-  ville line and also to the new, lower priced line thus the name, Armstrong Furniture, growing out of Thomasville F urniture and Arm strong Cork.  The local plant of Armstrong Cork, Armstrong Furniture, Bill Lowe, plant m anager, employ s in excess of 600 people, and is proud- to provide t furniture  to the Holiday Inn chain and furniture for the rental industry, among others. Armstrong, Appomattox is proud that you are a part, our industrial picture!  Next week, well take a look at ohei industries in Appomat tox.  N   n ------------"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture was producing furniture"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture was producing furniture"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1578.19, 1711.68, 1859.67, 1791.52], "bbox_id": "a9622349f8", "file": "TimesVirginian_1978_0570.pdf", "page": 1, "text": "Thomasville Furniture Industries, Inc. recently announced that William L. Lowe, Plant Manager and Vice President ofthe Armstrong Furniture Division in Appomattox, has been named to its Board of Directors. Mr. Lowe has been with Armstrong since 1965, and came to the nm nasville organization in July of 1970. He has been Manager of the Appomattox facility since its inception in June of 173."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries, Inc. recently"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries, Inc. recently"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1416.51, 988.24, 1697.29, 1042.19], "bbox_id": "af5e025869", "file": "TimesVirginian_1978_0079.pdf", "page": 1, "text": "Thomasville Furniture Industries, dose attention to detail ni careful hand-finishing are outstanding features of A n n  n g s new First Family case pieces. This handsome armoire has the look and feel of fine hardwood, but is prired much I owct than comparable furniture. The piece retails for about 250."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries, dose attention"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries, dose attention"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2034.59, 736.19, 2272.96, 770.84], "bbox_id": "03193985eb", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "Thomasville Furniture Industries Announces Wage Increases"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries Announces Wage Increases"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries Announces Wage Increases"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1744.1, 1020.97, 2006.79, 1040.89], "bbox_id": "edb1222234", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "Thomasville Furniture Industries"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture Industries"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1874.4, 856.04, 2447.58, 894.23], "bbox_id": "336bab4591", "file": "AppomattoxNewspapers_1971-1973a_0388.pdf", "page": 1, "text": "THOMASVILLE FURNITURE INDUSTRIES"}, "highlight": {"text": {"matched_tokens": ["THOMASVILLE"], "snippet": "<mark>THOMASVILLE</mark> FURNITURE INDUSTRIES"}}, "highlights": [{"field": "text", "matched_tokens": ["THOMASVILLE"], "snippet": "<mark>THOMASVILLE</mark> FURNITURE INDUSTRIES"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2032.69, 783.82, 2180.78, 1103.91], "bbox_id": "7006a99743", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "Thomasville Furniture In dustries has announced wage increases which will be effective July 31. According to Tom A. Finch, president of Thomasville Furni ture Industries, the company reviews wages twice each year. One wage adjustm ent has already been made in 1978. This particular wage adjust ment is being made now because of the unusual econo mic circumstances we currently face in this country, Finch said. Sharply-rising inflation during the first half of 1978 haz meant ttdPtofaM employees Me TbqSSv ur niture Industries plants, and we feel the need to respond to this situatioU. Finch pointed put that wage reviews include a performance review for each employee, and that individual wage increases are based on merit.. The July 31 adjustment rill be differ ent, he said, because it will include both a merit increase"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture In dustries has"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Furniture In dustries has"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.03, 655.81, 1847.04, 892.6], "bbox_id": "ccda85b4b7", "file": "TimesVirginian_1978_0180.pdf", "page": 1, "text": "Thomasville F urniture Industries, Iuc., award six scholarships each year to graduating seniors whose parents are employees of the company. Only six scholarships from the entire corporation are awarded and this year two Appomattox County High School seniors are recipients of scholarships through the Armstrong Furniture plant located here. The T. Austin Finch Scholarships, awarded to sons and daughters of employees at the local plant, have been presented to Connie Murray and Walker Covington, In the above photo  are, left to right, Mrs. James Murray and her daughter, Connie, and Walker Covington and his father, Mr. Beryl Covington. Connie is the daughter of Mr. and Mrs. James Murray. She plans to enter Longwood College in the fall and major in Physical Education. Walker is the son of Mr. and Mrs. Beryl Covington. He plans to enter The College of William and Mary in the fall and major in Pre-Law.   I . The scholarships are awarded based on merit qualifications and needs of the applicant and take into account good moral character of students. With only six scholarships awarded by the entire corporation of Thomasville Furniture Industries, Inc., it is extra good to know that two of these are going to ACHS seniors."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> F urniture Industries, Iuc.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> F urniture Industries, Iuc.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2241.33, 1308.87, 2554.73, 1323.87], "bbox_id": "cacc3011f3", "file": "TimesVirginian_1976_0107.pdf", "page": 1, "text": "Thomasville Bassett Kincaid many more"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Bassett Kincaid many more"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "<mark>Thomasville</mark> Bassett Kincaid many more"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2038.54, 282.48, 2184.28, 503.86], "bbox_id": "6d58432209", "file": "AppomattoxNewspapers_1974-1975a_0340.pdf", "page": 1, "text": "Thomas ville 1, 12 - Hilltop- p e rs.il NAPA, 16 - Thomasville 2,9 Amoco Car Wash, 8 - Lawson Ford, 0 Best Furniture Co., 7 - Appo. Baptist Temple, 0 forfeit Lawson Ford, 19 - NAPA, 4 Amoco Car Wash, 7 - Appo. Baptist Temple, 0 forfeit Best Furniture Co., 18 - Thomasville 1,4 Hilltoppers, 7 - Thomasville 32, 0 forfeit a mm mvw mm."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "e rs.il NAPA, 16 - <mark>Thomasville</mark> 2,9 Amoco Car Wash,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "e rs.il NAPA, 16 - <mark>Thomasville</mark> 2,9 Amoco Car Wash,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1122.7, 599.57, 1305.96, 715.62], "bbox_id": "15d0bacc46", "file": "TimesVirginian_1984a_0107.pdf", "page": 1, "text": "Thomas A. Finch, Jr. .. .i iv  j March 28 At Memorial United Methodist Church in Thomasvle, Memorials should be made .to Woodberry Forest School, Woodbetty Forest, VA, 22989, or the Thomasville Community Foundation, co William Albright. Wachovia Rank, Thomasville, NC, 27360, for the benefit of Alzheimer patients."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "VA, 22989, or the <mark>Thomasville</mark> Community Foundation, co William"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "VA, 22989, or the <mark>Thomasville</mark> Community Foundation, co William"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.32, 692.89, 1861.07, 734.34], "bbox_id": "87dd440546", "file": "AppomattoxNewspapers_1974-1975a_0296.pdf", "page": 1, "text": "This visit, sponsored by Thomasville Furniture Industries, was conducted from 9 a.m. unti on Tuesday at the Liberty Baptist Church and from a report there had been a total of 100 blood donated, making this visit very successful. . Thé Rev. Ernie Lucas is Chairman of the Blood Program in Appomattox County."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "This visit, sponsored by <mark>Thomasville</mark> Furniture Industries, was conducted"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "This visit, sponsored by <mark>Thomasville</mark> Furniture Industries, was conducted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1901.77, 304.31, 2224.72, 593.74], "bbox_id": "aef9762848", "file": "AppomattoxNewspapers_1908-1909a_0495.pdf", "page": 1, "text": "this place  Mias Carrie Hix, of Richmond, Mrs. Annie Earle Waco, Tex., Mrs. W. M. Er win, Salisbury, N. G., and Mr. Sears Hix, Thomasville N. C. Mrs. W. M. Erwin and son, Billy, of Salisbury are staying awhile here with hdroe people Mr. Winston Hix, of Roan oke, was among those attend ing Mrs. Chamberlains burial, Mrs. Charles Calhoun and daughter, of Roanoke, are on a visit to Mrs. Calhouns mother, Mrs, Luther Glenn. Mrs. Bessie Grinstead mid daughter. Miss Anne, of Jack- son, Miss., are on a visit to Mrs. Grinsteads sister Mrs. J. R Marshall. Mrs. Fannie Ras returned homo after spending some time with her sister, Mrs. Willie Al- ity seem to be good.  ipn, of Powhatan. Mr. and Mrs. F. B. Conner i have returned from a visit to! gsasssssssm aB B relatives in Bedford and Vin-!"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "and Mr. Sears Hix, <mark>Thomasville</mark> N. C. Mrs. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "and Mr. Sears Hix, <mark>Thomasville</mark> N. C. Mrs. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2298.0, 610.13, 2449.46, 1183.2], "bbox_id": "e722e8a16f", "file": "AppomattoxNewspapers_1971-1973a_0405.pdf", "page": 1, "text": "The Virginia Employment Commission has been request ed by Thomasville Industries. Incorporated, a leading pro ducer of home furniture, to make a survey of people interested in employment in the Appomattox area. Thomasville is planning construction of a major manufacturing facility here if there is a sufficient supply of capable labor in the area. People who are at least 18 years old and who live within daily commuting distance of Appomattox may register at the Appomattox Intermediate School, on U. S. Route 460, between 900 a.m. and 900 p.m. on Friday, August 11th, and between 900 a.m. and 5 p.m. on Saturday, August 12th, according to an announcement made by James A. Smith, President of the Appomattox County Development Corpora tion. Clay E. Wells, Virginia Em ploym ent Commission labor market analyst, noted that both men and women skilled and unskilled will be needed. Training will be provided for those who need it. Thomasville, an Equal Op portunity Employer, pays competitive wages and has a full range of employee benefits including paid holidays, vaca tions, retirement income com pletely paid by the company, full insurance coverage, plus other attractive incentives. The new facility will be one of the most modern furniture manufacturing plants in the nation. If you live within commuting distance of Appomattox be sure to register, this is not a formal work application and will take only about five minutes of your time. Any"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "been request ed by <mark>Thomasville</mark> Industries. Incorporated, a leading"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "been request ed by <mark>Thomasville</mark> Industries. Incorporated, a leading"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.78, 1068.96, 1840.48, 1325.95], "bbox_id": "9d3c51c5f1", "file": "AppomattoxNewspapers_1971-1973a_0419.pdf", "page": 1, "text": "The Virginia Employment Commission, at the request of Thomasville Furniture Indust ries, conducted a Labor Supply Survey of Appomattox County August 11th and 12th. With a total of 1668 persons registering during the two-day survey, the representatives of the VEC and representatives from Thomasville Furniture Industries termed the survey a great success. A report prepared by the Manpower Research Division of. the Virginia Employment Commission has been released and figures show that during the recent survey 764 males and 904 females responded. Age-wise, 425 were from 18 to 24 years old, 476 were between 25 and 34 years old, 374 were"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "at the request of <mark>Thomasville</mark> Furniture Indust ries, conducted"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "at the request of <mark>Thomasville</mark> Furniture Indust ries, conducted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.88, 771.37, 1997.51, 1066.71], "bbox_id": "4b081a3b66", "file": "AppomattoxNewspapers_1971-1973a_0411.pdf", "page": 1, "text": "The V i r g i n i a Employment Commission, at the request of Thomasville Furniture Industr ies of Thomasville, N.C., made a survey on people interested in employment in the Appomat tox area on Friday and Satur day, August 11th and 12th, at th e Appomattox Intermediate School. Thomasville is planning to construct a major manufactur ing facility in Appomattox and needed to know if there was a sufficient supply of capable la bor available in the area. During the sign-up period on Friday, from 9 a.m. until 9 p.m., 850 persons registered and on Saturday, from 9 a.m. until 5p m., 818 persons registered, making a total of 1668 persons showing an interest in employ ment in the Appomattox area. Persons from a wide geographic area came to Appomattox and filed the report. Wells,with the V.E.C,brought"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "at the request of <mark>Thomasville</mark> Furniture Industr ies of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "at the request of <mark>Thomasville</mark> Furniture Industr ies of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.71, 1636.68, 1815.17, 1685.58], "bbox_id": "ac8dc7ceba", "file": "AppomattoxNewspapers_1905-1912a_0233.pdf", "page": 1, "text": "The Thomasville Ga. Times shouts Down with corn liqner. No trouble about that if its good corn liquor."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "The <mark>Thomasville</mark> Ga. Times shouts Down with corn liqner. No trouble about that if its good corn liquor."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "The <mark>Thomasville</mark> Ga. Times shouts Down with corn liqner. No trouble about that if its good corn liquor."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1990.57, 572.39, 2135.53, 839.68], "bbox_id": "d7a71788dd", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "The president of the United Paperworkers Union was in dicted July l9th on charges of embezzling 360,000 in union funds and using part of the money to try to derail a federal investigation of his conduct. The Paperw orkers Union currently represents employ ees in firms that manufactures paper, boxes, and other paper products and has recently indicated that it will attempt to organize w orkers at the Thomasville Furniture Indus tries plant here in Appomattox. A federal grand jury in Brooklyn, New York charged that Joseph Tonelli, president of the 300,000 member union, and union treasurer Henry Segal hired two A tlanta attorneys to intervene with officials of the Justice Depart ment on their behalf."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "w orkers at the <mark>Thomasville</mark> Furniture Indus tries plant"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "w orkers at the <mark>Thomasville</mark> Furniture Indus tries plant"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.08, 435.7, 1891.46, 733.49], "bbox_id": "2042fd0091", "file": "TimesVirginian_1981a_0012.pdf", "page": 1, "text": "The marriage, of Deborah Ann Nuckols to J ames Twyman Jones took place at the home of the brides parents, Mr. and Mrs. Josepfr E. -Nuckols, in Lynchburg with the Rev. Ernie W. Lucas, pastor of Friendship Baptist Church in Appomattox, officiating. The bridegroom is the son of Mr. and Mrs. James Mundy Jones of Appomattox. The bride was given in marriage by her father. Darlene Faye Woodall of Lynchburg was maid of honor and Mr. Jones was best man for his son. The bride is a graduate of E. C- Glass High School and is employed by A. G. Jefferson Inc. Thè bridegroom was grad uated from Appomattox Coun ty High School and is an employee of Thomasvillé Furni ture Co. in Appomattox. The couple will live in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Thomasvillé"], "snippet": "is an employee of <mark>Thomasvillé</mark> Furni ture Co. in"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasvillé"], "snippet": "is an employee of <mark>Thomasvillé</mark> Furni ture Co. in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1625.73, 1304.15, 1761.43, 1426.7], "bbox_id": "f43d97482c", "file": "AppomattoxNewspapers_1974-1975a_0134.pdf", "page": 1, "text": "The Lions Club of Appomat tox will meet at Maudes Restaurant at 645 p.m. on Thursday, January 9,1975. Guest speaker for the eve ning will be Mr. William Lowe, Vice-President and Plant Man ager at Thomasville Furniture Industries, Inc. - Appomattox Plant. All members will want to be present for this meeting."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Plant Man ager at <mark>Thomasville</mark> Furniture Industries, Inc. - Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Plant Man ager at <mark>Thomasville</mark> Furniture Industries, Inc. - Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1788.71, 1312.6, 1926.11, 1404.2], "bbox_id": "462ea7b5eb", "file": "AppomattoxNewspapers_1974-1975a_0140.pdf", "page": 1, "text": "The Lions Club of Appomat tox will meet at Maudes Restaurant at 645 p.m. on Thursday, January 9,1975. Guest speaker for the eve ning will be Mr. William Lowe, Vice-President and Plant Man ager at Thomasville Furniture Industries, Inc. - Appomattox"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Plant Man ager at <mark>Thomasville</mark> Furniture Industries, Inc. - Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Plant Man ager at <mark>Thomasville</mark> Furniture Industries, Inc. - Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.93, 578.54, 1944.28, 682.89], "bbox_id": "1206c05373", "file": "TimesVirginian_1983a_0385.pdf", "page": 1, "text": "The Future Business Leaders of America recently held their October monthly meeting. a . The members listened to a talk and slide-show by Mr. Dave Zimmerman, personal director at Thomasville. Members were reminded that Oct. 11 was the last day for sales from Pennington Distributors are due. On Oct. 15 officers traveled to Longwood"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Zimmerman, personal director at <mark>Thomasville</mark>. Members were reminded that"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Zimmerman, personal director at <mark>Thomasville</mark>. Members were reminded that"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.99, 1407.09, 1918.73, 1740.58], "bbox_id": "9d3edb78e2", "file": "AppomattoxNewspapers_1974-1975a_0281.pdf", "page": 1, "text": "The first visit of the new fiscal year of the American Red Cross Bloodmobile to Appomat tox County has been set for Tues., May 27. This visit is being sponsored by Thomasville Furniture In dustries and the hours will be from 9 a.m. until 3 p.m. and will be held as usual at Liberty Baptist Church. The hours for this visit have been changed to accommodate Thomasville and if as successful as we hope it will be, Thomasville plans to sponsor another visit during the coming year. Memorial United Methodist Church women will be in charge of the canteen for this visit. The quota for the first visit is set at 102 units of blood and you are reminded that 17 year olds may donate blood with parental consent. Rev. Earnie Lucas, Chairman of the Blood Program, urges everyone to make every effort to come out on May 27 and donate a unit of blood which is so badly needed to supply the blood bank."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "is being sponsored by <mark>Thomasville</mark> Furniture In dustries and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "is being sponsored by <mark>Thomasville</mark> Furniture In dustries and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [383.5, 493.72, 524.5, 1114.24], "bbox_id": "8ce08f6594", "file": "AppomattoxNewspapers_1971-1973a_0412.pdf", "page": 1, "text": "The Editor Appomattox, Va. August 14, 1972 Mr. Lloyd Vaughan, Editor Times-Virginian Appomattox, Va. 24522 Dear Mr. Vaughan The response to the la b o r survey last week was a compli ment to the Greater Appomat tox Community. The result for exceeded my fondest expecta tions. This was possible be cause many people thought that it was important. Thomasville Furniture In dustries insisted that before in vesting in a multi-million dol lar plant, they would need to be assured of an adequate labor supply. There are many people who need to be thanked  the School Board for providing a facility for the survey, the 46 volunteers who gave their time to help fill our the questionaires, the Post Office for distributing the an nouncements, the many busi nesses that allowed us to post a notice that the survey would be conducted,the churches and civic groups that made an nouncements concerning the sur vey, and of course the Times- Virginian for their excellent news coverage of this effort. Persons from a wide geo graphic area came to Appomat tox and filed a report. This strong backing was acknowledg ed by the Virginia Employment Commission. On two occasions it was necessary to have ad ditional forms printed. Time after time, representa tives of Thomasville Furniture expressed their amazement. They continued to point out that the number was impressive but also the quality of people was even more outstanding. On behalf of the Appomattox County Development Corporat ion, I want to express our ap preciation for the fine respon se. Yours very truly, James A.Smith, President"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "that it was important. <mark>Thomasville</mark> Furniture In dustries insisted"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "that it was important. <mark>Thomasville</mark> Furniture In dustries insisted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2168.36, 860.16, 2311.13, 945.31], "bbox_id": "9839b72314", "file": "TimesVirginian_1978_0425.pdf", "page": 1, "text": "the company has learned. The IUD . had charged Thomasville with an unfair labor practice for granting wage increases to all its employees except those in the Phenix Chair Plant in West Jefferson, where the union"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "The IUD . had charged <mark>Thomasville</mark> with an unfair labor"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "The IUD . had charged <mark>Thomasville</mark> with an unfair labor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2021.73, 456.22, 2160.65, 633.25], "bbox_id": "ecea5fab3f", "file": "AppomattoxNewspapers_1971-1973a_0511.pdf", "page": 1, "text": "The Board of Directors of the Industrial Development Authority of the County of Appomattox, Virginia, will convene on November 10, 1972, at 1000 a.m. in the board room at the Farmers National Bank for the purpose of taking formal action on a resolution to acquire a tract of 0.48 acres to be donated by the Industrial Development Authority to Thomasville Furniture Indus tries, Inc. The meeting of the board of Directors is open to the public."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Industrial Development Authority to <mark>Thomasville</mark> Furniture Indus tries, Inc."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Industrial Development Authority to <mark>Thomasville</mark> Furniture Indus tries, Inc."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [270.5, 721.84, 548.14, 940.45], "bbox_id": "8ea8370cbd", "file": "AppomattoxNewspapers_1974-1975a_0264.pdf", "page": 1, "text": "The April Career Assembly was held in the Appomattox County High School Auditorium April 16, 1975. This months program centered on the proper techniques for a job application and job interviews. Mrs. Polly DePew Guidance Counselor and advisor for the Career Assembly opened our monthly meeting by explaining the program and introducing the guests. Students from ACHS also prepared a skit showing the proper and improper way of applying for a job interview. Students participating were Lynn Allen Smith a member of the Distributive Education Clubs of America who was Personnel Manager. Cindy Guill and Julie Moore were both secretaries applying at the job interview and Gay Honeycutt was receptionist for the skit. Also as our guest for the assembly we had Mr. Roger Redman, , Personnel Director at Thomasville Furniture Industries, and Mr. Buddy Carson, Personnel Director at Appomattox Garment Company. Both men discussed the qualities looked for in an individual when applying for a job and also job attitudes and opportunities. The April Career Assembly was very successful and informative. The meeting was adjourned and the student body was dismissed. __________"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Redman, , Personnel Director at <mark>Thomasville</mark> Furniture Industries, and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Redman, , Personnel Director at <mark>Thomasville</mark> Furniture Industries, and Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2297.43, 1014.13, 2443.55, 1417.51], "bbox_id": "2796025735", "file": "AppomattoxNewspapers_1971-1973a_0451.pdf", "page": 1, "text": "The Appomattox Town Cou ncil meeting in regular session on Monday night, September 18th, voted to retain Common wealth Attorney, W. Sam Kerr, as attorney for the Town. Council voted, also, to fur nish materials for curbing and gutters to be put on both sides of High Street from Moses Street down to Bandana Street with the Highway Department employees doing the work. A resolution to this effect was approved and will be sent to the area office of the Virginia Department of Highways. In other business, a resolu tion was passed by council asking the State Highway Department to extend Hunter Street past the new well site. A resolution to extend Virginia Avenue to the town limits, which will carry Vir ginia Avenue into property under option by Thomasville Furniture Industries, was carried and the resolution will be sent to the area office of the Virginia Department of High ways. Motion was made to delete that part of the Code of the Town of Appomattox that states the Clerk of the Council Cont. on jftge 5"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "property under option by <mark>Thomasville</mark> Furniture Industries, was carried"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "property under option by <mark>Thomasville</mark> Furniture Industries, was carried"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2010.48, 483.49, 2142.51, 717.18], "bbox_id": "641316c364", "file": "TimesVirginian_1980a_0084.pdf", "page": 1, "text": "The Appomattox Elemen tary School PTA will have a fund raising project this Spring with the grand prize being a Thomasville bed room suite. Donations are 1.00 and tickets may be purchased in front of Wilbuns and Kings Super, Markets on Friday afternoon and Saturday, .March 14 and 15 and on Friday afternoon and Satur day, March 21 and 22. The bedroom suite will be given away at the May PTA meeting. You do not have to be present, to win. Please support the Ele mentary School PTA in this effort as the donations will be used to purchase fans for all the classrooms."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "grand prize being a <mark>Thomasville</mark> bed room suite. Donations"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "grand prize being a <mark>Thomasville</mark> bed room suite. Donations"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2159.31, 615.63, 2341.57, 854.2], "bbox_id": "2af901a2d2", "file": "TimesVirginian_1983a_0468.pdf", "page": 1, "text": "The Appomattox Assembly extends its thanks and appreciation to those individuals making contributions to the Reverend R. Q.. Lowing, Sr. Memorial Scholarship Fund said Thomas A. Chilton, Sr. Assembly president. The following additional contribu tions have been made G. Lewis McDearmon. 25.00 Fred Smith, 50.00 Mrs. Beulah S. Morgan, 100.00 Amrican Federal Savings and Loan Appomattox, 50.00-, Fellowship of Armed Forces Retirees, 50.00 Thomasville Furniture Industries, Inc., 500.00 Dr. Larry Smith, 100.00 Family Practice Center, 50.00 Lloyd Walton, 15.00 and Mrs. Vivian Morris. 25.00. Correction"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Armed Forces Retirees, 50.00 <mark>Thomasville</mark> Furniture Industries, Inc., 500.00"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Armed Forces Retirees, 50.00 <mark>Thomasville</mark> Furniture Industries, Inc., 500.00"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2066.15, 281.25, 2227.12, 463.14], "bbox_id": "d5e42711c8", "file": "AppomattoxNewspapers_1926-1933a_0495.pdf", "page": 1, "text": "ter Jr., of Chicago, 111, and the following .brothers and sisters Miss Maggie Hix and Messrs. William D, and Wilson Hix, of this place Miss Carrie Hix, of Richmond, Mrs. Annie Earle Waco, Tex., Mrs. W. M. Er win, Salisbury, N. C., and Mr. Sears Hix, Thomasville N. C. Mrs. W. M. Erwin and son, Billy, of Salisbury are staying awhile here with home people Mr. Winston Hix, of Roan oke, was among those attend ing Mrs. Chamberlains burial. Mrs. Charles Calhoun and daughter, of Roanoke, are on a"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "and Mr. Sears Hix, <mark>Thomasville</mark> N. C. Mrs. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "and Mr. Sears Hix, <mark>Thomasville</mark> N. C. Mrs. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1579.2, 979.65, 1728.62, 1414.92], "bbox_id": "d521ebaa44", "file": "TimesVirginian_1981a_0068.pdf", "page": 1, "text": "ted an extension of the franchise expiration date in order to study the feasibility of their purchasing the system from Deimler., The franchise was originally scheduled to expire Feb. 23. In other business before the Mayor and. Council Monday night, a motion was approved to examine the town regula tions defining business-license tax obligations for local merchants and professionals. The Councilmen instructed the finance committee to conduct a study of the current business-license tax regula tions, with particular attention to the rules involving profess ionals such as .doctors and lawyers. Mayor Ronald C. Spiggle called the action an effort to see that everyone pays his fair share, in the business-license tax. . The Councilmen also voted to help fund the fireworks display at the 1981 Railroad Festival! Town Manager .Bill Britton said that Thomasville Furni ture, which with the county Board of Supervisors funded the ffi-eworks display last year, had indicated that it would hot - provide funding for the fireworks display in 1981. The total, cost of the fireworks display in 1980 was approximately 1,200 according toBritton."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Bill Britton said that <mark>Thomasville</mark> Furni ture, which with"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Bill Britton said that <mark>Thomasville</mark> Furni ture, which with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [924.26, 271.69, 1119.25, 462.18], "bbox_id": "64b8b5f0c0", "file": "TimesVirginian_1984a_0107.pdf", "page": 1, "text": "Tboènox A.. B ath , Jr..  chairman of the board f ThomasviHe Funifture in d u s tS lne. riaew 7   d W    h  26 after an extentd Mr. Finch, 61, was widely knoWn far his industry efforts as well as tor 1 many contributions over the years- to civic, church and education causes ,,, The Southern Furniture Manufact urers Association In 197Ô  honored - Mr.  t Finch with the James J. RyfO Award for his many contributions for the betterment of his community, the furniture industry and to-tbe state and region. This past January he received yet another honor when the Thomasville Family YMCA was r e n a m e d the Tom A . Finch Community"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "another honor when the <mark>Thomasville</mark> Family YMCA was r"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "another honor when the <mark>Thomasville</mark> Family YMCA was r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1901.01, 355.92, 2446.02, 579.76], "bbox_id": "c89c2b3174", "file": "AppomattoxNewspapers_1974-1975a_0276.pdf", "page": 1, "text": "Take stock in America Buy US. Savings Bonds STANDINGS Appomattox Softball League Won Lost Lawson Ford 2 0 Hilltoppers 2 1 Best Furniture 2 1 NAPA 2 1 Amoco Car Wash 1 2 Appo. Baptist Temple 1 2 Thomasv. 2 1 2 Thomasv. 1 0 2 Last Weeks Results Amoco Car Wash .,11-Thomas- ville 2,10 Best Furniture, 6 - Thomasville 2,5 Lawson Ford, 11 - Appo. Baptist Temple, 2 NAPA, 20 - Hilltoppers, 6"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "2,10 Best Furniture, 6 - <mark>Thomasville</mark> 2,5 Lawson Ford, 11"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "2,10 Best Furniture, 6 - <mark>Thomasville</mark> 2,5 Lawson Ford, 11"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2353.43, 1706.24, 2654.69, 1822.14], "bbox_id": "ba866d3aa4", "file": "TimesVirginian_1981a_0435.pdf", "page": 1, "text": "STUDENTS OF THE APPOMATTOX Cowty High School Art Department got into the spirit of the season last week, when they completed this nativity scene in front of thr Thomasville factory. The materials for the project were donated to the art deportment by Thomasville. The project came about as a result of a suggestion made by Betty Coleman, the plants gate guard. The ACHS agriculture department also assisted on the project, catting oat the boards in the shape of the main figures. Shown above are from left Delores Hamiett. Sue Granato, Cheryl Davis, Betty Vannoy, Teresa Mayberry, David Page, Mrs. Wendy Richardson teacher. Melody Barber, and Betty Coleman, the Thomasvikle.gate guard."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "in front of thr <mark>Thomasville</mark> factory. The materials for"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "in front of thr <mark>Thomasville</mark> factory. The materials for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2441.76, 494.58, 2586.24, 743.37], "bbox_id": "fa2e620e71", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "statues, plus five years on the embezzlement counts. The announcement that the Paperworkers would attempt to organize Thomasville em ployees in Appomattox was by Arnold Brown who heads Region 4 which includes Virginia of the United Paper- workers International Union and first appeared in the ROANOKE TIMES  WORLD NEWS on June 21,1978. The Paperworkers got a foothold in the furniture industry when the Mead Company, the large Lynchburg paper manufacturer, bought Stanley Furniture Company. Even though workers voted in the Paperworkers at Stanley, a local has never been active there."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "would attempt to organize <mark>Thomasville</mark> em ployees in Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "would attempt to organize <mark>Thomasville</mark> em ployees in Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2155.68, 765.57, 2295.93, 1010.75], "bbox_id": "a00463a552", "file": "AppomattoxNewspapers_1974-1975a_0195.pdf", "page": 1, "text": "Station 170, Transcontinen tal Gas Pipe Line Corporation, Appomattox, celebrated its 24th anniversary on Friday evening with a dinner for employees and their wives and guests at the parkway Rest aurant. Guests for the celebration included several retired em ployees of the company, the Rev. and Mrs. Doyle Chauncey and family, and Mr. and Mrs. Hugh Johnson and family. Hany D. Carter of. the Compressor Station and Her man Carter of the Pipeline Crew, recently retired were recegnrad H thedianer. W Hugh Johnson, purchasing agist for Thomasville Furni ture Industries, Appomattox plant, was the guest speaker for the evening. He described"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Johnson, purchasing agist for <mark>Thomasville</mark> Furni ture Industries, Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Johnson, purchasing agist for <mark>Thomasville</mark> Furni ture Industries, Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [272.89, 818.14, 413.26, 972.84], "bbox_id": "596bce0761", "file": "AppomattoxNewspapers_1974-1975a_0299.pdf", "page": 1, "text": "STANDINGS Appomattox Softball League W on-Lost Lawson Ford 7 0 NAPA 5 2 Hilltoppers 6 4 Amoco Car Wash 4 3 Best Furniture . 4 4 Thomas ville  2 3 4 Appo. Baptist Temple 3 7 Thomasville 1 0 8 Last Weeks Results Appomattox Baptist Temple, 4 -Thomasville 81,2 Best Furniture, 7 - Hilltojiers,"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Baptist Temple 3 7 <mark>Thomasville</mark> 1 0 8 Last"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Baptist Temple 3 7 <mark>Thomasville</mark> 1 0 8 Last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [272.14, 854.06, 413.54, 1113.65], "bbox_id": "5a77aff916", "file": "AppomattoxNewspapers_1974-1975a_0273.pdf", "page": 1, "text": "STANDINGS APPOMATTOX SOFTBALL LEAGUE Team Won Lost Hill Toppers Thomasville 2 Lawson Ford NAPA Appo. Baptist Temple Best Furniture Amoco Car Wash Thomasville 1 Last Weeks Results Lawson Ford, 23 - Thomasville  1.2 Best Furniture, 11-NAPA, 4 Hilltoppers, 13- Amoco Car Wash, 8 Thomasville 2, 6 - Appo. Baptist Temple, 5. Appo. Baptist Temple, 15 - Thomasville 1,6 Hilltoppers, 9 - Best Furniture, 1 NAPA, 8 - Amoco Car Wash, 7"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Won Lost Hill Toppers <mark>Thomasville</mark> 2 Lawson Ford NAPA"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Won Lost Hill Toppers <mark>Thomasville</mark> 2 Lawson Ford NAPA"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [544.78, 885.94, 704.37, 1173.87], "bbox_id": "d759174fdc", "file": "AppomattoxNewspapers_1971-1973a_0491.pdf", "page": 1, "text": "Spout Spring - Grayson Crews Collins, 64, of Spout Spring, died Thursday, Octo ber 12, at Lynchburg General- Marshall Lodge Hospital. Born at Drakes Branch, he was a son of Flavius 0. Collins and Grace Crews Collins. He I was a retired machinist with I the U. S. Government. He is survived by two sons, Edgar Grayson Collins of Lynchburg and James Frank Collins of Santa Clara, Calif., a brother, George F. Collins of Thomasville, N. C., and two i sisters, Mrs. J. Frank Rice of Phenix and Mrs. Richard Boddie of Durham, N. C. Funeral services were con ducted at 3 p.m. Saturday at Browning Funeral H o m e , Keysville, by the Rev. Fred Fore. Burial was in the Bethel Baptist Church Cemetery, Phenix."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "George F. Collins of <mark>Thomasville</mark>, N. C., and two"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "George F. Collins of <mark>Thomasville</mark>, N. C., and two"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [751.44, 460.55, 895.79, 553.64], "bbox_id": "ebd6de38e7", "file": "TimesVirginian_1981a_0072.pdf", "page": 1, "text": "son and, the làte Mr. Julian E. Holt. Theresa is employed at Thomasville Furniture Indust ries, in Appomattok, Va. Gene is the son of Mrs. Alice Ferguson and the late Aubrey E. Baldwin. Gene is employed with the Appomattox County Sheriff Department."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Theresa is employed at <mark>Thomasville</mark> Furniture Indust ries, in"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Theresa is employed at <mark>Thomasville</mark> Furniture Indust ries, in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [268.81, 487.82, 403.93, 855.15], "bbox_id": "890a932798", "file": "TimesVirginian_1980a_0141.pdf", "page": 1, "text": "sociates, Hanson Electric Co.. Harold T. and Carolyn P. Williams, Pamplin Exxon Servicenter, Tolleys Fert- liser and Fuel Co.. Webbs Tire Co., Travelers Inn Motel, J. E. Jamerson  Sons, Inc., Thomasville Armstrong Furniture, Ap pomattox Radio  TV Service, J. A. Burke  Co., Inc., Kings Market. W. Frank Moore, Inc., Wilbuns ? ational Auto Parts, Inc., he Farmers National Bank, American Federal Savings and Loan, The American Legion, The Womans Club of Appomattox. Mrs. Mary. Alma Hudson, Dr, and Mrs. Kenneth Powell, Mr. and Mrs. Burke Guill, Mrs. Peggy Franklin. Times-Vir- ginian Printing-Co. Several individuals and business contributed and wished to remain anony mous. Thanks also to Mr. Doug Webb who chaired a committee of ideal business men and women who contacted the businesses in the county for donations. Other members of the committee were Mr. Lloyd."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "E. Jamerson  Sons, Inc., <mark>Thomasville</mark> Armstrong Furniture, Ap pomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "E. Jamerson  Sons, Inc., <mark>Thomasville</mark> Armstrong Furniture, Ap pomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1643.3, 1083.61, 1815.87, 1437.11], "bbox_id": "fab0e56ffe", "file": "AppomattoxNewspapers_1908-1909a_0461.pdf", "page": 1, "text": "Slight showers this week re freshed vegetation some but we need a ground soaking rain to ireapmuch benefit. Mrs. J. B. Mosley, of South Boston, Miss Bessie Marshall, of Lexington, N. C.,Tfiss Flossie Marshall, of Charlotte, N. C., i and Dn and Mrs. Lea Brooks  and son have been visiting Mr. and Mrs. Baxter Marshall this week. Messrs. H. M. and J. R. Mar shall Jpent Monday in Lynch burg. - Mr. W. M. Erwin and W. M., Jr motored from Badih, N CS, to visit Mrs. Erwin and children, who are spending the summer with Miss Mag Hix J. Sears Hix is expected in soon from Thomasville, N. C, Mr. and Mrs. E. W Gilliam returned to Lynchburg Monday having spent the week with friends and relatives here. . , Mr. and Mrs.Wilson Hix were  business visitors in Farmville recently. Miss Hazel Tavfnrf"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "expected in soon from <mark>Thomasville</mark>, N. C, Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "expected in soon from <mark>Thomasville</mark>, N. C, Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1648.78, 1091.41, 1827.4, 1659.0], "bbox_id": "bc8f70b5c0", "file": "AppomattoxNewspapers_1926-1933a_0461.pdf", "page": 1, "text": "Slight showers this week re freshed vegetation some but we need a ground soaking rain to I reap much benefit. Mrs. J. B. Mosley, of South Boston, Miss Bessie Marshall, of Lexington, N. C., Miss Flossie Marshall, of Charlotte, N. C., and Dr. and Mrs. Lea Brooks and son have been visiting Mr. I and Mrs. Baxter Marshall this week. Messrs. H. M. and J. R. Mar-1 shall spent Monday in Lynch burg. Mr. W. M. Erwin and W. M.,  Jr., motored from Badin, N Oi to visit Mrs. Erwin and children! who are spending the summer! with Miss Mag Hix. I J. Sears Hix is expected in soon from Thomasville, N. C, Mr. and Mrs. E. W. Gilliam returned to Lynchburg Monday having spent the week with friends and relatives here. I Mr. and Mrs. Wilson Hix were business visitors in Farmville recently. Miss Hazel Taylor, of Staple- i ton, is visiting in the home of E. P. Sears. Mrs.J.R. Marshall and daugh ter and Mrs. Luther Glenn re-j port a fine trip to Ya. Beach. Mrs. Alice Harwood and Miss I M. J. Drinkard were visitors in the home of A. R. Harwood this week. Miss Carrie Hix after spend- j ing a week with Miss Mag Hix  here left for a northern trip with friends from Richmond. J. S. Hix, Paul Milam and W. M. Erwin spent Wednesday in Lynchburg. J. T. Hix was at tending Merchants Convention there."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "expected in soon from <mark>Thomasville</mark>, N. C, Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "expected in soon from <mark>Thomasville</mark>, N. C, Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1027.87, 1630.04, 1185.07, 1743.93], "bbox_id": "5b100070af", "file": "AppomattoxNewspapers_1915-1918a_0122.pdf", "page": 1, "text": "She Shoots Rattler After Being At tackedWill Recover. Thomasville, Ga.Mrs. John F. Archbold, daughter-in-law of John D. Archbold, of the Standard Oil Com pany, was bitten by a rattlesnake while bunting on the Archbold estates, near here. Physicians said a heavy eather boot prevented complete poison ing and her wound would not prove Mrs. Archbold shot the snake he had been bitten."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Being At tackedWill Recover. <mark>Thomasville</mark>, Ga.Mrs. John F. Archbold,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Being At tackedWill Recover. <mark>Thomasville</mark>, Ga.Mrs. John F. Archbold,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1674.66, 337.96, 1841.81, 387.06], "bbox_id": "505034f42d", "file": "AppomattoxNewspapers_1947-1949a_0069.pdf", "page": 1, "text": "Sears Hix, of Thomasville, N. C., and Mrs. W. M. Erwin, of Mount Ulla, N. C., will be the guests of Miss Maggie Hix from July 26th through August 2nd."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Sears Hix, of <mark>Thomasville</mark>, N. C., and Mrs. W. M. Erwin, of Mount Ulla, N. C., will be the guests of Miss Maggie Hix from July 26th through August 2nd."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Sears Hix, of <mark>Thomasville</mark>, N. C., and Mrs. W. M. Erwin, of Mount Ulla, N. C., will be the guests of Miss Maggie Hix from July 26th through August 2nd."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [433.16, 1058.35, 1455.67, 1170.58], "bbox_id": "f8276130cf", "file": "AppomattoxNewspapers_1974-1975a_0312.pdf", "page": 1, "text": "s will be Page a Phelps, Nancy id Mary Ellen Lawson Ford 9 NAPA 7 2 Best Furniture 5 4 Amoco Car Wash 5 HilKoppers 6 6 Thomas ville 2 3 5 Appo. Baptist Temple 3 8 Thomasville Ml 1 10 Last Weeks Results Best Furniture,7 - Thomasville"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Baptist Temple 3 8 <mark>Thomasville</mark> Ml 1 10 Last"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Baptist Temple 3 8 <mark>Thomasville</mark> Ml 1 10 Last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1928.16, 1444.91, 2068.07, 1633.51], "bbox_id": "b8071aa614", "file": "AppomattoxNewspapers_1974-1975a_0422.pdf", "page": 1, "text": "rurunure industries in Appo mattox has a new name. Now known as TRANSMARK OP ERATIONS the Appomattox plant represents the manufac turing facility of a separate operating division of Thomas- ville Furniture Industries. In addition to the facility here in Appomattox, TRANSMARK Marketing and Design staffs are headquartered at the Thomasville headquarters in Thomasville, NC. Also, a newly assembled TRANSMARK mar- keting organization is located in key cities throughout the United States and Canada."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in <mark>Thomasville</mark>, NC."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in <mark>Thomasville</mark>, NC."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.49, 1443.71, 2065.17, 1600.86], "bbox_id": "f0dec728c8", "file": "AppomattoxNewspapers_1974-1975a_0423.pdf", "page": 1, "text": "rurnuure industries in Appo mattox has a new name. Now known as TRANSMARK OP ERATIONS the Appomattox plant represents the manufac turing facility of a separate operating division of Thomas- ville Furniture Industries. In addition to the facility here in Appomattox, TRANSMARK Marketing and Design staffs are headquartered at the Thomasville headquarters in Thoma8ville, NC. Also, a newly assembled TRANSMARK mar-"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in Thoma8ville, NC."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in Thoma8ville, NC."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.68, 1443.17, 2064.63, 1632.21], "bbox_id": "bfa4582286", "file": "AppomattoxNewspapers_1974-1975a_0426.pdf", "page": 1, "text": "runuture industries in Appo mattox has a new name. Now known as TRANSMARK OP ERATIONS the Appomattox plant represents the manufac turing facility of a separate operating division of Thomas- ville Furniture Industries. In addition to the facility here in Appomattox, TRANSMARK Marketing and Design staffs are headquartered at the Thomasville headquarters in Thonumville, NC. Also, a newly assembled TRANSMARK mar- keting organization is located in key cities throughout the United States and Canada."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in Thonumville, NC."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in Thonumville, NC."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2427.27, 1108.23, 2569.71, 1184.73], "bbox_id": "dfa9808e6d", "file": "TimesVirginian_1976_0285.pdf", "page": 1, "text": "residential and contract bed room- furniture is a Division of Thomasville Furniture Indus- ties, Inc.,  a wholly owned subsidiary of Armstrong Cork Company, Lancaster, Pennsyl vania."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "residential and contract bed room- furniture is a Division of <mark>Thomasville</mark> Furniture Indus- ties, Inc.,  a wholly owned subsidiary of Armstrong Cork Company, Lancaster, Pennsyl vania."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "residential and contract bed room- furniture is a Division of <mark>Thomasville</mark> Furniture Indus- ties, Inc.,  a wholly owned subsidiary of Armstrong Cork Company, Lancaster, Pennsyl vania."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2312.17, 234.6, 2587.94, 920.44], "bbox_id": "43a142d056", "file": "TimesVirginian_1980a_0043.pdf", "page": 1, "text": "reserve the right to limit quantities JAN. 28-Several from the community attended the wedd ing of W ayne Burton in Richmond Sunday.- Wayne is the grandson of Mr. and Mrs. Burkley OBrien of this community. Mrs. T. N. Saul returned home Tuesday after spending several weeks with Mr. and Mrs. Billy Saul at Piney Point, Maryland. Charles Wayne Cook of Richmond was. a weekend Visitor of his parents, Mr. and Mrs. W. T. Cook. Mrs- Wilbur St. John of Appomattox was s Friday visitor in the same- home. Mr. and Mrs. Don Morris and boys Mr. and Mrs. Roger Morris and Sandi and C. J. Morris and Cindy attended the wedding of Terry Ferrell at Thomasville, N orth Carolina Saturday. Regina Lutz of Buckingham was a weekend guest of Kathy Morris. Mr. and Mrs. H. Flood Harris of Green Bay were Saturday visitors of Mr. and Mrs. Russell L. Harris. Mrs. Katherine Carson of Spout Spring Was a Monday visitor in the home of Mr. and Mrs. K. M. Beasely, Jr. Mr.sad Mrs. StuartJackson of Richmond spent Saturday in the home of Mr. and Mrs. Aubrey N. Morris. Mr. and Mrs. George Shumaker of Brookneal were Sunday visit ors in the same home. Mrs. Bob Bryan and Mrs. Bernard Tolbert were co hostesses to a bridal shower Friday night for Dora Mann Carter at the home of Mrs. Bryah. _ Charles Morris of Richmond and Nancy WilsotTbf Farmville were callers ip the C. W. Morris home Sunday.  Edward T. Cook of Prospect was a Monday visitor of his parents. Mr. and Mrs. W. T- Cook."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "of Terry Ferrell at <mark>Thomasville</mark>, N orth Carolina Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "of Terry Ferrell at <mark>Thomasville</mark>, N orth Carolina Saturday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.44, 1552.65, 1853.39, 1727.24], "bbox_id": "92c7b62584", "file": "AppomattoxNewspapers_1974-1975a_0195.pdf", "page": 1, "text": "Redman, Personnel Manager at Thomasville Furniture Indus tries, Appomattox plant, was elected Director and J. E. Jamerson, former Vice Presi dent was elected Vice Chair man of the Board of Directors. Other officers elected were 1 Eleanor C. Conner, Assistant  Cashier and Ellen R. Martin, Assistant Cashier. In addition to the newly elected Director, Roger Red man, Directors include the j officers listed above and W. M. I Abbitt, E. W. Carson. John C. ! Cole, J. B. Drinkard, Jr., John"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Redman, Personnel Manager at <mark>Thomasville</mark> Furniture Indus tries, Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Redman, Personnel Manager at <mark>Thomasville</mark> Furniture Indus tries, Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2320.26, 857.06, 2462.58, 942.9], "bbox_id": "2173fbea30", "file": "TimesVirginian_1978_0425.pdf", "page": 1, "text": "recently won a representative election. The NLRB said the charge is without merit and will be dismissed if the union does not withdraw it. Thomasville President Tom A. Finch said, We are, of course,"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "does not withdraw it. <mark>Thomasville</mark> President Tom A. Finch"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "does not withdraw it. <mark>Thomasville</mark> President Tom A. Finch"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2338.78, 803.36, 2481.18, 968.6], "bbox_id": "3fe854e353", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "Realty and 0.48 acres of land owned by Humble Oil Com pany that had been purchased by the Industrial Development Authority of A p p o m a t t o x County and was donated to Thomasville Furniture Indus tries. According to Mr. Sydansk, of Armstrong Cork Company, engineering is preceeding in the project and when complet ed, plans will then be let for bids, and we can look forward to the beginning of constuctlon."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "and was donated to <mark>Thomasville</mark> Furniture Indus tries. According"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "and was donated to <mark>Thomasville</mark> Furniture Indus tries. According"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1924.8, 1443.8, 2064.2, 1631.34], "bbox_id": "1bb7468bef", "file": "AppomattoxNewspapers_1974-1975a_0425.pdf", "page": 1, "text": "r urmture industries in Appo mattox has a new name. Now known as TRANSM ARK OP ERATION S the Appomattox plant represents the manufac turing facility of a separate operating division of Thomas- ville Furniture Industries. In addition to the facility here in Appom attox, T R A N SM A R K Marketing and Design staffs are headquartered at the Thomasville headquarters in Thomasvilie, N C. Also, a newly assembled TRANSM ARK mar keting organization is located in key cities throughout the United States and Canada."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in Thomasvilie, N"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "are headquartered at the <mark>Thomasville</mark> headquarters in Thomasvilie, N"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2321.3, 1016.55, 2454.21, 1315.98], "bbox_id": "82288ba4f2", "file": "TimesVirginian_1980a_0326.pdf", "page": 1, "text": "PUBLIC NOTICE The Appomattox Town Council and the Appomattox County Planning Commis sion, in accordance with Sec. 15.1-431, Code of Virginia, is notifying the citizens of a Public Hearing, to be held on October 20, 1980, at 730 p.m., in the Appomattox Town Office, so they may appear and present their views on a proposed change in the Appomattox Town Zoning Map. The proposed change is on the Northwest corner of the Town, on Thomasville property. The1 proposed change would be, from M.-l zoning to B-l zoning. For additional information contact W. R. Britton, Jr., Zoning Administrator, 352- 8268. 8010-2-2tc i  CLASSIFIED ADS ....RESULTS...."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "of the Town, on <mark>Thomasville</mark> property. The1 proposed change"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "of the Town, on <mark>Thomasville</mark> property. The1 proposed change"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1325.73, 590.25, 1508.85, 1181.52], "bbox_id": "38efe0806c", "file": "TimesVirginian_1980a_0333.pdf", "page": 1, "text": "producing substantial am ounts of water. The Councilmen authorised Britton to approach the Appomattox County School Board, owners of the property, and negotiate an agreement that would allow the town to drill a test well on the property. Councilmen also heard a report on the cable television franchise in Appomattox. Arco, Inç., the Pennsylvania-based company which holds the franchise, has not been in compliance with the terms of the franchise, according to Britten. He noted that the company was given 30 days to come into compliance, and that time was due to expire Tuesday Oct. 14. After that time, thé town could annul the franchise, Britton noted. He said that a cable television firm currently operating but of Farm vilie has expressed strong interest in picking up the franchise if Arco loses it. The Councilmen also voted to put a street fight on a stretch of Morris Avenue which is abnormally dark at night. Mayor Ronnie Spiggle noted that street lights are vary expensive, costing the taxpayers .-more than 12,000 in the first nine Months of fiscal 1966. In other business the . few er com m ittee m o  a te iM d  c M fM - roval for a motion to deny MbMviHe Furniture Industries access to the municipal sewer system. Commit tee spokesman Ray Noble noted that addition of the Thomasville wastep ater would put additional strain on a system which is already operating near capacity, and would necessitate costly monitoring since the influent contains chemicals which are consider ed hazardous materials. The Couneilmon aisé voted to adopt a proposed Areawide Housing Opportu nity Kan AHOP with the stipulation that the plan be administered locally. The plan, if proved by the U. S. Department of Housing and Urban Dev elopment, would provide a method of dispersing federal housing subsidy funds for low-snd-ukoderate-income . housing."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "that addition of the <mark>Thomasville</mark> wastep ater would put"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "that addition of the <mark>Thomasville</mark> wastep ater would put"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2439.06, 611.53, 2597.02, 1632.86], "bbox_id": "36be862058", "file": "AppomattoxNewspapers_1971-1973a_0405.pdf", "page": 1, "text": "previous registration, whether with the VEC or other agencies, will not be valid for this survey. You must register at the Appomattox Intermedi ate School on one of the above dates to indicate your interest. Without the proper interest shown NOW, Thomasville will not be able to have a true picture of the labor that will be available. Please take a few minutes of your time Friday or Saturday to indicate your interest in employment in this industry. Please do not wait for the industry to be built and think it will be just as well to register or apply for employ ment then . . . without a favorable labor survey NOW, Thomasville Furniture Indust ries will not be able to proceed with their plans. The Appomattox County Development Corporation is positive that there will be sufficient interest in this survey and wishes to again stress the importance of having a favorable labor survey on August 11th and August 12th. Local volunteers helping with the survey on Friday will be Mrs. A. B. Norconk, Mrs. Louise Plunkett, Rebecca Jamerson, Elizabeth Reynolds, Mike Belter, Janet Hix, Jane Hix, John McCraw, Harriett Redding, Mrs. C. G. OBrien and Mrs. Frances Murray from 900 a.m. until 100 p.m. From 100 p.m. until 500 p.m. the volunteers will be Mrs. Frank Carwile, J. L. Hedrick, Beck Hudson, Frances Paulette, Mrs. John L. Wilson, Mrs. V. L. Hudson, Mrs. C. G. OBrien, Ruby Moses and Agnus Powell, and from 500 p.m. until 900 p.m. on Friday the volunteers will be Mrs. Charlie Hill, Mrs. Besty Carter, Mrs. Nancy Elder, Mrs. Edith Scruggs, Mrs. Nina Beasley, S. B. Waddell, V. O. Mims, J. N. Jennings and Jimmy Rogers. On Saturday morning from 900 a.m. until 100 p.m. the volunteers will be June Chenault, W. T. Coleman, T. E. Pittman, L. E. Thomas, Mrs. Lathan Harvey, Danny Simp son, R. E. Pankey, Ronnie Lewis, Joan Ranson and Mrs. C. C. Houchens. For Saturday afternoon from 100 p.m. until 5 ,0 0 p.m. volunteers are Robert A. Sears, Robert W. Carter, Robert Jamerson, W. M. McGrath, Tom Pankey, Clarence Smith, Charlie Wil liams, Mrs. Wallace Moore, Mrs. Marshall Stratton and Peggy Franklin. In last weeks issue of the Tiines-Virginian, J. A. Smith asked for volunteers to help with the survey, working four hour shifts, and as you can see by the list of names above, the response was great. Initial employment at Tho masville Furniture Industries will begin at 200 to 250 per sons, within a year or two after production begins the plant should be providing employ ment for 600 to 700 persons. Plan now for the future . . . come by the Appomattox Intermediate School on Friday or Saturday and register with the Virginia Employment Commission."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "proper interest shown NOW, <mark>Thomasville</mark> will not be able"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "proper interest shown NOW, <mark>Thomasville</mark> will not be able"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1482.51, 640.57, 1679.16, 772.02], "bbox_id": "3ef5291d88", "file": "AppomattoxNewspapers_1974-1975a_0540.pdf", "page": 1, "text": "Pictured above is the sign recently erected at the Thomasville Furniture Industries plant, here in Appomattox. As the sign indicates, this plant carries the name of Transmark Operations and manufactures furniture merchandized as ..from the Indoor World of Armstrong. Thomasville Furniture is a wholly owned subsidiary of the Armstrong Cork Company. The Armstrong Board of Directors met at the plant on Monday, November 24, and heard reports on the progress of the plant."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "recently erected at the <mark>Thomasville</mark> Furniture Industries plant, here"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "recently erected at the <mark>Thomasville</mark> Furniture Industries plant, here"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [125.52, 496.47, 265.27, 678.76], "bbox_id": "06cc7d5419", "file": "TimesVirginian_1976_0266.pdf", "page": 1, "text": "Pictured above are members of the Wilkes-Vaughan family who attended the seventh annual family reunion held off Sun., June 27 at the farm house of Mr. and Mrs. J . Franklin Vaughan in Spout Spring. Those present were Mrs, Janie Holloman, Mr. and Mrs. James Vaughan and Mr. and M rs. Edwin Vaughan of Victoria Mr. and Mrs. Jimmie Vaughan, John, Je ff and Lynn of Richmond, Mr. and Mrs. Billy Vaughan of Thomasville, N.C. Mr. and Mrs. Stewart Brock- well and Chris of Amelia Mr."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Mrs. Billy Vaughan of <mark>Thomasville</mark>, N.C. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Mrs. Billy Vaughan of <mark>Thomasville</mark>, N.C. Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1989.61, 403.09, 2554.95, 492.24], "bbox_id": "fdfab0fa80", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "Paperworkers Union Seeks To Organize Thomasville Plant"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Paperworkers Union Seeks To Organize <mark>Thomasville</mark> Plant"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Paperworkers Union Seeks To Organize <mark>Thomasville</mark> Plant"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2266.06, 160.29, 2420.35, 837.71], "bbox_id": "e851fa9d17", "file": "TimesVirginian_1976_0412.pdf", "page": 1, "text": "or 48 cents per share were 57,419,000, or 2.22 per share. Estimated net earnings from operations were 45,019,000, or 1.74 per share, compared with earnings of 25,747,000, or 99 cents per share, for the comparable period ot 1975. In the 1976 period, unrealized currency exchange gains a- mouhted to approximately 3,400,000, or 18 cento per share, compared with the 3.900,000 or 15 cents per share gain included in the 1975 nine-month earnings total. According to Armstrong president James H. Bin ns, these results were achieved despite a reduction from the 1975 level in consolidated earnings of Armstrongs affili ated companies abroad. He attributed the decline in foreign earnings to a combination of negative factors including a deterioration in cost-price relationships costs involved in preparation for initial produc tion at the new Thornaby-on- Tees, England, rotovinyl floor ing plant ot the companys British affiliate currency ex change losses realized on inter-company sales in greater Europe and nonrecurring expenses associated with the closing down of Armstrongs woven carpet operations in Canada to concentrate on move profitable tufted carpet in that- country. Looking to the remainder of 1976, Binns said We are anticipating a continuation of modest year-to-year improve ment in the majority pf the domestic markets we serve. Despite the persistence of most of the negative factors affecting our internationally based com panies, we are hopeful for the beginning of a turn-around in their performance trends. On balance, therefore, we continue to feel that 1976 will prove to be a year of progress for the company as a whole. Armstrong Cork Company with home offices in Lancaster, Pennsylvania is the parent company of Thomasville Furni ture Industries, Inc. which has"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "the parent company of <mark>Thomasville</mark> Furni ture Industries, Inc."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "the parent company of <mark>Thomasville</mark> Furni ture Industries, Inc."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [972.23, 294.42, 1117.76, 733.71], "bbox_id": "fab8715a30", "file": "AppomattoxNewspapers_1962-1965a_0142.pdf", "page": 1, "text": "On Tuesday March 19, the Parnplin HD Club convened in the home of Mrs. Frances Luca- do. Nine members were present. Miss Peggy Berger, county agent, demonstrated child crait. The next meeting will be on the re gular day, Thursday, April 18. Mrs. Benny Massey will be hos tess. Those who came from a dis tance to attend the funeral of Mr. Willie Hix on March 19, at Walkers Presbyterian Church at Hixburg and interment in the cemetery there were Mr. Har wood and Tom Hix, Mrs. Edith Hix and Frances and Mr. and Mrs. Crote Carson, all of Rich-1 mond. Also, Lt. Col. W. M. Er win, Jr., of Langley A. F. Base Mr. Tom Erwin and Mr. and Mrs. Kenneth Shoaf, of Mt. Ulla, N. C.. Mr. and Mrs. J. S. Hix, of Thomasville. N.C., and Mr. j Sam Erwin, of Greensboro,N.C.  Mr. and Mrs. Richard Robin-. son, who spent the winter in  Cincinnati, returned on Saturday. I Mrs. Robinson is the former Anne Martin, daughter of M r. and Mrs. Rob Martin. On March 9, Mrs. Jennie j Young went back to her home I in Prince Edward County after! spending the winter with h e r. niece, Mrs. Rob Martin. Week end guests of Mr. and  Mrs. F. M. Alley were Mr. and Mrs. Parvin, Malcolm Green, and Mr and Mrs. Edwin Alley, all of Norfolk. Mrs. Bob Covington, Mrs. John i Goin and Mrs. Jim Carson -at tended the District Meeting of the Women of the Church at the Presbyterian Church at Bucking-"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "J. S. Hix, of <mark>Thomasville</mark>. N.C., and Mr. j"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "J. S. Hix, of <mark>Thomasville</mark>. N.C., and Mr. j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1610.64, 421.93, 1739.26, 574.73], "bbox_id": "496c066a78", "file": "TimesVirginian_1980a_0313.pdf", "page": 1, "text": "On Oct. 9 the Pamplin chapter of American Assoc iation of retired persons will have their regular monthly meeting at the Pamplin Uriited Methodist Church in the friendship hall at 730 p.m. The meeting will last about 30 minutes, after which Susan Bailey of the personnel departm ent of Thomasville FurnitureJ00. in Appomattox will show color movie pictures with"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "personnel departm ent of <mark>Thomasville</mark> FurnitureJ00. in Appomattox will"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "personnel departm ent of <mark>Thomasville</mark> FurnitureJ00. in Appomattox will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [578.66, 176.73, 857.72, 453.63], "bbox_id": "8f8bff6f25", "file": "TimesVirginian_1976_0276.pdf", "page": 1, "text": "Oakville Rnritans Held Auction Over 500 items w ereartl  d at the th. Annual Oakville Ruritan Auction Sale. The sale, held on Saturday, July 10th, at the Oakville school building, drew a crowd estimated at 150 to 200 persons. Part of the people, shown above, were bidding on an item with Ronald Milkier doing the auctioneering. The club wishes it could each person personally that helped to make this a successful sale. Not being able to do this, we do wish to pubhcally thank those who consigned or donated items, those who purchased Rem, and those who volunteered their services in one way or another. We want to say a special ank you to the following busi- nessess that made donations Times Virginian, Appomattox Farmers Supply, Wilbuns Supermarket, Newcomb Auto parts Webbs Tire Company, Dixie Blend Station, National Auto Parts, J . E . Sears and C om pany, Poe Hardware, Superior Trees, and Thomasville Furniture Company. M  M Auction Company of Appomattox donated their ser vices to help with auctioneering items. This required over five hours of work. We, the Oakville Ruritan Club, express a sin cere thank you to Russell and Ronald Millner for their help. The Ruritan organization is dedicated to community service. The proceeds of this sale will be used in several of the on-going community service projects of the Oakville Ruritan Club. Tlravii Poole"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Hardware, Superior Trees, and <mark>Thomasville</mark> Furniture Company. M  M"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Hardware, Superior Trees, and <mark>Thomasville</mark> Furniture Company. M  M"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2394.9, 1155.31, 2540.75, 1802.02], "bbox_id": "e9ca5f6c4c", "file": "AppomattoxNewspapers_1971-1973a_0583.pdf", "page": 1, "text": "number of facilities involved increased 10 rising from the 140 announcements in 1971 to 155 in 1972. A total of 15,150 manufact uring jobs are expected from 1972 announcements. These employment opportunities are the result of 75 new plants that have located or plan to locate in Virginia which will employ about 7,600 and 80 expansions of existing facilities which will add approximately 7,550 jobs. In 1971, there were 75 new plants with anticipated em ployment of 9,100 and 65 expansions which added about 5,020 jobs for a total of 14,120. As can be seen from the above figures, expansions were up substantially from last year. Twenty-seven existing plants have added or expect to add 100 or more employees. Those expansions with plans to hire 300 or more new employees include International Business Machines, Manassas, 650 Lie- bherr - America, Newport News, 650 Atlantic Furniture Mfg. Co., Inc., Norfolk, 300 Columbia Yacht Company, Chesapeake, 300 General El ectric Company, Portsmouth, 300 Goodyear Tire and Rubber Company, Danville, 600 and Quality Mills, Inc., Hillsville, 300. Of the 75 new plants, thirty-three will employ 100 or more persons. Those employ ing greater than 300 are Thomasville Furniture Indust ries, Appomattox, 700 Ameri can Furniture Company, Chii- howie, 600 General Electric Company, Winchester, 400 and Standard Garments, Inc., Chatham, 350. During 1972, there were 40 announcements which indicat ed an investment of 1 million or more. Of these, 27 were for expansions and 13 for new facilities. Ior the year 1971 there were 28 announcements with a 1 million or greater"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "greater than 300 are <mark>Thomasville</mark> Furniture Indust ries, Appomattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "greater than 300 are <mark>Thomasville</mark> Furniture Indust ries, Appomattox,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.51, 1079.22, 1886.61, 1190.72], "bbox_id": "285dd6656f", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "November 14 - Thomasville Furniture Industries has com pleted its acqusition of about 100 acres of land at Appomat tox. The Company, one of the nations largest producers of furniture for the home, had taken an option on the property in mid July."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "November 14 - <mark>Thomasville</mark> Furniture Industries has com"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "November 14 - <mark>Thomasville</mark> Furniture Industries has com"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [680.14, 811.94, 859.29, 1005.79], "bbox_id": "4d2f300275", "file": "AppomattoxNewspapers_1960-1962b_0587.pdf", "page": 1, "text": "Next Thursday evening, April 19, beginning at 7 30 P. M., the ladies of Walkers Church, will have a re ception, at the church, honoring the new minister and his lamuy. Mrs. Jim Carson will he in charge of it. Mr. 3. S. Hix, of Thomasville, N. C. is expected to spend Tuesday and Wednesday nights in the home pf hi sister, MiSe .Maggie Hix. Mrs. Walter Lorenze, of Mine Will., N. J.f is the guest o her par ents, Mr. and Mm E. A. Covington  this week  Mr. Hunter Baldwin is to enter the McGuire Hospital in Richmond on Tuesday, April 17, to undergo  surgery."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "3. S. Hix, of <mark>Thomasville</mark>, N. C. is expected"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "3. S. Hix, of <mark>Thomasville</mark>, N. C. is expected"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [457.67, 542.43, 603.42, 866.06], "bbox_id": "0896246476", "file": "TimesVirginian_1981a_0394.pdf", "page": 1, "text": "Nativity scene -placed on th e lawn at Thomasville. Mrs. Wendy Ric hardson is the art teacher at ACHS. She also sponsors the art dub. Students who take physical education always stay active. One physical education prog ram that is unfamiliar to most people is the adaptive physical education class. This d û s is for the handicapped students at ACHS. M rs. Lucy H arris teaches the class of five, three of whom are in wheel chairs. Students in this class play the same sports as other P. E. students, but the games are adapted to meet their needs. Mrs. Harris said, The students play basketball, archery, tennis and all other sports we just modify the rules and limit .the playing area. Students who take foreign language at ACHS have numerous- activities in which they can participate. Mr. Thomas Terry teaches Latin, and Mrs. Marce McKay teaches"}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "th e lawn at <mark>Thomasville</mark>. Mrs. Wendy Ric hardson"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "th e lawn at <mark>Thomasville</mark>. Mrs. Wendy Ric hardson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.5, 1624.86, 1669.94, 1745.51], "bbox_id": "9f07325b38", "file": "AppomattoxNewspapers_1960-1962b_0459.pdf", "page": 1, "text": "N to attend the Hog W meeting at ManaUn Saturday, Mias Mary I of Thomasville, N. r  ral days with her W . Twyman WiUiams- t writing another hook, f,  7 Rappahannock  haring been quite a I remaining, copies I Panting haring told I original price."}, "highlight": {"text": {"matched_tokens": ["Thomasville"], "snippet": "Mias Mary I of <mark>Thomasville</mark>, N. r  ral days"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville"], "snippet": "Mias Mary I of <mark>Thomasville</mark>, N. r  ral days"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
