{"document": {"bbox": [926.41, 468.78, 1121.14, 1076.31], "bbox_id": "d77c6845a7", "file": "TimesVirginian_1984a_0107.pdf", "page": 1, "text": "Y M C A . . Mr. Finch assumed the presidency of Thomasville Furniture in 1961, a position his father, T. Austin Finch, and grandfather, Thomas Jefferson Finch, both held before him. It was under Tom A.. as he was affectionately called throughout the industry, that the 80-year-old furniture company became à powerful force in the national marketplace. Mr. Finch served as a director of Inlegon Corporation and Wachovia Bank ana Trust Company, both in Winston Salem, NC, Armstrong World Industries hi Lancaster, PA, and the Norfolk Southern Railway in Washing ton, DC. He was a past president of the Southern Furniture of the South. In 1963. he was selected as Furniture Man pf the Year by the American Furniture Mart.  Mr. Finch was a trustee of the Medeira School. Greenway, VA Duke University, Durham, NC and Wood- berry Forest School, W oodberry Forest, VA. He also served as a trustee of the Davidson County Public Library System as well as Thomasvilles Community General Hospital. He was act ive in the development of the Thomasville Family YMCA, serving on the board of directors, and in 1975 received the YMCA Industrialist of the Year Award. Mr. Finch sat as a member of the Davidson County Bicentennial Commit tee and was à member mid past president of the Thomasville Rotary Club. He was graduated with honors from Woodberry Forest in 1940 and from Princeton University in 1943, where he was a Phi Beta Kappa. He then served as lieutenant in the United States Navy in 1946. He was a member of the Everglade Çlub in Palm Beach, FL, and the Met ropolitan Club in New York City. rived by his w ilv. i Clark Slane of- , PMVIfe five children  TfirtifiâsAusnlIfT IH .ofNew York City John Lambeth of High Point Sumner Slane of Chapel Hill David Slane and  Meredith Kempton, both of Thomàs- ville, and three grandchildren. Services were held at 400 p.m. on"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "assumed the presidency of <mark>Thomasville</mark> <mark>Furniture</mark> in 1961, a position"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "assumed the presidency of <mark>Thomasville</mark> <mark>Furniture</mark> in 1961, a position"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2005.22, 1145.7, 2296.11, 1480.86], "bbox_id": "7997d81edf", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "with the wage adjustment we have scheduled to go into effect on July 31, will go a long way toward offsetting the effects of the sharply-rising inflation we are now experiencing in this country, Finch said. Also,the additional time off with pay is som ething th a ts of great interest to employees and their families today, and wè believe its important to reflect that interest in our benefit pro grams. The new benefits will apply to all Thomasville Furniture Industries employees except those employees at the companys W est Jefferson Plant who are represented by a recently-certified union. Wa ges and benefits for bargaining unit members at West Jeffer son are mandatory subjects for negotiations with the union as required by law, he said. Competency Tests Required Before H. S. Graduation"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "will apply to all <mark>Thomasville</mark> <mark>Furniture</mark> Industries employees except those"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "will apply to all <mark>Thomasville</mark> <mark>Furniture</mark> Industries employees except those"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1214.17, 1451.19, 1333.16, 1480.54], "bbox_id": "2f70f1316f", "file": "AppomattoxNewspapers_1974-1975a_0374.pdf", "page": 1, "text": "WILLIAM L. LOWE Vice President and General Manager Transmark Operations. Division of Thomasville Furniture Industries"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "WILLIAM L. LOWE Vice President and General Manager Transmark Operations. Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "WILLIAM L. LOWE Vice President and General Manager Transmark Operations. Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [705.08, 235.15, 836.97, 509.51], "bbox_id": "4199634f80", "file": "TimesVirginian_1980a_0326.pdf", "page": 1, "text": "weekend with his parents, Mr. and Mrs. Ed Davis. The Pamplin Chapter of AARP will meet Thursday October 9 at the Pamplin United Methodist Church in the friendship hall at 730 p.m. Susan Bailey of the personnel departm ent of Thomasville Furniture Co mpany w ill show color pictures and also give a talk on the operation of the company. Refreshments will be served and the public is .invited. Mrs. C. V. Wingfield returned home Saturday after spending some time in Norfolk with her sister and brother-in-law, Mr. and Mrs. Harold Southern. They attended the funeral Satur day of their cousin, Mrs. Mary Williams Bonwèll Brown in Keysville on Saturday."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "personnel departm ent of <mark>Thomasville</mark> <mark>Furniture</mark> Co mpany w ill"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "personnel departm ent of <mark>Thomasville</mark> <mark>Furniture</mark> Co mpany w ill"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [294.67, 1072.85, 816.29, 1350.2], "bbox_id": "c21bc727e8", "file": "AppomattoxNewspapers_1974-1975a_0461.pdf", "page": 1, "text": "We reserve the right to limit quantities TO THE EDITOR Dear Mr. Vaughn, I would like to take this opportunity to express through your paper, my most sincere appreciation to all of those that helped in making the Blood mobile a success. I would like to express deep appreciation to the Junior Womens Club here in Appoma ttox, Virginia, along with Mrs. Lucy Harvey, the local radio station, W.T.T.X. and its manager Mr. Joe Cusaac, the Appomatox Garment Factory, the local grocery stores, Thomasville Furniture Plant, and all of thosewho made public announcements in helping us reach our goal, especially in the matter of securing that blood which was short at the Blood Bank. I would also like to express my appreciation to the employ-"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "the local grocery stores, <mark>Thomasville</mark> <mark>Furniture</mark> Plant, and all of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "the local grocery stores, <mark>Thomasville</mark> <mark>Furniture</mark> Plant, and all of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2460.68, 953.66, 2604.58, 1198.85], "bbox_id": "3202acbcae", "file": "AppomattoxNewspapers_1971-1973a_0384.pdf", "page": 1, "text": "We aredesigningtheplantto facilitate future expansion, he commented,  if this becomes desirable Uh the growth in our busines1 Thomasville Furniture In dustries is an affiliate of Arm strong Cork Company, Lancast er, Pennsylvania. Armstrong and its associated companies are leading producers of inter ior furnishings, including re silient flooring, carpeting, and ceiling systems, as well as fur niture. The parent company also makes a variety of specialty products for the textile, auto motive, shoe and construction industries. The new Appomattox plant will be the 20th Thomasville Furniture Industries manufact- contd. to Page 2"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "growth in our busines1 <mark>Thomasville</mark> <mark>Furniture</mark> In dustries is an"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "growth in our busines1 <mark>Thomasville</mark> <mark>Furniture</mark> In dustries is an"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2015.52, 657.3, 2591.5, 1145.13], "bbox_id": "99c2fffe54", "file": "AppomattoxNewspapers_1974-1975a_0115.pdf", "page": 1, "text": "W. L. LOWE, Vice-President and Plant Manager at the Appomattox plant, Thomasville Furniture Industries, Inc., spoke to management Thursday morning of last week just prior to the first carload shipment of furniture made at the new plant. Production at the plant, the largest and most modern furniture manufacturing facility in the world, is at or above expectations at this time and according to Lowe the, is only one way to go and that is up!  . s r ,,. v w ? .vi Approximately 200 persons are now employed at TFIs Appomattox plant. Additional workers will be hired to meet production needs in the future. y a cooperative venture which came into existence when the Consortium of Colleges, the Greater Lynchburg Chamber of Commerce, the Central Vir ginia Planning District Com mission and City Gate discov ered that they were all involved in goals setting for Central Virginia. A steering committee was organized with members from each of the groups serving on the committee. Modeled after the Hartford Process, CVT was hired representatives of Am erican City Plan as advisors to the Process. The eventual oal of allowing the citizens of each eontmunity to choose what- they think Is belt for their community in business, economics, education jind social welfare, and th e 1 members of steering committee think the- best way to obtain that goal is through workshops with residents of a jurisdiction actually doing their own plan ning and goals setting. Unlike the weather, wfaich you cant do anything about, you can make your community a better place to live. The first step is recognizing what will help, and then implementing plans and projects to change it for the better. That is the purpose of todays workshops."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "at the Appomattox plant, <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., spoke to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "at the Appomattox plant, <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., spoke to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1889.0, 723.39, 2028.05, 806.09], "bbox_id": "e838384e21", "file": "AppomattoxNewspapers_1974-1975a_0226.pdf", "page": 1, "text": "ty High School and attended Virginia Commonwealth Uni versity in Richmond. A native of Appomattox County, she is married to Michael Shatter of Springfield, an employee at Thomasville Furniture Indus tries, Inc. She is the daughter"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Springfield, an employee at <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Inc. She"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Springfield, an employee at <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Inc. She"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2281.56, 1526.83, 2426.21, 1785.72], "bbox_id": "46d344f47a", "file": "TimesVirginian_1976_0096.pdf", "page": 1, "text": "trial revenue bonds that were issued at the time the plant was built for Virginia Metal Products in 1973. In announcing plans for the new manufacturing facility, Tom A. Finch, president of Thomasville Furniture, said, We look forward to being a part of the Brookneal commu nity. , Weve had a fine experience with our new plant at Appomattox, about 35 miles north of here, and we know that one reason for this is the character of the people in this section of Virginia. They re capable, industrious people, and they care about the communities they live in. We - try to be good corporate citizens wherever pur plants are located, and this is the kind contd on page 6"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "A. Finch, president of <mark>Thomasville</mark> <mark>Furniture</mark>, said, We look forward"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "A. Finch, president of <mark>Thomasville</mark> <mark>Furniture</mark>, said, We look forward"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [342.24, 963.05, 487.73, 1057.59], "bbox_id": "bfc28b3a61", "file": "TimesVirginian_1981a_0135.pdf", "page": 1, "text": "three peittml? Who art not affiliated with the company. Tom A. Finch, chairman of Thomasville Furniture, pre sented the scholarship awards at the banquet Tuesday night which was attended by students, their parents and high school administrators."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "A. Finch, chairman of <mark>Thomasville</mark> <mark>Furniture</mark>, pre sented the scholarship"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "A. Finch, chairman of <mark>Thomasville</mark> <mark>Furniture</mark>, pre sented the scholarship"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2132.27, 1483.86, 2400.52, 1788.83], "bbox_id": "5f16392772", "file": "TimesVirginian_1976_0096.pdf", "page": 1, "text": "Thomasville Plans Expansion In Brookneal Tentative plans for a new manufacturing plant at Brook neal, Campbell County, Va., were announced today by Thomasville Furniture Indus tries. The new plant, which would be used for the production and warehousing of household furniture, would occupy an existing 191,000-square-foot bulding formerly used by the Virginia Metal Products Com pany, a subsidiary of Gray Manufacturing Company. Thomasville Furniture has reached agreement with the Industrial Development Auth ority of Campbell County for a long-term lease including pur chase options on the building and its 110-acre industrial site. The agreement is subject to approval by holders of indus"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "were announced today by <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries. The new"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "were announced today by <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries. The new"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [394.09, 198.86, 538.33, 792.98], "bbox_id": "c2b36e23f8", "file": "TimesVirginian_1976_0099.pdf", "page": 1, "text": "THOMASVILLE PLANS EXPANSION IN BROOKNEAL contd from page 1 of community spirit we like to share.   . Finch said that no timetable has been established ss to when the plant would beginproduc tion, nor has an employment figure been determined. It is expected, he said, that most of the employee force for the new facility would be hired from the Brookneal area and other parts of Campbell County, although some supervisory personnel would probably be transferred from other Thomaaville plants. The plant site is situated just west of Brookneal. It fronts on U. S. Route 501 and is served by the Norfolk and. Western Railway. Thomasville Furniture Indus tries is a maker of high quality bedroom, dining room, and living room furniture sold under the Thomasville, Found ers, and Huntley names. It is based a t Thomasviild, N.C. and is a subsidiary of A rm strong jCork Company, Lancaster, Pa. Armstrong and its associated companies are also leading producers of interior furnishings, including resilient flooring, carpeting, and ceiling systems. H ie parent company also makes a variety of specialty products for the building, textile, automotive, and other industries. The new plant at Brookneal would be the 21st Thomasville Furniture Industries manufact uring facility. All of the other 20 are located in the Southeast-one in Virginia at Appom attox, T8 in. North Carolina, and one in Mississippi .Another Armstrong affiliate, E  B Carpet Mills, Inc., operates a carpet yarn spinning plant at Keysville, Va."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Norfolk and. Western Railway. <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries is a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Norfolk and. Western Railway. <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries is a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [286.55, 471.27, 438.05, 1157.73], "bbox_id": "fa24fe46cb", "file": "TimesVirginian_1978_0571.pdf", "page": 1, "text": "THOMASVILLE, N.C. Thomasville Furniture In dustries today announced wage increases and benefits im provements for its employees at the Phenix Chair Plant in West Jefferson, N.C. Employees wifi receive a general wage increase, im proved vacation pay, and im provements in the medical in surance plan and accident and sickness benefits, effective today. Beginning in January, em ployees wifi receive additional vacation time off, as well as the addition of Memorial Day as a paid holiday. Tom A. Finch, president of Thomasville Funiiture In dustries, said, The adjustmen ts are being made by the com pany because contract negotiations with the United Furniture Workers Union Local 267, which represents the West Jefferson employees, have readied an impasse. After 24 bargaining sessions held over the past four months, negotiations between the Phenix Chair Company and the union have clearly reached an impasse, Finch said. The companys proposals for a con tract were rejected last week by the union committee and the membership. Accordingly, the company is putting the economic proposals into effect in their entirety, ef fective immediately, Finch said. Since an impasse has oc curred, in the absence of a con tract with the union, the com pany may put into effect these wage and benefit adjustments.  The wage increase ranges from 20 cents to. 37.. cents per hour. The average increase will beaboigM cents per bour. , Major medical insurance maximum coverage is being doubled, hospital room and board coverage is being in creased and weekly accident and sickness benefits are being increased. Christmas Tree Is a Tradition In Many Lands"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "THOMASVILLE, N.C. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries today announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "THOMASVILLE, N.C. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries today announced"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2019.06, 861.61, 2160.27, 946.51], "bbox_id": "727ebed55b", "file": "TimesVirginian_1978_0425.pdf", "page": 1, "text": "Thomasville, N. C., Septem ber 22 - The National Labor Relations Board in Winston-Sa lem will dismiss an unfair labor practice charge brought against Thomasville Furniture Indus tries by the Industrial Union D ep artm ent nf the AF1.-C10."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "practice charge brought against <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "practice charge brought against <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries by the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [574.7, 799.72, 731.12, 1087.56], "bbox_id": "9ed39d3620", "file": "TimesVirginian_1978_0004.pdf", "page": 1, "text": "Thomasville Furniture was producing furniture of excellent quality and to market a good s line of furniture, popular in price, would in some instance be misleading to the Thonfas-  ville line and also to the new, lower priced line thus the name, Armstrong Furniture, growing out of Thomasville F urniture and Arm strong Cork.  The local plant of Armstrong Cork, Armstrong Furniture, Bill Lowe, plant m anager, employ s in excess of 600 people, and is proud- to provide t furniture  to the Holiday Inn chain and furniture for the rental industry, among others. Armstrong, Appomattox is proud that you are a part, our industrial picture!  Next week, well take a look at ohei industries in Appomat tox.  N   n ------------"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture", "furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> was producing <mark>furniture</mark> of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture", "furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> was producing <mark>furniture</mark> of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1578.19, 1711.68, 1859.67, 1791.52], "bbox_id": "a9622349f8", "file": "TimesVirginian_1978_0570.pdf", "page": 1, "text": "Thomasville Furniture Industries, Inc. recently announced that William L. Lowe, Plant Manager and Vice President ofthe Armstrong Furniture Division in Appomattox, has been named to its Board of Directors. Mr. Lowe has been with Armstrong since 1965, and came to the nm nasville organization in July of 1970. He has been Manager of the Appomattox facility since its inception in June of 173."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. recently announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. recently announced"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1416.51, 988.24, 1697.29, 1042.19], "bbox_id": "af5e025869", "file": "TimesVirginian_1978_0079.pdf", "page": 1, "text": "Thomasville Furniture Industries, dose attention to detail ni careful hand-finishing are outstanding features of A n n  n g s new First Family case pieces. This handsome armoire has the look and feel of fine hardwood, but is prired much I owct than comparable furniture. The piece retails for about 250."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries, dose attention to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries, dose attention to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2034.59, 736.19, 2272.96, 770.84], "bbox_id": "03193985eb", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "Thomasville Furniture Industries Announces Wage Increases"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries Announces Wage Increases"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries Announces Wage Increases"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1744.1, 1020.97, 2006.79, 1040.89], "bbox_id": "edb1222234", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "Thomasville Furniture Industries"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> Industries"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1874.4, 856.04, 2447.58, 894.23], "bbox_id": "336bab4591", "file": "AppomattoxNewspapers_1971-1973a_0388.pdf", "page": 1, "text": "THOMASVILLE FURNITURE INDUSTRIES"}, "highlight": {"text": {"matched_tokens": ["THOMASVILLE", "FURNITURE"], "snippet": "<mark>THOMASVILLE</mark> <mark>FURNITURE</mark> INDUSTRIES"}}, "highlights": [{"field": "text", "matched_tokens": ["THOMASVILLE", "FURNITURE"], "snippet": "<mark>THOMASVILLE</mark> <mark>FURNITURE</mark> INDUSTRIES"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2032.69, 783.82, 2180.78, 1103.91], "bbox_id": "7006a99743", "file": "TimesVirginian_1978_0318.pdf", "page": 1, "text": "Thomasville Furniture In dustries has announced wage increases which will be effective July 31. According to Tom A. Finch, president of Thomasville Furni ture Industries, the company reviews wages twice each year. One wage adjustm ent has already been made in 1978. This particular wage adjust ment is being made now because of the unusual econo mic circumstances we currently face in this country, Finch said. Sharply-rising inflation during the first half of 1978 haz meant ttdPtofaM employees Me TbqSSv ur niture Industries plants, and we feel the need to respond to this situatioU. Finch pointed put that wage reviews include a performance review for each employee, and that individual wage increases are based on merit.. The July 31 adjustment rill be differ ent, he said, because it will include both a merit increase"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> In dustries has announced"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "<mark>Thomasville</mark> <mark>Furniture</mark> In dustries has announced"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.03, 655.81, 1847.04, 892.6], "bbox_id": "ccda85b4b7", "file": "TimesVirginian_1978_0180.pdf", "page": 1, "text": "Thomasville F urniture Industries, Iuc., award six scholarships each year to graduating seniors whose parents are employees of the company. Only six scholarships from the entire corporation are awarded and this year two Appomattox County High School seniors are recipients of scholarships through the Armstrong Furniture plant located here. The T. Austin Finch Scholarships, awarded to sons and daughters of employees at the local plant, have been presented to Connie Murray and Walker Covington, In the above photo  are, left to right, Mrs. James Murray and her daughter, Connie, and Walker Covington and his father, Mr. Beryl Covington. Connie is the daughter of Mr. and Mrs. James Murray. She plans to enter Longwood College in the fall and major in Physical Education. Walker is the son of Mr. and Mrs. Beryl Covington. He plans to enter The College of William and Mary in the fall and major in Pre-Law.   I . The scholarships are awarded based on merit qualifications and needs of the applicant and take into account good moral character of students. With only six scholarships awarded by the entire corporation of Thomasville Furniture Industries, Inc., it is extra good to know that two of these are going to ACHS seniors."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "the entire corporation of <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., it is"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "the entire corporation of <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., it is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1469.32, 692.89, 1861.07, 734.34], "bbox_id": "87dd440546", "file": "AppomattoxNewspapers_1974-1975a_0296.pdf", "page": 1, "text": "This visit, sponsored by Thomasville Furniture Industries, was conducted from 9 a.m. unti on Tuesday at the Liberty Baptist Church and from a report there had been a total of 100 blood donated, making this visit very successful. . Thé Rev. Ernie Lucas is Chairman of the Blood Program in Appomattox County."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "This visit, sponsored by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, was conducted from"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "This visit, sponsored by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, was conducted from"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.78, 1068.96, 1840.48, 1325.95], "bbox_id": "9d3c51c5f1", "file": "AppomattoxNewspapers_1971-1973a_0419.pdf", "page": 1, "text": "The Virginia Employment Commission, at the request of Thomasville Furniture Indust ries, conducted a Labor Supply Survey of Appomattox County August 11th and 12th. With a total of 1668 persons registering during the two-day survey, the representatives of the VEC and representatives from Thomasville Furniture Industries termed the survey a great success. A report prepared by the Manpower Research Division of. the Virginia Employment Commission has been released and figures show that during the recent survey 764 males and 904 females responded. Age-wise, 425 were from 18 to 24 years old, 476 were between 25 and 34 years old, 374 were"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "at the request of <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries, conducted a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "at the request of <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries, conducted a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.88, 771.37, 1997.51, 1066.71], "bbox_id": "4b081a3b66", "file": "AppomattoxNewspapers_1971-1973a_0411.pdf", "page": 1, "text": "The V i r g i n i a Employment Commission, at the request of Thomasville Furniture Industr ies of Thomasville, N.C., made a survey on people interested in employment in the Appomat tox area on Friday and Satur day, August 11th and 12th, at th e Appomattox Intermediate School. Thomasville is planning to construct a major manufactur ing facility in Appomattox and needed to know if there was a sufficient supply of capable la bor available in the area. During the sign-up period on Friday, from 9 a.m. until 9 p.m., 850 persons registered and on Saturday, from 9 a.m. until 5p m., 818 persons registered, making a total of 1668 persons showing an interest in employ ment in the Appomattox area. Persons from a wide geographic area came to Appomattox and filed the report. Wells,with the V.E.C,brought"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture", "Thomasville"], "snippet": "at the request of <mark>Thomasville</mark> <mark>Furniture</mark> Industr ies of <mark>Thomasville</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture", "Thomasville"], "snippet": "at the request of <mark>Thomasville</mark> <mark>Furniture</mark> Industr ies of <mark>Thomasville</mark>,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1990.57, 572.39, 2135.53, 839.68], "bbox_id": "d7a71788dd", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "The president of the United Paperworkers Union was in dicted July l9th on charges of embezzling 360,000 in union funds and using part of the money to try to derail a federal investigation of his conduct. The Paperw orkers Union currently represents employ ees in firms that manufactures paper, boxes, and other paper products and has recently indicated that it will attempt to organize w orkers at the Thomasville Furniture Indus tries plant here in Appomattox. A federal grand jury in Brooklyn, New York charged that Joseph Tonelli, president of the 300,000 member union, and union treasurer Henry Segal hired two A tlanta attorneys to intervene with officials of the Justice Depart ment on their behalf."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "w orkers at the <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries plant here"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "w orkers at the <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries plant here"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1625.73, 1304.15, 1761.43, 1426.7], "bbox_id": "f43d97482c", "file": "AppomattoxNewspapers_1974-1975a_0134.pdf", "page": 1, "text": "The Lions Club of Appomat tox will meet at Maudes Restaurant at 645 p.m. on Thursday, January 9,1975. Guest speaker for the eve ning will be Mr. William Lowe, Vice-President and Plant Man ager at Thomasville Furniture Industries, Inc. - Appomattox Plant. All members will want to be present for this meeting."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Plant Man ager at <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. - Appomattox Plant."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Plant Man ager at <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. - Appomattox Plant."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1788.71, 1312.6, 1926.11, 1404.2], "bbox_id": "462ea7b5eb", "file": "AppomattoxNewspapers_1974-1975a_0140.pdf", "page": 1, "text": "The Lions Club of Appomat tox will meet at Maudes Restaurant at 645 p.m. on Thursday, January 9,1975. Guest speaker for the eve ning will be Mr. William Lowe, Vice-President and Plant Man ager at Thomasville Furniture Industries, Inc. - Appomattox"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Plant Man ager at <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. - Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Plant Man ager at <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. - Appomattox"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.99, 1407.09, 1918.73, 1740.58], "bbox_id": "9d3edb78e2", "file": "AppomattoxNewspapers_1974-1975a_0281.pdf", "page": 1, "text": "The first visit of the new fiscal year of the American Red Cross Bloodmobile to Appomat tox County has been set for Tues., May 27. This visit is being sponsored by Thomasville Furniture In dustries and the hours will be from 9 a.m. until 3 p.m. and will be held as usual at Liberty Baptist Church. The hours for this visit have been changed to accommodate Thomasville and if as successful as we hope it will be, Thomasville plans to sponsor another visit during the coming year. Memorial United Methodist Church women will be in charge of the canteen for this visit. The quota for the first visit is set at 102 units of blood and you are reminded that 17 year olds may donate blood with parental consent. Rev. Earnie Lucas, Chairman of the Blood Program, urges everyone to make every effort to come out on May 27 and donate a unit of blood which is so badly needed to supply the blood bank."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "is being sponsored by <mark>Thomasville</mark> <mark>Furniture</mark> In dustries and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "is being sponsored by <mark>Thomasville</mark> <mark>Furniture</mark> In dustries and the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [383.5, 493.72, 524.5, 1114.24], "bbox_id": "8ce08f6594", "file": "AppomattoxNewspapers_1971-1973a_0412.pdf", "page": 1, "text": "The Editor Appomattox, Va. August 14, 1972 Mr. Lloyd Vaughan, Editor Times-Virginian Appomattox, Va. 24522 Dear Mr. Vaughan The response to the la b o r survey last week was a compli ment to the Greater Appomat tox Community. The result for exceeded my fondest expecta tions. This was possible be cause many people thought that it was important. Thomasville Furniture In dustries insisted that before in vesting in a multi-million dol lar plant, they would need to be assured of an adequate labor supply. There are many people who need to be thanked  the School Board for providing a facility for the survey, the 46 volunteers who gave their time to help fill our the questionaires, the Post Office for distributing the an nouncements, the many busi nesses that allowed us to post a notice that the survey would be conducted,the churches and civic groups that made an nouncements concerning the sur vey, and of course the Times- Virginian for their excellent news coverage of this effort. Persons from a wide geo graphic area came to Appomat tox and filed a report. This strong backing was acknowledg ed by the Virginia Employment Commission. On two occasions it was necessary to have ad ditional forms printed. Time after time, representa tives of Thomasville Furniture expressed their amazement. They continued to point out that the number was impressive but also the quality of people was even more outstanding. On behalf of the Appomattox County Development Corporat ion, I want to express our ap preciation for the fine respon se. Yours very truly, James A.Smith, President"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "that it was important. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries insisted that"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "that it was important. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries insisted that"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2021.73, 456.22, 2160.65, 633.25], "bbox_id": "ecea5fab3f", "file": "AppomattoxNewspapers_1971-1973a_0511.pdf", "page": 1, "text": "The Board of Directors of the Industrial Development Authority of the County of Appomattox, Virginia, will convene on November 10, 1972, at 1000 a.m. in the board room at the Farmers National Bank for the purpose of taking formal action on a resolution to acquire a tract of 0.48 acres to be donated by the Industrial Development Authority to Thomasville Furniture Indus tries, Inc. The meeting of the board of Directors is open to the public."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Industrial Development Authority to <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Inc. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Industrial Development Authority to <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Inc. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [270.5, 721.84, 548.14, 940.45], "bbox_id": "8ea8370cbd", "file": "AppomattoxNewspapers_1974-1975a_0264.pdf", "page": 1, "text": "The April Career Assembly was held in the Appomattox County High School Auditorium April 16, 1975. This months program centered on the proper techniques for a job application and job interviews. Mrs. Polly DePew Guidance Counselor and advisor for the Career Assembly opened our monthly meeting by explaining the program and introducing the guests. Students from ACHS also prepared a skit showing the proper and improper way of applying for a job interview. Students participating were Lynn Allen Smith a member of the Distributive Education Clubs of America who was Personnel Manager. Cindy Guill and Julie Moore were both secretaries applying at the job interview and Gay Honeycutt was receptionist for the skit. Also as our guest for the assembly we had Mr. Roger Redman, , Personnel Director at Thomasville Furniture Industries, and Mr. Buddy Carson, Personnel Director at Appomattox Garment Company. Both men discussed the qualities looked for in an individual when applying for a job and also job attitudes and opportunities. The April Career Assembly was very successful and informative. The meeting was adjourned and the student body was dismissed. __________"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Redman, , Personnel Director at <mark>Thomasville</mark> <mark>Furniture</mark> Industries, and Mr. Buddy"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Redman, , Personnel Director at <mark>Thomasville</mark> <mark>Furniture</mark> Industries, and Mr. Buddy"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2297.43, 1014.13, 2443.55, 1417.51], "bbox_id": "2796025735", "file": "AppomattoxNewspapers_1971-1973a_0451.pdf", "page": 1, "text": "The Appomattox Town Cou ncil meeting in regular session on Monday night, September 18th, voted to retain Common wealth Attorney, W. Sam Kerr, as attorney for the Town. Council voted, also, to fur nish materials for curbing and gutters to be put on both sides of High Street from Moses Street down to Bandana Street with the Highway Department employees doing the work. A resolution to this effect was approved and will be sent to the area office of the Virginia Department of Highways. In other business, a resolu tion was passed by council asking the State Highway Department to extend Hunter Street past the new well site. A resolution to extend Virginia Avenue to the town limits, which will carry Vir ginia Avenue into property under option by Thomasville Furniture Industries, was carried and the resolution will be sent to the area office of the Virginia Department of High ways. Motion was made to delete that part of the Code of the Town of Appomattox that states the Clerk of the Council Cont. on jftge 5"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "property under option by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, was carried and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "property under option by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, was carried and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2159.31, 615.63, 2341.57, 854.2], "bbox_id": "2af901a2d2", "file": "TimesVirginian_1983a_0468.pdf", "page": 1, "text": "The Appomattox Assembly extends its thanks and appreciation to those individuals making contributions to the Reverend R. Q.. Lowing, Sr. Memorial Scholarship Fund said Thomas A. Chilton, Sr. Assembly president. The following additional contribu tions have been made G. Lewis McDearmon. 25.00 Fred Smith, 50.00 Mrs. Beulah S. Morgan, 100.00 Amrican Federal Savings and Loan Appomattox, 50.00-, Fellowship of Armed Forces Retirees, 50.00 Thomasville Furniture Industries, Inc., 500.00 Dr. Larry Smith, 100.00 Family Practice Center, 50.00 Lloyd Walton, 15.00 and Mrs. Vivian Morris. 25.00. Correction"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Armed Forces Retirees, 50.00 <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., 500.00 Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Armed Forces Retirees, 50.00 <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., 500.00 Dr."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [751.44, 460.55, 895.79, 553.64], "bbox_id": "ebd6de38e7", "file": "TimesVirginian_1981a_0072.pdf", "page": 1, "text": "son and, the làte Mr. Julian E. Holt. Theresa is employed at Thomasville Furniture Indust ries, in Appomattok, Va. Gene is the son of Mrs. Alice Ferguson and the late Aubrey E. Baldwin. Gene is employed with the Appomattox County Sheriff Department."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Theresa is employed at <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries, in Appomattok,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Theresa is employed at <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries, in Appomattok,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2427.27, 1108.23, 2569.71, 1184.73], "bbox_id": "dfa9808e6d", "file": "TimesVirginian_1976_0285.pdf", "page": 1, "text": "residential and contract bed room- furniture is a Division of Thomasville Furniture Indus- ties, Inc.,  a wholly owned subsidiary of Armstrong Cork Company, Lancaster, Pennsyl vania."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "residential and contract bed room- furniture is a Division of <mark>Thomasville</mark> <mark>Furniture</mark> Indus- ties, Inc.,  a wholly owned subsidiary of Armstrong Cork Company, Lancaster, Pennsyl vania."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "residential and contract bed room- furniture is a Division of <mark>Thomasville</mark> <mark>Furniture</mark> Indus- ties, Inc.,  a wholly owned subsidiary of Armstrong Cork Company, Lancaster, Pennsyl vania."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.44, 1552.65, 1853.39, 1727.24], "bbox_id": "92c7b62584", "file": "AppomattoxNewspapers_1974-1975a_0195.pdf", "page": 1, "text": "Redman, Personnel Manager at Thomasville Furniture Indus tries, Appomattox plant, was elected Director and J. E. Jamerson, former Vice Presi dent was elected Vice Chair man of the Board of Directors. Other officers elected were 1 Eleanor C. Conner, Assistant  Cashier and Ellen R. Martin, Assistant Cashier. In addition to the newly elected Director, Roger Red man, Directors include the j officers listed above and W. M. I Abbitt, E. W. Carson. John C. ! Cole, J. B. Drinkard, Jr., John"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Redman, Personnel Manager at <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Appomattox plant,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Redman, Personnel Manager at <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Appomattox plant,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2338.78, 803.36, 2481.18, 968.6], "bbox_id": "3fe854e353", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "Realty and 0.48 acres of land owned by Humble Oil Com pany that had been purchased by the Industrial Development Authority of A p p o m a t t o x County and was donated to Thomasville Furniture Indus tries. According to Mr. Sydansk, of Armstrong Cork Company, engineering is preceeding in the project and when complet ed, plans will then be let for bids, and we can look forward to the beginning of constuctlon."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "and was donated to <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries. According to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "and was donated to <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries. According to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2439.06, 611.53, 2597.02, 1632.86], "bbox_id": "36be862058", "file": "AppomattoxNewspapers_1971-1973a_0405.pdf", "page": 1, "text": "previous registration, whether with the VEC or other agencies, will not be valid for this survey. You must register at the Appomattox Intermedi ate School on one of the above dates to indicate your interest. Without the proper interest shown NOW, Thomasville will not be able to have a true picture of the labor that will be available. Please take a few minutes of your time Friday or Saturday to indicate your interest in employment in this industry. Please do not wait for the industry to be built and think it will be just as well to register or apply for employ ment then . . . without a favorable labor survey NOW, Thomasville Furniture Indust ries will not be able to proceed with their plans. The Appomattox County Development Corporation is positive that there will be sufficient interest in this survey and wishes to again stress the importance of having a favorable labor survey on August 11th and August 12th. Local volunteers helping with the survey on Friday will be Mrs. A. B. Norconk, Mrs. Louise Plunkett, Rebecca Jamerson, Elizabeth Reynolds, Mike Belter, Janet Hix, Jane Hix, John McCraw, Harriett Redding, Mrs. C. G. OBrien and Mrs. Frances Murray from 900 a.m. until 100 p.m. From 100 p.m. until 500 p.m. the volunteers will be Mrs. Frank Carwile, J. L. Hedrick, Beck Hudson, Frances Paulette, Mrs. John L. Wilson, Mrs. V. L. Hudson, Mrs. C. G. OBrien, Ruby Moses and Agnus Powell, and from 500 p.m. until 900 p.m. on Friday the volunteers will be Mrs. Charlie Hill, Mrs. Besty Carter, Mrs. Nancy Elder, Mrs. Edith Scruggs, Mrs. Nina Beasley, S. B. Waddell, V. O. Mims, J. N. Jennings and Jimmy Rogers. On Saturday morning from 900 a.m. until 100 p.m. the volunteers will be June Chenault, W. T. Coleman, T. E. Pittman, L. E. Thomas, Mrs. Lathan Harvey, Danny Simp son, R. E. Pankey, Ronnie Lewis, Joan Ranson and Mrs. C. C. Houchens. For Saturday afternoon from 100 p.m. until 5 ,0 0 p.m. volunteers are Robert A. Sears, Robert W. Carter, Robert Jamerson, W. M. McGrath, Tom Pankey, Clarence Smith, Charlie Wil liams, Mrs. Wallace Moore, Mrs. Marshall Stratton and Peggy Franklin. In last weeks issue of the Tiines-Virginian, J. A. Smith asked for volunteers to help with the survey, working four hour shifts, and as you can see by the list of names above, the response was great. Initial employment at Tho masville Furniture Industries will begin at 200 to 250 per sons, within a year or two after production begins the plant should be providing employ ment for 600 to 700 persons. Plan now for the future . . . come by the Appomattox Intermediate School on Friday or Saturday and register with the Virginia Employment Commission."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "favorable labor survey NOW, <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries will not"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "favorable labor survey NOW, <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries will not"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1482.51, 640.57, 1679.16, 772.02], "bbox_id": "3ef5291d88", "file": "AppomattoxNewspapers_1974-1975a_0540.pdf", "page": 1, "text": "Pictured above is the sign recently erected at the Thomasville Furniture Industries plant, here in Appomattox. As the sign indicates, this plant carries the name of Transmark Operations and manufactures furniture merchandized as ..from the Indoor World of Armstrong. Thomasville Furniture is a wholly owned subsidiary of the Armstrong Cork Company. The Armstrong Board of Directors met at the plant on Monday, November 24, and heard reports on the progress of the plant."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "recently erected at the <mark>Thomasville</mark> <mark>Furniture</mark> Industries plant, here in"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "recently erected at the <mark>Thomasville</mark> <mark>Furniture</mark> Industries plant, here in"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [578.66, 176.73, 857.72, 453.63], "bbox_id": "8f8bff6f25", "file": "TimesVirginian_1976_0276.pdf", "page": 1, "text": "Oakville Rnritans Held Auction Over 500 items w ereartl  d at the th. Annual Oakville Ruritan Auction Sale. The sale, held on Saturday, July 10th, at the Oakville school building, drew a crowd estimated at 150 to 200 persons. Part of the people, shown above, were bidding on an item with Ronald Milkier doing the auctioneering. The club wishes it could each person personally that helped to make this a successful sale. Not being able to do this, we do wish to pubhcally thank those who consigned or donated items, those who purchased Rem, and those who volunteered their services in one way or another. We want to say a special ank you to the following busi- nessess that made donations Times Virginian, Appomattox Farmers Supply, Wilbuns Supermarket, Newcomb Auto parts Webbs Tire Company, Dixie Blend Station, National Auto Parts, J . E . Sears and C om pany, Poe Hardware, Superior Trees, and Thomasville Furniture Company. M  M Auction Company of Appomattox donated their ser vices to help with auctioneering items. This required over five hours of work. We, the Oakville Ruritan Club, express a sin cere thank you to Russell and Ronald Millner for their help. The Ruritan organization is dedicated to community service. The proceeds of this sale will be used in several of the on-going community service projects of the Oakville Ruritan Club. Tlravii Poole"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Hardware, Superior Trees, and <mark>Thomasville</mark> <mark>Furniture</mark> Company. M  M Auction"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Hardware, Superior Trees, and <mark>Thomasville</mark> <mark>Furniture</mark> Company. M  M Auction"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2394.9, 1155.31, 2540.75, 1802.02], "bbox_id": "e9ca5f6c4c", "file": "AppomattoxNewspapers_1971-1973a_0583.pdf", "page": 1, "text": "number of facilities involved increased 10 rising from the 140 announcements in 1971 to 155 in 1972. A total of 15,150 manufact uring jobs are expected from 1972 announcements. These employment opportunities are the result of 75 new plants that have located or plan to locate in Virginia which will employ about 7,600 and 80 expansions of existing facilities which will add approximately 7,550 jobs. In 1971, there were 75 new plants with anticipated em ployment of 9,100 and 65 expansions which added about 5,020 jobs for a total of 14,120. As can be seen from the above figures, expansions were up substantially from last year. Twenty-seven existing plants have added or expect to add 100 or more employees. Those expansions with plans to hire 300 or more new employees include International Business Machines, Manassas, 650 Lie- bherr - America, Newport News, 650 Atlantic Furniture Mfg. Co., Inc., Norfolk, 300 Columbia Yacht Company, Chesapeake, 300 General El ectric Company, Portsmouth, 300 Goodyear Tire and Rubber Company, Danville, 600 and Quality Mills, Inc., Hillsville, 300. Of the 75 new plants, thirty-three will employ 100 or more persons. Those employ ing greater than 300 are Thomasville Furniture Indust ries, Appomattox, 700 Ameri can Furniture Company, Chii- howie, 600 General Electric Company, Winchester, 400 and Standard Garments, Inc., Chatham, 350. During 1972, there were 40 announcements which indicat ed an investment of 1 million or more. Of these, 27 were for expansions and 13 for new facilities. Ior the year 1971 there were 28 announcements with a 1 million or greater"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "greater than 300 are <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries, Appomattox, 700"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "greater than 300 are <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries, Appomattox, 700"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.51, 1079.22, 1886.61, 1190.72], "bbox_id": "285dd6656f", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "November 14 - Thomasville Furniture Industries has com pleted its acqusition of about 100 acres of land at Appomat tox. The Company, one of the nations largest producers of furniture for the home, had taken an option on the property in mid July."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "November 14 - <mark>Thomasville</mark> <mark>Furniture</mark> Industries has com pleted"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "November 14 - <mark>Thomasville</mark> <mark>Furniture</mark> Industries has com pleted"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1391.31, 595.35, 1736.79, 800.13], "bbox_id": "373f4260d6", "file": "TimesVirginian_1983a_0469.pdf", "page": 1, "text": "N O T IC E Any person who was employed fry Rayson Co. or G. G. Ray Co. involved in the construction of Thomasville Furniture, Inc., please call W. M. ABBOT, SR. at 352-8229 or 352-558"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "in the construction of <mark>Thomasville</mark> <mark>Furniture</mark>, Inc., please call W."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "in the construction of <mark>Thomasville</mark> <mark>Furniture</mark>, Inc., please call W."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [858.71, 640.52, 998.51, 868.66], "bbox_id": "5c155a29bd", "file": "AppomattoxNewspapers_1974-1975a_0374.pdf", "page": 1, "text": "Mrs. Winfred Elder, of Pamplin, Va., was organist and Mr. and Mrs. Barry Elder of Radford, Va., were soloists. Following the ceremony the brides parents entertained with a reception on the church lawn. The bride is a 1975 graduate of Appomattox County High School and is an employee of the Times-Virginian Printing Corporation in Appomattox. The bridegroom is a 1972 graduate of Appomattox Coun ty High School and is employed with Thomasville Furniture Industries in Appomattox. After a wedding trip to Myrtle Beach, S.C., the couple will make their home in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "and is employed with <mark>Thomasville</mark> <mark>Furniture</mark> Industries in Appomattox. After"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "and is employed with <mark>Thomasville</mark> <mark>Furniture</mark> Industries in Appomattox. After"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1950.49, 631.6, 2090.36, 827.14], "bbox_id": "39a4b59fdf", "file": "AppomattoxNewspapers_1974-1975a_0256.pdf", "page": 1, "text": "Mrs. Mary Hancock was mistress of ceremonies. Following the ceremony, Mrs. Charles E. Kidd, Sr. entertained with a reception in the church fellowship hall. The bride is a graduate of Buckingham High School and the bridegroom is a graduate of Frank L. Ashley High School of Gastonia, N. C. and University of North Carolina with a B. S. Degree. Mr. Ledford is pre sently employed at Thomasville Furniture in Appomattox, Vir ginia. After a wedding trip to Pennsylvania, the couple will reside at Wingina, Virginia."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "pre sently employed at <mark>Thomasville</mark> <mark>Furniture</mark> in Appomattox, Vir ginia."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "pre sently employed at <mark>Thomasville</mark> <mark>Furniture</mark> in Appomattox, Vir ginia."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1821.09, 643.5, 1965.32, 901.7], "bbox_id": "08765f3a34", "file": "TimesVirginian_1976_0284.pdf", "page": 1, "text": "Mrs. Jerry Smith, organist, and Miss Patsy Hughes and Miss Katy Johnson provided a program of nupital music. Mrs. Raymond Jamerson served as director and Mrs. Charles Wallace was guest book attendant. Following the ceremony the brides parents entertained with a reception in the church fellowship hall. The bride is a graduate of Appomattox County High School and is employed by Data Processing Co- at Appomattox Garment Co. The groom is a graduate of Appomattox County  High School and is employed by Thomasville Furniture Indus tries, Inc. After a wedding trip the couple will live in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "and is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Inc. After"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "and is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries, Inc. After"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1547.48, 610.86, 1685.3, 714.71], "bbox_id": "4174bf1e5c", "file": "AppomattoxNewspapers_1974-1975a_0208.pdf", "page": 1, "text": "Mr. Ledford is a graduate of Frank L. Ashley High School of Gastonia, North Carolina. He also graduated from the Uni versity of North Carolina, with a Bachlor of Science Degree, he is also employed at Thomasville Furniture. An early Spring wedding is planned."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "is also employed at <mark>Thomasville</mark> <mark>Furniture</mark>. An early Spring wedding"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "is also employed at <mark>Thomasville</mark> <mark>Furniture</mark>. An early Spring wedding"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1996.23, 621.3, 2276.07, 760.95], "bbox_id": "de95fc2c84", "file": "TimesVirginian_1976_0228.pdf", "page": 1, "text": "Mr. and Mrs. T. Russell Martin of Appomattox, Virginia announce the engagement of their daughter, Penny Sue, to Larry Edward Jordan, son of Mr. and Mrs. James E. Jordan, Jr., Concord, Virginia. Miss Martin is a 1974 graduate of Appomattox County High School and is employed by Ferebee-J oh n son Co., Inc. in Lynchburg, Virginia. , . i . Mr. Jordan is a 1973 graduate of Rustburg High School and attended Central Virginia Community College in Lynchburg. He is employed by Thomasville Furniture Industries, Inc. in Appomattox. The wedding will take place on September 25, 1976 at 730 p.m. at Trinity United Methodist Church."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "He is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. in Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "He is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. in Appomattox."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1405.71, 592.96, 1687.21, 710.61], "bbox_id": "c94b20de46", "file": "TimesVirginian_1978_0010.pdf", "page": 1, "text": "Mr. and Mrs. Ralph Whitmore Harrison of Rustburg announce the engagement of their daughter, Shelby Dawn, to Allen Curtis Litchford, ton of Mr. and Mrs. Charles Douglas Litéhford of Appomattox. Miss Harrison is a senior at Rustburg High Schoo and is employed at Pearsons Drug of Lynchburg. Mr. Litchford is a graduate of AppomattoxHigh School and is employed at Thomasville Furniture in Appomattox. Miss Harrison is the granddaughter of Mrs. George W. Page ,and the lattrMr. Page of Appomattox.  No date has been set for the wedding."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "and is employed at <mark>Thomasville</mark> <mark>Furniture</mark> in Appomattox. Miss Harrison"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "and is employed at <mark>Thomasville</mark> <mark>Furniture</mark> in Appomattox. Miss Harrison"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2276.66, 772.21, 2421.16, 934.35], "bbox_id": "59b7ab809c", "file": "TimesVirginian_1976_0174.pdf", "page": 1, "text": "Mr. and Mrs. R. L . Reynolds, of Appomattox, would like to announce th e. engagement of their daughter, Catherine Dar lene Reynolds, to Mr. Ralph D. Handy of Appomattox. Mr. Handy is the son of Mr. and Mrs. Herbert Lee Handy, Sr. of Appomattox. Mr. Handy is employed by Thomasville Furniture Com pany, Inc., and Miss Reynolds is now attending Appom attox County High School. A July wedding is planned."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Handy is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Com pany, Inc., and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Handy is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Com pany, Inc., and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1976.39, 621.68, 2260.09, 750.27], "bbox_id": "544ff5ed7b", "file": "TimesVirginian_1976_0174.pdf", "page": 1, "text": "Mr. and Mrs. Paul H. Smith of Pamplin announce the engagement of their daughter, Carolyn Ann, to William Henry Hamilton, son of Mr. and M is. Leslie W. Hamilton, Sr., of Pamplin, Virginia. Miss Smith is a senior at Appomattox County High School. , Mr. Hamilton is a 1969 graduate of Prince Edward Academy and a 1972 graduate of Central Virginia Community College with a degree in electronics. He is presently employed at Thomasville Furniture Factory. The wedding will take place at Elon Baptist Church on July 17,1976 at 2 oclock p.m. Although no invitations are being sent, all friends and relatives are cordially invited to attend"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "is presently employed at <mark>Thomasville</mark> <mark>Furniture</mark> Factory. The wedding will"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "is presently employed at <mark>Thomasville</mark> <mark>Furniture</mark> Factory. The wedding will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [285.65, 738.97, 559.1, 863.92], "bbox_id": "713cffedf8", "file": "AppomattoxNewspapers_1974-1975a_0300.pdf", "page": 1, "text": "Mr. and Mrs. Herman A. Varner of Pamplin take pleasure in. announcing the engagement of their daughter, Carla Renee, to Mr. James D. Torrence, son of Mr. and Mrs. Charles D. Torrence of Appomattox. Miss Varner will be a June graduate of Appomattox County High School. Mr. Torrence was a 1973 graduate of Appomattox County High School, attended VPI  SU and is presently employed with Thomasville Furniture Industries in Appomattox. The wedding date has been set for July 26, 1975. The ceremony will take place at Liberty Baptist Church at 7 p.m. All friends and relatives are cordially invited to attend."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "is presently employed with <mark>Thomasville</mark> <mark>Furniture</mark> Industries in Appomattox. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "is presently employed with <mark>Thomasville</mark> <mark>Furniture</mark> Industries in Appomattox. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1536.0, 698.54, 1816.36, 827.59], "bbox_id": "3f52ffc7b5", "file": "TimesVirginian_1976_0187.pdf", "page": 1, "text": "Mr. and Mrs. Fred Crowe, Jr. proudly announce the engagement of theifr daughter, Rowana Kaye, to Aldon Benny Crain, son of Mrand Mrs. William B. Crain, all of Appomattox. Miss Crowe is a graduate of Appomattox County High School and is presently employed at Kings Market. Mr. Crain, also a graduate of Appomattox County High School, is employed at Thomasville Furniture Industries to Appomattox. The wedding will take place June 26,1976 at 4 oclock to the afternoon in Rocks Baptist Church, Pamplto. Although no invitations are being sent, friends and relatives are invited to attend."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "School, is employed at <mark>Thomasville</mark> <mark>Furniture</mark> Industries to Appomattox. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "School, is employed at <mark>Thomasville</mark> <mark>Furniture</mark> Industries to Appomattox. The"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1527.79, 667.0, 1675.39, 1015.88], "bbox_id": "3d98c3ba13", "file": "TimesVirginian_1976_0018.pdf", "page": 1, "text": "monies. Attending the bridal registers were Mrs. Herbert Abbitt, aunt, of the bride, and Mrs. Tommy Stanley, aunt of the bridegroom! Following the ceremony a reception was given in the fellowship ball of the church by the mother of the bride. Hostess for the retortion was Mrs. Thomas M. Richardson. Assisting with the reception included Mrs. F re d  Wool dridge, Mrs. Randall Wool dridge, Mrs. Jimmy Pierce, Mrs. Bookie Johnson, Miss Brenda Garrett, Mias Teresa Elliott and Miss Kaye Chenault, all of Appomattox. The bridé is a graduate of Appomattox County High School and is a freshman at Longwood College. The bridegroom is a graduate of Appomattox County High School and is presently employed by the Thomasville Furniture Industries, Inc. in Appomattox. After a southern wedding fjfip the couple jrift.. live in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "presently employed by the <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. in Appomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "presently employed by the <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. in Appomattox."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.64, 1059.81, 1916.74, 1400.7], "bbox_id": "7f54b46ce4", "file": "AppomattoxNewspapers_1974-1975a_0281.pdf", "page": 1, "text": "Members of the Town Council of Appomattox, meet ing on Monday night, at the request of the Appomattox County Chamber of Commerce agreed to make available the old town office located on Church Street to the Chamber for office space provided the Information  Referral Center no longer has use for the building. If used by the Chamber of Commerce, they will pay all utilities but there will be no charge for use of the office facility. Council voted to open up the first 200 feet of Virginia I Avenue extended street ad jacent to the Ed Hopkinson property and the Virginia Department of Highways prop erty, barricade at the end of the 200 feet and seed the remainder of the street until such time that Thomasville Furniture Industries requests Bloodmobile Visit Set For May 27"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "until such time that <mark>Thomasville</mark> <mark>Furniture</mark> Industries requests Bloodmobile Visit"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "until such time that <mark>Thomasville</mark> <mark>Furniture</mark> Industries requests Bloodmobile Visit"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1508.64, 638.51, 1667.52, 1317.87], "bbox_id": "cf903a8943", "file": "TimesVirginian_1976_0350.pdf", "page": 1, "text": "light silk organza pillow, on which was fastened the two wedding bands. Mr. Jordan served as his sons best man. Ushers were Mr. Robert C. Jordan, brother of the bridegroom Mr. M. Earl Harris, brother-in-law of the bridegroom Mr. Richard W. Carroll, brother-in-law of the bride, and Mr. Thomas H. Roberts of Concord. Miss Jackie Cobbs served as Mistress of Ceremonies, and was assisted by Mrs. T, R. M artin, J r. G uests were registered at the brides book by Miss Debbie Kay Moore. M in U sa D. Thompson of Riner, served as program girl. Following the ceremony, the wedding guests were entertain ed by the parents of the bride with a reception in the social hall of the church. Hostesses for the reception included Mrs. R. Martin Coleman Mrs. Carl E. Martin and Mrs. Marvin G. Reynolds, aunts of the bride. 11 Also serving were Mrs. Larry tiiw eegar dfColumbus, Ohio Mrs. Lyle N. Garrett, Jr. of Amherst, Mrs. Lewis Thomp son of Riner Mrs. L. Tommie W ilhoit M rs. Lonnie C. Reynolds, Jr. Mrs. Harold T. Cheatham, Mrs. E. Thompson Stratton, all cousins of the bride and Mrs. Robert C. Harris of Pamplin, cousin of the bridegroom. Mrs. Martin chose for her daughters wedding, a floor- length dress of pastel floral design. Mrs. Jordan chose a gown of rose colored polyester double knit. They added identical corsages of w hite orchids. The bride is a graduate of Appomattox County High School and is employed by Ferebee-Johnson Co, Inc. in Lynchburg. The bridegroom is a graduate of Rustburg High School and attended Central Virginia Community College in Lynchburg. He is employed by Thomasville Furniture Indus- tires, Inc. in Appomattox. After a southern wedding trip, the couple will make their home in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "He is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Indus- tires, Inc. in"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "He is employed by <mark>Thomasville</mark> <mark>Furniture</mark> Indus- tires, Inc. in"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1655.65, 859.11, 1798.65, 986.64], "bbox_id": "18664e0377", "file": "TimesVirginian_1978_0071.pdf", "page": 1, "text": "Lewis Mann, employed by Armstrong Furniture Division of Thomasville Furniture In dustries at their Appomattox plant on May 5, 1974, has recently been promoted from production employee to Fabri cation HI Supervisor of the second shift. Born in Campbell County, Mann haa lived most of h g . VKin ÀppômattQXjCounty."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Armstrong Furniture Division of <mark>Thomasville</mark> <mark>Furniture</mark> In dustries at their"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Armstrong Furniture Division of <mark>Thomasville</mark> <mark>Furniture</mark> In dustries at their"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.85, 1607.93, 2239.24, 1772.27], "bbox_id": "ce1544fd3f", "file": "AppomattoxNewspapers_1974-1975a_0415.pdf", "page": 1, "text": "Last summer Thomasville Furniture Industries, Inc., Appomattox plant, constructed a sediment basin to catch the soil eroding from their develop ment. Now that most of their land is established to protective vegetative cover, or being renegated, they are removing the sediment basin. Sediment basins are con structed much like farm ponds,  except th at the pipe is  perforated and surrounded by a j travel cone to filter the water I and catch the mud -that it did."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Last summer <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., Appomattox plant,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Last summer <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc., Appomattox plant,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1854.24, 384.52, 2608.79, 555.93], "bbox_id": "042af10d14", "file": "AppomattoxNewspapers_1971-1973a_0405.pdf", "page": 1, "text": "Labor Survey Requested Thomasville Furniture Industries To Be Conducted Friday-Saturday"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Labor Survey Requested <mark>Thomasville</mark> <mark>Furniture</mark> Industries To Be Conducted Friday-Saturday"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Labor Survey Requested <mark>Thomasville</mark> <mark>Furniture</mark> Industries To Be Conducted Friday-Saturday"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [442.11, 582.47, 592.92, 953.45], "bbox_id": "5f9a03fbf9", "file": "TimesVirginian_1981a_0219.pdf", "page": 1, "text": "L. E. Pop Foster, executive vice president of Thomasville Furniture Industries, has elect ed early retirement from the company, effective July 1 . He will retire with more than 41 years of service, with Thomasville and its parent .company Armstrong world. Industries In addition to his position as executive vice president, Fos ter has served as general manager of the companys Armstrong Furniture Divison since 1973. The Armstrong  Furniture Divisions manufacturingfaci lity is at Appomattox, Va. A native of Birmingham, Ala., Foster received his bachelors degree in 1939 from Auburn Ala. U niversity. While a student he was president of Omicron Delta Kappa scholastic honorary, president of Delta Sigma Pi, professional business frater nity, and a member of the .varsity football team. Following his graduation, Foster joined Armstrong in 1939 as a sales trainee in the Atlanta office. He served five years- in the Army and was discharged in"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "executive vice president of <mark>Thomasville</mark> <mark>Furniture</mark> Industries, has elect ed"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "executive vice president of <mark>Thomasville</mark> <mark>Furniture</mark> Industries, has elect ed"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1386.16, 430.57, 1674.21, 542.15], "bbox_id": "57cd6dfe42", "file": "TimesVirginian_1978_0213.pdf", "page": 1, "text": "jp Bill Slagle, President, gave a report on the Chambers I- activities for the past year. . - I? Mr. Bill Lowe, Vice President and Manager off Armstrong 1 Furniture Division of Thomasville Furniture Industries local plant, was guest speaker for the evening. Mr. Lowe told the  group that the local plant is the largest furniture producing V plant in the United States and possibly in the world. They are X now in the process of enlarging the local faculty.  Armstrong is really an asset to the Town of Appomattox, to  the County and to surrounding areas."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "1 Furniture Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries local plant, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "1 Furniture Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries local plant, was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1349.9, 469.41, 1491.06, 608.56], "bbox_id": "88d33e9658", "file": "TimesVirginian_1978_0071.pdf", "page": 1, "text": "Joe Danos of Evington was employed by Armstrong Furni ture Division of Thomasville Furniture Industries in their Appomattox plant March 24, 1975 as a production employee. Danos has recently been promoted to the position of Packing and Repair Supervisor of the second shift. He will be married in the near future and plans to move to the Appomattox  Concord area."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Furni ture Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries in their Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Furni ture Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries in their Appomattox"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.09, 523.41, 1820.26, 932.73], "bbox_id": "8e69d8c14c", "file": "TimesVirginian_1976_0281.pdf", "page": 1, "text": "ing the first six months of 1976. During the second half of the year, negotiations are schedul ed at plants in.Fulton, N.Y. Jackson, Miss. and Lancaster, Pa. and at affiliate company operations in Montreal Cana da, and Allentown, Pa._ _ __ _ Binns sees the overall outlook for Armstrong during the remainder of the year as promising. We are looking for the domestic economy to continue to register modest gains, he said, and we are anticipating a gradual recovery in the foreign markets in which we operate. While on a year-to-year comparison basis, we will be measuring our 1976 results against those of a substantially stronger 1975 second half - - and we would not expect that we can maintain our 1976 first-half rate of gain - - we are well positioned to take advantage of our expand ed opportunities. A r m s t r o n g manufac tures and markets a compre hensive range of interior furnishings, including resilient flooring and carpets, ceiling systems, and furniture, and a variety of specialty products for the building, automotive, textile and other industries. Thomasville Furniture In-"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "textile and other industries. <mark>Thomasville</mark> <mark>Furniture</mark> In-"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "textile and other industries. <mark>Thomasville</mark> <mark>Furniture</mark> In-"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2035.2, 1587.67, 2188.3, 1827.86], "bbox_id": "b0ea7b5397", "file": "TimesVirginian_1981a_0075.pdf", "page": 1, "text": "In last weeks Times-Virgin- ian, it was. incorrectly reported that the ApppniattoX Town . Council had voted to fund Jthe Railroad Festival fireworks, display in injunction with the County Board of Supervisors, because Thomasville, Furniture Industries had declined to help  fund the display, this vear. - . Thomasville has not - indica ted that it will not help fund the display this year, according to Town Manager BUI Britton. Britton noted th a t the Council did not vote to fund the display, but did indicate that they would help fund the fireworks in the event that additional funding is needed  this year. f i The Times-Virginian regrets the error."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Board of Supervisors, because <mark>Thomasville</mark>, <mark>Furniture</mark> Industries had declined to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Board of Supervisors, because <mark>Thomasville</mark>, <mark>Furniture</mark> Industries had declined to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2000.16, 1148.86, 2144.89, 1427.4], "bbox_id": "3699f9907a", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "Im proved vacations, paid holidays, and upgraded insur ance coverage were included among employee benefit chan ges announced July 21st by Thomasville Furniture Indus tries. According to Tom A. Finch, president of Thomasville Furni ture Industries, the vacation and holiday improvements are being made in response to the trend throughout industry toward providing employees with more time oft with pay. Among the improved insur ance benefits is higher medical insurance coverage to protect employees and their families against the rapidly-rising costs of health care. Finch said. Also included is a significant improvement in weekly acci dent and sickness benefits. We believe the strengthen ed insurance coverage together"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "announced July 21st by <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries. According to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "announced July 21st by <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries. According to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [533.75, 532.59, 672.39, 722.33], "bbox_id": "3678426fa7", "file": "AppomattoxNewspapers_1971-1973a_0412.pdf", "page": 1, "text": "I want to commend you and your staff on your fine news paper and especially on the excellent c o v er ag e given to Thomasville Furniture Indus tries announcement of a new facility. You and all the people of Appomattox are to be commen ded for the fine response to the survey and to those volunteers who assisted in the registration we are most appreciative of their time. I have never felt more warmly received by any community, and I look forward to my next visit to Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "ag e given to <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries announcement of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "ag e given to <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries announcement of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1924.23, 1643.31, 2063.18, 1739.46], "bbox_id": "0e06cd2bc1", "file": "AppomattoxNewspapers_1974-1975a_0426.pdf", "page": 1, "text": "Here in Appomattox, furni ture from Transmark is available at Best Furniture. Thomasville Furniture In dustries, Inc., is a subsidiary of the Armstrong Cork Company, Inc. with headquarters in Lancaster, PA. Armstrong manufactures and sells a"}, "highlight": {"text": {"matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1924.28, 1643.85, 2064.2, 1739.79], "bbox_id": "cc077e0e82", "file": "AppomattoxNewspapers_1974-1975a_0423.pdf", "page": 1, "text": "Here in Appomattox, furni ture from Transmark is available at Best Furniture. Thomasville Furniture In dustries, Inc., is a subsidiary of the Armstrong Cork Company, Inc. with headquarters in Lancaster, PA. Armstrong manufactures and sells a"}, "highlight": {"text": {"matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1926.71, 1644.86, 2066.88, 1740.75], "bbox_id": "a8e4ee7d57", "file": "AppomattoxNewspapers_1974-1975a_0422.pdf", "page": 1, "text": "Here in Appomattox, furni ture from Transmark is available at Best Furniture. Thomasville Furniture In dustries, Inc., is a subsidiary of the Armstrong Cork Company, Inc. with headquarters in Lancaster, PA. Armstrong manufactures and sells a"}, "highlight": {"text": {"matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1923.37, 1643.68, 2062.8, 1738.87], "bbox_id": "3e7c22bbff", "file": "AppomattoxNewspapers_1974-1975a_0425.pdf", "page": 1, "text": "Here in Appomattox, furni ture from Transm ark is available at Best Furniture. Thomasville Furniture In dustries, Inc., is a subsidiary of the Armstrong Cork Company, In c. w ith headquarters in Lancaster, P A . Arm strong m anufactures and sells a"}, "highlight": {"text": {"matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1924.77, 1643.19, 2064.25, 1738.88], "bbox_id": "2731484dbb", "file": "AppomattoxNewspapers_1974-1975a_0427.pdf", "page": 1, "text": "Here in Appomattox, furni tu re from Transm ark is available at Best Furniture. Thomasville Furniture In dustries, Inc., is a subsidiary of the Armstrong Cork Company, Inc. with headquarters in Lancaster, PA. Arm strong m anufactures and sells a"}, "highlight": {"text": {"matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Furniture", "Thomasville", "Furniture"], "snippet": "is available at Best <mark>Furniture</mark>. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries, Inc.,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [741.58, 527.69, 883.17, 590.03], "bbox_id": "c19f8ab7e2", "file": "TimesVirginian_1978_0359.pdf", "page": 1, "text": "HELP WANTED Reliable person to baby-sit in their home, 3 school age children, in the Thomasville Furniture factory area. Phone 993-3289. ________ 8-3-2tc"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "HELP WANTED Reliable person to baby-sit in their home, 3 school age children, in the <mark>Thomasville</mark> <mark>Furniture</mark> factory area. Phone 993-3289. ________ 8-3-2tc"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "HELP WANTED Reliable person to baby-sit in their home, 3 school age children, in the <mark>Thomasville</mark> <mark>Furniture</mark> factory area. Phone 993-3289. ________ 8-3-2tc"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1986.0, 1079.43, 2130.74, 1187.07], "bbox_id": "9e3f9fc61c", "file": "TimesVirginian_1978_0508.pdf", "page": 1, "text": "HELP WANTED Electricians- and Electrician Helpers needed to work for Bryant Durham Electric Co. at new addition Thomasville Furniture Co. Located Highway 460 E. Appomattox. Contact Doug Scoggins at job site. Equal Opportunity E m p l o y e r . MaleFenufie. _____ U-9-2tc"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Co. at new addition <mark>Thomasville</mark> <mark>Furniture</mark> Co. Located Highway 460"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Co. at new addition <mark>Thomasville</mark> <mark>Furniture</mark> Co. Located Highway 460"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [419.99, 451.69, 556.65, 651.08], "bbox_id": "098197c0e3", "file": "TimesVirginian_1983a_0117.pdf", "page": 1, "text": "furniture. They wanted to expand tbeSr product line int o lower end promotionally. priced products. Thomasville Furniture In dustries. Inc. makes fl variety of wood furniture from the promotional thro ugh relatively high end. It als has an impart Bne of products that are bought thrughout tbs Middle Cast and Europe and then marketed foculiK Armstrong World Indus tries produce resilient flooring, carpet. ceiHag tile, and f variety of industrial products along with a"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "end promotionally. priced products. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries. Inc. makes"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "end promotionally. priced products. <mark>Thomasville</mark> <mark>Furniture</mark> In dustries. Inc. makes"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2016.24, 679.97, 2144.9, 745.67], "bbox_id": "fb2b6db790", "file": "TimesVirginian_1980a_0421.pdf", "page": 1, "text": "from Appomattox County High School andis employee of Thomasville Furniture Co,  The wedding is planned for December 31."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "from Appomattox County High School andis employee of <mark>Thomasville</mark> <mark>Furniture</mark> Co,  The wedding is planned for December 31."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "from Appomattox County High School andis employee of <mark>Thomasville</mark> <mark>Furniture</mark> Co,  The wedding is planned for December 31."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1452.95, 578.53, 1726.51, 775.21], "bbox_id": "4b2c071ba8", "file": "AppomattoxNewspapers_1974-1975a_0368.pdf", "page": 1, "text": "Floyd. Eggleston, Vice President of fidelity National Bank, Appomattox, and Lyle Garrett, chairman of local board, announced the appointment of William L. Lowe to the Board of Directors. A native of Weslaco, Texas, Mr. Lowes college years were interrupted when called back in the service during the Korean War. He later graduated from Gettysburg College in February of 1955 and joined Armstrong Cork Company at that time. He was transferred to Thomasville Furniture Industries, a subsidiary of Armstrong Cork Company, in June of 1970 where he held the position of Vice President of Production Planning and Distribution. Lowe started working at the Appomattox plant, Transmark Operations, a division of Thomas ville Furniture Industries, Inc., in 1972 and formally assumed his current position of Vice President and General Manager of Transmark Operations in the spring of 1973. He and his wife, Naomi, are the parents of two children, a M a I eem I o nrliA w ill e m to r VPT Jr f i l l 1TI fllO fa ll o f LtllS"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "He was transferred to <mark>Thomasville</mark> <mark>Furniture</mark> Industries, a subsidiary of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "He was transferred to <mark>Thomasville</mark> <mark>Furniture</mark> Industries, a subsidiary of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.74, 820.68, 1593.69, 1112.17], "bbox_id": "fa25fa3486", "file": "TimesVirginian_1976_0376.pdf", "page": 1, "text": "Fifth District and Appomat tox County Republican Party announces that Ronald F . Steinkamp, plant production planning and traffic manager of Thomasville Furniture Com pany, Inc., Appomattox has been named Republican Party Chairman of the Gerald Ford-Robert Dole campaign for Appomattox County . Steinkamp and his wife, Bette, resident Walton Place in lipimiiisttrn rrhr .-fore children. .. h , f yjrT -rirr  m Ron has-been active in the Republican Party for ten years, serving as precinct chairman in .Macon, Georgia and Chairman of the Zoning Board for a township in Lancaster County, Pennsylvania. Campaign headquarters will be opened in the Town of Appomattox shortly. All campaign donations should be mailed to Ronald F."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "and traffic manager of <mark>Thomasville</mark> <mark>Furniture</mark> Com pany, Inc., Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "and traffic manager of <mark>Thomasville</mark> <mark>Furniture</mark> Com pany, Inc., Appomattox"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2098.49, 1516.53, 2370.29, 1577.88], "bbox_id": "78c8e54333", "file": "AppomattoxNewspapers_1974-1975a_0415.pdf", "page": 1, "text": "Everette Moores loader gives John Goin, Soil Conservati Service Technician, a lift to probe depth of mud in Thomasville Furniture Industries sediment pond. Tracks in the background are those of mud turtle. Watershed Conservation"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "depth of mud in <mark>Thomasville</mark> <mark>Furniture</mark> Industries sediment pond. Tracks"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "depth of mud in <mark>Thomasville</mark> <mark>Furniture</mark> Industries sediment pond. Tracks"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2206.77, 645.73, 2344.87, 1209.15], "bbox_id": "59244e634a", "file": "AppomattoxNewspapers_1974-1975a_0134.pdf", "page": 1, "text": "Entering a new year can be an anxious time if one is nervous and unsure of what the future has in store, or it can be a pleasurable experience for someone who is confident and has set goals to be acheived during the coming 12 months. Although the nation suffered a trememdous recession during 1974, Appomattox County en joyed a moderate boost to its economy. We predict that 1975 will offer even better things for the county and its citizens. Virginia Fibre Corporation is scheduled to begin productive operations about mid-year. The initial operations will provide some employment for county residents, but more important is the fact that it will provide a market for one of Appomattoxs biggest products, pulp wood. Thomasville Furniture has already exceeded first esti m ates of production. We predict an increase of pro duction there with jpeeitie expansion of the plant. This bill continue to spur the countys economy and reduce the. unem ployment rte. We predict foresting oper ations to begin codbty wide as other companies, compete for m arketable tim ber, and a possible new wood processing industry to be located in the western part of the county. Central Virginia Tomorrow  A Partnership Process is expected to make rapid prog ress in the areas of land use, transportation, e m ploymcnt, health care services and gov ernment to people commun ications. Farm production will be up during 1975, and there should be.a substantial increase in the price to the grower. Beef and pork producers e s p e c i ally should realize a better profit than they have in past year."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "biggest products, pulp wood. <mark>Thomasville</mark> <mark>Furniture</mark> has already exceeded first"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "biggest products, pulp wood. <mark>Thomasville</mark> <mark>Furniture</mark> has already exceeded first"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [364.81, 1383.62, 507.01, 1798.71], "bbox_id": "255f0e8fb0", "file": "AppomattoxNewspapers_1971-1973a_0417.pdf", "page": 1, "text": "Contd from page 1 with him to Appomattox 1,000 forms and on two occasions had to have additional forms print ed. This alone is an indication of the great success of the la bor survey. Mr. Wells stated that the outcome of the survey was very fine, in fact it was one of the most outstanding surveys they had ever conducted. He added that possibly enough peo ple had shown such interest that Appomattox could easily count on even another industry labor- wise. Representatives from Tho - masville Furniture Industries, on hand both days to answer questions the applicants might have, expressed their amaze ment time and time again. They were very impressed with the number of people who turned out for the survey and with the quality of the people. Approximately fifty local vol unteers were on hand Friday and Saturday to assist with the survey. Plans for the initial employ ment at Thomasville Furniture Industries is scheduled to begin at 200 to 250 persons and within a year or two after production begins the plant should be em ploying 600 to 700 per sons. Both men and women will be employ ed in the plant."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "initial employ ment at <mark>Thomasville</mark> <mark>Furniture</mark> Industries is scheduled to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "initial employ ment at <mark>Thomasville</mark> <mark>Furniture</mark> Industries is scheduled to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.65, 466.28, 1793.19, 616.43], "bbox_id": "c9bc83dcb0", "file": "TimesVirginian_1978_0071.pdf", "page": 1, "text": "Chuck Webber, a native of Appomattox, began his employ ment with Armstrong Furni ture Division of Thomasville Furniture Industries at their Appomattox plant on Septem ber 16, 1974 as a production employee. Webber has recently been named Finishing Supervi sor on the second shift. He and bis wife, Carolyn, are the parents of one child Cindyand they reside on Route 4, Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Furni ture Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries at their Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Furni ture Division of <mark>Thomasville</mark> <mark>Furniture</mark> Industries at their Appomattox"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.9, 860.08, 1649.16, 998.98], "bbox_id": "1201bae250", "file": "TimesVirginian_1978_0071.pdf", "page": 1, "text": "Charles Reece, employed by Armstrong Furniture Division of Thomasville Furniture In dustries at their Appomattox facility May 6, 1975 as a production employee, has re cently been named Supervisor of Sub-Assembly of the first shift. A native of Tennessee, Reece and his wife, Ruth, are the parents p i three children, Sandf. Carol and Davd. They now live in Prospect."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Armstrong Furniture Division of <mark>Thomasville</mark> <mark>Furniture</mark> In dustries at their"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Armstrong Furniture Division of <mark>Thomasville</mark> <mark>Furniture</mark> In dustries at their"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.76, 1117.22, 2283.81, 1137.22], "bbox_id": "615e5c75d2", "file": "TimesVirginian_1978_0328.pdf", "page": 1, "text": "By Thomasville Furniture Ind."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "By <mark>Thomasville</mark> <mark>Furniture</mark> Ind."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "By <mark>Thomasville</mark> <mark>Furniture</mark> Ind."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2349.07, 1288.12, 2492.55, 1687.15], "bbox_id": "c7e424968d", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "At the regular meeting of the Appomattox County Board of Supervisors on Friday morning, November 10,1972, it was announced that officials representing Armstrong Cork Company would meet on Tuesday with the Appomattox Industrial Development Auth ority to finalize the transaction for Thomasville Furniture Industries plant to be built in. Appomattox. Mr. John V. Jackson, District Forester, and Mr. David Smith of the State Forest Service asked the board to pass a resolution to oppose the Proposed House Bill 895 to relieve the railroads of keeping the railroad right-of- way clean and upon considera tion Mr. John Cole made a motion that the board adopt the following r e s o l u t i o n  Whereas - Section 56-426 of the Code of Virginia requires that Every railroad company shall keep its right-of-way clear and free of weeds, grass, and decayed timber, which from their nature and condition are combustible material, liable to take and to communicate fire from passing trains to abutting or adjacent property and"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "finalize the transaction for <mark>Thomasville</mark> <mark>Furniture</mark> Industries plant to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "finalize the transaction for <mark>Thomasville</mark> <mark>Furniture</mark> Industries plant to be"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1852.29, 1198.58, 1999.54, 1684.7], "bbox_id": "8fd6ad5ef2", "file": "AppomattoxNewspapers_1971-1973a_0384.pdf", "page": 1, "text": "At the regular meeting of the Appomattox County Board of Supervisors on Friday, July 14th, James A. Smith, repre senting the Appomattox County Development Corporation, in formed the board that initial plans had been made and an option signed by Thomasville Furniture Industries of Tho masville, North Carolina, to ac quire a 100 acre tract of land, owned by Courtland R e a l t y Company, for the purpose of erecting a major facility in Ap pomattox. Complete details of this story can be found in this issue of the TIMES-VIRGIN- IAN. Dr. J. A. Mathews, member of the Board of Directors of Central Virginia Commun i t y College, and Dr. M. Douglas Reed, president of the College, requested the board o assist the college with its building plans now underway by allocat ing funds on a share-fhe-cost ratio basis. The countys obli gation cost of projects now underway total 13,565 18 or 6.3 percent of the total amount, j The board approved this request, i Dr. Reed explained that the  General Assembly had author ized CVCC to erect additional buildings and had allocated two  million dollars for this, but the j amount allocated did not include I necessary side improvements. He stated further that Appomat tox County was  on par in rat ios of give and take, as the per centile of county student at- i tendance was 6.1 percent this i year."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "an option signed by <mark>Thomasville</mark> <mark>Furniture</mark> Industries of Tho masville,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "an option signed by <mark>Thomasville</mark> <mark>Furniture</mark> Industries of Tho masville,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [270.26, 687.02, 410.03, 829.27], "bbox_id": "c3b7f0777e", "file": "TimesVirginian_1976_0191.pdf", "page": 1, "text": "at Processing Department Appomattox Garment Co. Mr. Wallace is also a graduate of Appomattox High School and is now employed with Thomasville Furniture Industries, Inc. The wedding will take place at 2 oclock on the afternoon of July 31 at Bible Baptist Church. Although no invitations are being sent friends and relatives are invited to attend."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "is now employed with <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. The wedding"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "is now employed with <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Inc. The wedding"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2043.57, 810.16, 2186.06, 1098.75], "bbox_id": "f603ea44bd", "file": "AppomattoxNewspapers_1971-1973a_0519.pdf", "page": 1, "text": "At a meeting held in the Court House at Appomattox on Tuesday morning, November 14th, Thomasville Furniture finalized the deal on land located on Highway 460, west of Appomattox, for a new facility to be built here. Present for the meeting were Mr. T. DeWitt Evans, President of the Industrial Development Authority of the County of Appomattox, and Mr. Floyd Eggleston, Secre- tary-yreasur,er for the Authori- ty. Mr. Raymond Sydansk, General manager, Real Estate Department, Armstrong Cork Company of Lancaster, Penn- sylanvia, and Mrs. A . E . Mays, attorney for Armstrong Cork Company, represented Tho masville Furniture Industries of Thomasville, North Carolina. Mr. C. Edward Richardson, III, Closings and Sales Representa"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Tuesday morning, November 14th, <mark>Thomasville</mark> <mark>Furniture</mark> finalized the deal on"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Tuesday morning, November 14th, <mark>Thomasville</mark> <mark>Furniture</mark> finalized the deal on"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2135.76, 403.78, 2278.8, 608.18], "bbox_id": "e49777c011", "file": "TimesVirginian_1978_0378.pdf", "page": 1, "text": "Armstrong Furniture Com pany recently announced that Jerry Lucado, Production Plan ning Supervisor for the Appomattox Plant, has accept ed a promotion to Plant Industrial Engineer and Quali ty Assurance Manager of the Thomasville Furniture Plant in Brookneal. Jerry, a 1974 graduate of Virginia Tech and a native of Princeton, W. Va., has been with Armstrong since June of 1976 and at the Appomattox Plant since September of that year. He and his wife, Debbie, will continue to reside in Appomattox."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Assurance Manager of the <mark>Thomasville</mark> <mark>Furniture</mark> Plant in Brookneal. Jerry,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Assurance Manager of the <mark>Thomasville</mark> <mark>Furniture</mark> Plant in Brookneal. Jerry,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [310.32, 184.75, 449.72, 624.12], "bbox_id": "d1f32a773c", "file": "AppomattoxNewspapers_1974-1975a_0448.pdf", "page": 1, "text": "appreciaton to lcoal merchant! for their co-operation and generous donation. Kings, Robinsons Funeral Home, Inc., Fred Jones, WeO Co., Appomattox Hdwe. Co., Inc., Webbs Tire Co., Inc., J. E. Jamerson  Sons, Inc., Bennett T. Matthews, Inc., Thomasville Furniture Ind., Inc., Marshalls Department Store, Appomat tox Truck  Tractor, Inc., Times  Virginian Publishers, Western Auto Associate Store, Times-Virginian Printing Corp. National Auto Parts, Inc., G arriss Upholstery Shop, Jeannes R estaurant, Appo mattox Drug Store, J. A. Burke  Co., Insurance, Elliott Florist  Gifts, Phils Carpet Center, Appomattox Beauty Shop, Casa Rio formerly Georges Snack Bar, Lee-Grant Motel, Fer rells Art W are, Caroles Fashions, Appomattox Radio  TV Service, Gaines Jewlers, Poe Hdwe. Co., Inc., Lawson Ford, Inc., Travellers Inn Motel, J. E. Sears  Co., Inc., Strings N Things Knit Corner at Caroles Fashions, Carpet House, Appomattox Oil Co., Dairy Queen, Wilbnns Super market, Maudes Restaurant, Colemans Feed Store, Wilkes Jewelers, T. Hunter Dickerson Clothing Store, Nancys Beauty Shop, Coles Dairy, Herncalls Dry Cleaners, Ed H arvey Appliance Co., Sears, Roebuck  Co., Catalog Store."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Bennett T. Matthews, Inc., <mark>Thomasville</mark> <mark>Furniture</mark> Ind., Inc., Marshalls Department"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Bennett T. Matthews, Inc., <mark>Thomasville</mark> <mark>Furniture</mark> Ind., Inc., Marshalls Department"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2355.58, 539.02, 2504.34, 1777.06], "bbox_id": "d63fd4b442", "file": "AppomattoxNewspapers_1971-1973a_0597.pdf", "page": 1, "text": "Appomattox County marked its 127th year in 1972 as a county always keeping in mind the happenings in past years but at the same time looking to a brighter future. The big story of the year came with the announcement that THOMASVILLE FURNI TURE INDUSTRIES, with headquarters in Thomasville, North Carolina, planned to build a major manufacturing facility in Appomattox a 350,000 square foot plant and that they had taken an option on a 100-acre tract of land on U. S. Route 460, adjacent to the western limits of the Town of Appomattox. Initial employ ment was set at 250 persons, and, after a year or two of pro duction, employment should reach 600 to 700. This announcement came in July of 1972. In August of 1972, the Vir ginia Employment Commission was requested by Thomasville Furniture Industries, Incor porated, to make a survey of people interested in employ ment in the Appomattox area. The labor survey, conducted on August 11th and August 12th, was termed a great success by th e Virginia Employment Commission when a total of 1668 persons registered show ing an interest in employment during the two-day survey. And finally, at a meeting held in the Court, House j,. Appomattox on November 14, 1972, Thomasville Furniture Industries finalized the deal on the land located on Highway 460 for the new facility to be built here. Plans will soon be let for bids and we can look forward to the beginning of the construction of the new plant The news in Appomattox County ranking second came when the county was declared a disaster area for the second time in three years when our county and surrounding count ies were hit by heavy rains from tropical storm Agnes causing heavy flood damage. Damage to Appomattox County was estimated at 995,000. One person was reported dead due to the high waters. Major damage to roads and highways in the county totaled 195,000 m i n o r damage totaled 50,000 and damage to bridges totaled 30,000. These are estimated totals. Estimated damage to personal property in Appo mattox County totaled 49,500 estimated damage to industry totaled 10,000 businesses in the county receiving damage totaled 23,000 and an estimated damage of 637,500 was done to farm buildings, equipment, crops, animals and land. Flood victims were assured of assistance. In March of 1972 Fourth District Representative Wat- kin M. Abbitt, Democrat of Appomattox, announced that he would retire from Congress at the end of his term of office. At that time Abbitt was a 24-year veteran of the Fourth District. A graduate of Appomattox High School and the University of Richmond Law School, he was awarded an honorary Doctor of Law Degree in 1964 by the University of Richmond. He was always, and still is, active in community, civic and church affairs in Appomattox County while maintaining an active interest in the Fourth District, in the State and in National affairs. Abbitt is married to the former Corinne Hancock and they have three children, Mrs. Anne Abbitt Kerr, Watkins, Jr., and Corinne. Watt Abbitt donated his papers, records and correspon dence of his 25 years in"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Commission was requested by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Incor porated, to"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Commission was requested by <mark>Thomasville</mark> <mark>Furniture</mark> Industries, Incor porated, to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2243.71, 1155.07, 2387.74, 1411.56], "bbox_id": "63c70016ee", "file": "AppomattoxNewspapers_1971-1973a_0583.pdf", "page": 1, "text": "According to a December 22, 1972, news release from the Governors Office, Division of Industrial Development, in the official report on Manufactur ing Developments in Virginia for the year 1972, Appomattox tops the list of towns and cities, employmentwise, with the anticipated employment of 700 persons at the new Thomasville Furniture Indust ries which will locate in Appo mattox. The report released is as fol lows Employment antici p a t e d from the announcements of new manufacturing plants and expansions in Virginia during 1972 registered a 7 gain over employment expected from announcements in 1971. The"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "persons at the new <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries which will"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "persons at the new <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries which will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1512.67, 1666.85, 1936.62, 1676.85], "bbox_id": "175c5d150f", "file": "AppomattoxNewspapers_1974-1975a_0288.pdf", "page": 1, "text": "a,1T  ie effris T thofhe fe S iy e  te te in g sponsored by Thomasville Furniture Industries and"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "a,1T  ie effris T thofhe fe S iy e  te te in g sponsored by <mark>Thomasville</mark> <mark>Furniture</mark> Industries and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "a,1T  ie effris T thofhe fe S iy e  te te in g sponsored by <mark>Thomasville</mark> <mark>Furniture</mark> Industries and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2309.98, 721.35, 2453.83, 1025.84], "bbox_id": "9ec44c3a89", "file": "AppomattoxNewspapers_1971-1973a_0384.pdf", "page": 1, "text": "A major manufacturing faci lity will be built at Appomattox Virginia, by T h o m a s v i l l e Furniture Industries, one of the nations largest producers of furniture for the home. The company, with headquarters in Thomasville, North Carolina, has taken an option to acquire 100-acre tract of land onU.S. Route 460, adjacent to the west ern limits of the Town of Appo mattox. Preparations for construc tion of the 350,000 square-foot plant will commence almost im mediately after the purchase option is exercised, according to Tom A. Finch, President of Thomasville Furniture Indust ries. This is expected to occur within the next two to three mon ths, he said.  We hope to be in production by early or mid 1974, Finch stated,  in what will be one of the most modern ftirniture man ufacturing facilities in the nat ion."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "A. Finch, President of <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries. This is"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "A. Finch, President of <mark>Thomasville</mark> <mark>Furniture</mark> Indust ries. This is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [277.8, 826.4, 428.77, 1174.53], "bbox_id": "79a657764d", "file": "TimesVirginian_1978_0004.pdf", "page": 1, "text": "A major concern of any  family contemplating a move to  any given . locality is the j opportunity for employment for j family members. Appomattox , has much tb offer industries in the town, the immediate area, and industries within com muting distance provide almost unlimited opportunities. One of the most recent A dditions to the industrial picture of Appomattox is the A rm strong Furniture Plant which had Its beginning in our town in June of1973.. . y Starting out as Thomasville Furniture, not too much time passed before there wasa name change and people had to get used to the name Transmark, This, however, was short lived and the name was again changed, this time to Arm strong Furniture. The parent corporation Armstrong Cork, had its orgin in Pittsburg, Pa. in the 1860s. The plant was successfully turning out cork stoppers for bottles. The plant engineers, concerned about the amount of"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "y Starting out as <mark>Thomasville</mark> <mark>Furniture</mark>, not too much time"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "y Starting out as <mark>Thomasville</mark> <mark>Furniture</mark>, not too much time"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [596.38, 583.37, 747.91, 1084.19], "bbox_id": "47ebd0a697", "file": "TimesVirginian_1981a_0219.pdf", "page": 1, "text": "1945 with the rank of major, having served as assistant chief of staff of an infantry divisfan. He was awarded two Bronzes Star medals. Upon returning to Arm strong, Foster served in a variety of assignments across a broad spectrum of Armstrong businesses. Prior to coming to Thomasville, he was serving an assistant general manager and director of marketing. Interna tional Operations. In 1969, Foster was named Senior vice president with Thomasville. He became exe cutive vice president in 1973 and is a member of the Thomasville Furniture Indus tries Board of Directors. At Thomasville, Pop has obviously made many signifk cant contributions, said Presi dent L. E. Bish, and foremost among them has been his outstanding guidance of the Armstrong Division-from an idea to the successful business it represents today. For this, and his many other accomplishments, we are in deed grateful. Active in Thomasville civic affairs, Foster presently serves as president of the Thomasville Family YMCA. He has alto held M t t o u a i O M i i U l f a Boys Club.- 4 i,. His wife is the former Mary Louise Hastings of Saginaw, Mich. They will continue to reside in Thomasville. We wish Pop and Mary Lou good health and much hapiness as they begin their well- deerved retirem ent, Bish said."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "a member of the <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries Board of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "a member of the <mark>Thomasville</mark> <mark>Furniture</mark> Indus tries Board of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [548.8, 1052.42, 895.61, 1263.46], "bbox_id": "d46faae12f", "file": "TimesVirginian_1983a_0480.pdf", "page": 1, "text": ", NOTICE Any person who was employed by Rayson Co. or G. G. Ray Co. invdlved in the construction of Thomasville Furniture, Inc., please call  V W. M. ABBITT, SR. at 352-8229 or 352-5589"}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "in the construction of <mark>Thomasville</mark> <mark>Furniture</mark>, Inc., please call  V"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "in the construction of <mark>Thomasville</mark> <mark>Furniture</mark>, Inc., please call  V"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [186.0, 778.54, 339.51, 1056.18], "bbox_id": "3f250170a1", "file": "TimesVirginian_1981a_0135.pdf", "page": 1, "text": ", A Charlotte County student has been awarded a T. Austin Finch Scholarship sponsored by the Thomasville Furniture Industries Foundation. He is Jeffrey L. Dean, son of Mr. and Mrs. Glen R. Dean of Charlotte Court House, Va. Mr. Dean is employed at the Armstrong Furniture Appo mattox plant, a division of Thomasville Furniture Indust ries. Jeffrey will graduate from Randolph-Henry High School and-plans to attend Virginia Polytechnic Institute and State Uimpirrity in Blacksburg study veterinary science. He and seven other 1961 scholarship recipients, aU child ren of Thomasville Furniture Industries employees, were honored at a scholarship banquet Tuesday night April 28 at the companys main office building in Thomasville."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "Scholarship sponsored by the <mark>Thomasville</mark> <mark>Furniture</mark> Industries Foundation. He is"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "Scholarship sponsored by the <mark>Thomasville</mark> <mark>Furniture</mark> Industries Foundation. He is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1901.01, 355.92, 2446.02, 579.76], "bbox_id": "c89c2b3174", "file": "AppomattoxNewspapers_1974-1975a_0276.pdf", "page": 1, "text": "Take stock in America Buy US. Savings Bonds STANDINGS Appomattox Softball League Won Lost Lawson Ford 2 0 Hilltoppers 2 1 Best Furniture 2 1 NAPA 2 1 Amoco Car Wash 1 2 Appo. Baptist Temple 1 2 Thomasv. 2 1 2 Thomasv. 1 0 2 Last Weeks Results Amoco Car Wash .,11-Thomas- ville 2,10 Best Furniture, 6 - Thomasville 2,5 Lawson Ford, 11 - Appo. Baptist Temple, 2 NAPA, 20 - Hilltoppers, 6"}, "highlight": {"text": {"matched_tokens": ["Furniture", "Thomasville"], "snippet": "11-Thomas- ville 2,10 Best <mark>Furniture</mark>, 6 - <mark>Thomasville</mark> 2,5 Lawson Ford, 11"}}, "highlights": [{"field": "text", "matched_tokens": ["Furniture", "Thomasville"], "snippet": "11-Thomas- ville 2,10 Best <mark>Furniture</mark>, 6 - <mark>Thomasville</mark> 2,5 Lawson Ford, 11"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [268.81, 487.82, 403.93, 855.15], "bbox_id": "890a932798", "file": "TimesVirginian_1980a_0141.pdf", "page": 1, "text": "sociates, Hanson Electric Co.. Harold T. and Carolyn P. Williams, Pamplin Exxon Servicenter, Tolleys Fert- liser and Fuel Co.. Webbs Tire Co., Travelers Inn Motel, J. E. Jamerson  Sons, Inc., Thomasville Armstrong Furniture, Ap pomattox Radio  TV Service, J. A. Burke  Co., Inc., Kings Market. W. Frank Moore, Inc., Wilbuns ? ational Auto Parts, Inc., he Farmers National Bank, American Federal Savings and Loan, The American Legion, The Womans Club of Appomattox. Mrs. Mary. Alma Hudson, Dr, and Mrs. Kenneth Powell, Mr. and Mrs. Burke Guill, Mrs. Peggy Franklin. Times-Vir- ginian Printing-Co. Several individuals and business contributed and wished to remain anony mous. Thanks also to Mr. Doug Webb who chaired a committee of ideal business men and women who contacted the businesses in the county for donations. Other members of the committee were Mr. Lloyd."}, "highlight": {"text": {"matched_tokens": ["Thomasville", "Furniture"], "snippet": "E. Jamerson  Sons, Inc., <mark>Thomasville</mark> Armstrong <mark>Furniture</mark>, Ap pomattox Radio  TV"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomasville", "Furniture"], "snippet": "E. Jamerson  Sons, Inc., <mark>Thomasville</mark> Armstrong <mark>Furniture</mark>, Ap pomattox Radio  TV"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
