{"document": {"bbox": [1348.82, 1593.78, 1506.23, 1648.92], "bbox_id": "62544493ea", "file": "AppomattoxNewspapers_1922-1923a_0434.pdf", "page": 1, "text": "WleW meme Bl The organiza- tiouof this branch has recently been affected, and has awakened much interest. Mrs. Thomas S. Bocock Wfts elected Regent."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "WleW meme Bl The organiza- tiouof this branch has recently been affected, and has awakened much interest. Mrs. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> Wfts elected Regent."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "WleW meme Bl The organiza- tiouof this branch has recently been affected, and has awakened much interest. Mrs. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> Wfts elected Regent."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1761.33, 605.91, 1934.11, 743.57], "bbox_id": "821f205411", "file": "AppomattoxNewspapers_1943-1947a_0428.pdf", "page": 1, "text": "We are informed by Mr. N. R. Featherston that plans are being formulated to have a bust of the late Thomas S. Bocock placed in the state capital at Richmond. Mr. Bocock was a prominent leader of the Confederacy. Town Te Get New Light"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "bust of the late <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> placed in the state"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "bust of the late <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> placed in the state"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [306.24, 422.48, 454.32, 1760.36], "bbox_id": "e479f14c1d", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "those who know his amiable deportment will admit that none can better deserve them. By Cel. Samuel D. MeDear- men - Gen. Zachary Taylor and his little army As long as our frontier is guarded by such gallant officers and soldiers, as they have proved themselves to be, one may fear no harm, though the Mexicans brag and the British Lion growl. By W. W. Hamner - The memory of Gen. Jackson. By Thomas S. Bocock - John C. Calhoun His transcendent genius, firmness and patriotism have been placed in a clearer light, by his recent course upon the Oregon question - If he is not the next President of the United States, it will be more the Countrys loss than his own. By Thomas 8. Bocock - Genera Taylor, the Hero of the Rio Grande. For his distinguish ed services in the present Mexican Campaign, he de serves the lasting gratitude of his countrymen, and the Presidency of the Union is a civil office and to be bestowed only on those who by a long course of services, show themselves able and faithful. By Thomas I. M. Cheatham - E. James Good May he soar aloft as on the wings of an eagle, in the estimation of his fellow citizens to the highest pinade of fame and pluck therefrom some of those beautiful and never facing wreaths of honor and renown, that has ever adorned the brow of our great, good and intelligent worthies of this our own, our happy America - NousVrons By Lieut. Peter H. Phelps  Wm. C. Rives, the able statesman and accomplished gentleman When will Virginia yea,,, the United States, properly appreciate him? By P B. Pankey  Colonels Benajamin P. Walker and Samuel D. McDearmon As Military Officers equalled by few. As Patriots surpassed by none. By A. H. Cox - The bravery of our soldiers on the plains of Palo Alto and Resaca de la Palma on the eighth and ninth of May prove them the worthy sons of noble sires. By Capt. Richard Perkins an invited Guest - The toast was prefaced by the remark, that it was conceived on approaching the fine barbecue and dinner - - The Whigs and Democrats They united on the Oregon Question to the 49th degree - now let us on this now more important occasion go with 540-40s - the whole hog or none. By R. H. Cox  The Ladies of Appomattox Though not in the, habit of being addressed publicly, their intelligence, modesty and beauty warrant the opinion that they are often addressed privately. By R. J. Wright - America is an island, and should be one and indivisible. By James O. Davidson - May the spirit of liberty which actuated the signers of the Declaration of Independence, be cherished in us and be perpetuated in the hearts of the young generation. By Josiah A. LeGrand - Constitutional liberty May its course be ever onward, till the whole world shall enjoy the blessedness. By John W. West - The Lieut. Col. of the 174th regiment  May his distinguished military talents be duly appreciated by the companies under his command. By Join Sears - Mr. Thomas S. Bocock May he ever continue to shine, a bright star in the affection of his countrymen. By M. C. Porter - The citizens of Appomattox May they ever be united - not consider stage roads, or other highways, as constituting points for divis ions, either in a civil, military or political point of view. By Capt. Wyatt Abbitt - The Fourth of July 1776 The day on which our fathers pledged their lives, their fortunes and their sacred honor for their country. We, this day, feel aware how honorably they redeemed their pledge. By Col. Z. E. Cheatham - The"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "of Gen. Jackson. By <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> - John C. Calhoun His"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "of Gen. Jackson. By <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> - John C. Calhoun His"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [807.35, 470.33, 969.99, 1016.3], "bbox_id": "c5e933d925", "file": "AppomattoxNewspapers_1926-1933a_0206.pdf", "page": 1, "text": "Thomas J. Thornhill, 0 n Thursday, Jan. 8 , passed away  at the home of his sister, Mrs. 3. C. James, in Salem, Va. He was laid to rest in the family jurying ground on the old Thornhill estate near Tower  Hill, Va- He fs survived by the follow- ng brothers and sisters Rev- a. R- Thornhill, a Baptist min ister in Washington, D. C. C. W. Thornhill, o f Appomattox  Jounty, Mrs. D. A. Christian, jf Richmond, Va., and Mrs- E- J- James, of Salem, Va. He was an uncle of Dr. D. A. Christian jf Appomattox. Mr. Thornhill was born in ippomattox County, Va., Oc- ober 8 th, 1849, the son of Al- jert a n d Lucinda Thornhill. After graduating in law h e ormed a partnership with the ate Thomas S- Bocock, with offices at- Buckingham Court .louse- He w as Common wealth- Attorney for Appomat- ,ox County from 1880 to 1883, j resigning from that office to go .0 Kansas City, Mo., to pract ice law, until he returned to lis old home in this County in .ebruary 1929. He was for x number of years secretary of is masonic lodge in Kansas City. 1 Mr- Thornhill was reared in a home of culture and refine ment, and naturally inheriting -hose desireable attainments, e carried them out to the idl est through his life. He wi. genial and hospitable, making I a desirable land pleasan . companion for all who were .ortunate enough to- make his acquaintance. Mr. Thornhill was a member jf the Baptist church in Kan sas City Miouri. He was jtever married."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "partnership with the ate <mark>Thomas</mark> <mark>S</mark>- <mark>Bocock</mark>, with offices at- Buckingham"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "partnership with the ate <mark>Thomas</mark> <mark>S</mark>- <mark>Bocock</mark>, with offices at- Buckingham"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [416.16, 1484.9, 576.41, 2006.78], "bbox_id": "5e7ce1b7cb", "file": "AppomattoxNewspapers_1898-1902a_0617.pdf", "page": 1, "text": "The P o rtrait o f H on. T . S Bocock. The portrait of Hon. Thomas S, Bocock was presented to the Con federate Museum this morning by Judge Christian, on behalf of Mrs T. S. Bocock. amid an assembly of representaive Virginian Confederates Dr. Smith, chaplain of the Museum being master of ceremonies, in troduemg the speakers. Judge George L. Christian made an instructive and eloquent address, iu which he reviewed the seventy seven years of Speaker Bococks life, In his introduction he said in trying to honor the good and true we honor ourselves, and we are doing that this morning. He commenced from his birth in Buckingham county, and took his audience through the varied scenes of his life, his election to Con gress iu 1847 for seven consecutive terms, duriug which several branches of the Navy were reformed. At th conclusion, Mastor Thomas Bocock Price namesake and oldest grand child, unveiled the portrait. Hon. John Goode accepted the portrait on behalf of the ladies of the Confederate Museum, in au eloquent and patriotic speech, which was frequently interrupted by bursts of applause. In receiving this por trait, he said  Hallowed associations come u from the past, and I see in imagiua tion many familiar faces, which, if they could speak, would tell of this old White House, which is without a blot. Here lived Jefferson Davis bold as a lion heart Robert E . Lee, peerless captain among the sons of men Stonewall Jackson,that thun derbolt of war J . E. B. Stuart, the flower of cavaliers. We would not forget them if we could not if we would, for sufferings of right are grown deep ou the chronicles of nations. As a man he whose portrait"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "The portrait of Hon. <mark>Thomas</mark> <mark>S</mark>, <mark>Bocock</mark> was presented to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "The portrait of Hon. <mark>Thomas</mark> <mark>S</mark>, <mark>Bocock</mark> was presented to the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1883.44, 1173.15, 2057.09, 1734.19], "bbox_id": "821ef3073d", "file": "AppomattoxNewspapers_1936-1939a_0043.pdf", "page": 1, "text": "the Houdon Statue. The speech he delivered on that occasion was a masterpiece in every respect. By this time he had so favorably impressed upon the people of the United States his geniality, his high sense of duty to his people, his cour tesy at all times, his consideration of the rights of others, his firmness in his convictions as to a principle, his brilliantical gifts, his powers iii debate, showed in marked degree -that .fe possessed every lesBenjtial to make him the logical candidate for the high office of President of the United States, that they were ready to place the banner of their party in his hand, which office he was as capable of filling as any man who ever occupied the Presidential chair. That eventful, but fateful, period, the four years from 1861 to 1865, which cast such a gloom over our fair. Southland, blasted, not only the future political success of this brill iant son of the United States, but many others of that period who hap pened to have the honor of residing south of the Mason-Dixon line. While in Congress, Mr. Bocofck was made Chairman of the Com mittee on Naval Affairs, serving a- bout ten years in that capacity, and so reformed and advanced the po licy of the Navy as to bring favor able comment, not only from the United States but from other na tions. During the dark days from 1861 to 1865, when the best brain and talent was essential for the Confed erate Cabinet, Thomas S. Bocock was wisely chosen Speaker of the Con federate Congress, filling that posi tion with great distinction and un surpassed ability during the entire life of the Confederacy. As soon as the War closed a wealthy and leading Democratic poli tician f New York begged Mr. Bo cock to come to New York and prac tice law, guaranteeing him the sum of 20,000.00 per annum -until he could establish himself and return to Congress, but to this and other tempting offers he turned a deaf ear, choosing rather to suffer af fliction with his own people than to enjoy the riches of those who had impoverished them. Soon after the close of the War Between the States, on account of"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "the Confed erate Cabinet, <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> was wisely chosen Speaker"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "the Confed erate Cabinet, <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> was wisely chosen Speaker"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [186.26, 691.38, 343.86, 890.23], "bbox_id": "b8dba6a603", "file": "AppomattoxNewspapers_1902-1905a_0256.pdf", "page": 1, "text": "Rev. W. K. Bocock died in Pbila delphia on the 15tn instant, and his remains ware interred at Lexing ou. Va., on the 20th. Mr. Bocock as the son of an eminent Presbyter.t n divine, the Rev. John H. Bocock. D. D., and nephew of a former t!iJr- ney-general of Virginia, the Hon. Willis P. Bocock, and of the Hon. Thomas S. Bocock, for many years a member of the Federal Congress, and the only Speaker of the Con federate Congress. His mother, Sarah Margaret Kemper, is a sifter of the late General James Lawson Kemper, Governor of Virginia fri.m 1873 to 1877."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "and of the Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, for many years a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "and of the Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, for many years a"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.08, 571.86, 1907.51, 597.96], "bbox_id": "c80c0248e3", "file": "AppomattoxNewspapers_1943-1947a_0428.pdf", "page": 1, "text": "PLAN HONOR FOR LATE THOMAS S. BOCOCK"}, "highlight": {"text": {"matched_tokens": ["THOMAS", "S", "BOCOCK"], "snippet": "PLAN HONOR FOR LATE <mark>THOMAS</mark> <mark>S</mark>. <mark>BOCOCK</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["THOMAS", "S", "BOCOCK"], "snippet": "PLAN HONOR FOR LATE <mark>THOMAS</mark> <mark>S</mark>. <mark>BOCOCK</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [165.84, 466.23, 312.32, 1762.57], "bbox_id": "0a8502fbfc", "file": "TimesVirginian_1976_0243.pdf", "page": 1, "text": "Palma Let him now take his stand in the front rank of American Heroes. By Maj. Samuel J. Walker - Bartholomew Cyrus the only surviving Revolutionary Sol dier present May his last days behübest. By Bartholomew Cyrus A Revolutionary Soldier - May the feelings which filled the hearts o f the Patriots of the Revolution be justly appreciat ed by the youth of the present day. By Dr. Wm. D. Christian Speedy peace with Mexico continued peace with Great Britian and the world. By Maj. Samuel J. Walker  Gen. Scott and Gen. Gaines The distinguished services of these Generals in the late war, and the blood the one spilt at Lundys Lane and Chippewa, the other at Erie, will protect them against the assualts of President Polk and his Secre tary of War. The American people understand how to estimate these services. By Thomas S. Bocock  Gen Scott We thank him for what be has done for his country and only wish that during the next Presidential term he may take his hasty plate of soup in privacy, without the fear of enemies either in front or rear. By Rkhard Perldiu invited Guest - The County of Appomattox, I hope the hospitality exhibited by her citizens this day Will form a closer alliance with her deserted parents. I was her greatest enemy in war, in peace her best friend. By QBss  Partwood  Henry Claftffie wisp end good May posterity do homage to hie destinguished ability, by implic it acquiescence in the great leading measures of his policy of our Government By Cat Beujamiae P. Walker - John J. Crittenden The unrivalled Orater, accomplish ed Gentleman and able Senator, he deserves the gratitude of his Country for his services on the Oregon Question. By P. B. Pankey - Col. T. H Flood - long the whig tide of Buckingham surely Hot diked by Appomattox. Loci Focoisn. By Capt. J. A. Hamer - General Taylor like a Washing ton and Jackson May he long be remembered by the Ameri can People. By Henry F. Bocock - The ladies  of Appomattox, as patriotic as they are fair. By A. A. LeGrand - The perpetuation of our Republican Government and the just appreciation of the rights of the governed. By G. W. A. Raine - E. J. Goode - Reader of the Declaration of Independence - May a distinction worthy of the intelligence and patriotism of his youth crown his entire manhood with the love and respect of his countrymen. By H. F. Bocock - R. M. T. Hunter A fearless advocate of the rights of the people, regardless of the consequences which may result to himself - May he fill the seat about to be vacated by our distinguished Senator, Wm. S. Archer. By Capt. Thomas W. Johns - Gen. Andrew Jackson The warrior and statesman sleeps with his fathers. His memory will evpr be reversed alike by philanthropists and patriots, his services both in the council chamber and upon the lentel field will be handed down to the latest posterity - and shine as morning lights in his countrys history. By A. A. North - The United States and Texas - Long may this union of the two republics last and long may it continue to disperse its blessing? to the countless millions who in the course of time, are determined to animate its soul. By E. B. le nd - Henry Clay - May his evening sun set as tranquil as was his meridan, bright and luminous. By A, W, Carter - Edmund J. Goode The handsome which he this day delivered, gives us promise of future distinction and usefulness, and"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "estimate these services. By <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>  Gen Scott We thank"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "estimate these services. By <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>  Gen Scott We thank"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [893.7, 889.7, 1009.24, 1067.49], "bbox_id": "49ee285ba9", "file": "AppomattoxNewspapers_1947-1949a_0221.pdf", "page": 1, "text": "P. L. Thornton Dr. J. R. McDearmon Hon. Thomas S. Bocock S.F. Wright J. W. Flood J. R. Franklin C. T. Plunkett Dr. J. R. Robertson James Couch F.. H. Thornton Wm. H. Trent Dr. R. H. Watkins Spencer Gilliam Wm. B. Farnar Rev. J. H. Cawthorn John Sneed Sfc D. McDearmon Dr. T. P. Mathews."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "J. R. McDearmon Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> S.F. Wright J. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "J. R. McDearmon Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> S.F. Wright J. W."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1459.88, 282.95, 1625.83, 1036.98], "bbox_id": "5eb513a87f", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "Number 5 of a Series of Histor ical Articles About Appo mattox. On Thursday after the first Monday in May, 1845, the first county court of the newly form ed county of Appomattox met a Clover Hjill, the new county seat. Among those meeting to organ ize the new countys government were Joel Watkins, William Math ews, Major Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Co Thomas H. Flood, Nathan L Hancock, Bryant Nowlin, Co. Z. E. Cheatham, Washingto Hunter, Sterling O. Andersoi John HL Plunkett and Jame. McDearmon. Joel Watkins, senior justice o the county w a s commissionec the first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. Wat kins were named deputies. Th. following other county officer were named All the first offi cers were named by the counts court instead of by election. John T. Bocock, first clerk Thomas S. Bocock, first com monwealths attorney  Thoma W. Johns, commissioner of reve nue Andrew B. Baker, corroner Before the next term of th court, John T. Bocock, the firs clerk, died and Henry F. Bocock his son, was named in his place He continued to hold this pos until July 1, 1860, when he re signed and moved to Lynchburj to engage in the mercantile bus iness. ! Col. Z. E. Cheatham, who hai been in the legislature iron Campbell county before the for mation of Appomattox, was th first representative of Appomat tox in the Hfciuse of Delegates He had also been  appoints county surveyor. The post offices in the count when it was formed were Clov er Hill, the county seat. Thi was soon afterwards changed t Appomattox Court House, nov Old Appomattox Bent Creek Oakville, Walkers Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept at Chiltons Tav ern. It might be mentioned her that Raleigh Chilton, postmaster at Concord at the time Appomat tox county was formed in 1845 was very much opposed to th new county. It was told1 tha on opening mail addressed t Appomattox Court House, hr would always refer to it as Scrap Court House. The voting precincts of thi"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "T. Bocock, first clerk <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, first com monwealths attorney"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "T. Bocock, first clerk <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, first com monwealths attorney"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1447.45, 261.17, 1614.78, 1082.87], "bbox_id": "d999ab8c10", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Num ber 5 of a Series of Histor ical Articles About Appo- J n a tto x . . On Thursday after the first Monday in May, 1845, the first eeunty eourt tff the newly forir ed county of Appomattox m et a Clover 1011, th e newcouhty seat. Am ong those m eeting to organ ize the new countys government were Joel W atkins, William Math ews, M ajor Thomas Rudd, Joh W. Marshall, Dr. Rueben D. Pa mer, Col. Benj. P. Walker, Coi Thomas H. Flood, Nathan t Hancock, B ryant Nowlin, Co Z. E. Cheatham, Washingto H unter, Sterling C. Andersoi John H. Plunkett and Jame, McDearmon. Joel W atkins, senior justice o the county w a s commissionei th é first sheriff. Samuel D. Me Dearmon, William James Me Dearmon and William J. W at kins were named deputies. Th. following other county office were named All the first offi cera were named1 by the count court instead of by election. John T. Bo cock, first clerk Thomas S. Bocock, first com monwealths attorney Thoma W. Johns, commissioner of reve nue Andrew B, Baker, corroner Before the next term of th court, John T. Bocockf the firs clerk, died and Henry F. Bocock his son, was named in his place He continued1 to hold this pos until July 1, 1860, when he re signed and moved to Lynchbur to engage in the mercantile bus iness. Col. Z. E. Cheatham, who hat been in the- legislature i ron Campbell county before the for m ation of Appomattox, was th first representative of Appomat tok in the Hhuse of Delegates He had also been appointe county surveyor. The post offices in the count when it was form ed were  Clov er Hill, the county seat. Thii was soon afterw ards changed t Appomattox Court House, nov Old Appomattox  Bent Creek Oakville, W alkers __ Church Pamplin, then called Merrymlan Shop Ready Spring and Con cord, then kept a t Chiltons Tâv ern. It m ight be mentioned her th a t Raleigh Chilton, postmaster a t Concord at the tim e Appomat tox county was formed in 1845 was very much oppôsèd to th new county. It was told., thai on opening mail addressed t Appomattox Court House, hi would always refer  to it as Scrap Court House. The voting precincts of th new county were a t the court house, W alkers Church, Pake- ville and Spout Spring. A t th at tim e any  eligible voter could vote a t any precinct in the county where he happened to be on election day."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "Bo cock, first clerk <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, first com monwealths attorney"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "Bo cock, first clerk <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, first com monwealths attorney"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [487.44, 392.83, 659.14, 918.17], "bbox_id": "e90c8d5e33", "file": "AppomattoxNewspapers_1926-1933a_0501.pdf", "page": 1, "text": "Mrs. Martha A. Gills, a for mer resident of Appomattox, died at the home of her daugh ter, Mrs. T. L. Payne, in Crewe, April 11. Mrs. Gills was 93 years of age. She was a daugh ter of the late Captain Wilson Hix, of Appomattox, a leader in the community which play ed so dramatic a part in the War Between the States. Her mother was a sister of Hon. Thomas S. Bocock, of Appo mattox, who was the speaker of the House during the brief re gime of the Confederacy. Mrs. Gills remembered vivid ly the circumstances of the sur render of General Lee at Appo mattox. The surrender took place on a farm owned by her rather, and the terms of sur render were drawn and signed in a building formerly owned by her father, who sold it to Major McLean during the war. General Grant took possession of her fathers home for eight days while the Confederate sol diers were being paroled. When the Union soldiers were beginning to evacuate the village, an officer approached the young daughter of the house and informed her that he had hidden away a barrel of flour and a chicken, so that when they were gone her fami ly might not suffer for provi sions. The gloom of war was bright ened for Mrs. Gills by the ro mantic attachment she felt for her first cousin, Daniel Gills, a young cavalrymen in Fitzhughjj Lees brigade, which after the war culminated in marriage. Her husband, with his six brothers, William, Watt, John, and Edmund"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "a sister of Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, of Appo mattox, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "a sister of Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, of Appo mattox, who"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [487.2, 370.05, 645.02, 505.65], "bbox_id": "3b1d9e534b", "file": "AppomattoxNewspapers_1908-1909a_0501.pdf", "page": 1, "text": "Mrs. Martha A. Gills, a for mer resident of Appomattox, died at the home of her daugh ter, Mrs. T. L. Payne, in Crewe, April 11. Mrs. Gills was 93 .years of age. She was a daugh ter of the late Captain Wilson Hix, of Appomattox, a leader in the community which play ed so dramatic a part in the War Between the States. Her mother was a sister of Hon. Thomas S. Bocock, of Appo-"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "a sister of Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, of Appo-"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "a sister of Hon. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, of Appo-"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [881.01, 804.16, 1042.76, 852.46], "bbox_id": "ffeda3ab56", "file": "AppomattoxNewspapers_1936-1939a_0045.pdf", "page": 1, "text": "Liteol Thomas S. Bocock"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "Liteol <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "Liteol <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [573.09, 262.54, 733.05, 433.49], "bbox_id": "bdb7a0e61b", "file": "AppomattoxNewspapers_1898-1902a_0617.pdf", "page": 1, "text": "is before us, acted well his part in all relations of life as a lawyer, was of clear and deserving judgm ent as an orator, eloquent and pathetic as a statesman, conservative aud unsel fish as a citizen, without fear of reproach as a friend, I know he was as constant as the needle to the pole as a husband, tender, true as a father, affectionate and kind and as a Christian, had a cnildlike faitb, When Virginia shall come to make up her jewels and call the long roll of her illustrious sons, the name of Thomas S. Bocock will not be for gotten, till the lineaments of artists hall have died away and the ever-"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "sons, the name of <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> will not be for"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "sons, the name of <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> will not be for"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [234.51, 1487.32, 685.33, 1624.77], "bbox_id": "fce4769759", "file": "AppomattoxNewspapers_1892-1898a_0341.pdf", "page": 1, "text": "in aD0ther colm of onr reummber his atribra against Vr -1 oldfr8 Stote eCare  He is truly the wonder of ginias Supreme Court ? Who does . ree 88 Amherst is not know that he dragged the ometime8 called, will stretch every judiciary into the vortex of repndia- nerTe to make the victory a glorious tion and from every political rostrum in the Commonwealth bitterly scof- fed at authority of the courts ? At Appomattox Courthouse, on Thursday, September 9. 1881, in joint debate with Hon. Thomas S Bocock, as shown by the files of this newspaper Colonel Cameron, in a fit of pas sion, charged, as sqnarelv as words"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "joint debate with Hon. <mark>Thomas</mark> <mark>S</mark> <mark>Bocock</mark>, as shown by the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "joint debate with Hon. <mark>Thomas</mark> <mark>S</mark> <mark>Bocock</mark>, as shown by the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2053.84, 1172.44, 2222.94, 1396.25], "bbox_id": "c44ed8aa21", "file": "AppomattoxNewspapers_1936-1939a_0043.pdf", "page": 1, "text": "financial coitditioni, Mr, Bocock moved to Lynchburg and engaged actively in the practice -of law, and there the people at once recognized his unsurpassed ability, and always put him forward as tlelesder and speaker op all important occasions. When the President of the United States visited Lynchburg, he headed the reception committee and deliver ed the address of welcome. When ever there was an important politi cal meeting, Thomas S. Bocock was the leading speaker. Bub with all these attractions held out to him by the city of Lynchburg, they could not hold him, for his old home and friends in Appomattox were still his ideal and foremost in his thoughts. As soon as possible he returned to the soil of his youth which was sacred to him. During the dark days of recon struction the compromise Governor Continued on Page Four"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "important politi cal meeting, <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> was the leading speaker."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "important politi cal meeting, <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> was the leading speaker."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1024.75, 332.78, 1378.29, 497.13], "bbox_id": "2e434f60f3", "file": "AppomattoxNewspapers_1943-1947a_0166.pdf", "page": 1, "text": "Cabell Breckinridge, Sec. of War. I Tee following is the historical program of the Appomattox Chap ter of U. D. C. for 1945 January Matthew M ontaine Maury, Mrs. L. Crawley. Thomas J. Jackson, Mr. N. R. Featherston. Col. Thomas S. Bocock, -Miss Jones read Mr. Feathemons contest pa per. Hostess Miss M. Anna Jones. j February Mesdames L. Crawley and C. F. James, hostesses. Lead- j Treasury, Mrs. Ola Patteson, lead-! ! ers- Mrs. R. C. Moore, Hon. Robt. er. George Wythe Randolph. Conf. i i Tombs, first Secretary of State,  Sec. of War, Mrs. W. P. Coleman, j I Confederate cabinet Mrs. J. A. leader. History of Appomattox j Burke, Alexander H. Stephens and j families who contributed to th e. Hampton Roads Conference, 1865.  civic, military, industrial and agri- j"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "N. R. Featherston. Col. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, -Miss Jones read Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "N. R. Featherston. Col. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, -Miss Jones read Mr."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1381.15, 1191.86, 1548.78, 1733.71], "bbox_id": "e3075a266e", "file": "AppomattoxNewspapers_1936-1939a_0043.pdf", "page": 1, "text": "An open invitation has been ex tended to the public to write on the political life of the late Thom as S. Bocock. While I shall make a feeble attempt to write on that subject, I shall also touch on his social life, as any write-up of his political life would be incomplete without the social side. As the wheels of time roll on, each day bringing into the _ world  souls great and small, as bright a .star as decked the sky peeped down into old Buckingham County, Vir ginia, on the 15th day of May, 1815, and welcomed into this world the spirit of Thomas Salem Bocock, and from that time On that bright star -of intellect and high character was his guide, and never did that star have to dim its light on account of its subject failing to measure up to the highest standard. That star led him through his young days on into old Hampden- Sydney College, en tering there in 1837, and gradua ting in 1838 with an A. B. degree and the highest honors of his class. He was able to graduate in one year of having studied under his older brother, Col. Wiillis P. De code, who was a graduate of Hamp den- Sydney. From the close of his school days he was very active in politics and the practice of law. If he possessed political ambitions, it was not nec essary for him to make that fact known, for, being a young man of such brilliant mind, gigantic intel leett his powers as a debater, his oratorical powers, his unvarying courtesy, pleasing personality were all so naturally ootstandinf that his People were always ready to press him forward to any position of honor in their power to bestow up on him, and the political historian  ftu a8 place the name of  Thomas S. Bocock among the bright est stars of fame to shine while roll the wheels of time, leaves that history incomplete. In 1842, when a young man, he sent to the Legislature from uckingham County, and when the in Appomattox was formed  1845 he was made the firSt Com- - Weah Attorney. The people n realized that the mantfe"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "place the name of  <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> among the bright est"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "place the name of  <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> among the bright est"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.12, 614.05, 1690.06, 743.1], "bbox_id": "a713df7a1e", "file": "AppomattoxNewspapers_1947-1949a_0054.pdf", "page": 1, "text": "A tablet to the memory of the 1 honorable Thomas S. Bocock was presented to the Commonwealth of - Virginia by the Virginia Division, ! United Daughters of the Confeder acy, on Monday, June JO. The tab- ! let has been placed on the wall of  the old Hall of Delegates in the Capitol at Richmond, where Mr. Bocock presided over the Confeder ate House of Representatives I throughout the War Between the States."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "of the 1 honorable <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> was presented to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "of the 1 honorable <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark> was presented to the"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1605.63, 1560.71, 1756.01, 1580.06], "bbox_id": "76247e955d", "file": "AppomattoxNewspapers_1952-1954a_0017.pdf", "page": 1, "text": "5. Thomas S. Bocock, Hal Flood, J . W. Flood and W. M. Abbitt."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "5. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, Hal Flood, J . W. Flood and W. M. Abbitt."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "5. <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>, Hal Flood, J . W. Flood and W. M. Abbitt."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1353.11, 494.76, 1516.85, 1553.52], "bbox_id": "9a3811780f", "file": "TimesVirginian_1976_0319.pdf", "page": 1, "text": "- Labor Day was on the quiet aide in Appomattox. Up and .  about early as usual, I drove through town and was proud to aee that most business places iiad the Flag on display in honor of the holiday. But streets were deserted add around town I heard only one lawnmower in 4 Btion. It is not news to report that when banks are dosed, the post office dosed, lawns are dry had do not need mowing, gardens are about through for he year, few m eetings   Scheduled, the Sunday dishes washed, most payroll plants dosed. Labor Day does not mean that we are laboring. Rather, quietly observing one of our fine holidays. And the ext holiday on my calendar is Veterans Day, set up for Monday, October 25, and that is âges away. After that. Thanks- giving, my Birthday, and  Christmas. Could he that the most rftlfig news around town is talk of Swine Flu shots.     ACHS won its opening football gam e. Gretna fell v4fetim to the Raiders, and we  iv e hopes for a winning season on the gridiron. I bought  three Sunday newspapers, and could not find out how Slippery f Rode came out. V PI fans are happy and sports news will be ill priority awhile now. e   Fetched in from my garden what might wqB be thelgst 11 m nf h iw  .,A üMr.aM of red, a bud w heniboughtitto but opened as bést it could be mornmg. Ah yes, soon will be bulb planting time for Springs i f display.     For some time I have been wanting to write a bit about one of Appomattox Countys most distinguished sons, Thomas S. Bocock. Thomas Stanhope Bocoek was born May 18,1815 and that was thirty years before Appomattox County was formed. It was in that portion of the county then listed as Wwiringhwn. He was educated by private tutors and then graduated from Hampden- Sydney College in 1838. He was admitted to The Bar in 1840 and was a member of the House of Delegates of Virginia, 1842-44. He was prosecuting attorney for Appomattox County, 1845- 46 and was elected as U . S. Congressman and served from March 4, 1847 until March 8, 1861. A t that time he was fleeted to the Congress of the Confederate States of America and was chosen as Speaker of that body February 18,1862. After the War Between the States, he returned to Appo mattox and served in the State Legislature aa Delegate for the terms of 1869, 1870, 1877 and 1878. He was a delegate to the Democratic National Conven tion in New York City in 1868, at St. Louis in 1876 and at pi wh rm ati in 1880 . He died in hfr home county of Appomattox August 5,1891 and is buried in Che fam ily cem etery near Ttfidway, Appomattox County. yfoy list of Hie great sons of Appomattox would have to place Thomas S. Bocock at or npar the very top.  Source of above...Biographical Directory of The Americn Congress, ft4-1927."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock", "Thomas"], "snippet": "Countys most distinguished sons, <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>. <mark>Thomas</mark> Stanhope Bocoek was"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock", "Thomas"], "snippet": "Countys most distinguished sons, <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>. <mark>Thomas</mark> Stanhope Bocoek was"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1078.34, 755.44, 2275.97, 875.14], "bbox_id": "5ec54d7e0f", "file": "AppomattoxNewspapers_1915-1918a_0019.pdf", "page": 1, "text": "Mrs. Annie H. Bocock Dies. Mrs. Annieo Himes Bocock widow of Thomas S, H as Helped Thousands, Maybe th a t H aitian cyolone blew Bobo away. Bocock, who for a long time was a member of the Federal Con gress at W ashington, and later I Speaker of the Confederate Congress, died Wednesday m orning a t the home of her daughter, Mrs,"}, "highlight": {"text": {"matched_tokens": ["Bocock", "Thomas", "S"], "snippet": "Dies. Mrs. Annieo Himes <mark>Bocock</mark> widow of <mark>Thomas</mark> <mark>S</mark>, H as Helped Thousands,"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock", "Thomas", "S"], "snippet": "Dies. Mrs. Annieo Himes <mark>Bocock</mark> widow of <mark>Thomas</mark> <mark>S</mark>, H as Helped Thousands,"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1720.07, 989.81, 1885.77, 1073.26], "bbox_id": "e0ab861e51", "file": "AppomattoxNewspapers_1936-1939a_0030.pdf", "page": 1, "text": "life of Thomas S. Bococx, by Miss M. Anna Jones. Mr. Bocock was a citizen of Appomattox eounty who served as speaker of the Confeder ate Congrses,  Delegates were appointed to the state convention in Richmond, and titye general convention in Charles ton, South Carolina."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "life of <mark>Thomas</mark> <mark>S</mark>. Bococx, by Miss M. Anna Jones. Mr. <mark>Bocock</mark> was a citizen of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "life of <mark>Thomas</mark> <mark>S</mark>. Bococx, by Miss M. Anna Jones. Mr. <mark>Bocock</mark> was a citizen of"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2137.22, 771.83, 2402.93, 925.1], "bbox_id": "157006f838", "file": "AppomattoxNewspapers_1947-1949a_0113.pdf", "page": 1, "text": "VII Jr a.  rk of the I Coa t pf Appomattox County. Thom- as j Bocock solved as Congress- iSSfet- man in the U. S. House of Repre- sentatives prior to ille oiit break of the War Between the States. After r a f f i l i Sectissi on lie was elec ted ropresenta- ti ve to t le Confeder ite liouse of Represen -atives in 1ti oh nond and Spe aker if that body A tablet com- memorating Thomas S. Bococks Named serv ate ice as Hous Speaker of e of Rcpres the enti Confeder- itivos was reel ntly ledicated at the State Cap- i  ilol In Richmond. In 18 5, the Bo-"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "A tablet com- memorating <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>s Named serv ate ice"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S", "Bocock"], "snippet": "A tablet com- memorating <mark>Thomas</mark> <mark>S</mark>. <mark>Bocock</mark>s Named serv ate ice"}], "text_match": 1736172785157275769, "text_match_info": {"best_field_score": "3315687620608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172785157275769", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [331.43, 1418.41, 500.26, 1764.46], "bbox_id": "0d9f5848c4", "file": "AppomattoxNewspapers_1926-1933a_0198.pdf", "page": 1, "text": "This estimable lady died last I week in Richmond. She was the I wife of Dr. Johnson of the Pres- I byterian Seminary of that place. I Mrs. Johnson was 65 years old. I She is survived by her husband, I one son, Thomas Cary, tw o daughters, and one son, Thomas! Cary Price, of her former mar riage. Her sisters, Mrs. Salliel B. Roberts, of Chase City, Miss I j Belle Bocock, of Washington and a brother, Willis Bocock, of Hanover county, also survive her. Interment took place in Holly wood cemetery. Mrs. Johnson was the daugh- of Col. Thos. S. Bocock, formerly! of Appomattox county, and who was congressman from this dis trict for 14 years, and who was speaker of the house in the Con- j Congress in Richmond during the Civil War and afterwards practiced law in Appomattox county. She was also the grand daughter of Chas. J. Faulkner one time minister to France from the country."}, "highlight": {"text": {"matched_tokens": ["S", "Bocock"], "snippet": "daugh- of Col. Thos. <mark>S</mark>. <mark>Bocock</mark>, formerly! of Appomattox county,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Bocock"], "snippet": "daugh- of Col. Thos. <mark>S</mark>. <mark>Bocock</mark>, formerly! of Appomattox county,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1431.08, 353.5, 1597.02, 1750.43], "bbox_id": "08ce287cab", "file": "AppomattoxNewspapers_1908-1909a_0582.pdf", "page": 1, "text": "Taking a leaf from Appt mattox history. In 1877 Capt N. H. Hàficock ran agains Thomas S. Boccek for th house of delegates from thi county. The vote was as fol lows Court house, Bococ 185, Hancock 35 Walker Church, Bocock 108, Hancoc 65 Tower Hill, Bocock 101 Hancock 50 Bethany, Bococ 66, Hancock 74 Woodlawr Bocock 64, Hancock 89 Oak ville, Bocock 69. Hancock 29 Stonewall, Bocock 77, Hancock 51. In the 1876 presidential elec tion, Hayes g o t 809 votes ir the county and Samuel Tilden got 946. The total vote in thi county in the election was 1,- 755.    And now a word about old Uncle Spiller Trent. Spillei has been in the employ of th Times-Virginian since 1896. H was born a slave and was freed along with the rest by Lincoln He, was a sizable lad when Let surrendered here. Tuesday o this week, Spiller failed b show up for work. His left lej has given out on him the high before and since then he ha been-in bed. Maybe he won be at work anymore. W hope he will get back on th job. Somehow, there is noth ing finer to us in the Sout! than a- real old-time darkey.  have a measure of respect fo thîem. Spiller is one of thi finest types and no one livinj in this county has seen more o its history unfold than t h i i venerable old fellow. Thii paragraph is his. The onlj way I ever beat him to worl of a morning was to stay her all nightfor he got hère be fore the man went around tc blow out de lights.   V Dr. Douglas S. Freeman Richmond editor and orator likes Appomattox ham. Las fall he ivas in Lynchburg anc was served some ham whose flavor lasted. He was told il ame from Appomattox. Si last week he wrote to an Ap pomattox merchant to send him a- 20-pound Appomattox ham. Twas done.     And now as to Herr Adolph Hitler and the war crises ir Europe. One has to give ,onl impressionistic views, because censorship prevents any of ui from knowing what actually i going on. Father Darkleaf i enough of a journalist to know that. So our personal impres sions the anti-Jewish demon trations and persecutions wc read of, I guess to be exagger ated and fed us tô arouse Anti- Hitler sentiment. If the wai lords want you and I to fight Germany again, they will have their artists paint pla cards of Hitlerites butchering innocent cantors and Semetic babes. Further, what right has France to fuss about any body else arming? G man reparations hèlped pay for Frances present bristling arm ies. What would you do if you were German I . .all your neighbors armed a n d waiting an excuse to jump on you . . . and strippedof all means of de fending yourself legally . . , wouldnt you carry a razor in your, sock? I am nqt a Ger man sympathist or apologist, but when Hitler says, It is not wise to rob people of their eco nomic means of existence with out taking into account their right to live and Germany wants nothing she is not will ing to give to others, then I say, these are not bad words.   . THINGUMBOBS The Farm ers Bank has a loan of 20,000 from the R.F.C. The Associ ated Press tells us  J. El Din widdie out riding around the routes with local R.F.D. car riers there was virtually a tie for first honors in t h e Appo mattox graduating class This Madame Risca is really W. A. Baldwins wife saw a street car pushing a big passenger bus for a block in Lynchburg one day this week  theres something sentimental about closing day at school a fea ture at the county fair this year may be a public wedding, providing anybody feels t h a t way  ran off over 20,000 im pressions cm our presses this week heres hoping that some wise guy some day will invent a hose for .ladies that wont run, the present system being nothing short of a nar tional calamity. BBS"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S"], "snippet": "H. Hàficock ran agains <mark>Thomas</mark> <mark>S</mark>. Boccek for th house"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S"], "snippet": "H. Hàficock ran agains <mark>Thomas</mark> <mark>S</mark>. Boccek for th house"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1437.8, 374.84, 1601.36, 1773.46], "bbox_id": "e3c5d633df", "file": "AppomattoxNewspapers_1926-1933a_0582.pdf", "page": 1, "text": "Taking a leaf from Appi mattox history. In 1877 Capt N. H. Hancock ran agains Thomas S. Boccck for th house of delegates from thi. county. The vote was as fol lows Court house, Bococ 185, Hancock 35 Walker Church, Bocock 108, Hancoc 65 Tower Hill, Bocock 10i Hancock 50 Bethany, Bococ 66, Hancock 74 Woodlawr Bocock 64, Hancock 89 Oak ville, Bocock 69. Hancock 29 Stonewall, Bocock 77, Hancock 51. In the 1876 presidential elec tion, Hayes g o t 809 votes ir the county and Samuel Tilder got 946. The total vote in the county in the election was 1,- 755.    And now a word about old Uncle Spiller Trent. Spillei has been in the employ of the Times-Virginian siBce 1896. He was born a slave and was freed along with the rest by Lincoln He was a sizable lad when Let surrendered here. Tuesday oJ this week, Spiller failed t show up for work. His left lei has given out on him the nigh before and since then he ha been in bed. Maybe he won be at work anymore. W hope he will get back on thf job. Somehow, there is noth ing finer to us in the Soutl than a real old-time darkey.  have a measure of respect fo thiem. Spiller is one of the finest types and no one livinj in this county has seen more o its history unfold than t hi  venerable old fellow. This paragraph is his. The onlj way I ever beat him to worl of a morning was to stay here all nightfor he got here be fore the man went around tc blow out de lights.    Dr. Douglas S. Freeman Richmond editor an d orator likes Appomattox ham. Las fall he was in Lynchburg anc was served some ham whose flavor lasted. He was told il came from Appomattox. Sc last week he wrote to an Ap pomattox merchant to send him a 20-pound Appomattox ham. Twas done.  a a a And now as to Herr Adolph Hitler and the war crises ir. Europe. One has to give onl impressionistic views, because censorship prevents any of uf from knowing what actually h going on. Father Darkleaf i enough of a journalist to know that. So our personal impres sions the anti-Jewish demon trations and persecutions we read of, I guess to be exagger ated and fed us to arouse Anti- Hitler sentiment. If the wai lords want you and I to fight Germany again, they will have their artists paint pla cards of Hitlerites butchering innocent cantors and Semetic babes. Further, what right has France to fuss about any body else arming? Gftman reparations helped pay for Frances present bristling arm ies. What would you do if you were German . . .all your neighbors armed a n d waiting an excuse to jump on you . . . and stripped of all means of de fending yourself legally . . . wouldnt you carry a razor in your sock? I am not a Ger man sympathist or apologist, but when Hitler says, It is not wise to rob people of their eco nomic means of existence with out taking into account their right to live and Germany wants nothing she is not will ing to give to others, then I say, these are not bad words.     THINGUMBOBS The Farm ers Bank has a loan of 20,000 from the R.F.C. The Associ ated Press tells us J. E. Din widdie out riding around the routes with local R. F . D. car riers there was virtually a tie for first honors in t h e Appo mattox graduating class This Madame Risca is really W. A. Baldwins wife saw a street car pushing a big passenger bus for a block in Lynchburg one day this week theres something sentimental about closing day at school a fea ture at the county fair this year may be a public wedding, providing anybody feels t h a t way ran off over 20,000 im pressions on our presses this week heres hoping that some wise guy some day will invent a hose for .ladies that wont run, the present system being nothing short of a na tional calamity."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S"], "snippet": "H. Hancock ran agains <mark>Thomas</mark> <mark>S</mark>. Boccck for th house"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S"], "snippet": "H. Hancock ran agains <mark>Thomas</mark> <mark>S</mark>. Boccck for th house"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.14, 1427.3, 1509.94, 1592.35], "bbox_id": "784080bab8", "file": "AppomattoxNewspapers_1892-1898a_0219.pdf", "page": 1, "text": "Mrs. Bocock In W asltingaon. The following is clipped from the ra 8 hington Post of Sunday Mrs. ocock, widow of Hon. Thomas S. ocock, of Virginia, is spending a iw days with her sister, Mrs. S. eidleton Fatlkner-Pierce. Mrs. Ocock is a daughter of the late Ion. Charles Jsmes Faulkner, of ie 8 t Virginia, and duriug Mr. Bo- cks long term in Congress, extend- ng over twenty years, was a conspic- ious figure in society, which contiu led to the beginning of the late war."}, "highlight": {"text": {"matched_tokens": ["Thomas", "S"], "snippet": "ocock, widow of Hon. <mark>Thomas</mark> <mark>S</mark>. ocock, of Virginia, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S"], "snippet": "ocock, widow of Hon. <mark>Thomas</mark> <mark>S</mark>. ocock, of Virginia, is"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [978.51, 362.72, 1150.09, 1159.19], "bbox_id": "fd6e710fa1", "file": "AppomattoxNewspapers_1952-1954a_0564.pdf", "page": 1, "text": "j TEXAS LADY DESIRES DATA ON HER FAMILY TREE Dallas, Texas April 2-1, 1954 j Editor, Times-Virginian, Appomattox, Virginia Dear Sir Recently I had a clipping given me from your paper. It was given I me by a friend, who husband has a I brother living in Appomattox. They had written him sometime back and  asked him if he knew Judge Joel W.  Flood, who is a family connection of I mine. So he had sent them this clip ping from the paper of February I 25th. entitled, Father Darkleaf by c. h. r. I enjoyed it so very much, and thought I would write you and see if you might have some information from the early editions of your pa per, which might be of interest to me about the members of my fam ily who lived in Appomattox in the early days. My ancestors who lived there were Samuel Bocock, the home place was called, Wildway, which was half way between Bent Creek and Vera, Virginia, from material I have that my uncle, the late Charles Henry Buchanan, had sent my mother. He said that in 1934 it was owned by J. S. Kinney, Rt. 3, Appomattox, Va. Then I wondered if there was a Thomas family who lived there in those early days, whose daughter, Judith married Capt. John Bocock. This must have been around 17 hun dred and something. I cant put my hands on my data which has the dates on it, right now, anyway, the son of the above, John Thomas Bo cock married Mary Flood, and I be lieve the Flood family lived there also. One of the Floods married a Mary Fuqua, it was either John or Thomas. I have information which says one and then the other. I am most anxious to locate information on the Fuqua family, and to straight en out about which one of the Flood family is my ancestor. Judge Flood wrote me that it was John Flood II, and I feel sure he is correct. John Thomas Bocock and Mary Flood Bocock were the parents of my grandmother Mary Flood Bocock who married January 1, 1854 in Ap pomattox Appomattox Court House Virginia, John Rice Buchanan of Rockbridge County, Virginia. My mother, Mary Flood Buchanan was their daughter. I shall appreciate it very much if you could send me some material on these ancestors of mine. I know a great deal about the Bocock line, but you might have some material I do not have. If you do not have any records about them in your early file, you might be able to give me the name and address of some one who may be able to give me some. f Most sincerely, Frances Hall McCracken, note We will be glad to give the ftwuiwa y i iUvurttwKSii  any of our readers who may wish to write her regarding the above."}, "highlight": {"text": {"matched_tokens": ["Thomas", "Bocock", "Bocock"], "snippet": "he is correct. John <mark>Thomas</mark> <mark>Bocock</mark> and Mary Flood <mark>Bocock</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "Bocock", "Bocock"], "snippet": "he is correct. John <mark>Thomas</mark> <mark>Bocock</mark> and Mary Flood <mark>Bocock</mark>"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["S", "Bocock"], "snippet": "at that time T. <mark>S</mark>. <mark>Bocock</mark>, Tower Hill J . P."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Bocock"], "snippet": "at that time T. <mark>S</mark>. <mark>Bocock</mark>, Tower Hill J . P."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1364.12, 1013.55, 1724.98, 1382.6], "bbox_id": "8bbae4bb83", "file": "AppomattoxNewspapers_1922-1923a_0292.pdf", "page": 1, "text": "I The morning hour of the court! was taken np with the unveiling I ee cises of a haudsome picture ofl interest of bis College. the late Thomas S. Bobock. which! his widow, Mrs. Annie 11. Boiockl picseuted to the county. She did I this at the suggestion of this I to call attention to the paper. Judge Hundley preseiit-l lent of tfie Virginia Poly- ed the picture in choce speech his igtitute, which appears references to his departe t fri.iidI Sue of the T imes . The brought tears ro the eyes of some. Virginia and of-the. south Mr Flood accepted the picture fori i the splendid snppoit it the county and went irto Mr. Bo-I receiving aud has a re-1 cocks eventful life and delivered an extensive eulogy. M e s s r s . Peers., Ferguson and Flesbman made short addresses. Little Ann and Charles Reynolds, grandchil dren of Mr. Bocock pulled the veil. Mai y relatives from a dis tance and a large crowd of Mr. IBocock8 old Appomattox and Buckingham friends were present. The picture is a handsome oilpa nt- I ing anti is a splendid likeness of iimlitv ni ght J 1 t n as Mcl Mr. Bocock. u you nt man about 351   . .   I Feel Im pending Doom, age was found dead near I  . , i --1,1-1 five miles n. e. of Tower. T.he eeling of impending doomUijnCnBU3 th bruises about"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S"], "snippet": "bis College. the late <mark>Thomas</mark> <mark>S</mark>. Bobock. which! his widow,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S"], "snippet": "bis College. the late <mark>Thomas</mark> <mark>S</mark>. Bobock. which! his widow,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.01, 411.84, 1813.56, 717.03], "bbox_id": "b82814c582", "file": "AppomattoxNewspapers_1892-1898a_0207.pdf", "page": 1, "text": "ated and well filled by the guests, The Most remarkable cures of I As the inspiring strains of the scrofula on record have been accom- wedding march, skillfully rendered pliched by Hoods Sarsaparilla, by Miss Anna Jones, floated out in This medicine is unequalled for the flower-perfumed rooms,the bride, diseases of the blood. Take only attired in a traveling dress of En- Hoods. glish green cloth, trimmed with Dont forget that Hobbie Music veve and ur appeared in the Co., Roanoke Va., still represent, as j opening of the sliding doors to the they have for over ten years, the I wes accompanied by her mother great Estey Organ, and are now of- and 80D Master Thomas Bocock fering some brand new styles, and Prie, where she was met by the at prices and terms to suit everybody I groom who meanwhile had advanced Write for new catalogues. on the arm of his best man, Mr. TT ,, ... . , , , Charles Friend,of Hampden-Sidney, Hood s pills are hard made, and  , ,,   , ml . . . .. , Va., from the south door. Thence perfect in proportion and appear-1  . , , , ,, , r ok together, they proceeded to the wed- ance C ding dias, situated in the middle of A January thaw is always more the north of the r001D where prodetive of cold and coughs than a I g ev Rice, of Alexandria,stood January freeze. Then is the time 1 recejve them, and perform the Ayers. Cherry Pectoral is needed and proves so extremely efficacious. Ask your druggist for it, and also for Ayers Almanac, which is free to all."}, "highlight": {"text": {"matched_tokens": ["Thomas", "Bocock"], "snippet": "of- and 80D Master <mark>Thomas</mark> <mark>Bocock</mark> fering some brand new"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "Bocock"], "snippet": "of- and 80D Master <mark>Thomas</mark> <mark>Bocock</mark> fering some brand new"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.36, 357.46, 1771.42, 1230.48], "bbox_id": "d03a70ce74", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "APPOMATTOX COUNTY Historical Sketch The County took its name from the Appomattox River, L ajwaters of which are in this county. This in turn was ed after a tribe of Indians who inhabited its lower banks. Created by the 1844-1845 Session of the State Legislature, Act passed Feb, 8, 1845, which took effect May 1, 1845, mbraced parts of Buckingham, Prince Edward, Charlotte Campbell Counties, the general boundaries being set forth he Act, and subsequently was surveyed in the months of r June and July of that year by John Patteson, S. B. Co., ander Austin, Sur. Campbell Co., and Z. E. Cheatham, 1 had been appointed Surveyor of Appomattox County. It junded on the northwest by James River, and situated in the h central part of Virginia, and covers an area of 217,792 s, or approximately 340 square miles. The Act provided that the Governor should commission as ices of the Peace, for the County of Appomattox, the Jus- L commissioned and residing in those sections of the  counties that would be in Appomattox County, after the imencement of said Act. f The Court for the County was composed of the Justices resaid, who were to meet on Thursday after the first Mon in each month, after the same was organized, at the place wn as Clover Hill, the residence of Capt. John Raine, which 1 in the upper end of what was then Prince Edward County. ! County Court was authorized and directed by said Act to t a Court House and such other necessary buildings as the venience of the County required. f Said Justices were directed to meet at the residence of t. John Raine, on Thursday after the 1st Monday in May, 5, to organize the County Government, by the appointment  Clerk of the County Court, a Surveyor for the County, the 1 Commissioners and such other officers as the law re- d and were directed to nominate to the Governor, suitable ns to be commissioned Sheriff and Coroner of said County. From the best information available, the following Jus-  were commissioned for the new County Joel Watkins, lliam Matthews, Major Thos. Rudd, John W. Marshall, Dr. bin D. Palmer, Col. Benj. P. Walker, Col. Thomas H. Flood, chan H. Hancock, Bryant Nowlin, Col. Z. E. Cheatham, Washington Hunter, Sterling C. Anderson, John H. Plunkett H James McDearmon. I These men nominated to the Governor Joel Watkins for Rriff, and he was ommissioned the first Sheriff of Appo- Mttox County, and Samuel D. McDearmon, Wm. J. McDear- n and Wm. J. Watkins were named as his Deputies. The riffs office was the most potential in the county at that j e. He was not only the law-enforcement officer, but he col- j ted all taxes and disbursed the same on the order of the Jistice there were no juries summoned in those days, and the jeriff had to go out and find jurors when needed at each rm of the Court. j John T. Bocock, was named the first County Clerk, and llomas S. Bocock, the first Commonwealth Attorney, and An- ew B. Baker, the first Coroner. The organization being perfected, and its affairs entrust- el to men of outstanding character and ability, the County be- n a steady and peaceful growth. John T. Bocock, the first Clerk, died soon after his ap-"}, "highlight": {"text": {"matched_tokens": ["S", "Bocock"], "snippet": "County Clerk, and llomas <mark>S</mark>. <mark>Bocock</mark>, the first Commonwealth Attorney,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Bocock"], "snippet": "County Clerk, and llomas <mark>S</mark>. <mark>Bocock</mark>, the first Commonwealth Attorney,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1203.84, 334.5, 1347.07, 638.95], "bbox_id": "41ea13bae1", "file": "AppomattoxNewspapers_1962-1965a_0650.pdf", "page": 1, "text": "Among the visitors here for the Centennial were Mr. and Mrs Charles Price Reynolds and his wife, the former Judith Reddick, of Norfolk, who attended thè ceremonies dedicating the re constructed Court House at Ap pomattox National Historic a 1 Paik, April 9. Mr. Reynolds is the grandson of Thomas Salem Bocock, a na tive of this county, who was a member of the U. S. Congress. When the South seceded he be came Speaker of the House of the Confederacy. Mr. Reynolds, now retired, has lived in Washington. For some years he was a counselor for all railroads before the Interstate Commerce Commission. Later, he was an attorney for the Seaboard Air Line Railroad. Mr. Reynolds mother, Sally Bo cock Reynolds later Mrs. Wil liam R. Roberts, of Chase City, taught school in this county and his sister lived here some years ago. The Charles Reynolds live at 16 South Wilton Road, Richmond, Va."}, "highlight": {"text": {"matched_tokens": ["Thomas", "Bocock"], "snippet": "is the grandson of <mark>Thomas</mark> Salem <mark>Bocock</mark>, a na tive of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "Bocock"], "snippet": "is the grandson of <mark>Thomas</mark> Salem <mark>Bocock</mark>, a na tive of"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.53, 267.4, 1773.18, 1764.4], "bbox_id": "d1f7f47b98", "file": "AppomattoxNewspapers_1902-1905a_0454.pdf", "page": 1, "text": "acres, exchange. C. E. Lewis to,Nel8on Bocock 53 acres, exchange and 117. C. H. iSarkill, comr to Crawford H. Going, 280 acres, 240. R. B. Cralle c.. trustees to Farm ville Bldg.  Tr. Co., 26 acres, 125. Reuben Brown to J. B. Shearer, 12 acres, 250. E. W. Gilliam, c. to H. E. Gil liam, 319 acres, 10Q0. J W. Flood c. to T. B. Scruggs, 54 acres, 126. T. B. Scruggs to W. D. Sandidge, 202 acies, 600. W. J . Martin to T. W. Oder And Robt. Irvey, 3 acres, 135. Altert Thornhills Heirs to Thos. Chambers, 158 acres 400. Madison Cyrus to O. S. Cyrus, 101 acres, 400. Madison Cyrus to S. A. Cyrus. 50 acres, 500. Madison Cyrus to D. H. Cyrus, 50 acres, 500. J. M. Dnrphey to 8. E. J. Bur- ford, lot 11-16, 1625. Wm. W. Wright to Elizabeth S. Wright, 57 acres, 100. Annie H. Bocock to Ellen Morgan, 100 acres. 500. M. P. See c. to Flood and Fer guson 805 acre-, 800. Emeline Cheatham c. to T. S. Ferguson, 6 acres, 15. Etna Iron  M. Co. to E. M. Schaefer 115 acres, 2500. Wm. A. Miller to E. C. Marshall, 319 acres, 747.23. J. H. Robertson to Henry Jack- son, 5 acres, 150. J. M. Abbott to Henry Jackson, 5 acres, 1500. C. Wiley Tucker to E. E. Chism, 2 acres, 135. Jos. R. Abbitt to Obey Mann, 100 acres, 200. Robert Meadows to Marion Mose ley, 30 acres, 91.20. C. P. Marshall to C. H. See, 31 acres, 120. R. C. Maun to Z. N. Harris, 8 acres, 175. Saml Worley to Mary D. Worley, 11 acres. . aunders F. Wright to Fannie B. Wooldridge, 120 acres, 500. W. Q. Ligon to H. Ai. Marshall, 19 acres,1200. R. H. Purdum to Joel T. Caw- thorn, trustee for Liberty Church 3 acres, 93. Juo. W. Fvans to J. Hudson Cheatham, 11 acres, 200. Samuel A. Glover, c. to Thos. W. Moses, 4 acres, 40. J. R. Caldwell to Chas. Glover, 100 acres 280. F. C. Moon Comr to Eugene M. McCormick, 40 acres, 250. Farmers Exchauge to C. W. and C. A. Hancock, store and lot 2000. Nina E. Jones to J. C. Jones, 277 acres, 3000. J. C. Jones to Jno. Wilson Dur- rum, 277 3000. W. A. Durrum to Ann R, Dur- rum, 17 acres 207. W. E. Moo e to Peyton Vf. Calla- ham, 81J acres, 170. A. B. Scruggs to T. E. Fwen, 100 acres, 400. Sallie M. Featherson to H. R. Feathe stou, 305 acres, 1500. T. E. Oweus to L. S. and T. . Do s, 30 acres, 200 Lucv F. Caris to Jane E. Coleman, 75 acres, 375. Mattie W. Harvey to Ja-e E Coleman, 106 to 250.  - Jno. S. Davis to Jas. D. McDear- man Va a lot, 75. N. ii Featherston to Monroe L. Garrett, 201 acres, 900. J. A. Cheatham to School trustee South3ide and Court House,  acre, 37. H. F. Venable to School trustee Southside, 1 acre, 3. R. S. Burke to R. F. Burke acre iots, 595. Thos. H. Paris, trustee to Hun er M. Moore, 167 acres, 1400. C. S Morton, to S. W. Thornton 5 acres, 35. Flora E. and L, D. Th rntoir to S. W. Thorn cn, 39 acres aud 2 lots, Saml H. Gordou to W. Scott Thomas, 25 acres, 90. M. S. Davidson to D. T. Wool dridge, 50 acres, 350. T. W. Moses to D. T. Wooldridge 25 acres, 250 B. W. Bocock Comr io H. D. Johnson, lOaces, 78. Wm. Patteson to H. D. Johnson, 29 acres, 60. Jno. L. Davis and wife to W. E, Wooldridge c. 20 acres. Jno. L. Davis to Wesley Chapel Lruste l i acres, gift. A. B. Hoarman to J. W. Nash Jno. R. Phelps Heirs to 8. E and W. A. Wills, 50 acres, 100. A. A. White to Clifford Beck, 10 acres. 180. G. A. J. Pennell to Geo. W, Thomas, 19 acres, 200 G. W. W, Thomas to Oueida Lhomas 19 acres. Signora P. Fore to M. E. Agee 163 acres. S. S. and Elma Coleman c. to H. W. McKinney,  lot, 1200. J. R. Horsley Comr to Eliza Wright, 5 acres, 100.  E P. Evans Est. to N.  W. Ry. Co. 365-1000 acres, 260. A nna Staples Est. to N.  W. Ry. Co. 283-1000 acre, 100. B. W. Bocock Comr to D. M. Anderson 24 acres, 72. E. M. Schaefer to W. B. Sampso n 104 acres, 5. C. W. Hunter, Jr. trustee to N.  W. Ry. 17-100 acre, 15. N. C. Manson, Jr. Comr to Jos. O OBrien, 260 acres. 5455. John Reid to N.  W. R. R. Co. lot 1 acre, 400. C. W. Hunter to Sallie McKinnev"}, "highlight": {"text": {"matched_tokens": ["Thomas", "S"], "snippet": "Gordou to W. Scott <mark>Thomas</mark>, 25 acres, 90. M. <mark>S</mark>. Davidson to D. T."}}, "highlights": [{"field": "text", "matched_tokens": ["Thomas", "S"], "snippet": "Gordou to W. Scott <mark>Thomas</mark>, 25 acres, 90. M. <mark>S</mark>. Davidson to D. T."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2432.35, 984.31, 2726.03, 1647.45], "bbox_id": "14dfcaa91f", "file": "AppomattoxNewspapers_1962-1965a_0618.pdf", "page": 1, "text": "Snoddy Elected To Party Posts Junior Woman C U and the Home Demonstration CI a b s. are handling the possibilities of guest housing in and around the. Town. of. Appomattox. Due to the limited facilities for overnight, accommoda tions in the town, this has become necessary, and the committee, headed by Mrs. Joyce W. Morris, P e g g y Berger and Mrs. Peggy Layt - , son, is asking that those per sons who have a room or rooms which might be op ened to visitors to please let them know. Also, as a further showing of appreciation to t h e s e visitors for coming to Appomattox, they are asking that these rooms be made available without cost. Plans are being made to place centennial housing guest cards in an information center which will be located at a cen tral point on the western e d g e of Appomattc-x, and which will be manned by a member of one of the clubs in Centennial dress to offer guest cards and give out information. Friday night activity will be a program Music of the Blue and Gray, by the Appomattox Civic Chorus under the direction of the Rev. Thomas A. Waddill, with special guest acts and guest art ists. This will be presented at the high school auditorium at 8 p.m. On Saturday night, t h e United Daughters of th e Confederacy will put on the program at the Elementary School at 8 p.m. honoring  the Confederate veterans of Appomattox County, assist- ed by the American Legion and American Legion Aux iliary Posts here. On Sunday afternoon at 3 p.m., the Appomattox Ministerial As sociation will present a religious service at the Old Court House. Thegpcst minister will be the Rev Walker Bocock Healy, pas tor of First Presbyterian Church, Roanoke. Healy is the great grandson of the first clerk of the Appomattox Court and a native of Lynchburg. The Rev. Forrest S. Wagofior, pastor of Appomat tox Memorial Methodist Church, is chairman of the ministerial association and will preside at this service."}, "highlight": {"text": {"matched_tokens": ["s"], "snippet": "Demonstration CI a b <mark>s</mark>. are handling the possibilities"}}, "highlights": [{"field": "text", "matched_tokens": ["s"], "snippet": "Demonstration CI a b <mark>s</mark>. are handling the possibilities"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1348.07, 1159.03, 1826.95, 1341.58], "bbox_id": "c2a0136d8d", "file": "AppomattoxNewspapers_1905-1912a_0495.pdf", "page": 1, "text": "prospect. M iss W illie S tanley, of Ap-1 pom attox, is visiting Miss Je s sie OConnor. M rs, E S. T aylor visited her d au g h ter, C laire, of th e B. F. I. recently. Mr. Jam es C raw ley, of Blaok- stone, h as been vis tin g his In order to oonfer specialhonor parentg M r an d Mr8 T . W . upon the widow of Thomas -8. Bo- C raw ley, of th is place. ,,  ,. . . . . . . ,obck, a member of the Confederate! mi,- , flrmnn nrfthd hv onr a ir ,o t-.dly- t h a t .he d u eled th. 0   g  m _ OIBo, h    r r. l . r h e KrmoD preached b y wr rvicc to b changed to her home. I .. . .  w , IpSOTor Kcv Mr. Hon ton, fttth marred and we P ? i ! !  created Wedneeday DaVig- M em orial 0 h u rch on m a rr-c u  u u w c  Atij u . n D a  l r . i skl , t F ebruary 11th, w as m uch en- nyway she was m   . . .  l and Mr. Bocock elected to fill the ish her happiness and- p r o s p e r ity ,!  for Ufe Mrg   ock ig the"}, "highlight": {"text": {"matched_tokens": ["S"], "snippet": "M iss W illie <mark>S</mark> tanley, of Ap-1 pom"}}, "highlights": [{"field": "text", "matched_tokens": ["S"], "snippet": "M iss W illie <mark>S</mark> tanley, of Ap-1 pom"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [208.08, 1270.8, 710.81, 1703.69], "bbox_id": "6faeb5f74c", "file": "AppomattoxNewspapers_1915-1918a_0560.pdf", "page": 1, "text": "p wi i 1  H 1 í i 30 Amos Lee Cress Pamplin 20 39 Chas. A. Bocock Vera 21 ujb 25 William Price Martin Appomattox 22 B  g te  12 Lyle Foster Caldwell Spout 8pring 23 ppnd no J R j Jf!j B  1 34 Henry Augustus Tames Appomattox 24 i   , m m t i 2 John McCartney Scott Appomattox 25 S r i a B ! IB B i, 1 46 Add Alvis Washing Branch Pamplin 26 fyiEOcl l A H H j l l p l l 8 Frank Obey Covington Hollywood 27 sjmgii c H lfí Í 2 n lr f  ü 40 George Ferguson Vera 28 1 38 Clarence Fletcher Moore Oakville 29 H n oB fii 7 Bennett Harding Beckham 30 foTphn dMfi  27 Durward Belmont Thomas Appomattox 31 Hoft w sH BF VjL- 1 James R. Alvis Spout Bpring 32 HM. ohH  52 Lucius Ashton Harrison Appomattox 33 D i i H .  jal a 6 Charles Reames Morris Concord Depot 34 24 Doctor Connie Baldwin Evergreen 35  4 j 14 Clarence Burnett Simmons Evergreen 36 19 Silas Paul Cawthon Vera 37 Hem H . 11 j 37 James Leonard Blackwell Appomattox 38 B r K.v 36 Geo. Wesley Tolley Evergreen 89 1 Jff i . 1 BBBBj h yl Vc.-i y  44 Junius D ud gee Spout 8pring 40 16 Jesse Peyton Harvey Evergreen 41 ftSflrai RS 26 Nick Burrell Pamplin 42 IpfMilwjB y Si 31 Allen Howard Mayberry Appomattox 43 B  i H I i B I B K i 63 John Henry Stephens Appomattox 44 43 Thomas Doss Spout Spring 45 23 Melvin Davis Childers Vera 46 H r 22 Joseph Rufus Burnett Stapleton 47 21 Thomas Tyndal Pugh Appomattox 48 IVeg 50 Walter Day Bent Creek 49 É É p ?fl 47 Ossie Watson Evergreen 50 P aaH HpODt jtff -T Jifííg i   Es 9 Emmett Mott Perdieu Spout Spring 61 20 William Ernest Layne Spout Spring 52 H P f  5 Ernest Wightman Harwood Pamplin 63 42 Nelson Harris Spout Spring 54 L ocal B oard A ppomattox C ounty ."}, "highlight": {"text": {"matched_tokens": ["Bocock"], "snippet": "20 39 Chas. A. <mark>Bocock</mark> Vera 21 ujb 25"}}, "highlights": [{"field": "text", "matched_tokens": ["Bocock"], "snippet": "20 39 Chas. A. <mark>Bocock</mark> Vera 21 ujb 25"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1648.53, 985.09, 1974.88, 1309.53], "bbox_id": "9a1fafaa72", "file": "AppomattoxNewspapers_1905-1912a_0508.pdf", "page": 1, "text": ". . ..  way Local Union of F. E. and 0 Ihe requirements to get on q  a , 0 q the death of Mr. M. 0 honor roll are, that the student be jg,0in father of brothers G. H. El piesent every day and make an can, the president of onr local average of 95 on recitations. I union, and of Gordon A. Elcan, the county secretary and chaplain of i the Ridgeway looal. Roll of Honor of Martin s school I Whereas God in His wisdom has for February seen fit co remove from our mida Vance Harvey, Pouick Ha vey, Mr. Ma cus Olevelaud Elcan, an Ora Harvey, Roy Moses, G r a c e upright, honorable and useful ci  Moses, Emma Jennings, Hubertl-f  nd ohur   . ecftionte    father, we humbly submit to Hie Martin, Willie Tolley, Ethel Tolley, I will, therefore be it resolved, Mania Glark. M a t t ie D einkakd , I First, that we extend to our brot Teacher.  hers and the other members of the bereaved family our heartfelt sym- ltoll of Honor of Oakville school I P th y  Second, That these resolutions be for Febtuary . spread u.on the minutes of Ridge- High SchoolMary Harris, Myr  ty that they shall be pub- tie Thomas, Durward Thomas. lished in the T imes -V ibginian , Gramm .r GradesGuy Harris,  and a copy be sent to the family. Cornelia Woudson, May Harvey, Genevieve Doss, Estelle Thomas. I w. B. spenceb . Primary GradesHaiold Rogers, I Resolutions of respect and sym Leonie Doss, Ruoy Harris, Annie P111? 0,1 the death of tit. W. B r . u uoFiin Spencer, of Aicanum, Va. Bell Martin.  whereas God in His infinite wis dom bas seen fit to transfer to belter world onr friend and brother Mr. Willis Bocock Spencer, we the"}, "highlight": {"text": {"matched_tokens": ["s"], "snippet": "of Honor of Martin <mark>s</mark> school I Whereas God"}}, "highlights": [{"field": "text", "matched_tokens": ["s"], "snippet": "of Honor of Martin <mark>s</mark> school I Whereas God"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
