{"document": {"bbox": [671.02, 692.14, 846.89, 1600.13], "bbox_id": "2cf039f5ce", "file": "AppomattoxNewspapers_1933-1936a_0259.pdf", "page": 1, "text": "yn and Martian Lee, Mrs. e, Bert and Hoi-man Lee, week a t V irginia Beach. Mrs. E. W . Padgett  nd son, id I-,. J. Body, of Lynchburg, are siting Mrs R G Moore. Maji Evens and Ruby  It al-l visiting Miss M argaret Allen t Pleasant View, Va. Miss Evelyn, Blackburn, of Roanoke sPep4jng th,V week with Miss Virginia Moses. , Mr. arid Mrs. Em m ett Tuclt, who nave beh here fo r sometime, have returned to- Virgilina. F. T. Cawthoi-n and H. C Pulliam notorctdi to Richmond Tuesday to ttend a F ord mcieting. r M l- !nd Mrs. T E Caldwell, of ynchburg, spent last week with Mrs. Franklin Marshall. There will Ibe preaching at the risbyterian churcji ia,- Evergreen aunday afternoon at 330. ... Miss Della Inge will retu rn om e atuiday -after attending summe- cl- ol at Charlottesville. Mrs. Harrison, of Lynchburg, -pent last week with her sistrir, Mrs. T. J. Lowe. Friends of Mr. and Mrs. Hornsey Smith xkitertaineid a t ,a show.fr re eently in their honor. Moss Lewis, of Roanoke, - sp nt he week slnd with his parents, Mr. md Mrs. Cheriie L w is. Miss Flora Lawson and Mrs. Al fred I.awson hav, returned from a visit with relatives in New York. We are glad to hear th a t Andrrjw ferguson, who was op rated on at Memorial hospital last wgek, is now improving. Mr, and Mrs. S. J. Evans and children, Billy and M arian June have . returned from a visit with her sister Mrs. L. A. M essreau. of Baltimore. Jessie Guill, of W arrington, and Charli j Guill, of W ashington, spent Sunday with their parents, Mr. and Mrs. Fletcher Guill. M utt Cawthorn, of W ashington, ipent soveral days the first of the week with his parents, Mr. and Mrs. F. T. Cawthorn. Mrs. Beatrice Meadows and Miss Mary Smith, of Lvnchburg spent the week end in the Ihonvl of Hornsey Smith. Rev. W. M. Thompson, Mrs Hele.n Welch, Mrs. Loue 11,a Morris and Virginia Lee Thompson m otored to V cxandrin Monday. Mr. and Mrs. Howard Blank., and son,, Howaj-d, Jr., of Lynchburg. I spent the week end with Mr. and Mrs, E. L. Laynet. Guests in the home of Mrs. T. T Lowe for the week  jrid, w ere Mrs. T. A. H ackett and daughters, Ilelan and Dorothy, of Covington. Misses Nan Throckmorton, of New York, andi Mary Francs Pretlow, of Norfolk, are visiting relatives and friends here. Mr. end Mrs. Ed Layne, Mr. and Mrs, Howard Blanks, and Mr. arid Mrs, E. T. Guill and fam ily motored to Spears Mountain recently. Mr. and Mrs. George Babcock from j Florida spent l-.st week with Mrs. I H. C Babcock, en route to Maine and I other northern states. Mrs. Ruth Spilman and son of Pichard, and Miss M ary Kemp, of Florida are spending son time with Mrs. W. M. Morris. . . IWrs. M. C. S nath has retu rn ed from Richmond accompanied by her daughter, Virginia and Mrs. George Mayers who will spend the week in that home.  Harvey Morris and son, Norvall Woodson, Mr. and Mrs. Irving Maekof, of Richmond, Misses Ada were visitors in H arvey during and May Harvey, the home of T.  th 2 week end. Mrs. J. H. Cheatham. Mrs S .V . Munsey, D r.H avilah iVbcock and son, Huck and Jam es Elliot Cheat- ham are spending"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "of Covington. Misses Nan <mark>Throckmorton</mark>, of New York, andi"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "of Covington. Misses Nan <mark>Throckmorton</mark>, of New York, andi"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1606.78, 1387.48, 1772.0, 1655.98], "bbox_id": "88d9daaf59", "file": "AppomattoxNewspapers_1912-1915a_0294.pdf", "page": 1, "text": "Well, good-by! Awfully glad to have met you. You must come to see me some time in the city. Yes, thanks I will. And you must come and see me some time. You have my card, you know. Yes, and you have mine, It would be nice if we could meet some time In the fall and go to the matinee some time. O, that would bo just fine! Ill call you up some time on the phone and make a date. YeB and Id be awfully glad If you come up and take luncheon with me some time, and bring the baby with you. Id love to have you. Any time, you know just call me and 111 be sure to be home.  That Is awfully kind of you. Thank you. Ill surely comeIll be glad to . _ some time. And you must come over and take luncheon with me, and bring little Gladys, some time. Or perhaps youd rather come In the eve ning, for dinner, some time, you and Mr. Throckmorton. Why, thanks, we would like to ever so much. And you must come up and"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "time, you and Mr. <mark>Throckmorton</mark>. Why, thanks, we would"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "time, you and Mr. <mark>Throckmorton</mark>. Why, thanks, we would"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1970.4, 1083.99, 2144.61, 1222.89], "bbox_id": "b17874ab45", "file": "AppomattoxNewspapers_1947-1949a_0452.pdf", "page": 1, "text": "We want to thank the Presbyter ian ladies for a wonderful Easter party. The guests were AnnEvans, Eloise Couch, Annabelle Emmett, Little Lewis McDearmon Rosalie Emmett, Ted Godsey, Leo Godsey, Eugene Thomas, and also Dr. Twy- - man Williams, Mrs. G. L. Godsey, I Mrs. S, J. Evans, Mrs. Herman Schweizer, Mrs. Lucy Pack, Shirley M-aei Morris, Mary Watt Stanley, Mary Walker Evans, Maralyn Fay Guill, Mary Anna McDearmon, Te resa Throckmorton, Jesse Morris."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Anna McDearmon, Te resa <mark>Throckmorton</mark>, Jesse Morris."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Anna McDearmon, Te resa <mark>Throckmorton</mark>, Jesse Morris."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1925.75, 683.58, 2093.16, 847.68], "bbox_id": "b466b82665", "file": "AppomattoxNewspapers_1933-1936a_0522.pdf", "page": 1, "text": "V E tta Harris and Other Appomattox, Va., August 3rd, 1936. To- Esther J. Smith, Etta Har ris and W.E.Harris JVIrs. Mar garet Brittian and Leslie Brittilan, her husband, Mrs. Grover C. Able, and Grover C. Able, T . W . Throckmorton and Lena Throck morton, Mrs. Eddie Gein- 1 otte land Eddie Gejnotte, J . S. Lythgie and Sarah Lythgoe, W . J. Lythgoe and Lorena T . Lythgoe, Mrs Vera Wall, James N.Lythgoe and Virginia Lythgoe, Russell Lyth goe, and Mrs. Belle Lythgoe, Lill ian Linden and Max- F . Linden,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C. Able, T . W . <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C. Able, T . W . <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1951.69, 698.1, 2282.54, 1212.91], "bbox_id": "c5b44826af", "file": "AppomattoxNewspapers_1912-1915a_0286.pdf", "page": 1, "text": "TrtE HOUSE. Thursday. I The House session was brief, though I the chair was vacated twice to allow I time for completion of the list of com-1 mlttee assignments. The list ws presented by Speaker Cox shortly after 3 oclock, and in the main seemed to I give great satisfaction. In making up  the list the Seniority rule was hot fol lowed In all cases. Judge Martin Wil liams, of Giles, heads the important Committee on Privileges and Elec tions, as he did in the last session. Mr. Oliver heads the Committee on Courts of Justice, of which he was the ranking member after the retire ment of Judge Alden Bell. Mr, Love is made chairman of the Committee on Schools and Colleges. The import- ant Committee- on General Daws, of which Mr. Co has been the chairman for several sessions, falls to Mr. Spes- sard. John O. Daniel succeeds Mr. Throckmorton At tfcsé head of the Com mittee on Roads and Internal Navi gation. The COmmltte on Finance Is divided under the new rules. Colonel Bowman died since the last session and Mr. Jennings retired. The rank ing member was Mr. Spessard, who followed Mr. Cox at the head of Gen eral Laws, and the chairmanship of Finance was given to Al G. Weaver. Mr. Brewer was made chairman of the new Committee on Appropriations, Mr. Soessard being made a member of both of these commltteeá. Colonel Leedy, of the State militia, heads the,Commit- THE SENATE. tee oh Militia and Police, and Berkley The introduction of a flood of bills D. Adams, chalrman of the State was the chief activity of the Senate at Board of Agriculture, h  th e C o m Us opening session. They descended mlttee on Agriculture .   uion the clerks desk, forty and more, Kent becomes head of the Committee K i a n c h e within á few seconds af-  Counties, Cities and Towns.   ter the session was declared open tor, Houston continues at thebeaf th new legislation. Committee on Chesapeake and its The batch contained the usual num-  Tributaries, her of bills of a private character, with Rev. J. Y. Fair. D. D opened he se rai measures of the first Import- slon with prayer. At the request or anee In the latter class belong Sena- Judge Martin Wiiliams, tor Smiths bill tor the appointment, of the new enabling act, introduced y ataxremmlsslon. Senator Echols bills him on Wednesday, were ordered 5Lhe S t i w of tee taxes on bank. printed. Then came the flood of bills. a bill which were sent to tee clerks desk for"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "O. Daniel succeeds Mr. <mark>Throckmorton</mark> At tfcsé head of"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "O. Daniel succeeds Mr. <mark>Throckmorton</mark> At tfcsé head of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1041.58, 992.47, 1211.83, 1236.17], "bbox_id": "2cc6b230c2", "file": "AppomattoxNewspapers_1933-1936a_0518.pdf", "page": 1, "text": "To- Esther J. Smith, Etta Har ris and W .E. HarrisVI rs. Mar garet Brittian and Leslie Brittilan, her husband, Mrs. Grover C. Able, and Grover C. Able, T. W. Throckmorton and Lena Throck morton, Mrs. Eddie Gein- otte and Eddie ,Gefnotte, J. S. . Lythgie and Sarah Lythgoe, W . J. Lythgoe and Lorena T. Lythgoe, Mrs. Vera Wall, James N.Lythgoe and Virginia Lythgoe, Russell Lyth goe, and Mrs. Belle Lythgoe, Lill ian Linden and Max F. Linden, Mrs. Kate Lythgoe, Thomas J. Lyth goe Jr., Jennie Sheean and William Sheean, Clarence Lythgoe, Edward Lytthgoe and Vivian Lythgoe, Ray mond L. Lythgoe and Nora Lyth goe, D. E .. Lythgoe tend Mary Lythgoe, Vemard S. Gooding, Mel vin Gooding and Alice Gooding, Eleanor Franklin and Luther Frank lin, Mrs. Ethel Harvey and Lucius Harvey, Evelyn Bayne, Dora Boltz and Myron E . Boltz, Berta A. Boltz, Mrs. Ellen R . Enrought and"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C. Able, T. W. <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C. Able, T. W. <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1759.2, 273.67, 1897.05, 325.42], "bbox_id": "41082cf80c", "file": "AppomattoxNewspapers_1974-1975a_0300.pdf", "page": 1, "text": "The marriage of Miss Harvey to Mr. Throckmorton took place Saturday afternoon at two oclock in Appomattox Curl House Presbyterian Church."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "The marriage of Miss Harvey to Mr. <mark>Throckmorton</mark> took place Saturday afternoon at two oclock in Appomattox Curl House Presbyterian Church."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "The marriage of Miss Harvey to Mr. <mark>Throckmorton</mark> took place Saturday afternoon at two oclock in Appomattox Curl House Presbyterian Church."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [429.34, 653.84, 571.68, 1080.52], "bbox_id": "f7336dab2f", "file": "TimesVirginian_1976_0228.pdf", "page": 1, "text": "The m arriage of Miss Stephanie Anne Lucas of Richmond to Mr. Paul Douglas Harvey of Appomattox took place on Saturday, June 12, 1976 at 4 oclock in the afternoon in All Saints Episco pal Church in Richmond. The bride is the daughter of Mr. and Mrs. Harold Edward Lucas of Richmond and the groom is the son of Mr. and Mrs. Clifford Harvey of Appomattox. The Rev. Mann Valentine, VI, of Richmond officiated at the double ring ceremony. The bride, escorted and given in marriage by her father, wore a gown of ivory silk organza with empire bodice of re-embroidered Alencon Lace, portrait neckline of scalloped lace and long bishop sleeves with lace inserts and wide fitted cuffs of lace. Her A-Line skirt was accented with wide inserts of lace bordered at the hemline in scalloped lace, extending, all around the full circular chapel length Hbrnisw Her- veil was a matching Mantilla, finger tip length, attached to a cap of lace and seed pearls. Mrs. John Zunka of Char lottesville was matron of honor. Bridesmaids were Mrs. Denny Throckmorton of Covington and Miss Sallie Harvey of"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Bridesmaids were Mrs. Denny <mark>Throckmorton</mark> of Covington and Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Bridesmaids were Mrs. Denny <mark>Throckmorton</mark> of Covington and Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [554.59, 447.49, 739.95, 955.03], "bbox_id": "84d1d7e405", "file": "AppomattoxNewspapers_1939-1943a_0226.pdf", "page": 1, "text": "The Appomattox Lions Club win i have a Joint meeting with Farmville j Lions Club at Hotel WeyanoKe, in Farmville on January 31 at 645 P . M. Miss Frankie McKinney was hos tess to the contract bridge club last Friday evening High scores went to R. W. Stanley and Mrs. Ry- land Mann. Local banks were closed Monday n honor of the birthday of Robert E Lee A special service, honoring Lee was held at 11 A.M. Sunday at Liberty Baptist church. G. Lewis Doss is better after a recent illness. We extend deepest sympathy to Mrs. C. S, Jenkins in the loss of her father., R. L Burke, county treasurer, calls attention to the deadline for purchasing dog tags. Mr. and Mrs. Carlton Godsey, of Lynchburg, were in Appomattox last I Friday. Mrs.Cameron Seay and daughter, Lucy Watkins, are visiting in the home of Mrs. Joel Flood, Mr. and Mrs. C. D. Thomas and children, of Lynchburg spent Sun day with her parents, Mr.and Mrs. I g . J . Evans.  Miss Kate  OBrien spent the week end in Richmond with Miss I Virginia Gregory. Maurice OBrien, who has been I visiting for the past month in Kan- 1 sas City, Mo., has returned home. The Appomattox Cotillion Club I will meet tonight. Miss Nan Throckmorton, of New York, has been a guest of her aunt, I M ts . J.A  Burke. Miss Harriet Holley and Miss June J Babcock were in Washington Mon-1 day."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "meet tonight. Miss Nan <mark>Throckmorton</mark>, of New York, has"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "meet tonight. Miss Nan <mark>Throckmorton</mark>, of New York, has"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1754.66, 814.18, 1910.77, 1003.15], "bbox_id": "4e5d5c23f7", "file": "AppomattoxNewspapers_1915-1918a_0437.pdf", "page": 1, "text": "T h ro c k m o rto n A b b itt On Tuesday morning Lieu- tenant L. W. Throckmorton, of the U. S. Army, who has been spending his furlough here,was married to Miss Ola Abbitt in Mr. Throckmor ton is a son of Hon. C. W. Throckmorton, of Richmond, and a member of his fathers law firm until called to the col ors. Miss Abbitt iB a daughter of the late A.W. Abbitt, of this county. She is quite popular here and her marriage was a great surprise to her friends,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Lieu- tenant L. W. <mark>Throckmorton</mark>, of the U. S."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Lieu- tenant L. W. <mark>Throckmorton</mark>, of the U. S."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1670.1, 1103.5, 1828.6, 1364.09], "bbox_id": "46932e1af9", "file": "AppomattoxNewspapers_1918-1922a_0048.pdf", "page": 1, "text": "Saturday was a gala day for Appomattox. Although the weather w a s threatening a large crowd came to town to help put oyer the Victory-Loan. Hon. H. D. Flood and Lieut. Luther Throckmorton, an over sea soldier, spoke in the Court house. A brass band from Camp Lee made music and the Victory Loaa went whizzing over the top. It is estimated by the banks that at least 20,- 000 more than our quota has been subscribed. Appomattox is t h e proud possessor of another flag and is again on the map in Royal Blue figures as going over the top. The Womens Committee pledged our quota long ago and they fully redeemed the pledge."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Flood and Lieut. Luther <mark>Throckmorton</mark>, an over sea soldier,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Flood and Lieut. Luther <mark>Throckmorton</mark>, an over sea soldier,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2059.88, 1231.07, 2230.28, 1765.77], "bbox_id": "3e3df1dd00", "file": "AppomattoxNewspapers_1955-1957a_0110.pdf", "page": 1, "text": "Richmond, Va.- The Virginia Elec tric and Power Company board of directors meeting here approved a 50,000,009 construction program for 1956, declared dividends on the common and preferred stock and an nounced the promotions of Jamts B. Hawkins, and George A. Spencer. Hawkins succeeds Robert J. Throckmorton, who died the latter part of January, as vice president of Vepcos eastern division, with head quarters in Norfolk. Throckmorton had held this key post for more than 20 years. Spencer was named assistant treas urer to succeed Arthur L. Clark, who was recently made personnel direc tor. Hawkins, who moved up from as sistant vice president at Norfolk, is a native of Clifton Forge and re ceived his B. S. degree in electrical .engineering in 1926 from Virginia Polytechnic Institute. Following graduation he was employed by Vir ginia Public Service Company which was merged into Virginia Electric and Power Company in 1944. He held various engineering positions until 1940 when he was made super intendent of operations in Alexan dria. In 1943 he was transferred to Charlottesville as manager of the Blue Ridge District. He became as sistant vice president of the eastern division in 1952. He is a Kiwanian, member of the Princess Anne Country Club and di rector of the Norfolk Chamber of Commerce and has been active in the Community Chest and the Red Cross in Charlottesville and Norfolk. Spencer, who resides in Ashland, was born in Waterview in Middlesex County, and received his education in the Richmond Public Schools. He was employed by Vepco in 1936 and has held numerous posts in the ac counting department since that time except for six years service as an officer in the U. S. Naval Reserve during World War II and the Ko- Continued op Page Eight"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Hawkins succeeds Robert J. <mark>Throckmorton</mark>, who died the latter"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Hawkins succeeds Robert J. <mark>Throckmorton</mark>, who died the latter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1714.53, 842.23, 2018.92, 877.18], "bbox_id": "937a19225f", "file": "AppomattoxNewspapers_1915-1918a_0305.pdf", "page": 1, "text": "release order by Alabama, where the Hi n,K Pr _. . . . Throckmorton countlesi The total quarantine was raised in 13 whole counties and three parts of counties, ggregnting nearly 11,000 square miles,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "release order by Alabama, where the Hi n,K Pr _. . . . <mark>Throckmorton</mark> countlesi The total quarantine was raised in 13 whole counties and three parts of counties, ggregnting nearly 11,000 square miles,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "release order by Alabama, where the Hi n,K Pr _. . . . <mark>Throckmorton</mark> countlesi The total quarantine was raised in 13 whole counties and three parts of counties, ggregnting nearly 11,000 square miles,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1786.08, 187.64, 1948.64, 316.75], "bbox_id": "3ab64236cf", "file": "AppomattoxNewspapers_1915-1918a_0535.pdf", "page": 1, "text": "Read change of ad of Lester j B. Harvgy, on this page. Lieut. Throckmorton cables I his wife here that be has arriv- ed safely in England. Mr and Mrs. W ert Tnrnesl  1  t their 9-year-old-boy last Saturday. The little fellow had  been in ill health all his life. Private Dennis Wooldridge I"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "on this page. Lieut. <mark>Throckmorton</mark> cables I his wife"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "on this page. Lieut. <mark>Throckmorton</mark> cables I his wife"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [443.93, 423.4, 568.25, 1152.53], "bbox_id": "fd3c943629", "file": "AppomattoxNewspapers_1918-1922a_0299.pdf", "page": 1, "text": "pu l D ay A t A ppw m attox rial services Monday Jselnbrafced with appro lexercisos at the old sur grounds Perhaps the crowd for many year llod and tbe exercise. chargeof the Appomat Jprer of the U D J Dr. ftaaklio, formerly an Ap x boy but now of B ob I bh , made an appealing wtitle Captain Barks If Lynchburg, gave a Account of war activities ice where he served for bars as captain of a Vir cmpanv. The address Franklin deserves a tended notice than we to give. It was an ap the hearts jof men and to make the world safe humanity, and an en ftnt of the League of Col. K. F Bui ke was of ceremonies. S. L. jn introduced Mr Frank- J. R Horseley intro- laptain Barksdale. There 2 of the Confederate Is and a number of the Is of the late war. A hits flag with 12 goldeD presented the 12 young ho fell in France and ns from tnis county, was a large floral dis id the chapter turned full attendance. The were covered with to esteem of the present lion as was also tbe one f a federal soldier who Ts buried in the samt yi in charge of the exer ire Mrs L. H. Crawley, it Mrs W. B. Caldwell, Bident Mrs. D N.Twy- Bcrelary Mrs. Lula recording secretary am Committee  Miss irfce, Mrs. Hunter and iwley. Iittee on Arrangements t. F. Burke, Miss Nina id Virs. Joe OBrien. CommitteeMrs. J. A Mi 8 s Anna Jones and Tte Franklin. Iittee on FlowersMes W. B. Caldwell, D. N R. F. Burke, J. D. ET. B. Pretlow, Misses Ferguson, Annie Da- K at Davidson and nils. lyance CommitteeMes G. Anderson, W. T. W. L Throckmorton, 8 Mattie Sears. Tal Committee  A, H"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "W. T. W. L <mark>Throckmorton</mark>, 8 Mattie Sears. Tal"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "W. T. W. L <mark>Throckmorton</mark>, 8 Mattie Sears. Tal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1288.3, 1272.91, 1423.34, 1466.36], "bbox_id": "caeeb49027", "file": "AppomattoxNewspapers_1918-1922a_0150.pdf", "page": 1, "text": "pttnson and others...............D efendants hdwuia  Johnson, Ja n e Johnson.  Johnson, H attie Johnson, Alice r Fan Key, Fioj H askins,! Is Husking John Jo h n s o , fath er . WUis vv right, BeLjamm Jo h n so n ,1 p e Johnson, nl.en jo n u so n , Nealy En i  el1 E a sle y , A lvin Johnson, pua Jcmnson, Rosanna J onnsou, Bettie uiUiS iL0eit8OIi F au n a Jones, pues, Rachel Brown, W alter Brown, f ouuson, Emma L Johnson, Phillip Jonn W illiam A John P ? Johnson, Peyton B row n, Minnie ft Ruth Brown, Robert B iow n, Veruel I n Jotiu H enry Lewis, fiwnn Raw is, tittiau Prances Lewis, r f , A.CW 1 S, and M cKinley Lewis, Jciue Johuson, izettu C hristian, H c K h n n 0 Johnson, M artha Ann   pfu.n, hi -Throckmorton, iuaraian ftty icdsuH 11118 autl 1fcIenaante iu the  o n J? ieDiS th a t 1 h ave fixed lu iu .iyn MAdy l7th tn e time, o APbuiaitox C ourt House,  Iif lhe several accounts I m orderetl by decree la rtfit a AP U  rm  M o i the U r- Ehl Vr APPomattox, to-wits I S indrBt.ao !ar Wa8h Johnson, la, hhu tne intrests of each in the p u c in the bill and proceeding? m en"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "artha Ann   pfu.n, hi -<mark>Throckmorton</mark>, iuaraian ftty icdsuH 11118"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "artha Ann   pfu.n, hi -<mark>Throckmorton</mark>, iuaraian ftty icdsuH 11118"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1951.87, 244.11, 2123.57, 929.96], "bbox_id": "3a09419692", "file": "AppomattoxNewspapers_1912-1915a_0338.pdf", "page": 1, "text": "Plnchot Falls To Get Pardon. Although hacked by a petition from Gifford Plnchot, former Chief Forester n the United States Department of Agriculture, Governor Stuart declined to pardon Sherman Sneed, serving two years in toe State Penitentiary for grand larceny. Sneed is a colored man, and was convicted in the Hustings Court of toe city of Richmond. It ap pears that his mother was at one time a charwoman at the Forestry offices in Washington, and she interested Mr. Plnchot in the case. The Governor granted a pardon to Bettle Lee, colored, sentenced to one year in toe penitentiary by the Hus tings Court of toe city of Lynchburg Mr larceny. She has served about half of her time, and the pardon was recom mended by Judge Christian, who pre sided at toe trial, and by Common wealths Attorney Yancey, who prose cuted. The Governor refused to pardon Eu gene Dorsey, an Alexandria negro serv ing a life sentence in tbe penitentiary for toe murder of toe arti8t Walter Schultze. One negro was executed for this murder, but toe sentences of Dor sey and other accomplices were com muted by Governor Mann to life lm prisonment Gerald Stratton, a mem ber of toe State Penitentiary Board, has interested himself in toe case of Dorsey, and presented the- papers to toe Governor. Notwithstanding personal applica tions from John P. Branch, Bernard Lewis, George Bryan and Davis Bot- tom, Governor Stuart declined a par don hi toe case of Clarence E. Wood ward, serving a sentence of ten years in toe - penitentiary from Newport News for criminal assault. He has served about seven years of his term, and members of his family have been quite active in securing toe sympathies of those who sought his release. The Governor refused toe petition Mr a pardon for William Scranage, now serving a sentence of eighteen years In toe State Penitentiary for a murder committed in King George county. He has been In prison about six years. Thie petition was presented by C. W. Throckmorton. A pardon was refused to W. W. Wey- twelve months on the public  roads from the city of Norfolk for selling cocaine. A pardon waB refused William Lee, colored, sentenced to six months in the Richmond City Jail in default of bond, for trespassing on the property ot St. Andrews School. Tbe case waB tried in the Police Court, where suspicious circumstances in connection with the trespass and toe previous bad char acter of the prisoner led to toe justice requiring bead in toe sum of 100, which Lee wins unable to give. He ap pealed to toe Hustings Court, where toe trial court was affirmed."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "presented by C. W. <mark>Throckmorton</mark>. A pardon was refused"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "presented by C. W. <mark>Throckmorton</mark>. A pardon was refused"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.39, 207.17, 1749.44, 552.67], "bbox_id": "9fdf0ad7ea", "file": "AppomattoxNewspapers_1974-1975a_0301.pdf", "page": 1, "text": "Paul Douglas Harvey receiv ed his Bachelor of Science degree Sunday. May 11th in ceremonies at Hundley Stadi um, Hampden-Sydney College. He plans in the future to enter the School of Dentistry Medical College of Virginia in Richmond. Rebecca Penn Harvey re ceived her Bachelor of Science degree Saturday, May 17 at graduating exercises in The Mall at Longwood College, Fsrmville. Miss Harvey was married Saturday, May 24 to Joseph Denny Throckmorton of Hamp den-Sydney. They will make their home in Covington. Mrs. Throckmorton will teach third grade at Callahan Elementary School in Alleghany County.. They are both graduates of Appomattox High School and are the son and daughter of Mr. and Mrs. Clifford E. Harvey of. Appomattox."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "24 to Joseph Denny <mark>Throckmorton</mark> of Hamp den-Sydney. They"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "24 to Joseph Denny <mark>Throckmorton</mark> of Hamp den-Sydney. They"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [366.21, 295.03, 507.17, 459.82], "bbox_id": "9ab6204773", "file": "AppomattoxNewspapers_1918-1922a_0509.pdf", "page": 1, "text": "ox Fair. Big shipment of Tanlac just J ja d . bas. F. James, ocal agent. - ltlooks like a smalt crop of Lbsat is to be seeded by our  armers this fall. w L. Throckmorton is here to a visit to his wife and daughter. Mr. Bradley Babcock entered luompden Sidney college yes- lerday lor the session."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "this fall. w L. <mark>Throckmorton</mark> is here to a"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "this fall. w L. <mark>Throckmorton</mark> is here to a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [915.31, 1469.26, 1085.41, 1809.46], "bbox_id": "3d78eaacb4", "file": "AppomattoxNewspapers_1933-1936a_0533.pdf", "page": 1, "text": "Order of Publication Esther J. Smith vs Etta Harris and Others Appomattox, Va., August 3rd 1936. To- Esther J . Smith, Etta Har ris and W.E.Harris Mrs. Mar garet Brittian and Leslie Brittiian, her husband, Mrs,. Grover C. Able, and Grover C . Able, T . W , Throckmorton and Lena Throck morton, Mrs. Eddie Gein- otte and Eddie Genatte, J. S. Lythgie end Sarah Lythgoe, W . J. Lythgoe and Lorena T . Lythgoe Mrs. Vera Wall, James N . Lythgoe and Virginia Lythgoe, Russell Lyth- goe, and Mrs. Belle Lythgoe, Lill tan Linden and Max F . Linden Mrs. Kate Lythgoe, Thomas J. Lyth goe Jr., Jennie Sheeen and William Sheean, Clarence Lythgoe, Edward Lytthgoe and Vivian Lythgoe, Ray mond L. Lythgoe and Nora Lyth goe, D. E.. Lythgoe and Mary Lythgoe, Vernard S. Gooding, Mel vin Gooding and Alice Gooding, Eleanor Franklin and Luther Frank lin, Mrs. Ethel Harvey and Lucius Harvey, Evelyn Bayne, Dora Boltz and Myron E . Boltz, Berta A Boltz, Mrs. Ellen R. Enrought and William H. Enrought, Mrs. Mary E . Johnson and Robert W , John son,, Mary Boltz, M rs. Miriam Rhodes and Hugh C. Rhodes, Hilda E . Grant and Robert R . Granft,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C . Able, T . W , <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C . Able, T . W , <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [518.9, 208.93, 896.11, 399.43], "bbox_id": "fa6f95ced7", "file": "AppomattoxNewspapers_1918-1922a_0241.pdf", "page": 1, "text": "Mrs. W. L. Brown is right sick. We understand that Mr. J. W Marshall will move to Mrs. D. E Caldwells this fall to farm for her he has lived on Mr. J Circuit court will open here I Pufdums farm for the pa Friday morning.  seven years good for John. Mias Nettie Moses spent last  and Mrs M, T Qoin, of week with her cousin Mrs ! Clifton Forge, visited relatives dW ri dl!  rti8 Harvey, in Pamplin.  here la It has been kindsummers Mrs. L. W Throckmorton 1 Wenty five yearB e,nCH they and baby are ack f  m a visU J were at Appomattox, and -hei to Bedford  ! oy were opened wide to see u , , o a , . . . how the town has grown since M r N . E. vVagers and wife - are here. We understand they will make their home here. Miss Bell Byrne, of East Falls"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "kindsummers Mrs. L. W <mark>Throckmorton</mark> 1 Wenty five yearB"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "kindsummers Mrs. L. W <mark>Throckmorton</mark> 1 Wenty five yearB"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1628.14, 437.67, 1780.59, 573.67], "bbox_id": "a654df3b16", "file": "AppomattoxNewspapers_1918-1922a_0224.pdf", "page": 1, "text": "Mrs Throckmorton and little laughter are guests at Hotel Wons, Bedford county. Mr T V. Qor on and wife. f Ohio, ar- vmiruig rhoir eon, Prof G . O Gord w, hi re Tho E liter is j yinr a fiih ng trip this we k on Chesa peake Bay. Miss Dean Johns leaves iu a few days for Texas, where she goes to teach. The Hesediah B iptist Asso"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mrs <mark>Throckmorton</mark> and little laughter are"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mrs <mark>Throckmorton</mark> and little laughter are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1698.03, 731.27, 1866.63, 1195.11], "bbox_id": "b9ebd0b545", "file": "AppomattoxNewspapers_1939-1943a_0256.pdf", "page": 1, "text": "Mrs. T. B. Collins will entertain the Spout Spring bridge club to night. Her guests will include Mr. and Mrs. W .E . Dickerson, Mr.and Mrs. Russell Cawthorn, Mr. and Mrs. Morris Ferguson, Mr. and Mrs. Clem Morton, Misses Nannie Tones, Lucille Bates, Eurlean Ros ier, Mrs. Chap Adams, Mrs.How- st M-rtin, Miss Mamie Cullop and Tiss Wooten. Miss May belle Babcock is ou fter a recent illness. Mrs. T. B. Collins visited at Spout Spring Wednesday. Miss Lucille Cralle, of Charottcs- ille will spend this week-end at her home here. The April term of the Circuit Court will convene here next Tues day. The P. -T. A. met in the county library yesterday afternoon. The Appomattox high school base ball team will play Altavista here m the school diamond this Friday afternoon at 3 oclock. During the absence of coach John Curtis Cald well, the school tdam is being coached by Ned Hancock. Miss Nan Withers Throckmorton is visiting in the home of her aunt, Mrs. Jerry A. Burke.  Misses Margaret Fulp and Helen Vest will spend tile week-end in Lynchburg with Mrs. Carlton God sey. Herbert Abbitt, of Richmond, pent the week-end at his home at Vera. Mr. and Mrs. George Langran and Mr. and Mrs. James Langran and two children visited Mr. and Mrs. T. J. Carter at Lovingston Sunday."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Hancock. Miss Nan Withers <mark>Throckmorton</mark> is visiting in the"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Hancock. Miss Nan Withers <mark>Throckmorton</mark> is visiting in the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1720.31, 644.67, 1882.2, 741.82], "bbox_id": "5e1a79a1d5", "file": "AppomattoxNewspapers_1933-1936a_0353.pdf", "page": 1, "text": "Mrs. R L SJhepp has returned homii after visiliiig ip Richmond and Washington.  o  Mrs.Ola  Throckmorton, of New York is visiting her sister Mrs. J. A. Burke.  o  Mr. and Mrs. F. T Dess and son of Lynchburg spent the week end with Mrs. Herman Ould."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "and Washington.  o  Mrs.Ola  <mark>Throckmorton</mark>, of New York is"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "and Washington.  o  Mrs.Ola  <mark>Throckmorton</mark>, of New York is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.35, 481.03, 1720.9, 826.23], "bbox_id": "a63f6f7057", "file": "AppomattoxNewspapers_1974-1975a_0007.pdf", "page": 1, "text": "Mrs. Ola A. Thorkmorton if  I -  Mrs. Ola Abbitt Throckmor ton, formerly, of Appomattox, died Monday in Bradenton, Florida. She was the widow of Luther Wright Throckmorton. Born in Appomattox, she was a daughter of the late Aurelius William Abbitt and the late Nancy Jane Tibbs. She was a graduate of State Normal School now Longwood College and taught in the Richmond City Schools. She is survived by a daughter, Mrs. Nan Thorck- morton Browning of Bradenton, Florida a sister Elanor Abbitt Scott of Appomattox two granddaughters, and a great grandson. Graveside services will be conducted at 11 a. m. Thursday in Liberty Cemetery, Appomat tox. The family suggests that those wishing to make contri butions consider their favorite charity.   if Robinson Funeral Home of Appomattox is in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "widow of Luther Wright <mark>Throckmorton</mark>. Born in Appomattox, she"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "widow of Luther Wright <mark>Throckmorton</mark>. Born in Appomattox, she"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.09, 528.07, 1692.59, 564.47], "bbox_id": "55d09861a8", "file": "AppomattoxNewspapers_1939-1943a_0414.pdf", "page": 1, "text": "Mrs. Luther Throckmorton, of New York  arrived Tuesday to spend this week with her sister, Mrs. Jerry Allen Burke."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mrs. Luther <mark>Throckmorton</mark>, of New York  arrived Tuesday to spend this week with her sister, Mrs. Jerry Allen Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mrs. Luther <mark>Throckmorton</mark>, of New York  arrived Tuesday to spend this week with her sister, Mrs. Jerry Allen Burke."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.28, 302.8, 1674.35, 340.2], "bbox_id": "4df967a0fe", "file": "AppomattoxNewspapers_1926-1933a_0363.pdf", "page": 1, "text": "Mrs. L. W. Throckmorton and daughter, Nancy, are guests of Mrs. J. A. Burke."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mrs. L. W. <mark>Throckmorton</mark> and daughter, Nancy, are guests of Mrs. J. A. Burke."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mrs. L. W. <mark>Throckmorton</mark> and daughter, Nancy, are guests of Mrs. J. A. Burke."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [592.27, 419.58, 744.57, 453.65], "bbox_id": "cd8583847f", "file": "AppomattoxNewspapers_1918-1922a_0157.pdf", "page": 1, "text": "Mrs. L l Throckmorton i in a Richmond hospital for treatment"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mrs. L l <mark>Throckmorton</mark> i in a Richmond hospital for treatment"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mrs. L l <mark>Throckmorton</mark> i in a Richmond hospital for treatment"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1691.74, 1448.86, 1850.77, 1548.26], "bbox_id": "1299ac912d", "file": "AppomattoxNewspapers_1926-1933a_0363.pdf", "page": 1, "text": "Mrs. J. A. Burke and Mrs W. T. Gills gave a bridge party at the home of Mrs. Burke in honor of her sister, Mrs. L. W. Throckmorton and Mrs. Elea nor Scott. ------------ Q ------------ Harry Whitaker"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "sister, Mrs. L. W. <mark>Throckmorton</mark> and Mrs. Elea nor"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "sister, Mrs. L. W. <mark>Throckmorton</mark> and Mrs. Elea nor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1374.7, 297.12, 1667.17, 405.12], "bbox_id": "722224e93e", "file": "AppomattoxNewspapers_1918-1922a_0089.pdf", "page": 1, "text": "Mrs Fitzgerald, of Mississip pi, is a guest of Mrs 0. F. James. Mr. and Mrs. Throckmorton and baby left for Richmond L mentB inserted under this head tTof ON? CENT per word each I today. OBNTS per word tor one I _   90 , patrons are invited to make Ihe moving picture show, af-  ter m any disappointm ents, is know here- Cash must aooom_ jll order8-"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "James. Mr. and Mrs. <mark>Throckmorton</mark> and baby left for"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "James. Mr. and Mrs. <mark>Throckmorton</mark> and baby left for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1609.47, 363.04, 1750.08, 591.22], "bbox_id": "d4bf85888d", "file": "AppomattoxNewspapers_1974-1975a_0299.pdf", "page": 1, "text": "Mrs. Ben Harvey and Mrs. Grayden Pollard entertained with a luncheon of bridal appointment Thursday, May 23, at The Columns, honoring Miss Becky Harvey. Miss Harveys marriage to Denny Throckmorton took place Saturday, May 24, in Appomattox Court House Pres byterian Church. Among guests present for the luncheon were Mrs. Clifford Harvey, mother of the bride Miss Sally Harvey, her sisters maid of honor Mrs. J. D. Throckmorton, mother of the groom Mrs. Lillian Harvey, grandmother of the bride Miss Lucy Martin, Mrs. Marvin Goin and Miss Judy Agnew, attend ants of the bride."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Harveys marriage to Denny <mark>Throckmorton</mark> took place Saturday, May"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Harveys marriage to Denny <mark>Throckmorton</mark> took place Saturday, May"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.83, 352.92, 1712.52, 385.22], "bbox_id": "d0af2a51ef", "file": "AppomattoxNewspapers_1918-1922a_0330.pdf", "page": 1, "text": "Mr. W. L. Throckmorton is on j Pacific Coast engaged in Salva- i tion array drive."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mr. W. L. <mark>Throckmorton</mark> is on j Pacific Coast engaged in Salva- i tion array drive."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mr. W. L. <mark>Throckmorton</mark> is on j Pacific Coast engaged in Salva- i tion array drive."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1653.1, 361.15, 1812.35, 396.19], "bbox_id": "f8221d9096", "file": "AppomattoxNewspapers_1918-1922a_0073.pdf", "page": 1, "text": "Mr. R. J. Throckmorton, of Richmond, was a visitor here this week to his brother."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mr. R. J. <mark>Throckmorton</mark>, of Richmond, was a visitor here this week to his brother."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mr. R. J. <mark>Throckmorton</mark>, of Richmond, was a visitor here this week to his brother."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [588.9, 523.72, 743.55, 569.31], "bbox_id": "8187e5e557", "file": "AppomattoxNewspapers_1918-1922a_0260.pdf", "page": 1, "text": "Mr. L. W. Throckmorton re turned yesterday from the Pacific Coast where he has been for some months."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mr. L. W. <mark>Throckmorton</mark> re turned yesterday from the Pacific Coast where he has been for some months."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mr. L. W. <mark>Throckmorton</mark> re turned yesterday from the Pacific Coast where he has been for some months."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1588.08, 524.92, 1743.44, 633.57], "bbox_id": "b999fdb88b", "file": "AppomattoxNewspapers_1918-1922a_0259.pdf", "page": 1, "text": "Mr. L. W. Throckmorton re turned vesterdAy from the Pacific Coast where he hae been for some months. After all, the country will survive and tbe election of Harding is not as bad as the eleotion of Debs would have been."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mr. L. W. <mark>Throckmorton</mark> re turned vesterdAy from"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mr. L. W. <mark>Throckmorton</mark> re turned vesterdAy from"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1562.38, 220.68, 1723.83, 995.21], "bbox_id": "f2ddd26b7b", "file": "AppomattoxNewspapers_1908-1909a_0240.pdf", "page": 1, "text": "Mr. Holcomb Caldwell re turned to his school duties at Ferrum yesterday. Captain and Mrs. Hunter Gallier, of Crewe, Va., were visitors here to the Fair. Mrs. L. A. Tweedy, who has been sick for somo time i is much improved. Wm. Wingfield and wife, re burned to Richmond today af- er a visit to his father, C. A. Wingfield. Mrs. Agnes Bobbitt, of Hope- veil, is on. a visit to her father, 3 . A. Wingfield. Mrs. J. F Harvey, who re cently underwent an opéra- ion at the Virginia Baptist hos pital in Lynchburg, is reported o be improviùg. Mrs. Lewis Doss, Mrs..Har ry Johnson, and Mrs. P. JJ Sheppards of Buckingham, visited in Roxboro, N. C. this week. Messrs. Charles James, Al fred Harwood, Jr., land Henry ?ack left this week for Blacks- urg, where they Wiir begin heir studies at V. P. I. Mr. H. F. Doelaman has re- urned to his home in Balti more, Md., after being the rucst of Mr. and Mrs. H. B. .Marshall recently. Mr. Sidney Tinnell, Natural bridge, spent the day Sunday vith his wife and children in he home of Mr. D. B. John- on, near Stonewall. ...... Mrs. T. C. Roberts and son, Varren, of ShipmuhifiF. and Ærs. Clarke W. Roberts, of Cul peper, were Sunday guests of. 1rs. Lottie Bledsoe here.. Miss Virgimaee Thompson eft this wek for Randolph 4 aeon College, Lynchburg, vhere she will begin hër stud- es as a sophmore. Miss Emtnfa Gregory, who las been spending some time n Roanoke as the guest of Miss Mildred Fitzgerald has re- urned home. Mrs. Alma Beatty leaves Saturday for her home in Wa- jo, Texas, after spending the jummer in Appomattox, visit ng relatives, and friends. Mrs. Luther Throckmorton and daughter, Miss Nancy, who have been spending the cummer in Appomattox, have eturned to New Haven, Conn"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "and friends. Mrs. Luther <mark>Throckmorton</mark> and daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "and friends. Mrs. Luther <mark>Throckmorton</mark> and daughter, Miss Nancy,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.41, 239.15, 1734.6, 1656.53], "bbox_id": "7f2684fa5f", "file": "AppomattoxNewspapers_1926-1933a_0240.pdf", "page": 1, "text": "Mr. Holcomb Caldwell re turned to his school duties at Ferrum yesterday. Captain and Mrs. Hunter Gallier, of Crewe, Va., were visitors here to the Fair. Mrs. L. A. Tweedy, who has been sick for some time is much improved. Wm. Wingfield and wife re turned to Richmond today af ter a visit to his father, C. A. Wingfield. Mrs. Agnes Bobbitt, of Hope- veil, is on. a visit to her father, 0. A. Wingfield. Mrs. J. F. Harvey, who re- ently underwent an opera- ion at the Virginia Baptist hos pital in Lynchburg, is reported o be improving. Mrs. Lewis Doss, Mrs. Har ry Johnson, and Mrs. P. J. Sheppards of Buckingham, visited in Roxboro, N. C. this week. Messrs. Charles James, Ai red Harwood, Jr., land Henry Pack left this week for Blacks- jurg, where they will begin heir studies at V. P. I. Mr. H. F. Doelaman has re- urned to his home in Balti more, Md., after being the uest of Mr. and Mrs. H. B. Marshall recently. Mr. Sidney iTinnell, Natural 3ridge, spent the day Sunday vith his wife and children in he home of Mr. D. B. John- on, near Stonewall. Mrs. T. C. Roberts and son, Varren, of Shipman, Mr. and Mrs. Clarke W. Roberts, of Cul- eper, were Sunday guests of Irs. Lottie Bledsoe here. Miss Virginia Lee Thompson eft this week for Randolph Macon College, Lynchburg, vhere she will begin her etud es as a sophmore. Miss Emmfa Gregory, who has been spending some time n Roanoke as the guest of Miss Mildred Fitzgerald has re mitted home. Mrs. Alma Beatty leaves Saturday for her home in Wa- zo, Texas, after spending the summer in Appomattox, visit ing relatives and friends. Mrs. Luther Throckmorton and daughter, Miss Nancy, who have been Spending the summer in Appomattox, have eturned to New Haven, Conn. Mr. and Mrs. Robert Malon- ijr and children, of Madison- ille, and Miss Frances Ander- ..on, of Lynchburg, were recent quests in the home of Mr. ,B. 1. Anderson. Miss Mary Trent, who has jeen on a visit to her sister, Mrs. Elizabeth Fox, at Drew- jyville, has taken up her dut- es as teacher in the Hixburg school. Mr. and Mrs. Russell Gim- jert and son are occupying the jummer residence of C. A. Hancock. Mr. Gimbert has accepted a position as manager of the Battery Factory. Mrs. Gatie Woolridge Eppes and small daughter, Frances Fletcher, of Roanoke, were guests last week at the home of Mrs. J. H. Stanley and Mrs. H. M. Burge. Mrs. W. F. Collins and Mrs. Paul Harris, of East Radford, Mrs. Ruth Spelman and Miss Mary Kemp, of Miami, Fla., spent a few .days this week vth .Mrs, J. I. Morris and Mrs. R. C. Moore. ,R. W. Wilkins, Agricultural instructor, will begin a series of weekly discussions dealing with local farm problems, at Pettys Fork school house on vVednesday, Sept. 24, at 745 p. M. Mr. Grubb, County Agent of Campbell County, will talk on Lespedeza. Farm- ors in that locality are urged to come out. Mrs. M. C. Caldwell and son, Hubert and Miss Grace Cald well motored to Roanoke for he weekend to visit friends and relatives, they were accom panied home by the laters mother, Mrs. R. E. Caldwell, Sr., who has been spending jome time with her daughters, Mrs. C. O. McCray and Mrs. W D. Marshall.  Mrs. Ellen Furbush also came with them to her daughters Mrs. H. S. Jones, of Spout Spring, where ihe will make her home."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "and friends. Mrs. Luther <mark>Throckmorton</mark> and daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "and friends. Mrs. Luther <mark>Throckmorton</mark> and daughter, Miss Nancy,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [557.5, 201.68, 714.35, 547.47], "bbox_id": "b1a3a1f15a", "file": "AppomattoxNewspapers_1918-1922a_0225.pdf", "page": 1, "text": "Mr. Edgar Martin was io town yesterday. Harold Spencer has returned from bis vacation. Mr. Jerry Burke is confined to bis home by sickness Mrs. William Carter is sick at her home near Wild way. For SaleGood barrels for cider. 8 2t L E. S mith . The High School here opens on Monday, the lHtb. Mr. Adam Clement leaves for University of Virginia in a few days. Prof. Terry Durrum sails for London next Saturday on bus iness. Granulated sugar is retail ing in Appomattox at 21 cents a pound. Mrs. Throckmorton and little laughter are guests at Hotel Ions, Bedford county. Mr T V. Gor .on and wife. f Ohio, are visiting their son, Prof G. O. Gordon, hi re The-E iitor is enj yin,r a fi ih ng trrp this w r u on Chesa oeake Bay. Miss Desn Johns leases iu a few days tor Texas, where she"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "cents a pound. Mrs. <mark>Throckmorton</mark> and little laughter are"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "cents a pound. Mrs. <mark>Throckmorton</mark> and little laughter are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [535.74, 210.14, 691.17, 715.82], "bbox_id": "e599819885", "file": "AppomattoxNewspapers_1918-1922a_0349.pdf", "page": 1, "text": "Mr. Edgar Martin was in town yesterday. Harold Spencer has returned from bis vacation. Mr. Jerry Burke is confined to his home by sickness Mrs. William Carter is sick at her home uear -Wildway. For SaleGood barrels for cider. 8 2t L E. S mith . The High S ihool here opens onMonday, the 13ch. Mia Adam Clement leaves for University of Virginia in a few days. Prof. Terry furringsails for London next Saturday on bus iness. Granulated sugar is retail ing in Appomattox at 21 cents a pound. Mrs. Throckmorton and little laughter are guests at Hotel dons, Bedford county. Mr T V Gordon and wife, f Ohi1, ar.- visiting thu-ir won, Prof G. O Gordon, b-re The E litor is  j y i nrf a fi th ng trip tpis week on Jhsa jeake Bay. Miss Deau Johns leaves in a few days for Texas, where she goes to teach. The Hesediah Baptist Asso ciation meets this week at Gal ilee colored church Dr. J. B Abbitt, of Norfolk, sp jnt the week end with his wife and children here. Bud, the son of Mr add Mrs. A B. Nowlin, continues q lite sick. MissKizzie Burnett, of Stone wall, spent last week with her brother here. Mr. J W. Flood attended the Rich"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "cents a pound. Mrs. <mark>Throckmorton</mark> and little laughter are"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "cents a pound. Mrs. <mark>Throckmorton</mark> and little laughter are"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.45, 190.88, 1771.55, 595.17], "bbox_id": "cdaa15dbf4", "file": "AppomattoxNewspapers_1918-1922a_0348.pdf", "page": 1, "text": "Mr. Edgar Martin tow n yesterday. Harold Spencer has returned from bis vacation. Mr. Jerry Burke is confined to his home by sicknest Mrs. William Carter is sick at her home near Wildway. For SaleGood barrels for cider. 8 2t L E. S mith . The High School here opens on Tdonday, the 13th. M bs Adam Clement leaves for University of Virginia in a few days. Prof. Terry !urrmq sails for London next S lturday on bus ineea. G ranulated augar ia retail ing in Appomattox at 21 centa a pound. Mrs. Throckmorton and laughter are guets at vlons, Bedford county. Mr T V. G oron and if Ohi-, art- visiting thei Pff G. O Gord-rn, ht-re The E liter  h e j lying a fi ih  ng trip tiia we-k on Chesa jeake Bay . Mias Do in Johns leaves ia a few days for Texas, where she goes to teach. The HeBediah Baptist Asso ciation meets this week at Gal ilee celored church Dr. J. B Abbitt, of Norfolk,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "centa a pound. Mrs. <mark>Throckmorton</mark> and laughter are guets"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "centa a pound. Mrs. <mark>Throckmorton</mark> and laughter are guets"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1684.09, 357.83, 1845.48, 934.73], "bbox_id": "a737445953", "file": "AppomattoxNewspapers_1918-1922a_0046.pdf", "page": 1, "text": "Mr. Daniel Browning and family, of Richmond, were visiting Mr. R. H. Browning at the Old Court House last week. Mrs. Norman Cheatham and daughter, Miss Alice, of Lynch burg, have returned home after spending several days with Mr. and Mrs. J. H. Cheatham at the New Appomattox. Quite a crowd of our soldier boyawho have seen service in the Rainbow Division are ex pected home this evening at 437. A warm greeting awaits our heroes. Lieut. Luther Throckmorton came home last week with his discharge and saw his baby for the first time. He met Oaptian J ack Peters here also who ex changed greetings and said they last saw each other in France. Both of the gentlemen look good. Mr. John P. Rector had a se rious fire at his place of busi ness Monday night at Spout Spring The fire started in the store part of the building about 9 oclock p. m., the other part of the building being occupied by Mr. Holmesy Inge, as a res idence. Young Mr. Rector has only been in business a few months and is said to have been doing a good business, and many expressions of regret are heard of his misfortune. He was insured for 7,000 on stock and building, which will not cover his loss. Mr. Inge lost his household effects,with out insurance. Mr. Rector will rebuild and start business again."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "our heroes. Lieut. Luther <mark>Throckmorton</mark> came home last week"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "our heroes. Lieut. Luther <mark>Throckmorton</mark> came home last week"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [580.09, 166.88, 724.89, 334.53], "bbox_id": "ecb22361b5", "file": "AppomattoxNewspapers_1974-1975a_0465.pdf", "page": 1, "text": "Mr. Burton Day spent the week end in the home of Mr. V. B. Day. Miss Betty Day is spending some time with him. Other visitors last week were Mr. Frank Chenault, Mr. j Dannie Heath, Mr. and Mrs. Wesley Guill, Mr. and Mrs. i Charlie Forbes, Mr. Mike Scruggs, Ms. Becky Stinson and Dwayne, Mr. E. J. I Throckmorton, Mr. and Mrs.  W. I. Watson and several j others. Miss Anne Elliott, of Baltimore, Md., has been i"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mr. E. J. I <mark>Throckmorton</mark>, Mr. and Mrs.  W."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mr. E. J. I <mark>Throckmorton</mark>, Mr. and Mrs.  W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1380.25, 1012.72, 1554.29, 1546.51], "bbox_id": "4ce5a26c3a", "file": "AppomattoxNewspapers_1926-1933a_0367.pdf", "page": 1, "text": "Mr. Bob Fleshman, late of V. M. 1., has been on a visit to his fathers home, Hickory Grove, here, returning to Bluefield Sat urday. Mr. L. W. Throckmorton paid our office a pleasant call Satur day. He stopped over to see home folk enroute to Conneticut where he has charge of an im migration office for government. Miss Elizabeth Hancock, who has recently been entertaining a house-party at her summer home here, is now on a camping trip near W hite Sulpher Springs, West Virginia. Mr. and Mrs. W. W. Scott and small daughter, Nancy Stuart, leave Saturday for New York, where they will spend some time with the formers parents. Mr. Alwyn Howell, who has been spending the past week at the home of Rev. W. M. Thompson left Saturday for Richmond. Miss Josie Jamerson has re turned from her vacation in Richmond and Toano. She was accompanied home by Miss Bettie Meanly, who will spend the summer. M s. Waverly Green and children, of Burkeville Mr. Will Walton ana son, of Dis- putanna, who have been visit ing their parents here have re turned to their respective homes."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "urday. Mr. L. W. <mark>Throckmorton</mark> paid our office a"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "urday. Mr. L. W. <mark>Throckmorton</mark> paid our office a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1595.96, 222.93, 1920.96, 789.51], "bbox_id": "e586ac94a7", "file": "AppomattoxNewspapers_1908-1909a_0252.pdf", "page": 1, "text": "Mr. and Mrs. L. E. Morris are on a visit to relatives in Smithfield, Va. Rev and Mrs. W. M. Thomp son and daughter, Virginia, have returned home from a visit in Henderson, N. C., and South Boston, Va. Greatly .reduced rates for light and power will be put ip operation at Appomattox by the V. ,P. S. Company, begin ning with September account. The minimum rate domestic service will be 81 per month as announced in our last issue. Miss Elaine McDearmon en tertained at b r i d g e a number of her friends at her home in Pamplin last evening. This evening she will have an- redericksburg, were guest I other party exclusively for Lhis week in the home of Dr. L- young people. u. Gayle.  I Mr. Warren Thornhill and Miss Eula Mae Burke has  wife, of Bluefield, W. Va., and opened her home here and is Mrs. George Brandt, from aow occupying it with Mrs. J Lynchburg, Va., visited Miss Ola Throckmorton and daugh-Ida Jones and Mrs. Bell Payne cer, Miss Nancy. Misses Annie and Jessalyn Hancock are on a visit to their uncles, Messrs. Charles gnd Witt Hancock, at Bluefield W. Va. 3 u Mr, and Mrs C. A. Han cock, Mesdames E. E- Gill and Lily Gregory have re  .urned from a trip through, the alley of Virginia. Mr. R. W. Sihith, of Spou Spring, and Mr W. pitzer Gill, attended the funeral of Mr Wilson Gills last Friday in Buc tinghSm.T Misses Patsy Watkins o. armville and Mayy Rilee, Oi tichmond, are visiting in the iome of Mi, and Mrs. W. P. iills."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Va., visited Miss Ola <mark>Throckmorton</mark> and daugh-Ida Jones and"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Va., visited Miss Ola <mark>Throckmorton</mark> and daugh-Ida Jones and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1612.11, 280.12, 1749.71, 384.21], "bbox_id": "94fb75acb1", "file": "AppomattoxNewspapers_1974-1975a_0300.pdf", "page": 1, "text": "Mr. and Mrs. Jackie D. Throckmorton of Hampden- Sydney entertained at the Parkway Restaurant in honor of Miss Rebecca Penn Harvey and their son, Mr. J. Denny Thorockmorton, and the bridal party before the wedding rehearsal on Friday evening, May 23."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "and Mrs. Jackie D. <mark>Throckmorton</mark> of Hampden- Sydney entertained"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "and Mrs. Jackie D. <mark>Throckmorton</mark> of Hampden- Sydney entertained"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2059.39, 759.77, 2225.66, 805.76], "bbox_id": "6179bdb203", "file": "AppomattoxNewspapers_1943-1947a_0025.pdf", "page": 1, "text": "Mr. and Mrs. E. R Hammersley and guests, Mr, and Mrs. Charles Throckmorton and daughter and son of Richniond were recent visitors in the home of Mrs Mollie-S. Garrette."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mr. and Mrs. E. R Hammersley and guests, Mr, and Mrs. Charles <mark>Throckmorton</mark> and daughter and son of Richniond were recent visitors in the home of Mrs Mollie-S. Garrette."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mr. and Mrs. E. R Hammersley and guests, Mr, and Mrs. Charles <mark>Throckmorton</mark> and daughter and son of Richniond were recent visitors in the home of Mrs Mollie-S. Garrette."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [354.7, 614.68, 624.35, 705.57], "bbox_id": "3600f16a19", "file": "AppomattoxNewspapers_1974-1975a_0184.pdf", "page": 1, "text": "Mr. and Mrs. Clifford E. Harvey announce the engagement of their daughter, Rebecca Penn, to Joseph Denny Throckmorton, son of Mr. and Mrs. Jack D. Throckmorton of Hampden Sydney, Va. Miss Harvey is a senior at Longwood College in Farmville, Va. Mr. Throckmorton is a 1974 graduate of Hampden-Sydney College and is employed in Farmville, Va. The wedding is planned for May 24."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Penn, to Joseph Denny <mark>Throckmorton</mark>, son of Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Penn, to Joseph Denny <mark>Throckmorton</mark>, son of Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.22, 1008.7, 1907.38, 1038.2], "bbox_id": "a8cabcbb38", "file": "AppomattoxNewspapers_1915-1918a_0437.pdf", "page": 1, "text": "Misses Virginia Ferguson and  i0 in be8t wisheB or a Roselle Hundley and Messrs, appy ufe. Mr. Throckmorton"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Misses Virginia Ferguson and  i0 in be8t wisheB or a Roselle Hundley and Messrs, appy ufe. Mr. <mark>Throckmorton</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Misses Virginia Ferguson and  i0 in be8t wisheB or a Roselle Hundley and Messrs, appy ufe. Mr. <mark>Throckmorton</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1493.51, 1082.39, 1656.89, 1832.33], "bbox_id": "87c5f68172", "file": "AppomattoxNewspapers_1918-1922a_0081.pdf", "page": 1, "text": "Misses Gladys and Iiiene Smith and Mr. Hubert Cald well spent the week-end with their aunt, Mrs. E A. Walton, at Bent Creek. Messrs. Throckmorton and Chandler are rushing the equip ment for their moving picture show here. Contractors Brown  Smith will rush the building to completion. Mr and Mrs. R. N. Dawson, of Richmond, have returned after spending the summer with her father, Mr. R. H Browning, at Old Court House. Mr Dawson is much improved Capt. Jack Higginbotham and Mr. Cleveland Hail, su perintendent and guard respec ively of the Alleghany county convict road force, visited rela tives here this week. Mr. L. E. Smith is now pro prietor of the A. T. Inge Btore and for the present will con duct both places. Leu promises to give the public some mer chandise at an early date Messrs. Morris Bros, have purchased of Mr. R. W. Bur- key his stock of goods here and leased the building and will oonduot the business there hereafter. I will sell at public auction on Wednesday, Kept. 10,1919, the house and lot now occupied by Mrs. T. L. Wilkerson in tbe village of Appomattox on the road betveen the High school and Appomattox W. H. Sale to take place on the premises at 330 p. m. 27 2t J. W. C a w t h o n , J r . Try our Blood  Bone Tank age Fertilizers for your Grain and Grass crops. The best is always the cheapest and bv a liberal application you can ma terially increase your yields, hence reduce the cost of pro duction. Below are a few brands and analysis 20h Century Grain Grower 10 2 2 Virginia Grain Grower 12 2 0 Clover leaf for Grain 141 11 0 Clover leaf Potash Mixture 10 0 4  Raw Bone and Phosphate half and half. Make your selection and see your dealer or write to the Blackstone Guano Co. Inc.,"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "at Bent Creek. Messrs. <mark>Throckmorton</mark> and Chandler are rushing"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "at Bent Creek. Messrs. <mark>Throckmorton</mark> and Chandler are rushing"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.07, 1245.06, 1808.06, 1502.81], "bbox_id": "531052e59a", "file": "AppomattoxNewspapers_1918-1922a_0492.pdf", "page": 1, "text": "Misses Eula Bnrke, Gladys Fan Yolkenburg and Mrs. Ola Throckmorton, Messrs. Joel Flood and Tyler Akers motored o the Peaks on Saturday. Mr. and Mrs. B. R. Smith and Family, of Chicago, 111 , have returned from a visit to Messrs.  h. and D. R. Puckette here A L. Dean, of V. P. I., Poul- Fry Specialist, in company with jeounty agent, Byrne, is hold- Pg culling demonstrations in fh county this week. Several farmers of Stonewall fre interested und will install a F me crushing plant in that dis- F ct. Among those interested Pe notice Ool. Joe. Button, T. Moore and Walker Martin."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Yolkenburg and Mrs. Ola <mark>Throckmorton</mark>, Messrs. Joel Flood and"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Yolkenburg and Mrs. Ola <mark>Throckmorton</mark>, Messrs. Joel Flood and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [458.62, 659.83, 697.81, 1337.79], "bbox_id": "d7d7959c54", "file": "AppomattoxNewspapers_1926-1933a_0516.pdf", "page": 1, "text": "Miss Virginia Lee Thompson. D. H. Franklin visited his son, D. J. Jr., in Lynchburg Sunday, at the home of J. W. Smith. Mrs. Joe OBrien and daugh ters, Virginia, and Adeline, of Lynchburg, visited Miss Anne Caldwell recently. Charles James, Jr., spent Easter at home. The Recreational Club met Monday night and Miss B V. Harwood instructed the mem bers in the old folk dance of early colonial days. Miss Frances Gordon, of Blackstone, was at home last week for a visit. Miss Mary Taylor Gills was home for the Easter holidays Eleanor Harwood has return ed from a visit to Richmond. Mrs. R. E. Davis and family of Richmond, spent Easter here with. Mrs. Davis family. Miss Lucy OBrien spent Easter with heP sister, Mrs. W P. Gills. Mrs. J. A. Burke and daugh ter, Jane, entertained in hon or of Miss Nancy Withers Throckmorton of Saint Margar ets school, of Tappahannoc, on Saturday evening.1, There were out of town guests from Blacks- stone Military Academy. Farm ville, Spout Spring and Pamp lin. Mr. W. F. Woolf oik and Mr Giles Miller, of Culpeper, were visitors here during the recent holidays. Mr. W. J. LeGrand and family drove to Roanoke Mon day to visit Miss Mary Ann Le Grand and to return Miss Jose phine LeGrand to business school. Mrs. W. H. S. Barlow and son, Ralph, leave today for Clifton Forge, where she wil visit her husband, W. H. Barlow, who has a position there, and her daughter, Mrs Herbert Watts. . The Yo-Yo spread made by spending some j e iajje8 Gf the Presbyterian church was awarded to C. McDearmon, selected as win ner by a committee of four. The Presbyterians realized about twenty dollars on this work and it will be applied on the church expenses."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "of Miss Nancy Withers <mark>Throckmorton</mark> of Saint Margar ets"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "of Miss Nancy Withers <mark>Throckmorton</mark> of Saint Margar ets"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2391.6, 1118.62, 2509.41, 1128.16], "bbox_id": "12eca9b89b", "file": "AppomattoxNewspapers_1939-1943a_0237.pdf", "page": 1, "text": "MISS THROCKMORTON"}, "highlight": {"text": {"matched_tokens": ["THROCKMORTON"], "snippet": "MISS <mark>THROCKMORTON</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["THROCKMORTON"], "snippet": "MISS <mark>THROCKMORTON</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [572.16, 330.89, 729.13, 440.61], "bbox_id": "43525e4eff", "file": "AppomattoxNewspapers_1918-1922a_0331.pdf", "page": 1, "text": "Miss Ruth ber vacation ham Mr. W. L. Throckmorton is on j Pacific Coast engaged in Salva- non army drive. For Sale A good six cylinder tar, J. M Bu-koam, Evergreen, Va."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "ham Mr. W. L. <mark>Throckmorton</mark> is on j Pacific"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "ham Mr. W. L. <mark>Throckmorton</mark> is on j Pacific"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.35, 181.69, 1821.29, 1101.26], "bbox_id": "bdbafae3c0", "file": "AppomattoxNewspapers_1918-1922a_0362.pdf", "page": 1, "text": "Miss Macie Inge has return ed from a visit to Roanoke. Rev. J. M. Street, who has been ill, is much improved. Mrs VirgiHa Jones is visiting in Roanoke. Circuit court will open bare Friday morning. Miss Nettie Moses spent last week witb her cousin, Mrs. Curtis Harvey, in Pamplin. Mrs. L. W. Throckmorton and baby are back from a visit to Bedford. Mr N. E Wagers and wife are here. We understand they will make their home here. Miss Bell Byrne, of East Falls church, is a guest of her broth er, W. B Byrne, here. Mrs. N H. Gregory leaves today for Roanoke to hear Billy Sunday. Mr. and Mrs. M. L. Barman have returned from an extend ed visit to the Valley. Havilah Babcock and sister, Mies Oallie, were visitors hen this week from Elon College. Mr. Jesse Turned is recover mg from a broken arm, the result of crankiDg his car. Miss Eula M. Burke is spend ing some time with her sick brother in North Carolina. Miss Addis Chandler, of Burkeville, visited her brother, Mr. O. G. Chandler, last week. Mr and Mrs. Price, father and mother ,of our townsman, Mr. E. T. Price, are on a visit here. George W. Lewis, J r , is a new arrival and there is great rejoicing, even with the chick ens. The Lynchburg Fair is on this week and many Appomat tox people are journeying to the Hill City. Mr. Richard Baber lost hie barn of 1800 sticks of tobacco last week oy fire on the farm f the lute Dr. D M. Robertson Mr. A. F Drinkard, ot near Stapleton, continues sick, anc iiss Laura 1 bell, who has jeen ill, is much better. Women over 21 years of age should see Commissioner of Revenue E R. Abbitt and reg Ster, so they will be prepared to vote at the next election. New Butober Shop at Appo mat tox I will bave fresh meat every day. I will buy all veal oalves. Gall on me. 8 4t W J. L i G band . I will receive sealed bids for Lunoh privilege in building at Appomattox Fair until Mon day evening, October 4, at 8 p. m. E. L e R oy S mith , President. Billy Abbitts condition be came alarming a few days ago and the family was summoned to his bedside. After conference it was derided to remove him to a Norfolk hospital. Be went down Monday. The Sunbeam band of Holly wood church will hold its reg alar meeting on Saturday, October 2nd, beginning at 3 oclock p m. Every member invited to attend."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Pamplin. Mrs. L. W. <mark>Throckmorton</mark> and baby are back"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Pamplin. Mrs. L. W. <mark>Throckmorton</mark> and baby are back"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [569.75, 199.69, 724.45, 1109.21], "bbox_id": "1656606022", "file": "AppomattoxNewspapers_1918-1922a_0363.pdf", "page": 1, "text": "Miss Macie Inge has return ed from a visit to Roanoke. Rev. J. M. Street, who bas been ill, is much improved. - Mrs VirgiHa Jones is visiting in Roanoke. Circuit court will open here Friday morning. Miss Nettie Moses spent last week with her cousin, Mrs. Curtis Harvey, in Pamplin. Mrs. L. W. Throckmorton and baby are back from a visit to Bedford. Mr N. 1 Wagers and wife are here. We understand they will make their home here. Miss Bell Byrne, of East Falls church, is a guest of her broth er, vV. H Byrne, here. Mrs. N H. Gregory leaves today for Roanoke to bear Billy Sunday. Mr. and Mrs. M. L. Earrnan have returned from an extend ed visit to tbe Valley. Havilab Babcock and sister, Miss Gallic, were visitors ben this week from Elon College. Mr. Jesse Turnon is recover mg from a broken arm, the result of cranking biscar. Miss Eula M. Burke is spend ing some time with her sick brother in North Carolina. Miss Addie Chandler, of Burkeville, visited her brother, Mr. C. C. Chandler, last week. Mr and Mrs. Price, father and mother of our townsman, Mr. E. T. Price, are on a visit here. George W. Lewis, J r , is a oew arrival and there is great rejoicing, even with thé chick ens. The Lynchburg Fair is on this week and many Appomat,. tox people are journeying to the Hill City. Mr. Richard Baber lost bis barn of 1800. sticks of tobacco last week oy Are on the farm it tbe Lte ür. D M. Robertson Mr. A. F Drinkard, of near Stapletou, continues sick, anc lias Laura 1 bell, who has jeen ill, is much better. Women over 21 years of age should see Commissioner of Revenue E R. Abbitt and reg ster, so they will be prepared to vote at the next election. New Butcher Shop at Appo mat tox I will bave fresh meat every day. I will buy all veal oalves. Call on me. 8 4t W J . L e G r a n d . I will receive sealed bids for Lunch privilege in building at Appomattox Fair until Mon day evening, October 4, at 8 p. m. E. L e R oy S mith , President. Billy Abbitte condition be came alarming a few days ago and the family was summoned to his bedside. After conference it was decided to remove him to a Norfolk hospital. He went down Monday. Tbe Sunbeam band of Holly wood church will bold its reg alar meeting on Saturday, October 2nd, beginning at 3 oclock p m. Every member invited to ittend."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Pamplin. Mrs. L. W. <mark>Throckmorton</mark> and baby are back"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Pamplin. Mrs. L. W. <mark>Throckmorton</mark> and baby are back"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1635.1, 334.48, 1784.39, 587.37], "bbox_id": "94803ce201", "file": "AppomattoxNewspapers_1918-1922a_0395.pdf", "page": 1, "text": "Miss Edna Tornes, of Brook eal, Va., visited relatives here od in the county last week Mr Tommie Covington, of ttoanoke, has been visiting bis .arents, Mr. and Mrs T m Jovington, near Hollywood, a. Mr. W. P. Gills found in tbt. oad 25 feet rubber hose. I.vuer cun get soma by calling a him. Mrs. W, L Throckmorton nd little Nance will leave fet CicbiDond Friday und wiii aove to Norfolk. Mr. A. H Glemant and Mr Valter Jones have returned , rom a trip to Amherst ou . igai business."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "him. Mrs. W, L <mark>Throckmorton</mark> nd little Nance will"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "him. Mrs. W, L <mark>Throckmorton</mark> nd little Nance will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1435.45, 242.55, 1760.93, 1426.45], "bbox_id": "266ada12be", "file": "AppomattoxNewspapers_1926-1933a_0252.pdf", "page": 1, "text": "Miss Christine Caldwell is spending the week as the guest of Mrs. W. B. Caldwell. Dr. and Mrs. C. W. Tucker, of Drakes Branch, were guests in the home of Mr. and Mrs. C. 3 McDearmon Sunday. Mrs. Deb Babcock and little daughter, June, of Gladstone, were recent visitors to relatives m the county. Miss Catherine Gills spent he last week-end in Pamplin as the guest of Dr. and Mrs. Walker. Mrs. F. A. OBrien has re turned from a visit to hei daughter, Mrs. R. E- Alvis, in Richmond. Mr. J. P. Gayle and sons, ol j Fredericksburg, were guests .his week in the home of Dr. L. L, Gayle. Miss Eula Mae Burke ha opened her home here and is aow occupying it with Mrs. Ola Throckmorton and daugh ter, Miss Nancy. Misses Annie and Jessalyn  Hancock are on a visit to their ancles, Messrs. Charles nd vVitt Hancock, at Bluefield W. Va.  .  Mr. and Mrs C. A. Han cock, Mesdames E. E- Gills land Lily Gregory have re .urned from a trip through tht alley of Virginia. Mr. R. W. Smith, of Spou spring, and Mr. W. Pitzer Gill, attended the funeral of Mr Vilson Gills last Friday in Buc angham. Misses Patsy Watkins o armville and Mary Rilee, oi Richmond, are visiting in tht lome of Mr. and Mrs. W. P. Gills. Mrs. Jim Harvey, of Lynch-  ourg, Mr. and Mrs. Irving Alack, of N. J., were recent quests in the home of Mrs. Lou- illa Morris. Mrs. Lloyd Cates and two small sons, of Burlington N. ., who have been on a visit to Mrs. Cates parents, Mr. and Mrs. H. C. Babcock, have re- urned home. Dont miss a single issue of your county paper, always something happening in Ap- Miss Ilene Smith is spending I pomattox and you are sure to a part of her vacation at Ben Creek. It is reported that the gar ment factory will - start ug again next week. Ed. Ferguson, of Victoria was a visitor in Appomatto this week. Miss  Elizabeth Martin, o Jacksonville, Fla., is visiting ii the home of Senator Ferguson Mr. and Mrs. Mack, of Nev Jersey, were week-end guest of Mrs. Helen Welch. Misses Mary Taylor and Cor nelia Gills visited friends ii Bedford last week. Miss Della Inge is home aftei attending the summer schoo  at the University of Virginia. Miss Grace Caldwell hat been on a visit to relatives ir Crewe. Elwood James, of Dendron was a recent visitor in the hom of Dr. and Mrs. James. Miss Mary Dorton, of Rich mond, is spending her vacatior- with parents at Mt. View. Mr. Thelbert Trent was  . week-end guest in the home ol  Miss Florence Gregory. Messrs. Bob Fleshman and Red Garrett, of Bluefield spent the week-end with rel atives here."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "it with Mrs. Ola <mark>Throckmorton</mark> and daugh ter, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "it with Mrs. Ola <mark>Throckmorton</mark> and daugh ter, Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [492.96, 1205.71, 602.18, 1215.21], "bbox_id": "e88031f62d", "file": "AppomattoxNewspapers_1971-1973a_0632.pdf", "page": 1, "text": "Luther W. Throckmorton"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Luther W. <mark>Throckmorton</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Luther W. <mark>Throckmorton</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1326.25, 835.65, 1464.91, 971.19], "bbox_id": "5aacd2e756", "file": "AppomattoxNewspapers_1918-1922a_0142.pdf", "page": 1, "text": "LOCAL B itlB F S . lea Willie b.aMey is reported better this v ees. kasea ftuaie am. Annie Hancock iu.fl?ld, came home for Eaacer pesis. L W. Throckmorton anu J B rke are conducting a drive lauds for the Salvation Army, rs. Russell Peacck, of Rich I, who ha. been speeding Fas home, returned today."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Eaacer pesis. L W. <mark>Throckmorton</mark> anu J B rke"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Eaacer pesis. L W. <mark>Throckmorton</mark> anu J B rke"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [383.06, 654.26, 527.67, 1170.45], "bbox_id": "43036c98fe", "file": "AppomattoxNewspapers_1922-1923a_0087.pdf", "page": 1, "text": "lire. Frances Rose, of N. C., i Richmond for an operation  is ill. jfeteran Bob Wingfield of Idiers borne, Richmond, was ire this week. _jjr8, Throckmorton a n d lighter are visiting at thp tie of Jerry Burke. Are GinnellPollard is her king after the pack of toma eat the Appomattox cannery. 3apt. Jack Higginbothan Ln the State road force wan be Sunday to see his wife anc by- ire. Carrie Willis and child  returned to Fredericksburg loaday after an extended visit j her aunts here. Liberty Sunday School is cnicing to-day on Appomat- x river. Our hope is that Kexids will have a good time. Joe LtGrand has screened hi jaughter house and made it knitary. He was fined for It screening it last week. 1 Misses Mary H. Babcock, Luis L Moore, Mrs. F. E loore and two daughters have plumed from a trip to the East, la and other points ol k tenet. j Faroivilles fine ball team fill again try to defeat Appo mattox at the Fair Ground ere Saturday at 3 p. m. If yoi Taut to see real ball playing ome out Saturday."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "ire this week. _jjr8, <mark>Throckmorton</mark> a n d lighter"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "ire this week. _jjr8, <mark>Throckmorton</mark> a n d lighter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.52, 871.36, 1592.63, 1161.06], "bbox_id": "b32603f41f", "file": "AppomattoxNewspapers_1918-1922a_0298.pdf", "page": 1, "text": "lery. se in charge of the exer rere Mrs L. H. Crawley, lent Mrs VV. B. Caldwell, president Mrs. D N.Twy secretary Mrs. Lula r, recording secretary gram Committee  Miss iBurks, Mrfl. Hunter and rrawley. Imittee on Arrangements IR. F. Burke, Miss Nina land Mrs. Joe OBrien, tic CommitteeMrs. J. A Miss Anna Jones and täte Franklin. Imittee on FlowersMes W. B. Caldwell, D. N pan, R. F. Burke, J. D. T. B. Pretlow, Misses ia Ferguson, Annie Da- , Kata Davidson and i Gills. leyance CommitteeMes B. G. Anderson, W, T. W. L Throckmorton, lias Mattie Bears, fshal Committee  A . H it."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "W, T. W. L <mark>Throckmorton</mark>, lias Mattie Bears, fshal"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "W, T. W. L <mark>Throckmorton</mark>, lias Mattie Bears, fshal"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1430.15, 602.59, 1603.92, 1045.89], "bbox_id": "49b3b51155", "file": "AppomattoxNewspapers_1908-1909a_0256.pdf", "page": 1, "text": "L. B. Pitman, of Riqh- nd is visiting at the home of F father, Mr. W. P Gills. rMrs. Redding-and soiuf háve - sen on a visit to her relatives P1 McClellansville, N- ,C. Luther Throckmorton and daughter, Miss Nancy, are l plaiting relatives here. f Rev. A. F. Barker, Of Men- sriota, was a recent guest of p iss Emma Gregory. Mr. Donald GSrson, of Pros- Dect, was a recent viutor to jss Cqieen Coleman, ---- - Í Mr. Lawrence Walker, of Lynchburg, is a guest of Mr. alvin Coleman.  Miss Mildred McDéarmón, he University summer school,, ppent the week-end at home. ? Miss Loveila Buchannan re cently underwent an opera ron at Memorial hospital, f Misses Emily - Harvey and erta Smith have retained rom a visit to Obfin, Ohio.  . Mrs. Eugene Walton ,of Bent Creek is visiting at the pome of Mr. L. E. Smith, Miss BesBie IZuhmerinan has Returned from a visit to Iiv- fngston, Ala. Miss Mattie, McCain is yisitr ng her sistei, Mrs. C.  F ames."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "McClellansville, N- ,C. Luther <mark>Throckmorton</mark> and daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "McClellansville, N- ,C. Luther <mark>Throckmorton</mark> and daughter, Miss Nancy,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1431.57, 662.58, 1606.69, 1165.6], "bbox_id": "34c4641b47", "file": "AppomattoxNewspapers_1926-1933a_0256.pdf", "page": 1, "text": "k Mrs. Redding ,and sons have Ibeen on a visit to her relatives in McClellansville, N- C. Mrs. Luther Throckmorton apd daughter, Miss Nancy, are visiting relatives here. ! ev A. F. Barker, of Men- dota, was a recent guest of Miss Emma Gregory. Mr. Donald Carson, of Pros- pect, was a recent visitor to FMiss Coleen Coleman. I Mr. Lawrence Walker, of ILynchburg, is a guest of Mr. ICalvin Coleman.  Miss Mildred McDearmon, fthe University summer school, spent the week-end at home. J Miss Lovella Buchannan re- cer.tly underwent an opera- Iton at .Memorial hospital. I Misses Emily Harvey and lyerta Smith have returned from a visit to Oblin, Ohio. I Mrs. Eugene Walton ,of IBent Creek is visiting at the! home of Mr. L. E. Smith. , Miss Bessie Zimmerman has returned from a visit to Liv ingston, Ala. Miss Mattie McCain is visit ing her sister, Mrs. C. i F. James. I Mr. and Mrs. L. V. Allen and family, of Farmville, are visit- png Mrs. Allens parents, Mr. land Mrs. Witt Coleman. Mr. and Mrs. Harry Lawson have been on a visit to the Iformers mother, .Mrs. M. L. awsonw"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "N- C. Mrs. Luther <mark>Throckmorton</mark> apd daughter, Miss Nancy,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "N- C. Mrs. Luther <mark>Throckmorton</mark> apd daughter, Miss Nancy,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2353.89, 1153.1, 2553.8, 1342.2], "bbox_id": "0bf0af0a32", "file": "AppomattoxNewspapers_1939-1943a_0237.pdf", "page": 1, "text": "Judge and Mrs, Joel W, Flood, and Mr. and Mrs. J, A. Burke motored to Roanoke Monday n got to attend the play, Its A  Child, in which Miss Nan Wither Throckmorton enacted the role of Alice Peabody. Miaa Throckmorton, of New York, formerty of Appo- mattox, is the neice of Mr . and Mrs. J.A. Burke, and bw been spending some time. here. She at tended S.IT.C, at Farmville, and has been to professional dramltics about two years, and appeared In the play, Censored on Broadway, after attending the A. H. wooa Academy of Dramitica to Hew York. She played in summer stock snows ...  it Cragsmoore, N.Y., and at Roch- room egter, N . Y. last fall, doing radio books -I, while there."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "which Miss Nan Wither <mark>Throckmorton</mark> enacted the role of"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "which Miss Nan Wither <mark>Throckmorton</mark> enacted the role of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [342.7, 616.62, 465.45, 691.17], "bbox_id": "f001d9ba8e", "file": "AppomattoxNewspapers_1918-1922a_0466.pdf", "page": 1, "text": "If. p. Woolf oik is going to a Iriners Ceremony at Norfolk seek. nrB. Throckmorton and little ocy Withers are visiting Wives here."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "If. p. Woolf oik is going to a Iriners Ceremony at Norfolk seek. nrB. <mark>Throckmorton</mark> and little ocy Withers are visiting Wives here."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "If. p. Woolf oik is going to a Iriners Ceremony at Norfolk seek. nrB. <mark>Throckmorton</mark> and little ocy Withers are visiting Wives here."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.55, 585.11, 1695.2, 710.37], "bbox_id": "f9f0d07351", "file": "AppomattoxNewspapers_1918-1922a_0465.pdf", "page": 1, "text": "ID. F. Woolfolk is going to a bars Ceremony a t Norfolk veek. . L Throckmorton and little U Withers are visiting fves here. Lavona Crowder and iter, Louise, are visiting 8. L. Ferguson."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "t Norfolk veek. . L <mark>Throckmorton</mark> and little U Withers"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "t Norfolk veek. . L <mark>Throckmorton</mark> and little U Withers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1393.48, 691.37, 1563.1, 713.61], "bbox_id": "8cb60b6141", "file": "AppomattoxNewspapers_1974-1975a_0299.pdf", "page": 1, "text": "i . JOSEPH DENNY THROCKMORTON le former Miss Rebecca Penn Harvey"}, "highlight": {"text": {"matched_tokens": ["THROCKMORTON"], "snippet": "i . JOSEPH DENNY <mark>THROCKMORTON</mark> le former Miss Rebecca Penn Harvey"}}, "highlights": [{"field": "text", "matched_tokens": ["THROCKMORTON"], "snippet": "i . JOSEPH DENNY <mark>THROCKMORTON</mark> le former Miss Rebecca Penn Harvey"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.63, 1466.13, 1847.54, 1528.05], "bbox_id": "ceb12cff97", "file": "AppomattoxNewspapers_1908-1909a_0363.pdf", "page": 1, "text": "honor of her sister, Mrs. L. W. Throckmorton and Mrs. Elea nor Scott.  ------- o ------------ Harry Whitaker"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "honor of her sister, Mrs. L. W. <mark>Throckmorton</mark> and Mrs. Elea nor Scott.  ------- o ------------ Harry Whitaker"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "honor of her sister, Mrs. L. W. <mark>Throckmorton</mark> and Mrs. Elea nor Scott.  ------- o ------------ Harry Whitaker"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1497.6, 682.11, 1663.31, 834.91], "bbox_id": "2dd1c142df", "file": "AppomattoxNewspapers_1918-1922a_0079.pdf", "page": 1, "text": "her father, Mr. Robert Moore,. at Stonewall, this week. Bring load of Primings to I The Farmers Tobacco Ware-1 house, Appomattox, on Open-1 ing DaySept. 4th. 20 2 j Miis Margaret Chocklette,! of Lynchburg, spent Sunday I with ner parents, Rev. and Mrs. I G. A. Chocklette.  Mr. John D. Abbitt a n d l daughter, Miss Edith of Nor I folk, have been on a visit to I Mrs W. L. Throckmorton here. I"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "I Mrs W. L. <mark>Throckmorton</mark> here. I"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "I Mrs W. L. <mark>Throckmorton</mark> here. I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [658.78, 364.58, 1676.24, 443.04], "bbox_id": "ff814dcb90", "file": "AppomattoxNewspapers_1933-1936a_0444.pdf", "page": 1, "text": "H e a r t of T h e D ark T o b acco Appomattox, Virginia M r. and M rs. Harv mod aib seveJ alMJ in the home of Mr- erson Sunday.  o M rs. Throckmorton, was the guest of ehi i T . P . Childress last w"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Sunday.  o M rs. <mark>Throckmorton</mark>, was the guest of"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Sunday.  o M rs. <mark>Throckmorton</mark>, was the guest of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1001.99, 692.35, 1171.18, 772.65], "bbox_id": "114793e62e", "file": "AppomattoxNewspapers_1960-1962b_0638.pdf", "page": 1, "text": "Guest of Mrs. E. L. Pankey Sun day P.M. are as listed. Mr. and Mrs. Norman Grider of Lawrenceville,  a., Mr. Johnie Throckmorton from Georgia, Mrs. Ruby Jamerson, Lin da. and Charles, Mr. and Mrs. Henry Adams, and children, Mrs. Viola Wayne and Miss Helen Adams."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Lawrenceville,  a., Mr. Johnie <mark>Throckmorton</mark> from Georgia, Mrs. Ruby"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Lawrenceville,  a., Mr. Johnie <mark>Throckmorton</mark> from Georgia, Mrs. Ruby"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1627.72, 645.04, 1762.53, 736.93], "bbox_id": "5ec199c158", "file": "AppomattoxNewspapers_1922-1923a_0086.pdf", "page": 1, "text": "grt Prances Bose, of N. C., ..Richmond for an operation ie ill. eterao Bob Wingfield of ildiere home, Richmond, was week. Throckmorton a n d"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "grt Prances Bose, of N. C., ..Richmond for an operation ie ill. eterao Bob Wingfield of ildiere home, Richmond, was week. <mark>Throckmorton</mark> a n d"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "grt Prances Bose, of N. C., ..Richmond for an operation ie ill. eterao Bob Wingfield of ildiere home, Richmond, was week. <mark>Throckmorton</mark> a n d"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [300.0, 508.75, 620.32, 687.54], "bbox_id": "292aee947f", "file": "AppomattoxNewspapers_1908-1909a_0538.pdf", "page": 1, "text": "Godsey include-Mr- J. C. Hob- R.ev M- c  Pullia bolding isoh, Mrs. Whitest and daugh- revival services at Bedford- ter and mother from Norfolk,  News has reached here of and Mr. and Mrs. L. M. Guth- the death of Charles Dancey rie and family from Altavista- McCraw, of Georgia. He had been sick for a number of Mrs. L. W. Throckmorton years and her daughter, Nancy With Mrg p E Tuqker is in Rich- ers, brth of New Haven, Conn, mon1 f medical treatment.  yerd dy ,t0 ue gUC8ts f Childrens Day services will A Burke here. be held at the Methodist H Misses Ruth Layman and Church here next Sunday af- Inez Arnold of Roanoke, and ternoon at 246 oclock- Mrs- G. P. Maniates and son of . The Young Peoples program Lynchburg, were the guests of to have been held at the Pres- Mrs. Hunter Glenn at Ever- byterian Church here last Sun- green this week-end. day night has been postponed"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "of Mrs. L. W. <mark>Throckmorton</mark> years and her daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "of Mrs. L. W. <mark>Throckmorton</mark> years and her daughter,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1672.54, 994.87, 2129.29, 1383.56], "bbox_id": "6c2dc705b6", "file": "AppomattoxNewspapers_1939-1943a_0416.pdf", "page": 1, "text": "For the convenience of men, wom en, boys and girls over sixteen years of age, the Appomattox Chapter of only by members of the family, I the American Red Cross announces was performed b y , the RavereriL .Mrs, Glib, nd. Robert flu Redding, pastor of .the Ap- ed Nurse, ana director of home nor-  - _ -  - pomattox Court House Presbyterian sing for the chapter, has agreed to church, before an altar of gladioli teach a class at Appomattox on each and cathedral candles with a back-! Monday night from 730 to 930. ground of laurel and other native I The course requires 30 hours, there- greens. fore 15 lessons will ge given. The During the ceremony violin solos, only expense will be seventy-five Tis I Alone Can Tell,  Call Me cents for each textbook. All who de- iThine Own, and other selections sire to join the night class are asked were played by tre Honorable John Rolfe Horsley. The bride, who was gsven in mar riage .by her father, wore a cream wool dress with navy accessories in cluding a toque and bouquet of peach  gladioli and purple violets. She also  wore a locket and lace handkerchief that had belonged to her great grand mother. Miss Nan Withers Throckmorton, cousin of the bride, of Richmond, and New Yrok, was maid of honor and Mrs. Jerry Allen Burke, Jr., of Richmond was matron of honor. Both wore dresses of pastel wool with flower toques and bouquets of iris and roses. Jerry Allen Burke, Jr., brother of the bride, was best man. The bride attended the State Teachers College, Farmville, where she was a member oi oigma Sigma Sigma sorority she also attended the Ringling School of Art in Sara sota, Florida and later studied in New York. She is descended from Colonial Virginia families being a direct des-"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "mother. Miss Nan Withers <mark>Throckmorton</mark>, cousin of the bride,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "mother. Miss Nan Withers <mark>Throckmorton</mark>, cousin of the bride,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [474.26, 1227.31, 617.91, 1683.43], "bbox_id": "800370dc26", "file": "AppomattoxNewspapers_1971-1973a_0632.pdf", "page": 1, "text": "Florida - Mrs. Jerry A. Burke and Mrs. Abbitt Scott have received word that their brother-in-law, Luther Wright Throckmorton, 85, died in Bradenton, Florida, on Mon day, February 5. A native of Richmond he was the son of the late Charles W. Thorckmorton and Mary Anne Wright Throckmorton. He was educated in Richmond Public Schools, University of Rich mond, United States Naval Academy and University of Virginia Law School. He was a lieutenant in the heavy artillery in World War I and served in France for the duration of the war. For a number of years he was an attorney with the Bureau of Immigration and Nationaliza tion in New York City. He is survived by his wife, the former Ola Lee Abbitt, a daughter, Mrs. Thomas A. Browning, of B r a d e n t o n , Florida, two granddaughters, a great grandson a sister. Miss Lucy T. Throckmorton and a brother, Charles W. Throck morton, of Richmond a sister, Mrs. Lewis Taylor of Mech- anicsville, Virginia two nieces and a nephew. A graveside service will be  conducted on Thursday, eleven a.m., February 8, at Liberty  Baptist Cemetery by the Rev. Morey Peoples, Vicar of St. Annes Episcopal Church."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "their brother-in-law, Luther Wright <mark>Throckmorton</mark>, 85, died in Bradenton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "their brother-in-law, Luther Wright <mark>Throckmorton</mark>, 85, died in Bradenton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2193.35, 597.47, 2343.0, 920.16], "bbox_id": "d0037a38d6", "file": "AppomattoxNewspapers_1974-1975a_0327.pdf", "page": 1, "text": "fingertip mantilla edged in Venise lace and she carried a bouquet featuring white daises with babys breath. The bride wore her great-great grand mothers necklace featuring a tiny cross attached to an engraved rose. Mrs. Ronald J. Torrence of Weston, Colorado, was her sisters matron of honor and attendants were Miss Nancye Mathew and Mrs. Donald L. Williams of Appomattox and Mrs. J. Denny Throckmorton of Covington. The attendants wore slipper length gowns of soft yellow voile over taffeta. The bodice featured butterfly sleeves and a square neckline accented in ecru beaded lace. A softly gathered A-line skirt flowed from a high rise waist featuring a sash in the back. They carried I sprays of long stemmed white daisies and babys breath tier with green ribbons and wore white daisy in their hair. A Lewis Harris of Appomat tox was his brothers best man"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "and Mrs. J. Denny <mark>Throckmorton</mark> of Covington. The attendants"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "and Mrs. J. Denny <mark>Throckmorton</mark> of Covington. The attendants"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [376.36, 1216.85, 518.54, 1274.65], "bbox_id": "f02cdd47d9", "file": "AppomattoxNewspapers_1918-1922a_0493.pdf", "page": 1, "text": "Eula Burke, Gladys an Volkenburg and Mrs. Ola Throckmorton, Messrs. Joel j Flood and Tyler Akers motored j to the Peaks on Saturday."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Eula Burke, Gladys an Volkenburg and Mrs. Ola <mark>Throckmorton</mark>, Messrs. Joel j Flood and Tyler Akers motored j to the Peaks on Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Eula Burke, Gladys an Volkenburg and Mrs. Ola <mark>Throckmorton</mark>, Messrs. Joel j Flood and Tyler Akers motored j to the Peaks on Saturday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.61, 457.04, 1180.21, 692.39], "bbox_id": "608a6942d7", "file": "AppomattoxNewspapers_1933-1936a_0528.pdf", "page": 1, "text": "Etta Harris and Others Appomattox, Va., August 3rd, 1936. To- Esther J . Smith, Etta Har ris and W.E.Harris .Mrs. Mar garet Brittian and Leslie Brittilan, her husband, Mrs. Grover C. Able, and Grover C. Able, T . W Throckmorton and Lena Throck morton, Mrs. Eddie Gein- otte and Eddie Gcpnotte, J. S. Lythgie and Sarah Lythgoe, W .J. Lythgoe and Lorena T . Lythgoe, Mrs Vera Wall, James N. Lythgoe and Virginia Lythgoe, Russell Lyth goe, and Mrs. Belle Lythgoe, Lill ian Linden and Max F . Linden, Mrs. Kate Lythgoe, Thomas J. Lyth goe Jr., Jennie Sheean and William Sheean, Clarence Lythgoe, Edward I.ytthgoi and Vivian Lythgoe, Ray mond L Lythgoe and Nori Lyth goe, D  E. Lythgoe and Miary Lythgoe, Vernard S. Gooding, Mel vin Gooding and Alice Gooding, Eleanor Franklin and Luther Frank-"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "C. Able, T . W <mark>Throckmorton</mark> and Lena Throck morton,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "C. Able, T . W <mark>Throckmorton</mark> and Lena Throck morton,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.28, 910.44, 1838.34, 1161.38], "bbox_id": "7036129aba", "file": "AppomattoxNewspapers_1918-1922a_0164.pdf", "page": 1, "text": "c-president Mrs. D N.Twy n, secretary Mrs. Lula uter, recording secretary rogram Committee  Miss la Burke, Mrs. Hunter and i. Crawley. lommittee on Arrangements Jpl. B. F. Burke, Miss Nina Jn on les and Mrs, Joe OBrien, lusic CommitterMrs. J. A trr, Miss Anna Jones and is Kate Franklin, lommittee on FlowersMes nes W. B. Caldwell, D. N yman, R. F. Burk, J. D. rris, T. B. Fretlow, Misses ginia Ferguson, Annie Da son, E a t1 Davidson aud gie Jills. lonvey ance CommitteeMes nes B G. Anderson, W. T ,ele, W. L Throckmorton, 1 Miss Mattie Bears, darshal Committee  A. 11 m en!."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "T ,ele, W. L <mark>Throckmorton</mark>, 1 Miss Mattie Bears,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "T ,ele, W. L <mark>Throckmorton</mark>, 1 Miss Mattie Bears,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.39, 272.42, 1750.64, 399.57], "bbox_id": "5ace9011b4", "file": "AppomattoxNewspapers_1918-1922a_0240.pdf", "page": 1, "text": "Circuit court will open here Friday morning. Miss NtUie Moses spent last week with her cousin, Mrs. in. U. W. Throckmorton and baby are back from a visit to Bedford. Mr N. E Wagers and wife are here We understand they will make their home here. Miss Bell Byrne, of East Falls"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Mrs. in. U. W. <mark>Throckmorton</mark> and baby are back"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Mrs. in. U. W. <mark>Throckmorton</mark> and baby are back"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [516.99, 879.45, 629.57, 1148.69], "bbox_id": "50ceaf492e", "file": "AppomattoxNewspapers_1918-1922a_0165.pdf", "page": 1, "text": "charge of the exer- Mrs L. H. Crawley, Mrs W. B. Caldweii, dent Mrs. D N.Twy- rotary Mrs. Lula cording secretary pa Committee  Miss he, Mrs. Hunter and ley. Utee on Arrangements IF. Burke, Miss Nina Mrs. Joe OBrien, ommittefMrs. J. A gs Anna Jones and Franklin. tee on FlowersMes B. Caldwell, D. N. R F. Burkt, J. D. B. Pretlow, Mieses Ferguson, Annie Da- ati Davidson and Us. mce CommitteeMes G. Anderson, W. T L Throckmorton, jMattie Bears.  Committee  A . H"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Anderson, W. T L <mark>Throckmorton</mark>, jMattie Bears.  Committee  A"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Anderson, W. T L <mark>Throckmorton</mark>, jMattie Bears.  Committee  A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [525.59, 241.15, 1002.22, 1033.11], "bbox_id": "8229b28c93", "file": "AppomattoxNewspapers_1908-1909a_0516.pdf", "page": 1, "text": "Byrd In Statement time here, with her parents, Senator and Mrs. S. L. Fergu- c son. .  1 Mrs. Dewitt Marshall and ,i two children are visiting Misses ,1 Emma and Lucy Smith.  Miss Florence Gregory, of . Crozet, spent Easter week-end  in her home here. Thelbert Trent, of North  Garden, was a guest in the ! home of Mrs. Lily Gregory during Easter. Miss Ethelyn Lee spent last  week-end at home. Mrs. Paul Ferguson, of .Sta pleton, spent last week here with her mother. William Burke, of U. of Va., was home Sunday. Burke Steele was here last week-end. W. R. OBrien, of Roanoke, I was a guest in town Monday I night. Misses Annie a n d Corinne 1 Hancock spent Easter at home. Misses Bessie! V. and Alice I Harwood were home for ,Eas- ter. f Miss Virginia Lee Thompson of Randolph-Macon, was home I last week-end. f Miss Ada Basham, of Rineir, spent last week-end with Miss  Alice Harwood.  Miss Vaughan Guillander, of I Norfolk, spent Saturday with Miss Virginia Lee Thompson. D. H. Franklin visited his j son, D. J. Jr., in Lynchburg  Sunday, at the home of J. W. I Smith. Mrs. Joe OBrien and daugh ters, Virginia, and Adeline, of I Lynchburg, visited Miss Anne Caldwell recently. Charles James, Jr., spent I Easter at home. The Recreational Club met  Monday night and Miss B. V. I Harwood instructed the memJ Ibers in the old folk dance of I early colonial days. Miss Frances Gordon, of iBlackstone, was at home last I week for a visit. Miss Mary Taylor Gills was home for the Easter holidays. Eleanor Harwood has return- I ed from a visit to Richmond. Mrs. R. E. Davis and family  lof Richmond, spent.Easter here with. Mrs. Davis family. Miss Lucy OBrien spent 1 Easter with her sister, Mrs. W.  P. Gills. Mrs. J. A. Burke and daugh-  I ter, Jane, entertained in hon- lor of Miss Nancy Withers  Throckmorton of Saint Margar- _ I ets school, of Tappahannoc, on  I Saturday eVening.1, There were _  out of town guests from Blacks-  I stone Military Academy, Farm   ville, Spout Spring and Pamp-"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "of Miss Nancy Withers  <mark>Throckmorton</mark> of Saint Margar- _ I"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "of Miss Nancy Withers  <mark>Throckmorton</mark> of Saint Margar- _ I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1349.73, 987.45, 1482.21, 1261.73], "bbox_id": "dc4c5be37d", "file": "TimesVirginian_1980a_0388.pdf", "page": 1, "text": "attached the finger tip length veil of illusion. Miss Rita Faye Garrett, sister of the bride, was maid of honor. She wore a floor length dress of burgundy fashioned with high hack- line, short sleeves and full flowing skirt. She carried pink roses. Bridesmaids were Debo rah Lynn Morris, of Rich mond, cousin of the bride and Joan Throckmorton of Richmond. They wore dre sses identical to that of the honor attendant and carried pink roses. Mr. Tommy Beasley of Richmond was besthian and ushers were Mr. David T. Garrett Jr., and Timothy W. Garrett, of Evergreen, bro thers of the bride, and Mr. Dean Bareford of Richmond. Immediately following the ceremony the parents of the"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "the bride and Joan <mark>Throckmorton</mark> of Richmond. They wore"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "the bride and Joan <mark>Throckmorton</mark> of Richmond. They wore"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1470.28, 756.6, 1616.88, 1106.24], "bbox_id": "3ff8ad4247", "file": "AppomattoxNewspapers_1974-1975a_0299.pdf", "page": 1, "text": "Appomattox was her sisters maid of honor. Bridesmaids were Mrs. Marvin C. Goin of Hampden-Sydney, sister of the bridegroom Miss Lucy Martin of Appomattox and Miss Betty Agnew of Burkeville. 1 Mr. Throckmorton was his sons best man and ushers were Paul D. Harvey, brother of the bride, David A. H arvey, brother of the bride, both of Appomattox Marvin C. Goin of Hampden, brother-in-law of the bridfegfroom- Robert M. Cham bers of Farmville and Robert M. Evans of Richmond. After the ceremony Mr. and Mrs. Harvey entertained with a reception at the church fellowship hall. The bride is a graduate of Longwood College and the bridegroom is a graduate of Hampden-Sydney College. After a southern wedding trip the couple will live in Covington, Virginia."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "of Burkeville. 1 Mr. <mark>Throckmorton</mark> was his sons best"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "of Burkeville. 1 Mr. <mark>Throckmorton</mark> was his sons best"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1692.95, 313.59, 1861.77, 622.35], "bbox_id": "9934c3662c", "file": "AppomattoxNewspapers_1955-1957a_0170.pdf", "page": 1, "text": "Appomattox. The Cox family and Mrs. Throckmorton entertained with string music and singing. iMr. and Mrs. Calvin Robinson will leave tomorrow for Old Point, where they will spend the week-end. Mrs. Robinson, Chairman, Third Dis trict of the Virginia Division, United Daughters of the Confeder acy, will attend a State Executive Board Meeting and banquet at the Hotel Chamberlain on Saturday. Also the Dedication of the Jefferson Davis Memorial Park at Fort Mon roe, in ceremonies by the General Organization of the U. D. C., which will fake place immediately after the adjournment of the Saturday morning dbssion. The Executive Board members will be joined at a luncheon by the U. D. C. General Officers and Distinguished Guests, following the Dedication Ceremon ies. Mrs. B. C. Baldwin, of Lynch burg, Past President of the Virginia Division, U. D. C., will accompany the Robinsons to Old Point. Birthday List"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Cox family and Mrs. <mark>Throckmorton</mark> entertained with string music"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Cox family and Mrs. <mark>Throckmorton</mark> entertained with string music"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1822.58, 206.6, 1981.63, 468.14], "bbox_id": "832ae3692f", "file": "AppomattoxNewspapers_1915-1918a_0588.pdf", "page": 1, "text": "Among the Sick I Mrs Frank Babcock is sick Lem Mitchells faniily is dnw  sick Mrs. James Spiggleefam p, -V Mrs. Durrum and i r 0  11 r are sick Mr. Jack Higginbotham is out after a severe spell 8 J. Lees family is stricken. Rev. J C Lops is betterhis son, Joe. is sick at school John R. Poes family is sick Mrs. Throckmorton, Mi 8 Bessie James, Misses vi attic Bears and Bertha Wooldridge, and Duval Hunter are sick at Hotel Bradley Babcock is out again. Rev. McE roy is sick W. L Colemans family is down. Drs. Twym n and Chris tian are both up and at work today. The health authorities insist that our people must be care ful Avoid crowds. Dont sneeze or cough without hand kerchief over mouth and nose"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "family is sick Mrs. <mark>Throckmorton</mark>, Mi 8 Bessie James,"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "family is sick Mrs. <mark>Throckmorton</mark>, Mi 8 Bessie James,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1394.43, 756.86, 1471.2, 1063.55], "bbox_id": "d0e4b78550", "file": "AppomattoxNewspapers_1974-1975a_0299.pdf", "page": 1, "text": "age of Miss n Harvey to j Throckmorton lrday afternoon, 200 p.m. at Court House Jhurch in Appo- ia. the daughter of Clifford Eugene omattox and the the son of Mr. D. Throckmor- i-Sydney. 1 V. Dalton, church, officiat- ony. ven in marriage wore a gown of over taffeta. The ed long Juliet high neckline of lace. The A-line apel train were atching lace, y Harvey of"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "n Harvey to j <mark>Throckmorton</mark> lrday afternoon, 200 p.m."}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "n Harvey to j <mark>Throckmorton</mark> lrday afternoon, 200 p.m."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1502.9, 941.59, 1695.03, 1843.1], "bbox_id": "7df105c405", "file": "AppomattoxNewspapers_1918-1922a_0085.pdf", "page": 1, "text": "A. G j î u . Ground has bem broken for i epe new Methodist parsonage Mr. K G. Blackwell is the con-j tractor. Misses Mildred OBrien, Alice Kinney and Mildred Trent left yesterday for Farmville Nor I mal. Dr. H. E. Jones and Mr O E. Hunter, of Roanoke, were week-end guests at Oakland Farm. Mrs. I. 8 V. Bumgardner, of W. Va . and childred are visiting at the home of Mrs. H. C. Babcock. Rev. A. 8. J. Rice is conduct- ing a fine meeting at Mt. Com fort this week. He is being as  Listed by Rev. Keith, of Rich- I mond. The movies will soon be ini operation. Brown  Smith the contractors promise the build-j ing to Messrs. Throckmorton  Chandler in about two weeks. The Democratic candidates and many party man are hav ing a conference this evening at the courthouse. The contest is warming up. We are glad to report that the condition of Messrs. Randolph Caldwill and J. T. Rogers has so much improved that they are now considered out of 4u8eF- Brother Oauabam i preach I ing to a crowded house iu his meeting at Memorial services every evening this week aud Sunday at 815 You are in  yittd. Rev. L. F. Callaham is con ducting a series of meetings at Memorial Methodist church this week and large congregations are attending and much inter est is being manifested. Mr. A- T. Inge has been ap pointed assistant cashier of the Farmers National Bak ani has entered upon his duties, The appointment is a popular one, and both Mr. Inge and the 1 Bank are to be congratulated. Our frieud, Robert Wheeler, a o t on th e w rong gideof th e tie stick and when it Hew back the chain smacked bn in the face and disfigured him con siderably. It takes more than a lock-chain to hold Bob down. Local politicians are holding meetings over the county and it is reported that the meetings are b e in g well attended. Ju st what the issues of the cam paign are in a fight for local offices would be news worth printing."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "build-j ing to Messrs. <mark>Throckmorton</mark>  Chandler in about two"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "build-j ing to Messrs. <mark>Throckmorton</mark>  Chandler in about two"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.98, 297.8, 1794.34, 775.14], "bbox_id": "bffdef514d", "file": "AppomattoxNewspapers_1918-1922a_0508.pdf", "page": 1, "text": ". Grandstand ia being j ,u .h.Ph  APP L Fair- T . ahioment of Tanlac just BediP obas. F. James, cal agent. lit looks like a small crop of fceat is to be seeded by our bmers this fall. L 1 Throckmorton is here  a visit to his wife and Lighter. jjlr Bradley Babcock entered L pden Sidney college yes- Lay lor the session. Mr. and Mrs. M. L. Barman ie returned from a visit to Lads in the valley. L Will Coleman is at work t bis new home on the South deoi town. Ground has been broken for new home of W. J. Le Lgod on the southside of town Dr. Simpson will preaoh and lid Quarterly Conference at lethodist church here Monday lanlao, that wonderful medi 6 eoulin Appomattox by bas. F. James. Quite a number of oar oiti L are attending the Lynoh brg Fair this week. Circuit Court convenes here londay October 3rd. There is large doexet to be disposed of."}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "this fall. L 1 <mark>Throckmorton</mark> is here  a visit"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "this fall. L 1 <mark>Throckmorton</mark> is here  a visit"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [374.4, 373.18, 542.36, 1891.0], "bbox_id": "6e4838a3cb", "file": "AppomattoxNewspapers_1918-1922a_0152.pdf", "page": 1, "text": "Democratic Mass-Meeting Saturday after a well-attend ed meeting of the Democrat of Appomattox county was held in the cpurthouse here, Col. Joe Button, of Richmond, presiding, the following reso lutions were adopted . By S. L. FergusonResolved we endorse the Democratic administration of our national government under the wise and statesmanlike leadership of our president, Woodrow Wilson. We esieem it a privilege as well as a duty to congratulate and felicitate our distinguished representative in congress, the Honorable Henry. D. Flood, for his conspicuous services to his country. He has aided with great ability and unflag ging zeal all the foreign and domestic policies of the chief of our party, and has been in the forefront in promoting the measures of this Democratic administration. We extend to him our warm and hearty sup port for another term in the House of Representatives. By L. W. ThrockmortonRe solved that the Democrats of Appomattox county in mass meeting assembled this 8th day of May, point with pride to the very efficient, able and capable officers of this county, and eachof the magisteriol districts hereof, and of the efficient, progressive and economic ad ministration which the Demo cratic party, through its officers has given to the taxpayers and people of this county. By 8. L. Ferguson Whereas the death of the Senior Senator of Virginia, the late Thos. S. Martin, has occurred since the Democrats of this county last assembled, therefore be it now Resolved, that the Democrats of this county feel keenly his deathwill miss his able coun sel, characterized in State and National affairs with distin guished ability and recognized statesmanship. By R. F. Burke  Resolved that the seven votes to which Appomattox county is entitled in the Democratic State Con vention to be held in Roanoke, on the 19th of May, be cast by the Delegates who are present in that convention on all ques tions as a majority of the dele gates present may determine. By J . R. HorsleyResolved that the delegates from this county to the Roanoke conven tion be instructed to vote for the re-election of Hon. R. A James as chairman of the State Democratic committee and for the re-election of Hon. Carter Blass as member from Virginia on the National Democratic committee. By C. W. Smith  Whereas, the Democrats of Appomattox county have been fortunate in electing to the Legislature of Virginia a typical Virginia gentleman, a man of high character, broad experience intelligence, ability and sound legislative judgment, who has faithfully and efficiently repre sented the people of Appomat tox county during the last session of the Legislature, and among other measures has in troduced and secured the pas sage of some important State Road Legislation, Therefore, be it resolved by the Democrats of Appomattox county in mass meeting assem bled this the 8th day of May 1920, that we heartily endorse the course and career of the Hon. J . R. Horsley as our rep resentative in the House of Delegates of Virginia. By R. L. BurkeWhereas since the Democrats of Appo mattox county last met in mass meeting on Dec. 31st, 1918, at which time they called upon the Hon. S. L. Ferguson to be come a candidate for the State Senate, and Whereas, he bowed to the will of his countymen and friends, and laid aside bis personal considerations, and has been twice elected to the Senate of Virginia from the 18th District, and has ably, intelli gently, faithfully and efficient ly represented us in the extra sessioirof 1919 and the regular Vsssion of 1920, during the era of re-construction and re-ad justment following the world war, when the State and Nation called for the best statecraft of our ablest men who proper ly safeguard our institutions, and provide for the new order of things which must inevitab ly follow Therefore, bo it resolved by the Democrats pf Appomattox county, in mass meeting assem bled this the 8th day of May, 1920, that we believe that he is one of the ablest représenta tives it has had, and we hearti ly endorse the course of the Hon. S. L . Ferguson in the Senate of Virginia. The following delegates, with one-fourth vote each, were elected to the Roanoke con vention which meets on the 19th of M nyin that city H.j"}, "highlight": {"text": {"matched_tokens": ["Throckmorton"], "snippet": "Representatives. By L. W. <mark>Throckmorton</mark>Re solved that the Democrats"}}, "highlights": [{"field": "text", "matched_tokens": ["Throckmorton"], "snippet": "Representatives. By L. W. <mark>Throckmorton</mark>Re solved that the Democrats"}], "text_match": 578730089005449337, "text_match_info": {"best_field_score": "1108074561536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730089005449337", "tokens_matched": 1, "typo_prefix_score": 1}}
