{"document": {"bbox": [414.27, 735.93, 560.66, 1072.26], "bbox_id": "174803625c", "file": "TimesVirginian_1976_0204.pdf", "page": 1, "text": "you. In the time short or long, left to us we can work for worthy values, those ideals we held when  we studied at Appomattox Agricultural High School. Those purposes will sustain us in the moments or years that remain to us in life. May I remind you of these names of the 12 who are remembered by these roses and by the gold lettering on this ribbon Mary Virginia Airis, Eddie Houston Babcock, Ruth Truman Bur nette, Lillian Glen Caldwell, Mary Louise Morris, Frank Pendleton Peitow, Jefferies Judson Street, Nelson Reese Thurman, Ida Belle Evans, Eleanor Rosalie Ferguson, Gladys Addie Joy and Richard Moss Lewia. The vagejpf memorial roses was givhiMMMemorial Metho dist ChitecJHn honor of Mrs. L. Crawley Our principal. Money left after paying expenses was given to the Appom attox Rescue Squad. ----------- --------------------------"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Judson Street, Nelson Reese <mark>Thurman</mark>, Ida Belle Evans, Eleanor"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Judson Street, Nelson Reese <mark>Thurman</mark>, Ida Belle Evans, Eleanor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1529.04, 876.71, 1852.87, 991.91], "bbox_id": "aae4468d80", "file": "AppomattoxNewspapers_1926-1933a_0426.pdf", "page": 1, "text": "year of his age. Deceased wasIburg-Ergreen Public itoad hadniivedCharl0ti CUnty but and wi ere the soil road leading naa lived here the most of his Ifrom Appomattox toward Ever- hfe, and was a member of L iber-Feeii . intersects with said ty church, and served it as Sec-1 i SK S t W  Evergreen Road, rotary for 36 years S w i Smifh Ja  p  M5S of. L- E- twice married w,-D A. R Harwood and other twice married. His first wife I lands of E. R. Abbitt and others was Mackie Harvey of Charlotte Iand being the same property and two daughters survived Thurman by her d eath -M ary Wright of I hit , 4 b b lt t and Maggie Q . Ab-"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "and two daughters survived <mark>Thurman</mark> by her d eath"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "and two daughters survived <mark>Thurman</mark> by her d eath"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2119.18, 562.49, 2405.93, 1025.84], "bbox_id": "42fa188a4a", "file": "AppomattoxNewspapers_1943-1947a_0311.pdf", "page": 1, "text": "xioDert r.1 VniuoV Samuel L. Page Edward C. Martin James A. Reed John R. Mann Landor J. Hudson John H. Goin Samuel C. Phelps Joel W. Childress Edward Smith, III Thurman L. Wilcox Raymond Godsey Benjamin C. Harvey Sydney A. Conner Robert T. Messer Merwyn W. Williamson James L. Perdieu Clarence W. Harris Landon D. Thomas John H. Wilkes John D. Johnston, Jr. Thomas E. Burks Lonnie C. Reynolds Thomas E. Davidson Albert H. Page John W. Childress James H. Garrett Clifton Austin John H. Mason Hartwell C. Martin William L. Brown Charlie D. Doss Charlie C. Moses John C. Harvey Joseph B. Terry Johnnie J. Moore Robert B. Smith William G. Mitch id Thomas A. Guill James A. Bass I Howard R. Moore Lyle Crews James N. Phelps, Jr.  Buddie Ould Raymond J. Forbes James Gunter Edward L. Almond Lewis Cl Wooten - fiubtuteiw - tnshfieWbV BmMs -- i!sd    5  lirtqi Taylo4 MUler, Maybi-rry T berti"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Childress Edward Smith, III <mark>Thurman</mark> L. Wilcox Raymond Godsey"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Childress Edward Smith, III <mark>Thurman</mark> L. Wilcox Raymond Godsey"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [569.05, 267.69, 713.01, 460.34], "bbox_id": "b77cacbe9c", "file": "TimesVirginian_1976_0098.pdf", "page": 1, "text": "Worship service. A special guest will be coming that no one will want to miss hearing. It was good to have Mr. and Mrs. Glenn Martin back at church Sunday after having the flu. Mr. and Mrs. S. E. Ranson will spend this week in Roanoke with Mr. and Mrs. Thurman Wilcoxi The Rocks Quartet, went to Keysville Sunday afternoon to present a program of gospel music. Mrs. Patsy Richardion is on the sick list again."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "with Mr. and Mrs. <mark>Thurman</mark> Wilcoxi The Rocks Quartet,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "with Mr. and Mrs. <mark>Thurman</mark> Wilcoxi The Rocks Quartet,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1406.08, 1105.1, 1566.42, 1558.84], "bbox_id": "ab4e8bc08c", "file": "AppomattoxNewspapers_1905-1912a_0529.pdf", "page": 1, "text": "Winchester.  William Madison Myers, a State highway engineer in charge of road work, died at his home here on thq thirty-ninth anniversary of his birth. He leaves three sisters and two brothers. Clifton Forge.All four of the col ored men implicated in the holdup here were given sentences of six months in jail, and fines of 25 each. The men attempted to hold up a white man. but he resisted and they fled. Roanoke.Dr. J. N. Lewis, leading physician here, and George Bernard, a Norfolk and Western Railroad office clerk, were killed when their auto mobile ran into a fence and was wrecked on the Hollis turnpike, five miles from this city. Lynchburg.  Judge George S. Stevens, of - this city, died Thursday at the residence of his daughter, Mrs. R. M. Thurman, in Bedford county. He was 82 years of age. Formerly he was judge of the Nelson County Court, after which he was clerk of the same court. He was a member of the Lov- ingston Methodist Church. Fredericksburg.  The Fredericks burg Va. Society of the Alumni of the University of Virginia will hold its annual meeting Saturday, April 13, Founders Day, at 8 P. M. In addition to business and social feat ures a banquet will be held and all ex-students of the university from Caroline, Stafford, Spotsylvania, King George counties and the city of Freder icksburg are invited to attend. Judge A. W. Wallace is president of the local alumni and Mr. B. P. Willis secretary and treasurer. Lynchburg.  Mrs. Annie Watson Mitchell died Wednesday night in Ap pomattox county, aged 63. She was well known for years as the proprie tor of the Buffalo Ridge Springs."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "daughter, Mrs. R. M. <mark>Thurman</mark>, in Bedford county. He"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "daughter, Mrs. R. M. <mark>Thurman</mark>, in Bedford county. He"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [142.29, 1490.48, 306.88, 1575.33], "bbox_id": "bf0815324b", "file": "AppomattoxNewspapers_1912-1915a_0400.pdf", "page": 1, "text": "William Frazier, who was arrested ten days ago on a warrant charging him with the abduction of fourteen- year-old Mary Simon, who resided in the West Lynchburg suburbs, was given a preliminary trial before Squire H. C. Thurman. Alter going into the evidence in the case the charge was dismissed and Frazier was discharged"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "before Squire H. C. <mark>Thurman</mark>. Alter going into the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "before Squire H. C. <mark>Thurman</mark>. Alter going into the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2329.2, 1729.47, 2494.2, 1803.07], "bbox_id": "c87997de67", "file": "AppomattoxNewspapers_1939-1943a_0419.pdf", "page": 1, "text": "WILCOXWILU AMS Mrs. Essie Williams announces the marriage of her daughter, Dollie Grey Williams, to Thurman Lee Wilcox, stepson of R.H. Lucade. They motored to South Carolina, on January 30th, where the mar riage took place."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Dollie Grey Williams, to <mark>Thurman</mark> Lee Wilcox, stepson of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Dollie Grey Williams, to <mark>Thurman</mark> Lee Wilcox, stepson of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1289.29, 1108.43, 1510.07, 1413.62], "bbox_id": "901603637f", "file": "TimesVirginian_1983a_0155.pdf", "page": 1, "text": "When we consider the area around us including all of the businesses and the different types of enterprises, it is hard to forget one prominent name. That Is SECURITY SCALES SERVICE INC. located at 4 Hickok Road in Lynchburg, phone 237-0111. They feature the best in scales such as Fairbanks, Electroscale,. Thurman and General. They offer this area service on all types of scales including Toledo. Through their efforts to provide the best in y d for this area,they have come to be known as part of the backbone to the structure of this area. From their beginning they have striven to provide the most up-do-date service, with friendly conscientious efforts. They supply our business and industry with the best in scales, thus aiding to the financial strength and growth of the area, and are recognized by both the businessman and the homeowner as an inseparable entity of our community. This company is responsible for pouring tens qf thousands of dollars back into this regions economy by supplying it with this vital product and service. The w riters of this 19 Review herein announce our complete recommendation to the management and individuals of this community minded company."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "such as Fairbanks, Electroscale,. <mark>Thurman</mark> and General. They offer"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "such as Fairbanks, Electroscale,. <mark>Thurman</mark> and General. They offer"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [627.81, 561.0, 794.58, 609.94], "bbox_id": "a28ab1cae7", "file": "AppomattoxNewspapers_1954-1955a_0296.pdf", "page": 1, "text": "Week-end guests in the home of Mr. and Mrs. Thurman Wayne were Mr. and Mrs. N. A. Dearing, Mr. and Mrs. Frank Dearing, of Lynch burg, and Mrs. Cox, of N. C."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "of Mr. and Mrs. <mark>Thurman</mark> Wayne were Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "of Mr. and Mrs. <mark>Thurman</mark> Wayne were Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.66, 730.2, 1723.69, 1110.73], "bbox_id": "40fbf08009", "file": "AppomattoxNewspapers_1960-1962b_0295.pdf", "page": 1, "text": "We regret to hear that Mr. Bem- rd Tibbs had his house and most f the contents destroyed by firej Tuesday.  Mrs. Courtney Mann gave a din er Sunday in honor of her hus- ands birthday. Those present were Ir. and Mrs. Mann, and son, Carol, Irs. Lula Mann, Bradley Mr. and Irs. Marshall Dickerson, and fiaan- y, Mr. and Mrs. L. B. Mann and an, Mr. and Mrs. Ben Mann and an, Mr. and Mrs. Thomas Shep- rd and son, all of Brookneal Mr. nd Mrs. Gordon Mann and son, I rs. Thurman Mann and family, of j fttenix, Mr. and Mrs. Herbert Dick- rson and family, of Gladys, Mrs. ewis M!ann and son .and granddhil- ren, of Appomattox, H. A. Qhil- ressrJr-, ofNaruna. Mr. Miann re- eived many nice gifts. i Visitors in the afternoon  were Ir. and Mrs. Shelby Tucker and aughter, Sue. Mr. and Mrs. Willard Clarke nd family, of near Brookneal were inner. guests of Mr. and Mrs. El- rood Cox Sunday. Mr. John Love has had a farm ond huilt by Nash and Evans. Mr. and Mrs. Nelson Mann and Ir. Robert Mann, of Lynchburg, fcent the, week-end with hoane people."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "and son, I rs. <mark>Thurman</mark> Mann and family, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "and son, I rs. <mark>Thurman</mark> Mann and family, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1789.41, 374.36, 1972.03, 420.36], "bbox_id": "0d63a9536f", "file": "AppomattoxNewspapers_1943-1947a_0442.pdf", "page": 1, "text": "We are glad to have Mr. and Mrs. Thurman Wilcox and family in the community. They are living in the house formerly occupied by T Mr. and Mrs. T. L. Page."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "have Mr. and Mrs. <mark>Thurman</mark> Wilcox and family in"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "have Mr. and Mrs. <mark>Thurman</mark> Wilcox and family in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2049.62, 1227.81, 2213.36, 1414.27], "bbox_id": "e5e81a484a", "file": "AppomattoxNewspapers_1892-1898a_0407.pdf", "page": 1, "text": "W ANTED. Two men la eaob County in this State represent u s no experteaqe needed we drill you free of charge at your homes. You Can Barn 75 per Honth until January, 1898. Read What Other are Dofng  THOMAS OSBORNE, of Georgia, ays cleared 4.20 to-day. HBV. W. HKOOKH, of Arkansas says cleared 26.35 this week and lost one day. REV. ALEX. FRIEOMA, M MUiOurl ,1 savs I worked nine half days and made REV. O. B THURMAN, if Texas, says Tho first hour l made 2.10. MRS. VINA DARITY, of North Carolina, gays In 22 days I made 87.00. Wo could give hundreds of last such test- moulds had we the space. Write to-dav It you are out of employment and w- win an- swer you at once or send a representative to see you. Address Riverside Publishing Company, Department B. St. Louis, Mo."}, "highlight": {"text": {"matched_tokens": ["THURMAN"], "snippet": "made REV. O. B <mark>THURMAN</mark>, if Texas, says Tho"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN"], "snippet": "made REV. O. B <mark>THURMAN</mark>, if Texas, says Tho"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1416.97, 213.55, 2118.57, 321.19], "bbox_id": "a72ce85821", "file": "AppomattoxNewspapers_1908-1909a_0486.pdf", "page": 1, "text": "vm aiNtA TttVjteBAV THE TIM1.VIRQWUN, AryyMATTQX, PAGE FOUIj And I Like It Says _ Mr. Thurman l Editor In Texas former resident of Appo- j k  _ _____ f . n Ha No Fear For m Who See Good Point"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Like It Says _ Mr. <mark>Thurman</mark> l Editor In Texas"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Like It Says _ Mr. <mark>Thurman</mark> l Editor In Texas"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2190.26, 363.84, 2344.21, 1044.86], "bbox_id": "fc5273cce9", "file": "AppomattoxNewspapers_1974-1975a_0389.pdf", "page": 1, "text": "VIRGINIA la the Clerks Office of the Circuit Court el Appomattox THURMAN FERGUSON Tnui plainest VS  ORDER OF PUBLICATION MATTIE HAZEL SAUNDERS FERGUSON Defendant The object of this suit is to obtain a divorce from the bond of matrimony by the complain ant from the defendant on the grounds of having lived separate and apart for a period of more than one year. And it appearing by affidavit filed that M attie Hazel Saund ers Ferguson is not a resident of the State of Virginia, she is hereby required to appear within ten days-after the due publication of this order and do what is necessary to protect her interests. Testes BARBARA R. WILLIAMS. Clerk W.M. ABBITT, p.q. 7-81-4t APPOMATTOX COUNTY SCHOOLS Notice to Parents or Guardians of Handicapped Children The Special Education Pro gram of the Appom attox County School System is operated according to Federal and State Guidelines. These guidelines require par ental permission 1. to place a student in a program of special education, 2. to continue the student in a special education program, and,  3. to change the program. These guidelines also give parents of handicapped chil dren the right 1. to request special education placement or evaluation for such placement, 2. to reje ct eith er special education placement or special evaluation, and, 3  to request reports of .todies obtained for or used -.in consideration of special educa tion placement. For A dditional Inform ation Contact Appom attox County School Board Appomattox, Va. 24522 Telephone 352-8251 g 44 . 1 t"}, "highlight": {"text": {"matched_tokens": ["THURMAN"], "snippet": "Circuit Court el Appomattox <mark>THURMAN</mark> FERGUSON Tnui plainest VS"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN"], "snippet": "Circuit Court el Appomattox <mark>THURMAN</mark> FERGUSON Tnui plainest VS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2036.13, 198.96, 2183.26, 501.95], "bbox_id": "038193648c", "file": "AppomattoxNewspapers_1974-1975a_0378.pdf", "page": 1, "text": "VIRGINIA b the Clerks O nce of the Circuit Court of Appomattox 1 THURMAN FERGUSON Csm piabant VS ORDER OF PUBLICATION MATTIE HAZEL SAUNDERS FERGUSON Defendant The object of this suit is to   iw a divorce from the bond of matrimony by the complain ant from the defendant on the grounds of having lived separate and apart for a period of more than one ye. And it appearing by affidavit filed that Mattie Hazel Saund ers Ferguson is not a resident of the State of Virginia, she is hereby required to appear within ten days after the due publication of this order and do what is necessy to protect her interests. Teste BARBARA R. WILLIAMS, Clerk W.M. ABBITT, p.q. 7-31-4t"}, "highlight": {"text": {"matched_tokens": ["THURMAN"], "snippet": "Court of Appomattox 1 <mark>THURMAN</mark> FERGUSON Csm piabant VS"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN"], "snippet": "Court of Appomattox 1 <mark>THURMAN</mark> FERGUSON Csm piabant VS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1425.35, 221.45, 2239.42, 343.04], "bbox_id": "8c71f4913c", "file": "AppomattoxNewspapers_1926-1933a_0486.pdf", "page": 1, "text": "VIRfélNlA TltUltUDAY, JULY îS 1  Í98 THK nMfiiftVIKQiNÌAW, APPOMATTOX, FAQB POUfl 1,305 Register for Second  Teirm i Nelson Thurman, of Vinton! And I Like It Says recently spent a part of his va-  T  cation here. Mr. Thurman! FdltO l III i CXaS is a form er resident of Appo mattox.   , Little Viola Blackwell cele brated her eighth birthday Sunday and Rebecca Johnson came in for her part of the"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Second  Teirm i Nelson <mark>Thurman</mark>, of Vinton! And I"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Second  Teirm i Nelson <mark>Thurman</mark>, of Vinton! And I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1653.59, 519.32, 1854.46, 621.72], "bbox_id": "98f1f37099", "file": "AppomattoxNewspapers_1971-1973a_0414.pdf", "page": 1, "text": "U   ,Ct aet Martin, Sue Moore Camp- bell, Martha Nash Starnes, Susie Cheatham Nuckols, Sylvia Burks Sifferd, Agnes Christ s  1 HSieyi  BeUe Harvey Campbell, Lois Mann Notestein, Mildred Smoot Johnson Ear- lene Stinson Wilson and Louise Brown Class Sponsor. 3rd Row from the left are Calvin Tanner Fred Weakley, Thurman Arrington, Randolph Martin, Ed Cawthorn, Billy Johns ton, Howard Blanks, Jr., Jack Layne, Roy"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Calvin Tanner Fred Weakley, <mark>Thurman</mark> Arrington, Randolph Martin, Ed"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Calvin Tanner Fred Weakley, <mark>Thurman</mark> Arrington, Randolph Martin, Ed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1818.0, 147.28, 1967.74, 703.52], "bbox_id": "0dc2a97c7e", "file": "TimesVirginian_1976_0338.pdf", "page": 1, "text": "thy is extended this family. Bob Martin was taken to a doctor In Lynchburg Saturday and remained at tfe hospital. Mrs. Samuel Martin remained with him. H r. and Mrs. Aulden Roach and family, and Mrs. Erna Roach attended the home- at Union HID C har on 8anday. A num ber attended the W iLU . workshop at Liberty Church Monday night. The State Mission Day of Prayer will be at the church on Thursday, at 730 PM . A W.M.U. members are invited to be present. The Goal is 1217.85. Mr. C. V. Wilburn was our guest speaker for the morning and evening services at Rod Supday. He was very welcome. Mr. and M rs. Thurman Wilcox of Roanoke spent the week mid here with Mr. and Mrs. S. E. Ranson. Bill Caldwell went bade to the doctor in Lynchburg for a check up on Monday. A number from here attend ed the 5 County fair m Farmville last week. A few received prizes there. Mrs. Joan Ranson was among the judges for the Dress Revue at the 4-H event on September 9 in the High School Auditorium. Winners from here were Susan M orris and P atty Roach. Congratulations to each of these girls. Rev. Omsk Burnette will be the guest speaker at Rocks Church on Sunday, September 26. Mrs. Emetine Hamilton of Appomattox fell and broke her hip last week and is in the hospital in Lynchburg. Cassie Baldwin, Correspondent"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Mr. and M rs. <mark>Thurman</mark> Wilcox of Roanoke spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Mr. and M rs. <mark>Thurman</mark> Wilcox of Roanoke spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1539.87, 1012.68, 1708.1, 1050.33], "bbox_id": "025ecb34e8", "file": "AppomattoxNewspapers_1943-1947a_0024.pdf", "page": 1, "text": "Thurman Wilcox, of Fort Rodman Mass, has returned after having spent ten days with his wife and relatives in the county."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Wilcox, of Fort Rodman Mass, has returned after having spent ten days with his wife and relatives in the county."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Wilcox, of Fort Rodman Mass, has returned after having spent ten days with his wife and relatives in the county."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [697.91, 422.92, 864.36, 450.67], "bbox_id": "4119fb7a84", "file": "AppomattoxNewspapers_1943-1947a_0030.pdf", "page": 1, "text": "Thurman Wilcox, of Fort Rod- Mass., is spending a furlough with datives here."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Wilcox, of Fort Rod- Mass., is spending a furlough with datives here."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Wilcox, of Fort Rod- Mass., is spending a furlough with datives here."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2388.16, 376.76, 2560.69, 413.4], "bbox_id": "b18af5350e", "file": "AppomattoxNewspapers_1939-1943a_0598.pdf", "page": 1, "text": "Thurman Wilcox,  of ihtf-jtj. S. A-my, who visiied relatives  here and at Appomattox last week, re turned to Fort Rodman, Aiass."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Wilcox,  of ihtf-jtj. S. A-my, who visiied relatives  here and at Appomattox last week, re turned to Fort Rodman, Aiass."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Wilcox,  of ihtf-jtj. S. A-my, who visiied relatives  here and at Appomattox last week, re turned to Fort Rodman, Aiass."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2330.14, 332.73, 2489.97, 366.53], "bbox_id": "e23e159c98", "file": "AppomattoxNewspapers_1947-1949a_0457.pdf", "page": 1, "text": "Thurman Mays, of Altavista vl ited his parents, Mr. and Mrs. Ke. Mays Sunday."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Mays, of Altavista vl ited his parents, Mr. and Mrs. Ke. Mays Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Mays, of Altavista vl ited his parents, Mr. and Mrs. Ke. Mays Sunday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.05, 660.44, 1582.15, 816.08], "bbox_id": "4c467794e2", "file": "AppomattoxNewspapers_1971-1973a_0369.pdf", "page": 1, "text": "Thurman Bruce, 62, died Thursday in Nat- aval Medical Center, ,Md. Hewasthehus- Reba Hudson Bruce, to Orange County, he n of Allen Thurman Eva Anderson Bruce, a retired Naval Com- n with 24 years ex- He was a veteran of ir n and the Korean  was a member of Legion Post 104 and of Evergreen Baptist"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Bruce, 62, died Thursday"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Bruce, 62, died Thursday"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [794.62, 466.01, 960.63, 523.71], "bbox_id": "c3f70b95fb", "file": "AppomattoxNewspapers_1955-1957a_0318.pdf", "page": 1, "text": "Thurman Arrington has receiv ed his discharge Irom the U. S. Army Air Force in which he served four years. He is here with his par ents, Mr. and Mrs. S. C. Arring ton."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Arrington has receiv ed"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> Arrington has receiv ed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.9, 944.21, 1880.04, 974.29], "bbox_id": "8ef662de8c", "file": "AppomattoxNewspapers_1952-1954a_0426.pdf", "page": 1, "text": "Thurman and Currin Mayberry, of Richmond spent the week-end in the home of A. A. Mayberry."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> and Currin Mayberry, of Richmond spent the week-end in the home of A. A. Mayberry."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "<mark>Thurman</mark> and Currin Mayberry, of Richmond spent the week-end in the home of A. A. Mayberry."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1792.07, 392.08, 1962.68, 473.37], "bbox_id": "5fc2000266", "file": "AppomattoxNewspapers_1960-1962b_0627.pdf", "page": 1, "text": "Those visiting in the home of Mr. and Mrs. Courtney Mann Sun day were Mrs. Lula Berkley, Mr. and Mrs. Marshall Dickerson and family of Brookneal, Mr. and Mrs. Thurman Mann and fam ily of Phénix and Mr. and Mrs. Herbert Dickerson and family of Gladys."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Brookneal, Mr. and Mrs. <mark>Thurman</mark> Mann and fam ily"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Brookneal, Mr. and Mrs. <mark>Thurman</mark> Mann and fam ily"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [350.65, 217.2, 492.61, 451.42], "bbox_id": "07f333f0a6", "file": "AppomattoxNewspapers_1971-1973a_0288.pdf", "page": 1, "text": "THOMAS H. THURMAN Thomas Herbert Thurman, 86 j of 1023 Rivermont Ave., died at f 255 p.m. Wednesday at Gug- genheimer Memorial Hospital. He was the husband of the late , Hennie North Thurman. Born in Appomattox County,  he was a son of Henry Clay Thurman and Maggie Carter , Thurman. He was a retired lo-  cal manager of Eastern Mutual Life Insurance Co. and a mem ber of Euclid Christian Church.! He is survived by a number of j nieces and nephews. Funeral services were con- j ducted at 2 p.m. Saturday at Whitten Funeral Home by the j Rev. Herbert Moore. Burial took place in Presbyterian Ce- metery."}, "highlight": {"text": {"matched_tokens": ["THURMAN", "Thurman"], "snippet": "THOMAS H. <mark>THURMAN</mark> Thomas Herbert <mark>Thurman</mark>, 86"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN", "Thurman"], "snippet": "THOMAS H. <mark>THURMAN</mark> Thomas Herbert <mark>Thurman</mark>, 86"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1922.14, 264.66, 2070.99, 945.45], "bbox_id": "d6ae050b0b", "file": "AppomattoxNewspapers_1962-1965a_0555.pdf", "page": 1, "text": "The second six-week grading period honor roll shows a slight increase in the High School and the Elementary Department. The High School D e p a r t m e n t number increased four as com pared to twenty for the Elemen tary division. The honor roll as released by T. W. Mabry, principal are 12th Grade Mozelle Ferguson, Martha Hum bles, Phinnize Johnson, Barbara Turner, Georgia Walker 11th Grade Jessie Lewis, Edward Lockett, Evelyn Ferguson, Lois Johnson, Cora Naiper, Lucy Pankey, Ma bel Robertson. 10th Grade Marsha Cabell, Lucy Ferguson, Connie Jones, Annie Jones, Izet- ta Lewis, Thurman Jones, Dim ple Walker, roger Watson, Ron ald Franklin, Steward Robinson. 9th Grade Dorothy Lockett, Phyllis Lewis, Viola Johnson, Mary Alice Walk er, Elliott Cheatham. 8th Grade Maggie Jackson, Doris Austin, j George Ferguson, Willie E. Jones Michael Lewis, John Paige, Ne-o I la Powell, Deloris Watson, Mary Webb. 7th Grade Deloris Smith, Flossie Ferguson, Linda Marshall, Miary Pankey, Shelia Tanner, Freda Walker, Shirley iWalker, John Garrett, James Walker, Marilyn Booker, Iris Duguid, Maxine Lewis, Joan Walker 6th Grade Brenda Duiguid, Doris Hix, Wil bert Ferguson, Sarah Carter, Jacquetta Robinson. 5th Grade Frank Forrest, Rickey Garett, Corrine Hubbard, Edith Patter son, John Lampkins. 6th Grade Jacqueline Thornton, Mary Walk er, Peggy Pennix, Bernice Akers Valoris Booker, Francine McCoy Elizabeth Eanes, Darnell Wash ington 5th Grade Caksel Cawthom, Mickey Petty, Frances Wood, Gertrude Walker, Bruce McCoy, Patricia Patter son, Leslie Turner, Annie Gillis- pie, Meressa Jones, Gloria Cul pepper, Loretta Walker, Gladys Walker 4th Grade Colonel Walker, Paul McCoy, Elizabeth Austin, Brenda Wat kins, Samuel Penn, Nathan Snell"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Jones, Izet- ta Lewis, <mark>Thurman</mark> Jones, Dim ple Walker,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Jones, Izet- ta Lewis, <mark>Thurman</mark> Jones, Dim ple Walker,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.76, 563.8, 1817.56, 951.82], "bbox_id": "79a4c69c31", "file": "AppomattoxNewspapers_1971-1973a_0108.pdf", "page": 1, "text": "The Rev. Jack South, pastor of Locust Grove United Metho dist Church, Salem , w ill be guest minister to a s s is t the pastor, the Rev. John L . Hoke, in revival services at th e Pam plin United M ethodist Church, November 14-19 at 730 p.m. Next Sunday there w ill be a covered dish supper at th e church at 6 p.m . and at 730 p.m . the Rocks Quartet w ill have a program of m usic. R ev. Jack South service w ill begin at 8 p.m. Mrs. Jane Garnett of Blacks burg, Mrs. Janie W are and Mrs. Jane Wingfield of Lynchburg were visitors in town la st Sat urday. Mr. and M rs. H. W. Cole man returned to N orfolk last Monday after spending a week at their country hom e. The Annual D istrict Confer ence will be held at the Farm ville United M ethodist Church on November 14th at 230 p.m. M rs. Dan Harvey and M rs. Ken neth St. Johns youth group will present t h e i r contem porary Musical  Whats It A ll About Anyhow? M rs. Leon P aulette returned home last Monday from a trip to Toronto, Canada. Mrs. Thurman W ayne return"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "to Toronto, Canada. Mrs. <mark>Thurman</mark> W ayne return"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "to Toronto, Canada. Mrs. <mark>Thurman</mark> W ayne return"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1047.84, 174.14, 1188.32, 354.79], "bbox_id": "1fc6b89a62", "file": "AppomattoxNewspapers_1974-1975a_0559.pdf", "page": 1, "text": "the latters wife who will come home for awhile. Jennifer Roach celebrated her third birthday Sunday. Mr. and Mrs. S. E. Ran son were overnight guests of Mr. and Mrs. Thurman Wilcox of Roanoke Saturday. Mr. and Mrs. L. M. Williams of Waynesboro were visiting her parents, Mr. and Mrs. R. E. Roach Sunday. Mrs. Clara Garrett and Mrs. Alice Jackson of Evergreen, Mrs. Laura Richardson, of Appomattox, and Mr. and Mrs. Spud Almond, of Pamplin, were"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "of Mr. and Mrs. <mark>Thurman</mark> Wilcox of Roanoke Saturday."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "of Mr. and Mrs. <mark>Thurman</mark> Wilcox of Roanoke Saturday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2005.88, 530.22, 2170.63, 662.12], "bbox_id": "7e40ac7db2", "file": "AppomattoxNewspapers_1939-1943a_0454.pdf", "page": 1, "text": "The following .young men from Appomattox County were inducted into the U .S. Army on Monday of this week Norman Hunter Jones Dwight Minifee Paulette John Allen Booth William David Morris David Marie Franklin Curtis William Harris Clarence Arnold Perdieu Emory Olive Martin Russell Andis Chernault Thurman Lee Wilcox"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Martin Russell Andis Chernault <mark>Thurman</mark> Lee Wilcox"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Martin Russell Andis Chernault <mark>Thurman</mark> Lee Wilcox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [122.4, 258.89, 282.91, 1682.54], "bbox_id": "0f88461768", "file": "TimesVirginian_1976_0306.pdf", "page": 1, "text": "The following Freshman students have been assigned to the designated homerooms R moi 303 - BOYS - Eddie Agee. Sidney Allen. Donnie Almond, James Almond, .Goble Atkins, Ronnie Austin. Edward Baldwin, Dickie Beale, John Boyce, Carl Bryant, Jeff Bryant, David Caldwell, Gary Campbell. Willie Chambers, -Greg Cheatham, Ernie Che- nault. GIRLS - Penny Almond, Lisa Atchison, Debbie Baldwin, Laura Baldwin. Nancy Baldwin, Johanna Belter. Tammy Book. Katrine Bryant, Fannie Calloway. Teresa Campbell. Annette Carter, Crystal Car ter, Robbia Carter, Gloria Cashwell, Martha Chandler, Lisa Clark. Room 100 - BOYS- Michael Childress, Steve Cobb, Larnya Culpepper, Chuck Cuneo, Tim Davidson, David Doss, Gene Doss. Keith Doss. Bob Dun- nam, S. L. Ferguson, Tony Ferguson, Darryl Fitch, John Fleshman, John Foxwell Dale Garrett. GIRLS - Wilsie Cobbs, Helen Coleman, Margie Coleman, Linda Cowan, Terri Dalton, Dianne Daniel, Victor Daul- ton, Mary Davidson, Kathleen Davis, Melinda Davis,. Tina Doss. Cindy Dowdy, Charitta Ferguson, Ivette Ferguson. Roberta Ferguson, Rita Fergu son. Rosas 214  BOYS - David Garretts, Thomas Coin, James Guill, Steve Guthrie, Andrew Hall William Hamlett, William Hansen, Robert Harding, Dan ny Hhrvey, James Hash,  Ronald Hipps, William Hodges, Michael Hubbard, Jack Hud son, Vincent Hunter, Charles Irvin. y Verna Fleshman, Pamela Ford, Wanda Forest, Jackie Franklin, Martha Garrett, Vickie GSliam, Lisa Join, Pamela G ift Sharon Guill, Vickie Handy,- Ara Haskins, Kimberly Hipps, Gloria Hodges, Nancy Hodges, Vinnie Hubbard. - Room 205 - BOYS - Jeff Jamerson, Larry Kelso, Roy L. King. Robert Lawhorn, Eugene Lawson, Gary Layne, Mark Litchford, Timothy Marshall Bradley Martin, Jeffrey Mar tin, Jimmy Martin, Mark Martin, Roger Mayberry -Rich ard Mitchell, Robert Mitchell y GIRLS - Law lura Ivery, Clara Jackson, Jennifer. Johnson Teresa Kerr, Arlene Kidd, Verta Kress, Danette Letter- man, Agnes Lewis, Angie Mann, Darnell Mayberry, Mat- tie McCoy, Terry McCoy, Lulai McCoy, Virginia McCoy, Teresa McFadden. Art - BOYS - Gary Moore, Jeffery Moore, William Moore, William Moore, Godfrey Mos ley, Henry Moss, John Neigh bors, Kevin OBrien, Louis 1 OBrien Mark Paulette, Phillip Paulette, John Pennington. GIRLS - Vivian McFadden. Laurie McLean, Carolyn Megg- inson, Barbara Miller, Lori Mitchell, Lisa Moore, Terrell Morgan, Susan Musick, Sherrie Repass, Rhonda Nash, Cheryl Notestein, Beverly Oxner, _ Janice Pankey. Room 309 - BOYS - Anthony Phelps, Michael Phelps, Mark Pierce, David Price, James Pugh, Craig Puryear, Charles Rixey, Bryan Roach, Michael Robinson. GIRLS - Susan Parris, Darlene Powell, Alene Preston, Elizabeth Redman, Angie Rich ardson, Brigette Richardson, Sara Richardson, Debbie Roa ch, Linda St. John. Room 327 - BOYS - Ronnie Robinson, Vincent Robinson, Darrell Schrock, Gerald Sharp, Kenny Shorter, John Slifko, Danny Slough, Craig Smith, Darrell Smith, Troy Stanley. GIRLS - Robbie Sayre, Sherry Shorter, Pam Shrock, Debbie Smith, Shelby Smith, Edith Smoak, Robin Spiggle, Maxie Story, Connie Taylor, Pam Taylor. Room 304 - BOYS - Stanley Megginson, Donald Mitchell, Leon Stevens, Herbert Thorn ton, John Thurman, Gary Tolbert, Jerry Trent, James Vassar, James Vaughan, An-  thony Volturo, Roger Webb, Larry White, Terry Woods GIRLS - Renae Thomas, Loretta Tolbert, Elizabeth Waldo, Pam Watkins, Barbara Watson, Denise Webb, Sharon White, Zandra William, Tam my Womack, Debra Wright, f Judy Zimmerman."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Herbert Thorn ton, John <mark>Thurman</mark>, Gary Tolbert, Jerry Trent,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Herbert Thorn ton, John <mark>Thurman</mark>, Gary Tolbert, Jerry Trent,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [636.24, 1106.1, 772.19, 1300.89], "bbox_id": "f596bfc820", "file": "AppomattoxNewspapers_1974-1975a_0206.pdf", "page": 1, "text": "The first half was typical of the games ending as the score was 24-8, Celtics on top. The AU Stars scored 10 on the third quarter, and 6 in the fourth quarter, which just wasnt enough to take on the high scoring Cetics. Scoring for the AU Stars were Terry Woods with 7, Ronnie Robinson with 7, John Thurman with 4, and Steve Cobb, Bryan Roach, and Dwayne Scruggs, aU with 2. Scoring for the Celtics were Larry Kelson with 27, William Hamlette with 11, Gregg Cheatham with 7, and Andy Poole, John Foxwell, and Mike CampbeU, all with 2."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Robinson with 7, John <mark>Thurman</mark> with 4, and Steve"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Robinson with 7, John <mark>Thurman</mark> with 4, and Steve"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1760.16, 305.39, 1932.19, 1505.49], "bbox_id": "3038cb579d", "file": "AppomattoxNewspapers_1902-1905a_0357.pdf", "page": 1, "text": "The eleventh annual reunion of the old Confederates who fought under Col. John S. Mosby was held at Ber- ryville, near which place during the war Mosbys men made many daring exploits. The meeting was presided over by Col. Joseph Bryan, of Rich mond. Hon. Marshall McCormick de livered the address of welcome and a memorial from the pen of Col. John Alexander, of Leesburg, on the death of Chaplain Sidney Ferguson was read. J. William Foster was elected president and H. S. Ashby adjutant. The reunion closed tonight with an entertainment by Polk Miller and his Old South Quartet. At its regular meeting Garland Rodes Camp, Sons of Veterans, of Lynchburg, selected as their sponsor for the coming Confederate reunion Miss Rebecca Martin and as maid of honor Miss Norvie Craighill. both of that city. The Veterans have invited ex-Gov. Francis T. Nichols, who is spending the summer at Chase City, to attend the reunion and be one of the speakers. _ A call was issued by George E. Caskie, chairman of the executive committee of the Virginia Sunday- School Association, for the-State con vention to be held at Lynchburg Oc tober 3 to 5 . A large number of local committees will go to work at once arid arrange for a large attend ance. The last State convention was hqld at Petersburg in March, 1902.   George W. Wilson, of Fancy Hill, Rockbridge county, aged 73 years, is dead. He was a descendant of the Wilsons of Tinkling Springs, Augusta county, and had traveled over the whole of the United States. James Norton, of Medford,_ Mass., has discovered what he claimi to be the richest nickel mine in the United States on the edge of Floyd county, 10 miles south o f ShaWsville, on the Norfolk and Western railway. The lead is said to be large and Mr. Norton has ordered machinery for de veloping the property. The find is- lo cated four miles from the property of the United States Arsenic Mines Com pany, which is being operated by Pittsburg capitalists. The City Engineer, of Roanoke, is sued a building permit to the Norfolk and Western Railway for the erection of a new passenger station in that city at an estimated cost of 99,000. The Roanoke City Council enacted a Pure Food and Milk law. A drastic anti-gambling ordinance just enacted by the Roanoke City Council provides for a fine of not less than 50 nor more than 500 fot gaming. Mayor Cutchin says that he will permit no games of chance at the Roanoke fair in September. Mayor Joel H. Cutchin, of Roanoke, who was recently re-elected, in an in terview said he had given his time, attention and very best efforts to the city for two years and that his poli tical opponents have made the posi tion as unpleasant as possible. The Council, he says, has continually fought him in everything he attempts to do in the interest of the city, and recent proceedings he fears is an in dication that the same tactics will con tinue in the new Council. If so, he cannot and will not stand it. Some whom he thought were. his friends have shown an animosity that does not please him. He says the salary, which is less than any officer, police man or blacksmith of the city, is no compensation for the duties he is called upon to perform, to say nothing of a continual wrangle with the Coun cil, which is annoying to him and humiliating and distasteful to his rela tives and family. The Mayor says that the office has destroyed his law business and the continued harassing has injured his health and peace of mind. He says that if present condi tions continue no gentleman can- or will be Mayor of Roanoke. W. E. Ehoflf, 26 years old, is under arrest at Newport News on the charge of housebreaking, committed nearly six years ago. Ehoff was then living with his parents in Newport News. When he learned that a warrant had been sworn out against him he went to Philadelphia. While living there he was married, and a few days ago reappeared in Newport News with two children. The celebrated suit for divorce of Mrs. Olivia Thurman from her hus band, Gen. Charles Thurman, a rich landowner of Clarke county, which has been before the public frequently during the last year, was settled out of court. A decree will be entered giving Mrs. Thurman a divorce a mens et thoro, which will become absolute in three years, when alimony will cease. Caroline County Camp of Confed erate Veterans has decided to raise 2,500 for the erection of a monument to the Confederate soldiers of that county who were killed or died in the service. Rev. A. C. Knibb. a ministerial stu dent at the Virginia Christian Colege, of Lynchburg, has been conducting a protracted meeting in a tent in West Lynchburg for six weeks and nearly 300 persons have professed conver sion. About 200 persons have been baptized and many others will receive the ordinance-in a day or two. A broken axle wrecked n ears of a freight train on the Atlantic Coast line near Emnoria. No one was hurt. Mrs. R. L. Pownell, of Sherman dis trict. near Romney, was badly scald ed in the face while boiling hops. Miss Elizabeth Booker, of Lynch burg. who was injured in a runaway a- nt, has recovered consciousness after Iving in a comatose condition for more than 75 hours."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "divorce of Mrs. Olivia <mark>Thurman</mark> from her hus band,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "divorce of Mrs. Olivia <mark>Thurman</mark> from her hus band,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [426.25, 514.1, 568.4, 1162.02], "bbox_id": "1b4bcd4dca", "file": "TimesVirginian_1976_0241.pdf", "page": 1, "text": "The Class of 1936 of Appomattox High School held their . firrt reunion since graduating on Saturday eve ning, June 19, at thé Appom attox County High School cafeteria. Those members attending are shown above First row, 1. to r. M argaret Almond Martin, Katie Reynolds Martin, Kather ine Walton Carson, Mrs. Helene Welch Harvey, Virginia Al mond Sm ith, Iva Childers Pillow, Adele Thomas-. Fowler, and Faye E tta Harvey Richard son. Second row Alfred Torrence, Raehel Harvey Jon es, Ruth Jobe Givens, Bessie Christian Thompson, Elizabeth LeGrand Y eakley, Calhoun Moore and Mary Davidson Barrell. Third row Hafold Morris, Otho Martin, Jr., Rev. Thomas Oder, Winston Godsey, Noten Webb, Ronald Pafflette, and Virginia Whitehead Doss. Back row Thomas T. Martin, Thurman Mays, Jessie Harvey Martin, Charlie Abbitt, Wat kins Banton, Charlie Carter and Thomas Kerb. Not in the picture was Marvin Godsey who also attended the reunion. Tw enty-nine of the 36 members of the Class of 1936 of Appomattox High School re turned to their Alma Mater Saturday evening, June 19, 1976 for th eir first class reunion. Twenty-five husbands and wives of the classmates and one form er teacher, Mrs. elchkHarvey, brought ajber attending to Îiÿ WflWT enjoyèd an ewpu -4f reminising at the Appomattox County High School cafeteria. A coffee hour hosted by class members living in the Appo mattox area, preceded the dinner and program.  In compiling the addresses of class members, all 35 living members were located. One lives in Texas and one . in Kentucky and 33 are still living in Virginia. Charles Abbitt, accompanied by his wife, came from the fartherest point to join his classmates for Hie reunion, having driven from Houston,"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "row Thomas T. Martin, <mark>Thurman</mark> Mays, Jessie Harvey Martin,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "row Thomas T. Martin, <mark>Thurman</mark> Mays, Jessie Harvey Martin,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.69, 542.72, 1979.68, 940.55], "bbox_id": "26381689c4", "file": "TimesVirginian_1978_0375.pdf", "page": 1, "text": "The class of 1936 of Appomattox High School en joyed a reunion at the Appomattox County High School Cafeterian on Saturday evening August 19,1978. The class members attending were Virginia Almond Smith, Iva Childers Pillow, Fay Harvey Richardson, Ruth Jobe Givens, Elizabeth LeGrand Yeakley, Carolyn Moses Lusar- di, Katie Reynolds Martin, Virginia Whitehead Doss, Gar land Watkins Banton, Charlie Carter, Thomas Kern, Otho Martin, Jr., Thomas T. Martin, Thurman Mays, C a l h o u n Moore, Harold Morris, Ronald Paulette, Alfred Torrence and Noten Webb. Warren Fowlkes, a 1937 graduate was a visitor. There were also 17 husbands or wives of the classmates, making a total of 37 present. Thomas Kern, President of the class, welcomed the members and visitors, and presided over the meeting., Wiley Richardson led a memorial service in memory of five deceased members of the administration and faculty, and the one deceased class member, Ruth Collins Hesson. In answer to the roll call by"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Jr., Thomas T. Martin, <mark>Thurman</mark> Mays, C a l"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Jr., Thomas T. Martin, <mark>Thurman</mark> Mays, C a l"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2336.4, 1203.71, 2511.14, 1582.19], "bbox_id": "80db09a09f", "file": "AppomattoxNewspapers_1960-1962b_0372.pdf", "page": 1, "text": "The churches of Pamplan are cooperating in the Vacation Bible School which began on Monday, June ltt, and is being conducted in the Eton Baptist Church. The school will- run fbr two week-, meeting each day from 900 A. _ M. until noon.Provisions ---- are made for boys and girls from three through sixteen years of age. The Rev. John Leelie Hart, of Eton CHurch, is principal. Working with him are the Rev. Charles Price, of the Methodtot Church, and Mr. Lewis Ekidmore, student pas tor of the Presbyterian Church. Workers oowrL.g from all of tha local churches are In the Nursery Department Mrs. Thurman Wayne, Mrs. Eugene Dick erson and Miss Betsy Williams Be ginners Mre?. J. L. Hart, Mrs. Tivis Reeve, and Mrs. R. Clayton Beale Primary Mrs. Dorothy Canada, Mrs. Eddie Dickerson, Mtiss Lindt. Gilliam, Mrs. Roy Lucodfr Juniors Mrs. B. C. Massey, Mrs. Hugh Dick erson, Mrs. Clyde Gilliam, Mis? Mjary Rives Baefcg Intermediates r. Mrs. Vesta Clifton, Mr. Lewis Skidmore. Mies Mary Wilson MuClenny is tire pianist. Transportation is in charge of Mrs. W. C, Dudley,, and Mrs. James A. WilUama is ini charge of refreshments. Registration and Preparation Day was held last Friday."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "the Nursery Department Mrs. <mark>Thurman</mark> Wayne, Mrs. Eugene Dick"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "the Nursery Department Mrs. <mark>Thurman</mark> Wayne, Mrs. Eugene Dick"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1487.24, 661.94, 1620.68, 1098.62], "bbox_id": "b92503b0e3", "file": "TimesVirginian_1980a_0395.pdf", "page": 1, "text": "the bride. Miss Dawn Tyler, niece of the bride, both of Ranson,. West Virginia and Misft Tammy Martin, sister of the bridegroom, of Appomattox. Thfeir dresses were quiana with empire waistline and carried a bouquet of carnations of fall colors. Mr. Martin was best man for his son and ushers were. John B. McCracken, Jr ., brother of the bride of Fairfax Thurman Wilcox, uncle of the bridegroom and Mark Pierc, both .of Appomattox. David McCracken, bro ther of the bride and James Tyler, nephew of the bride, were acolytes. M iss Stephanie Lane, niece of the bride was flower girl. Matthew McCracken, nephew of the bride was ring bearqr- Immediately following the . ceremony the parents of the bride entertained with a reception in the fellowship h tilip ttm dtefoi.   , - Thiiride is h-student I Appomattox High School. . The bridegroom was graduated from Appomattox High School and is employed by Armstrong Furniture in Appomattox. After a wedding trip to Williamsburg the couple, will make their home in Appo mattox!"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "the bride of Fairfax <mark>Thurman</mark> Wilcox, uncle of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "the bride of Fairfax <mark>Thurman</mark> Wilcox, uncle of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [510.95, 824.64, 659.45, 1264.96], "bbox_id": "3913119e3f", "file": "AppomattoxNewspapers_1971-1973a_0133.pdf", "page": 1, "text": "Thanksgiving Day but was lucky not to break any bones. She was taken to the doctor at Appo mattox. She suffered only a few bruises. Mr. and Mrs. Lowell Flesh- man of Evergreen are all smiles Its a girl, Melinda Diane born at Va. Baptist Hospital on Nov ember 27. A covered dish and fellow ship supper was held at Rocks on Wednesday night for mem bers and guest. In spite of the snow a large number was out. Mrs. Lilly Jennings of Ever green accompained her son and his wife, M r . . and Mrs. Todd Jennings of Burkeville to be supper guests of Mr. and Mrs. Tommy Mottley of Deatonville one Saturday night recently. Mrs. Buddy Thompson and infant returned to their home in Farmville Wednesday morn ing from Va. Baptist Hospital in Lynchburg. On their way home they stopped by to see her grandmother, Mrs. Jennie Al mond. Mr. and Mrs. Bill Caldwell, Sr. and daughter of Martins ville spent Thanksgiving with their son, Bill, Jr. and his fam ily here. t Mr. and Mrs. S. E. Ranson ipent Sunday in Roanoke with Mr. and Mrs. Thurman Wilcox. The Home dem. Club will meet on Thursday night for their Christmas Party with Mrs. C. E. McLaughlin at 730."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "with Mr. and Mrs. <mark>Thurman</mark> Wilcox. The Home dem."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "with Mr. and Mrs. <mark>Thurman</mark> Wilcox. The Home dem."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [931.18, 962.31, 1097.2, 1526.2], "bbox_id": "ebd8a1b804", "file": "AppomattoxNewspapers_1952-1954a_0307.pdf", "page": 1, "text": "Thanks for a copy of a recent is sue of The Communicator, public- cation of U. S. NCS, GUAM . We reprint the following  Early this week Emile Thurman Bruce, CS B, USNR F-6, brought to a close 20 years before the mast. He was transferred to the Fleet Reserve- The 44 year old Commissaryman hadnt intended to stay so long . . World War II chang ed his mind for him. When bombs thudded into Ford Island on Dec. 7, 1941, Emile was working as a butcher in the galley there. For the past ten months he has been at Radio Barrigada where he worked as a cook. He spent a total of eight years in destroyer service. I didnt plan to go for 20 years when I came in. In 1941, just a year after I was to have been paid off for the last time, the Japanese attacked the Naval Air Station, Pearl Harbor. I was working in the galley there at the time. We took a bomb between the dispensary and the chow hall. Before long they were using the mess tables as hos pital beds for the wounded. Now, Im going to take 90 days rest and have my wife bring in coffee to me every morning on a tray, said Emile with a smile. Then Im go ing to get a job that will keep me close to home. O f all the duty 1 have had, I guess I like destroyers best. When I was single I think that sea duty was the best duty I could think of having . . if you except that picket duty of Okinawa, when we were attacked by Kamakazi. Id prefer any man-o-war, though. Bruces wife is from historic Appo mattox, Va- His mother is Mrs. Eva B. Snowden of Port Royal, Va. The Bruce family contains Emile Reba Bruce, 6 Bonny Eloise, 4 and Milton Thurman, 7 months. The last Bruce mentioned is the one Emile hasnt seen yet. He will remedy that soon. His awards include Good Conduct, American Defense, Amer ican Theater, Philippine Liberation two stars, W W II Victory, Asia tic - Pacific 4 stars, Navy Occu pation one star."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Early this week Emile <mark>Thurman</mark> Bruce, CS B, USNR"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Early this week Emile <mark>Thurman</mark> Bruce, CS B, USNR"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1662.43, 1496.6, 1822.03, 1842.34], "bbox_id": "466d1538ce", "file": "TimesVirginian_1983a_0151.pdf", "page": 1, "text": "than 2,000 of their babies into the world. His tee ot fifty cents became famous. He hung out his shingle in 1903, having graduated from Medical College of Virginia, Richmond, just before the turn of the century. His internship was at a Winston-Salem, N .C . hospital and his first practice inKentueky. He heard of a need ot a doctor in Pam plin, population 400. He acquired his first automobile, a Model T , in 1918. Before that he rode horseback. He liked spirited horses. His wife, the former A Hie Thornton, knew his favorite food, stewed apples. And I recall Dr. Lukin a a great baseball fan. Seldom missed a home game of the Appomattox Green Sox. What a man! Successful doctor and successful druggist. Others pic- tured in the feature, mostly in Dr. Lukins pstients chair, included S. T . Thurman, Mrs. Jack WilUams. R. W . Covington, Jack Price, C.H . Buckles, Mattie Thornton, Mrs. Woodrow Williams, Lewis Car- Well, M rs. Osie Southall, and son, W iley. Thanks for the memory, thanks for the gift of this oid paper, and thanks to you for reading. Seeya."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "chair, included S. T . <mark>Thurman</mark>, Mrs. Jack WilUams. R."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "chair, included S. T . <mark>Thurman</mark>, Mrs. Jack WilUams. R."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1404.71, 1154.66, 1568.26, 1335.31], "bbox_id": "481546b2f9", "file": "AppomattoxNewspapers_1936-1939a_0020.pdf", "page": 1, "text": "TayW Street laylor. Nelson Thurman, Clyde AlvfaS?p awson, Vireinia pHfi ,Catnile CWdweJl, I Nell P  oorne Lillian Caldwell, Lucfle erguson, Eleanor Ferguson, Flor- Gr.e  Catherine GUIs, Alice Harwood, Olive Lewis, Virginia Mor- Ouiri. .Mor Rebecca Martin, Omda OBrien, Phoebe OBrien, Al- rrr ,ueb Hazel Reynolds, Virginia Woodson, Myrtle Evans. 1926- 1927 Ri!nn 3 nl n areon Andrew Coleman, JoffVR HcDarmon Clyde OBrien, i? mes Stepheson, Thel- JeikiT? 6 g  f.C1T nJce Pe. Richard Fatie Anderson. Eleanpr ulton Nannie Sue Chilton, Eva Doss, Manon Dillon, Thelma Fergu-"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "TayW Street laylor. Nelson <mark>Thurman</mark>, Clyde AlvfaS?p awson, Vireinia"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "TayW Street laylor. Nelson <mark>Thurman</mark>, Clyde AlvfaS?p awson, Vireinia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1815.33, 912.47, 1986.08, 1074.61], "bbox_id": "ef73fbd43f", "file": "AppomattoxNewspapers_1960-1962b_0653.pdf", "page": 1, "text": "Sunday dinner guest of Mr. ana Mrs. Munday Moore and Mr. and Mrs. Watts Moore-were Mr. and Mrs. Claude Jennings, Mr. and Mrs. Wm. Layne Jr. and Son of Spout Spring,  Mr. and Mrs. Clarence Franklin and sonsl of Appomattox, Mrs. Eugeon Howerton Sr., Mr. and Mrs. Thurman Turner and family and Mr, and Mrs. Edward Howerton and family of Roanoke. The evening guest in the home were Mr. and Mrs. Alfred Moore and family, Mr. and Mrs. R. E. Mays and Mr. and Mrs. Edgar Tuck and family of Concord."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Sr., Mr. and Mrs. <mark>Thurman</mark> Turner and family and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Sr., Mr. and Mrs. <mark>Thurman</mark> Turner and family and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [758.89, 989.88, 920.99, 1642.74], "bbox_id": "5428ef473d", "file": "AppomattoxNewspapers_1898-1902a_0563.pdf", "page": 1, "text": "Statesmanship in the Vocative. It is to be supposed that there is as much brains m the United States to-day as there ever was before. Aud yet it seems that there has never been a time in our history when there were a few men in pub lic life who rise above their fellows as at the present. Meu who are en gaged iu the affairs of government, or who are ordinarily spoken of as candidates for high office, seem to be almost on a dead level of mediocrity. In neither house of Congress s there a man who is regarded as a leader and a statesman above his fel lows. Senator Hoar is a man of abil- ty, doubtless, but he had iu recent years shown more of a ctpacity to be led than to lead. Sen-itor llauna is the most influential man in the Sen- ite, but not by virtue of statesman hip. He possesses none of the quail ies which made the great Senators of the ante-bellum period leaders, and none of the brilliance of the la ter Eepublicans, such as Oliver P. Morton, Conkling and Blaine. With the death of Hendricks, Thurman, Bayard, and the retirement from public life of Mr. John G. Carlisle, the Democratic party has been much iu the same plight. When one be gins to discuss party candidates for the Presidency in 1904 no one is able to mention a tolerably available man in either party whose name is famil iar to all the people as were the names of Hendricks, Bayard or Conkling. The name of Mr. Thom as B. Heed is familiar enough, but he is not keeping step with his party, and he does not possess the knack of catching step which Senator Hoar so eminently possesses. When Mr. Heed and Mr. William L. Wilson re tired from the House of Repre sentatives, there were no Elishas in their respective parties upon whom they could drop their mantles. It may be that the best statesmen we possess find it impossible to adjust their views to party policies. In the old days this was not necessary, as the party policies were formulat ed by the statesmen themselves and not by the mere politicians. It may he that the best talent of the country is not available for the United States Government because of the superior inducements offered by the great corporations or by the rewards of labor in other walks of private life. Whatever the reason may be the fact is to be deplored.Baito. Sun."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "the death of Hendricks, <mark>Thurman</mark>, Bayard, and the retirement"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "the death of Hendricks, <mark>Thurman</mark>, Bayard, and the retirement"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.11, 321.05, 1729.44, 355.79], "bbox_id": "db57d1c535", "file": "AppomattoxNewspapers_1960-1962b_0086.pdf", "page": 1, "text": "SPgfc. and Mrs. Thurman Wilcox spent a few days last week in Ohio with friends."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "SPgfc. and Mrs. <mark>Thurman</mark> Wilcox spent a few days last week in Ohio with friends."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "SPgfc. and Mrs. <mark>Thurman</mark> Wilcox spent a few days last week in Ohio with friends."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1523.47, 991.0, 1699.86, 1210.37], "bbox_id": "96dfcf2a99", "file": "AppomattoxNewspapers_1939-1943a_0241.pdf", "page": 1, "text": "Special to TAoos-Viriiian Spring Mills, Feb. 26- Mrs. Jam- es Ford and Leroy Owen visited their sister, Mrs. Ed West, in Ap pomattox on Tuesday. Mrs. Lawrence Monroe and daugh ter. Lockie, visited in Nie home of Mrs. W. L. Ford and Mrs. James Ford Saturday. Mrs. Warren Guthrie and child ren Thalia, Junior and Sarah spent the week-end in Halifax visiting re-1 latives. I Mrs. James Ford and Mrs. W. L. Ford spent Monday afternoon with  Mrs. Thurman Cyrus. Among those who went to Lynch burg to see Gone With the Wind were Mrs. G. E. Owen Mrs. W. L. Ford, Mae Lee and Mildred Lee. Mrs. G. E. Owen, Mrs. James"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Monday afternoon with  Mrs. <mark>Thurman</mark> Cyrus. Among those who"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Monday afternoon with  Mrs. <mark>Thurman</mark> Cyrus. Among those who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1837.36, 776.62, 1978.45, 1131.25], "bbox_id": "87fe41e6de", "file": "TimesVirginian_1976_0420.pdf", "page": 1, "text": "so unselfishly gave. The staff at the American Cancer Society office and Mr. Thurman for their concern and help. The many clubs and organizations that so willingly pitched in and gave the many prayer services that were held for Kenneth the bloodmobiles that were held for him the Metropolitan Ambu lance Service, who day in and day out took such good care of Kenneth en route to and from Charlottesville. A special thanks to Mr. Kimball Glass and his crew whom we saw night and day in the last week of my sons life. It is people, like these ip our communities that makes this a place to be proud of and not to knock it, but to be thankful that we are part of it. Because there are many such children as my son out there who will continue to need your help until one day God will give the knowledge of a cure for this terrible disease called Cancer we thank God for each and every one of you. The family of Kenneth Craig Scott by his mother, Thelma Scott Racey"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Society office and Mr. <mark>Thurman</mark> for their concern and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Society office and Mr. <mark>Thurman</mark> for their concern and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1035.86, 190.68, 1179.68, 738.76], "bbox_id": "c6005ce4a0", "file": "TimesVirginian_1976_0264.pdf", "page": 1, "text": "So happy to know that she is improving rapidly. Joe Almond will return to his job Monday today after being Out for for sometime recuperat ing from an operation. Mrs. Flora Dickerson and Christine went to the hospital Friday to. see the formers sister, Mrs. Carrie Richardson and their aunt, Mrs. Bernice Murray at her home. It was good news to hear Dr. Carl A. Collins, Jr. returned to his pulpit for the service on Sunday. Mr. and Mrs. Toby Inge left last Monday for a weeks vacation at Myrtle Beach, S.C. They got home Sunday night. Rev. Donald Wagner will be on W.T.T.X. morning devotion this week. It will do you good to hear him at 845. Mr. and Mrs. Thurman Wilcox, of, Roanoke, spent the week end with her brother-in- law and sister, Mr. and Mrs. S, E. Ranson. Mrs. Louise Roach is still on crutches. A speedy recovery is wished her. Mr. and Mrs. Frank Lee Elder have purchased a home in the Rocks neighborhood. The Kenneth Richardsons home. So glad to have them settle here. But regret that the Richard sons are leaving in the future bn Route 26, South of Appomattox. Mr. and Mrs. Larry Williams, of Waynesboro, were dinner guests of her parents, Mr. and Mrs. R. E. Roach Sunday. Trooper arid Mrs. W. R. Roach and Annie Marie of Lovingston were supper guests of his parents,. Mr. and Mrs. R. E. Roach, of Pamplin Saturday night. Annie Marie remained"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "845. Mr. and Mrs. <mark>Thurman</mark> Wilcox, of, Roanoke, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "845. Mr. and Mrs. <mark>Thurman</mark> Wilcox, of, Roanoke, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1414.56, 610.25, 1568.29, 760.19], "bbox_id": "88ce8e0b4a", "file": "AppomattoxNewspapers_1955-1957a_0106.pdf", "page": 1, "text": "smurfs, Feb. 21.- Mr. and Mrs. her Nash, Mr. and Mrs. Thurman yne sad J. H. Rosser were week- visitors of relatives at Wash- xrn, D. C. lisa Kate Franklin spent several s last week with relatives in, icbburg. Ir. and Mrs. H. G. Hungate and , Henry Jr., of Roanoke, and . George Williamson and daugh- ofRrnchburg were week-end sts in the home of Mr. and Mrs. L. Dickerson."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Nash, Mr. and Mrs. <mark>Thurman</mark> yne sad J. H."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Nash, Mr. and Mrs. <mark>Thurman</mark> yne sad J. H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2191.68, 180.76, 2333.37, 361.85], "bbox_id": "4b5158e64b", "file": "AppomattoxNewspapers_1974-1975a_0404.pdf", "page": 1, "text": "Sherry Patterson, Susan Por- ton, Teresa Rankins, Ann Sears, Carolyn Ann Smith, Cindy Smith, Josephine Smith, Maryjane Smith, Vickie Smith, Felicia Thurman, Shelia Tor rence. Room 304  Janet Booth, Karen Chandler, Betty Cheat ham, Goldie Covington, Donna Cyrus, Rita Ferguson, Debra Garrett, Kathie Garris, Gale Griffin, Susan Hamlin, Cindy Harris, Beth Lawson, Geneva LaW arne. Debbie M artin. Tsmmv Martin. Carolyn Me-"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Smith, Vickie Smith, Felicia <mark>Thurman</mark>, Shelia Tor rence. Room"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Smith, Vickie Smith, Felicia <mark>Thurman</mark>, Shelia Tor rence. Room"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2170.55, 975.29, 2336.63, 1024.64], "bbox_id": "2b3fa716db", "file": "AppomattoxNewspapers_1947-1949a_0397.pdf", "page": 1, "text": "She was born in Pittsylvania County March 14, 1879. She was the daughter of Jessie W. and Ma tilda Thurman Hodges. She was the widow of Charlie G. Garrett."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "She was born in Pittsylvania County March 14, 1879. She was the daughter of Jessie W. and Ma tilda <mark>Thurman</mark> Hodges. She was the widow of Charlie G. Garrett."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "She was born in Pittsylvania County March 14, 1879. She was the daughter of Jessie W. and Ma tilda <mark>Thurman</mark> Hodges. She was the widow of Charlie G. Garrett."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [321.36, 922.78, 487.77, 985.62], "bbox_id": "dbf39b1e56", "file": "TimesVirginian_1983a_0256.pdf", "page": 1, "text": "She is theparent of Felicia Kelso and John Thurman Jr. and the daughter of Mr. and Mrs. Lewis Ferguson, all of Appomattox. She is employed at Babcock and Wilcox in Lynchburg, Va,"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Felicia Kelso and John <mark>Thurman</mark> Jr. and the daughter"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Felicia Kelso and John <mark>Thurman</mark> Jr. and the daughter"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [464.18, 357.16, 638.78, 411.56], "bbox_id": "c2e506164d", "file": "AppomattoxNewspapers_1960-1962b_0091.pdf", "page": 1, "text": "Sgt. Thurman Wilcox left Tues day for Panama, after spending a leave here. Mrs. Wilcox, and Anita will remain here awhile in the home of Mr. and Mrs. Edward Ranson."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Sgt. <mark>Thurman</mark> Wilcox left Tues day for Panama, after spending a leave here. Mrs. Wilcox, and Anita will remain here awhile in the home of Mr. and Mrs. Edward Ranson."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Sgt. <mark>Thurman</mark> Wilcox left Tues day for Panama, after spending a leave here. Mrs. Wilcox, and Anita will remain here awhile in the home of Mr. and Mrs. Edward Ranson."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1542.0, 455.81, 1710.8, 587.95], "bbox_id": "8284d24cbf", "file": "AppomattoxNewspapers_1952-1954a_0344.pdf", "page": 1, "text": "Sgt. and Mrs. Thurman Wilcox were visiting his aunt in Ohio last week. Bob Harris had charge of the prayer service on Tuesday night, and of the regular preaching service on Sunday morning. He preached a very fine sermon. We regret that Mrs. L. M. Will iams nee Dora Jean Roach is a patient at University Hospital, Char lottesville."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Sgt. and Mrs. <mark>Thurman</mark> Wilcox were visiting his"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Sgt. and Mrs. <mark>Thurman</mark> Wilcox were visiting his"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [254.38, 1116.62, 397.18, 1395.67], "bbox_id": "3fc4d7030f", "file": "AppomattoxNewspapers_1962-1965a_0249.pdf", "page": 1, "text": "September 23, Bluefield, Va. O v e r 300 students have registered for the fall term at Bluefield College, Bluefield, Va. Area students among those re gistering include the following Kyle Edward Almond, the son of Mr. and Mrs. D. W. Almond, of Appomattox, a graduate of Appomattox High School. Richard Floyd Hamilton, the son of Mr. and Mrs. J. K. Hamil ton of Evergreen, a graduate of Appomattox High School Harry Eugene Ranson, the son of Mr. and Mrs. H. W. Ranson, of Pamplin, a graduate of Ap pomattox High School Sandra Ruth Reynolds, the daughter of Mrs. Annie Jones Reynolds, of Appomattox, and the late Mr. Reynolds a grad uate of Randolph Henry High School at Charlotte Court House. Thurman Lee Wilcox, Jr., the son of Mr. and Mrs. John A. Tweedy, Jr., of Appomattox, a graduate of Appomattox High School."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "at Charlotte Court House. <mark>Thurman</mark> Lee Wilcox, Jr., the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "at Charlotte Court House. <mark>Thurman</mark> Lee Wilcox, Jr., the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2060.38, 273.96, 2213.83, 282.96], "bbox_id": "8fd6e7d832", "file": "AppomattoxNewspapers_1922-1923a_0621.pdf", "page": 1, "text": "SAYS THURMAN IS INSANE. j"}, "highlight": {"text": {"matched_tokens": ["THURMAN"], "snippet": "SAYS <mark>THURMAN</mark> IS INSANE. j"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN"], "snippet": "SAYS <mark>THURMAN</mark> IS INSANE. j"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [712.57, 334.28, 872.77, 771.79], "bbox_id": "0c789a4307", "file": "AppomattoxNewspapers_1908-1909a_0422.pdf", "page": 1, "text": "Sawdust Saving Worth Millions of Dollars Nèw York.By making thinner saws, which will save as little as one- sixteenth of an Inch In the width ot cuts made In wood, an annual watte of sawdust amounting to more than  00 , 000,000 may be saved for the American lumber Industry. This report was made recently to the American Society of Mechanical Engineers by a special research com mittee on saws and knives. Efficient standardisation of saws, the committee said, might accomplish the saving. The annual waste In- saw- logs was estimated u 30,000,0 hi with an additional sawdust waste of 83, 000,000 In manufactura of logs Into boards. A doubtful saving of 4.- 000,000 In power with thinner saws was estimated. bringing the grand to tal of value of . sawdust waste that might he n voided to 07.000.000. Commissioners Sale Of Valuable Real Estate Pursuant to a decree of the Hustings Court for the City of Roanoke, Virginia, entered on thé 6th day of December, 1927, in-the chancery cause of Fannie Lessie Thurman, Guardian ver sus William Allen Thurman, et ais pending in the Hustings Court for the City of Roanoke, Virginia, I will on . V Jan u a ry 12th 1 9 2 9 on the premises about one-half mile southeast of the Town of Appomattox, Virginia, in Appo mattox. Virginia, at 2 oclock P. M. of that date, offer lor salé to"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "cause of Fannie Lessie <mark>Thurman</mark>, Guardian ver sus William"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "cause of Fannie Lessie <mark>Thurman</mark>, Guardian ver sus William"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [715.45, 355.01, 877.79, 792.91], "bbox_id": "3fa11b2827", "file": "AppomattoxNewspapers_1926-1933a_0422.pdf", "page": 1, "text": "Sawdust Saving Worth Millions of Dollars New York.By making thinner saws, which will save as little as one- sixteenth of an Inch In the width of cuts made In wood, an annual waste of sawdust amounting to more than  60 , 000,000 may he saved for the American lumber industry. This report was mnde recently to the American Society of Mechanical Engineers by a special research com mittee on saws and knives. Efficient standardization of saws, the committee said, might accomplish the saving. The annual waste In saw- logs was estimated n 30,000,01 hi with nn additional sawdust waste of 38,- 000,000 in manufacture of logs Into boards. A doubtful saving of 4.- 000,000 in power with thinner saws was estimated, bringing the grand to tal of vnltte of sawdust waste that might be avoided to 07.000.000. _____ Commissioners Sale Of Valuable Real Estate Pursuant to a decree of the Hustings Court for the City of Roanoke, Virginia, entered on the 6 th day of December, 1927, in the chancery cause of Fannie j Lessie Thurman, Guardian ver- sus William Allen Thurman, et als pending in the Hustings Court for the City of Roanoke, Virginia, I will on January 12th 1929 on the premises about one-half mile southeast of the Town of Appomattox, Virginia, in Appo mattox, Virginia, at 2 oclock P. of that date, offer for sale to"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "of Fannie j Lessie <mark>Thurman</mark>, Guardian ver- sus William"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "of Fannie j Lessie <mark>Thurman</mark>, Guardian ver- sus William"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [146.67, 799.43, 485.71, 895.79], "bbox_id": "f83c825265", "file": "TimesVirginian_1983a_0256.pdf", "page": 1, "text": "Saint Pauls College is a growing liberal arts institution with ties to the Episcopal church. It is a four-year, coeducational college. Thurman gets degree"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Saint Pauls College is a growing liberal arts institution with ties to the Episcopal church. It is a four-year, coeducational college. <mark>Thurman</mark> gets degree"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Saint Pauls College is a growing liberal arts institution with ties to the Episcopal church. It is a four-year, coeducational college. <mark>Thurman</mark> gets degree"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [286.29, 1647.36, 444.65, 1768.85], "bbox_id": "de5843c49b", "file": "AppomattoxNewspapers_1902-1905a_0497.pdf", "page": 1, "text": "S e rva n ts o i th e People. Allen G. Thurman died poor, Roscoe Cockling died poor, Geoige F. Iloar died poor, Matt H. Car penter died poor, John H. Regan died poor. These were statesmen white hands were clean and heuris pure men who refused to represent special interests while servants of the peoplestatesmen who were without money and without price  Dallas Texas Times-Herald."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "e People. Allen G. <mark>Thurman</mark> died poor, Roscoe Cockling"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "e People. Allen G. <mark>Thurman</mark> died poor, Roscoe Cockling"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1486.09, 349.57, 1647.0, 1006.75], "bbox_id": "961dfda47c", "file": "AppomattoxNewspapers_1926-1933a_0186.pdf", "page": 1, "text": "ROCKS NEWS Dont forget the series of meet ings start at Rocks Baptist church, Sunday night, June 3rd, at 8 oclockCome. Mr. G- T. Marsh had as. his week-end guests Mr. Sidney Marsh, Mrs. Herbert Thurman, of Newport News, Miss Dorothy Marsh, of Lynchburg, and Mr. and Mrs. Dean Pugh and daugh ter, Audrey, of near Appomattox. Mrs. Edd Roach returned from Roanoke Saturday, accom panied by Mr. Hubert Lowe, Mr. Ernest Lowe and son, Jack, Mr. Robert Roach and son, Don ald, all of Roanoke. Mr. Harry Meadows, of Roa noke, visited his uncle, Mr. Edd Roach, recently. Mr. Hubert Martin, of Lynch burg, spent the week-end in this community. Some of the people around here attended the Evergreen meeting some last week.  Be sure your sins will find you out.   Remember that when stealing gasoline, or better still before you steal it, and leave it where it belongs- Miss Cassie Baldwin is teach ing the Sunday School Manuel at Rocks church with much success. Lots of the scholars made a hundred on their examinations. Mr. W. J. Almond spent a part of last week in Lynchburg, with his children. Mrs- S. M. Ranson and Mr. and Mrs. J. H. Ranson visited Nona Meadows at Evergreen recently. Mr. Elbert Dinkins and sister, Myrle, had a narrow escape last week, when their car turned over, but they were not hurt badly. Miss Dorothy Marsh Mr. Her man Marsh and Mr. and Mrs. Harold Marsh, of Lynchburg, visited their father, Mr. G. T. Marsh, last week."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Sidney Marsh, Mrs. Herbert <mark>Thurman</mark>, of Newport News, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Sidney Marsh, Mrs. Herbert <mark>Thurman</mark>, of Newport News, Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.34, 328.17, 1640.52, 984.71], "bbox_id": "b475731de4", "file": "AppomattoxNewspapers_1908-1909a_0186.pdf", "page": 1, "text": "ROCKS NEWS Dont forget the series of meet ings start at Rocks Baptist church, Sunday night, June 3rd, at 8 oclockCome. Mr. G. T. Marsh had as. his week-end guests Mr. Sidney Mársh, Mrs. Herbert Thurman, of Newport News, Miss Dorothy Marsh, of Lynchburg, and Mr. and Mrs. Dean Pugh and daugh ter, Audrey, of near Appomattox. Mrs. Edd Roach returned from Roanoke .Saturday, accom panied by Mr. Hubert Lowe, Mr. Ernest Lowe and son, Jack, Mr, Robert Roach and son,, Don ald all of Roanoke. Mr. Harry Meadows, of Roa noke, viBited his uncle, Mr. Edd Roach, recently. Mr. Hubert Martin, of Lynch burg, spent the week-end in this community.     Some of the people around here attended the Evergreen meeting some last week. Be sure your. gins wiirfind you out.  Remember that when stealing gasoline, or better still before you steal.it, and leave it where it belongs. Miss Cassie Baldwin is teari ing the Sunday School Manuel at Rocks church with much success. Lots of the scholars made a hundred oh their examinations. Mr. W. J. Almond spent a part of last week in Lynchburg, with his children. ... Mrs- S. M. Ranson and Mr. and Mrs. J. H. Ranson visited Nona Meadows at Evergreen recently. Mr. Elbert Dinkins and sister, Myrle, had a narrow escape last week, when their car turned over, but they were not hurt badly. Miss Dorothy Marsh Mr. Her man Marsh and Mr. and Mrs. Harold - Marsh, of Lynchburg, visited their father, Mr. G. T. Marsh, last week.-"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Sidney Mársh, Mrs. Herbert <mark>Thurman</mark>, of Newport News, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Sidney Mársh, Mrs. Herbert <mark>Thurman</mark>, of Newport News, Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1825.9, 283.14, 1997.27, 720.52], "bbox_id": "db3fabac8d", "file": "AppomattoxNewspapers_1955-1957a_0543.pdf", "page": 1, "text": "Rocks, July 8.- Rain is badly needed around here. Mrs. Carl Shelton fell a t her home last week and broke both arms. We wish her a speedy recovery. Mr. and Mrs. Bobby Mitchell went to Virginia Beach while on their vacation. Miss Ruiby Richardson spent the 4th with her aunt, Mrs. Willie Orange, of near Evergreen. Mr. and Mrs. Thomas Ranson and children visited in Washington, D. C. over the holidays. Miss Mary Patterson has returned to her home in Lynchburg after spending a few days in the home of Mr. and Mrs. Toby Inge and family. Mr. and Mrs. Emmett Paulette and family were visiting Mrs. D. R. Inge awhile Sunday afternoon. Mr. and Mrs. Jesse Anderson, of iShawnee, Kansas arrived Saturday night to visit his parents, Mr. and Mrs. A. T. Anderson, while on thedr vacation. Mrs. Elsie Perdieu, daughter of Mr. and Mrs. M. H. Marks, is a pa tient at Southside Hospital, Farrn- ville. iSFC. and Mrs. Thurman Wilcox and Anita, of Falls Church were visiting here during the holidays. Anita remained here. Mrs. Walter Ranson was visiting Mr. arid Mrs. L. C. Elder awhile last Monday night. The Rev. David L. Bailey, of War wick stopped by to see Mr. and Mrs. M. H. Marks while here last week for the A. D. Marshall funeral at"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "ville. iSFC. and Mrs. <mark>Thurman</mark> Wilcox and Anita, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "ville. iSFC. and Mrs. <mark>Thurman</mark> Wilcox and Anita, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [821.76, 538.69, 988.78, 795.68], "bbox_id": "b0c6dd7ca3", "file": "AppomattoxNewspapers_1939-1943a_0431.pdf", "page": 1, "text": "Robert Lucado, of Farmville, and Mr. and Mrs. Thurman Wilcox, of Appomattox spent the week-end in the home of R . H. Lucado. Those visiting Mr.and Mrs. Tom Page Sunday .were Mr.and Mrs.Per cy Page and children, o Lynchburg Mr. and Mrs. Lawson Lucado anc Thelma, Calvin Lucado, and Alvin Page, of Chatham, and Homer Luca do. Mr.and Mrs. Hrold Roger 0 and baby, of Lynchburg visited Mrs. Daisy Rogers and other relatives near here Sunday. Mr. and Mrs. J.E . Burge and Shirley spent Sunday afternoon with Mrs. Burges parents. Mr. and Mrs. Charlie Nash and children spent Sunday with Mr.and Mrs. Ira Phelps. Mrs. Littleton Lucado and daugh ter, Avis, spent Saturday night with Mr. and Mrs. Ira Lucado in Lynch burg."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "and Mr. and Mrs. <mark>Thurman</mark> Wilcox, of Appomattox spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "and Mr. and Mrs. <mark>Thurman</mark> Wilcox, of Appomattox spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1663.8, 715.24, 1806.95, 952.98], "bbox_id": "6906030ebe", "file": "TimesVirginian_1976_0090.pdf", "page": 1, "text": "Robert Harry White Luca do, 94, of Rt. 3, Appomattox, died Tuesday evening at his home. He was twice married. His first wife was the late Mrs Nannie Louise Marsh Lucjtdo, and his second wife was the late Mrs. Lizzie Wilcox Lucado. Born in Appomattox County, he was a son of the late Elisha Lucado and Catherine Conner Lucado. He was a member, deacon and trustee of Red Oak Baptist Church, and a retired farmer. He is survived by two sons, Robert A. Lucado and Harry Lucado, both of Appomattox a stepson, Thurman Wilcox of Roanoke a stepdaughter, Mrs. Lelia Braford of Richmond, two grandchildren and three great"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "of Appomattox a stepson, <mark>Thurman</mark> Wilcox of Roanoke a"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "of Appomattox a stepson, <mark>Thurman</mark> Wilcox of Roanoke a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1969.18, 339.97, 2138.6, 888.07], "bbox_id": "04b10023a1", "file": "AppomattoxNewspapers_1949-1952a_0597.pdf", "page": 1, "text": "Richmond, Va., May 7.- The 115 organizations that lend their support in the safety crusade of the Vir ginia State-Wide Safety Conference are distributing thousands of pro grams of the 18th annual meeting to be held here May 15-17 in the Jefferson Hotel, Col. Wm. M. Myers, executive secretary of the conference said today. With the program, that includes over 150 speakers on all phases of safety, Governor John S. Battle, the general chairman, sends an open let ter to the people of Virginia in which he says, The rate of acci dents in Virginia, including those on our streets and highways, in our homes and factories, and in all phases of our daily activities, can be reduced if the people are given proper information on preventative measures and resolve to apply it in telligently. We have a splendid state-wide organization which is ac tively at work in this important field. This is the Virginia State-Wide Safe ty Conference, which has one ob jectiveto make Virginia a safer place in which to liv e ....I urge you to attend and take part in the 18th annual meeting of safety lead ers and delegates in Richmond May 19-171, 1952. A new federal safety .section, headed by Rear Admiral D.H.Clarke, UiSN, Commandant of the Norfolk Naval Shipyard, has been added and will deal with safety problems of the U. S. Government employers, Col Myers added. General session speakers an nounced by Don N. Frazier, general program chairman include Ralph L. Lee, of Detroit Thurman Sensing, of Nashville, Tenn., and J. Dewey Dorsett, of Ridgewood, N. J. The Conference will be opened by an address of Governor Battle. Mayor T. Nelson Parker will give the welcome to Richmond. The housing chairman reports that early reservations are heavy and an all time record of attendance is ex pected."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "L. Lee, of Detroit <mark>Thurman</mark> Sensing, of Nashville, Tenn.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "L. Lee, of Detroit <mark>Thurman</mark> Sensing, of Nashville, Tenn.,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2050.08, 289.81, 2219.81, 577.21], "bbox_id": "ebaa2db226", "file": "AppomattoxNewspapers_1922-1923a_0621.pdf", "page": 1, "text": "Richmond Special.  Charles A. 1 Thurman, of Louisville, Ky., brother of Leo C. Therman, sentenced to be hanged on March 27 for the murdei of W alter P. Dolsen, in Norfolk, waited upon Gov. Swanson and again urged a commutation of sentence foi his brother on the ground of Insanity. Mr. Thurman says his brother is i divorced man, and th at his formei wife furnished the photograph which led to his detection in British Colum bia.His brother says also that he can prove by Kentucky alietiists that Lee was Insane when he committed th crime for which he Is Sentenced to hang. He declares the insanity wai caused by being struck on the head with a baseball bat. NORFOLK WINS TAX SUIT. .  Norfolk Special.In the case  of the city of Norfolk against th J. W. Perry Company and the same against William H. White, both de-  elded In the State Supreme Court, i the city wins the right In much wharl property at Town Point, valued at J 1,000,000. The Southern Railway, Atlantic Coast Line, the Old Bay Line, the Chesapeake Line and the Norfolk and j Washington Steamboat Company have their wharves there. Taxing this"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Special.  Charles A. 1 <mark>Thurman</mark>, of Louisville, Ky., brother"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Special.  Charles A. 1 <mark>Thurman</mark>, of Louisville, Ky., brother"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1522.04, 517.16, 1667.68, 786.85], "bbox_id": "b8c4cab310", "file": "TimesVirginian_1976_0026.pdf", "page": 1, "text": "Rev. W. H. Elder performed a wedding at Elon Church at Pamplin Saturday afternoon. The Rocks Quartet went to Bethany Pentcostal Holiness Church at Spout Spring on Saturday night for a song service.  Mr. and Mrs. Thurman Wilcox of Roanoke, spent the week end with Mr. and Mrs. S. E. Ranson of Pamplin. Baptist Mens Day at Rocks is on January 25. The men will have charge of the services. The Rocks Quartet along with Mrs. Betty Rhodenizer of Liberty Church, will present a gospel music program at Rocks on January 31 at 730 p.in. Congratulations to Mr. and Mrs. Jim Frank Ranson on being grandparents of another -grandson, Thomas Jason Gilli land, born on Jan. 11."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "service.  Mr. and Mrs. <mark>Thurman</mark> Wilcox of Roanoke, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "service.  Mr. and Mrs. <mark>Thurman</mark> Wilcox of Roanoke, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.65, 1072.6, 2324.0, 1148.75], "bbox_id": "50d3581222", "file": "AppomattoxNewspapers_1892-1898a_0404.pdf", "page": 1, "text": "REV, C. B THURMAN, it Texaa, ay The first hour I made S2.1U. MRS. VINA DAlllTY, of North Carolina, say 1  In 8 day I made 87.00.! . .   we could give hundred of j t uch testi monial baa we the paoe. w rite to-uav li you are out of emoloyment and we will im- wer you t once or send a representative to see you. Address, Riverside Publishing Company, Depart in ont B.  St. Louis, Mo"}, "highlight": {"text": {"matched_tokens": ["THURMAN"], "snippet": "REV, C. B <mark>THURMAN</mark>, it Texaa, ay The"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN"], "snippet": "REV, C. B <mark>THURMAN</mark>, it Texaa, ay The"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1918.78, 1542.95, 2074.52, 1703.07], "bbox_id": "d05c5a3bc8", "file": "AppomattoxNewspapers_1915-1918a_0184.pdf", "page": 1, "text": "Remembered Old Habit. H. Gassaway Davis, once a United States senator and later candidate foi vice president on the Parker ticket, was a brakeman before he became a millionaire and is said on one historic occasion, while sleeping soundly in the senate chamber, to have dreamed that he was still guiding an unruly freight car through the mountains of West Virginia. The dream was inspired by a nearby colleague, Senator Allen G. Thurman, who blew two mighty blasts on his nose. Davis thinking he had heard the freight whistle, seized his desk as If it were a brake and nearly twisted the thing from Us moorings before be came to"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "colleague, Senator Allen G. <mark>Thurman</mark>, who blew two mighty"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "colleague, Senator Allen G. <mark>Thurman</mark>, who blew two mighty"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1985.51, 376.76, 2324.01, 465.58], "bbox_id": "55eb18baba", "file": "AppomattoxNewspapers_1939-1943a_0135.pdf", "page": 1, "text": "Recent visitors of M rs.S . B .Fo re were Lacy Lee and wife, MrslOtey Stonewall, July 24.- Miss Barbara Padgett and children, all of Lynch- Caldwell, Thomas Jennings a n d burg. Thomas Almond are attending the u . . _ _ 14-H Club Short Course this week at Mr. and Mqs. Thurman Eney I Blacksburg, and son, Mr. and Mrs. W.H. F er- guson, Mrs. Emma Martn, Audrey Pugh and Myrna Boaze were also guests in ibis home."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "at Mr. and Mqs. <mark>Thurman</mark> Eney I Blacksburg, and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "at Mr. and Mqs. <mark>Thurman</mark> Eney I Blacksburg, and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1872.49, 1356.01, 2199.45, 1440.9], "bbox_id": "8f00b9192a", "file": "AppomattoxNewspapers_1892-1898a_0406.pdf", "page": 1, "text": "rb V . C. D THURMAN, of Texas, says Tho first hour 1 made 22.10. MRS. VISA DARITVof North Carolina,  t o coud  reyh u  red sof  rtsu   tastl- Eleven directors were cnosen iw i yJre oafoYempioynt andwt- win an- the purpose of canying o u t the swer you at oneeor-rend a representative to organization of the . J  Riverside Publishing Company obtaining a charter and_arru g g  nftflftrtment..B st.Louis,Mo. 0 tbr preliminaries, . ."}, "highlight": {"text": {"matched_tokens": ["THURMAN"], "snippet": "rb V . C. D <mark>THURMAN</mark>, of Texas, says Tho"}}, "highlights": [{"field": "text", "matched_tokens": ["THURMAN"], "snippet": "rb V . C. D <mark>THURMAN</mark>, of Texas, says Tho"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.76, 643.93, 1893.24, 979.37], "bbox_id": "ada3405572", "file": "TimesVirginian_1980a_0388.pdf", "page": 1, "text": "Ran son. West Virginia, and Miss Tammy Martin, sister of the bridegroom of Appomattox. Their dresses were quiuna with, empire waistline and carried a bouquet of carnations of fall colors. Mr. Martin was best man lor his son and ushers were John B. McCracken Jr., brother of the bride, of Fairfax- Thurman Wilcox, uncle of the bridegroom and Mark  Pierce, both of Appomattox.- David McCracken, brot her of the bride and James Tyler, nephew of the bride, were acolytes. Miss Stephanie Lane, niece of the bride, was flower girl. Matthew Mc- Craken, nephew of the bride, was ring bearer, Immediately following the ceremony the parents of the bride entertained with a reception in the fellowship half of the church. The- bride is a student at -Appomattox High School. The. bridegroom was"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "the bride, of Fairfax- <mark>Thurman</mark> Wilcox, uncle of the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "the bride, of Fairfax- <mark>Thurman</mark> Wilcox, uncle of the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2145.1, 503.7, 2348.87, 853.3], "bbox_id": "c0e8a207f8", "file": "AppomattoxNewspapers_1949-1952a_0598.pdf", "page": 1, "text": "r jfty-eight seniors are expected I to receive diplomas at the 1952 I commencement at the Appomattox I High School. The commencement I exercises will take place the week I of June 1. The tentative list of graduates I follows Joan Harvey, Rosa Shupe, Ann I Goad, Sylvia Burks, Mary Ellen I Ramsey, Billy Johnston, Shirley I Walton, Ida Belle Harvey, Peggy I Cole, Mildred Ferguson, Ann Frank- I lin, Bill Jamerson, Virginia Rag- I land, Beatrice Totty, Sue Moore Jesse M. Rosser, Jo Ann Catlett, I Agnes Christian, Doris Lee Moore, Kathryn Burkey, Mary Ellen Moore, Nina Barlow, Loretta Doss, Kendall  Hunter, Martha Nash, Lois stein, Sam Coleman, Randolph Mar tin, Peggy Smith David Wood, Lewis Garrette, Lucy  cision  Martin, Virginia Herndon, Cheatham, Mary Alice Cheatham, Jean Taylor, Leon Paulette, Doris Caldwell, Waverly Payne, Billy Per due, Fleetwood Blackwell Thomas, Calvin Tanner, Fred Weak ley, Thurman Arrington, Daphine Wells, Mary Woods, Dan Carson Wade Drinkard, Mildred Smoot, Earlene Stinson, Moses Smith, Faye Kestner, Howard Blanks, Roy Sharp, Ed Cawthorn, Robert Chernault, Jack Layne."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Tanner, Fred Weak ley, <mark>Thurman</mark> Arrington, Daphine Wells, Mary"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Tanner, Fred Weak ley, <mark>Thurman</mark> Arrington, Daphine Wells, Mary"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [696.95, 985.04, 860.75, 1075.88], "bbox_id": "4989597d0e", "file": "AppomattoxNewspapers_1892-1898a_0343.pdf", "page": 1, "text": "Q.Name some authorities for this statement. A.The foremost representative and senators of the time, such ag Blaine, Garfield, Voorhes, Holrrians ConkR, Thurman, Beck and vnanv others. J Q.What was the motive v A.To enhance the pu rchasing"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Garfield, Voorhes, Holrrians ConkR, <mark>Thurman</mark>, Beck and vnanv others."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Garfield, Voorhes, Holrrians ConkR, <mark>Thurman</mark>, Beck and vnanv others."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.16, 1529.89, 1654.98, 1559.59], "bbox_id": "5139f485ec", "file": "AppomattoxNewspapers_1939-1943a_0593.pdf", "page": 1, "text": "Pvt. Thurman Wilcox has return ed to Fort Rodman, Mass., after vis iting his wife."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Pvt. <mark>Thurman</mark> Wilcox has return ed to Fort Rodman, Mass., after vis iting his wife."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Pvt. <mark>Thurman</mark> Wilcox has return ed to Fort Rodman, Mass., after vis iting his wife."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.47, 1506.85, 1890.57, 1800.34], "bbox_id": "6f187b6f84", "file": "TimesVirginian_1981a_0374.pdf", "page": 1, "text": "political collectibles, such as buttons and pictures, but one of my choice items in .an official paper ballot from the 1888 Presidential election. In those days, long before voting machines, you went to the polls and asked for the ballot of the party you wanted to vote for. The one I have is a Democratic ballot and listed Grover Cleveland for Presi dent and Allen C. Thurman for Vice President the District Electors and the Democratic candidate for Congress. R. B. Poore, o f. Appomattox was an Elector and Harry St. George Tucker, of Augusts, was the candidate for Congress in the old Tenth District. The ballot is three by six and a half inches. Years later a new ballot form was used with the names of candidates of all parties and independents on the same ballot. You marked an X in"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "dent and Allen C. <mark>Thurman</mark> for Vice President the"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "dent and Allen C. <mark>Thurman</mark> for Vice President the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [436.77, 253.87, 1159.83, 444.36], "bbox_id": "85ab321bc5", "file": "AppomattoxNewspapers_1962-1965a_0573.pdf", "page": 1, "text": "Piney Ridge Evington to visit Mr. and Mrs. Hudson Dlekerson, ot Brooknel, Mr. and Mrs. Edward Ran son  Bryan, of Madison Heights and Jordon Newman, Saturday.  during the holidays. went to Roanoke Sunday to get M rs. Lula Calhoun. Mr. and Mrs. Robert Tolley Mrs. Gladys Wilcox and Anita, j Mrs. Rosa Marks, who had been i and Mrs. Perry Mobley Renent for the kingdom of 1 took Sunday dinner with their of Roanoke, spent part of th e. visiting Mr. and Mrs. Thurman  and boyS Mr. and Mrs. T. J. heaven is at hand  Matthew 32 son and daughter-in-law, Mr. and holidays here with the formers Wilcox for a few days. We extend our sincere sympa-1 Mrs. Earl Tolley, of Farmville. mother Mrs Rosa Marks thy to the Baldwin family in the Mr. and Mrs. Fred Mathis vis- Kyle Almond returned to Blue- death of their love one, Mr. Joe I ited their son and family, Mr. field College Sunday after spend- Baldwin j and Mrs. Bob Mathis, of Lynch- mg the holidays where with his Mr. and Mrs. Melvin Airing-! burg. New Years Day. parents, Mr. and Mrs. Wilson Al ton and three children, Clinton, Mr. and Mrs. Mack Mays and j mond, of Appomattox. Audrey, and Lin wood, of Powlia-1 Mrs. Melvin Arrington spent New I Harry Eugene Ranson return- tan, and Mr. and Mrs. Ralph Years holiday in Ellicott City, I ocj t0 y.p.l. after spending Christ- Arrington and two sons, Gerald Md. with Mr. and Mrs. Ralph  mas here with his parents, Mr. and Roy, of Ellicott City, Md., Arrington. and Mrs. Harry Ranson. Audrey and Linwood Arrington  Everyone was glad to see Mrs. visited the first part of Christ , mas with their mother, Mrs. I spent the holiday with then Mary Sizemore. grandmother, Mrs. Mary Size- Those visiting Mrs. Roberts in  more the Sizemore Convelescent Home"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "visiting Mr. and Mrs. <mark>Thurman</mark>  and boyS Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "visiting Mr. and Mrs. <mark>Thurman</mark>  and boyS Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [792.69, 367.04, 962.62, 413.1], "bbox_id": "7fe44f6e3c", "file": "AppomattoxNewspapers_1954-1955a_0429.pdf", "page": 1, "text": "Pamplin, Oct. 11.- Mrs. Luther Nash and Mrs. Thurman Wayne are visiting their mother, Mrs. Roach, of Washington, D. C."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Pamplin, Oct. 11.- Mrs. Luther Nash and Mrs. <mark>Thurman</mark> Wayne are visiting their mother, Mrs. Roach, of Washington, D. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Pamplin, Oct. 11.- Mrs. Luther Nash and Mrs. <mark>Thurman</mark> Wayne are visiting their mother, Mrs. Roach, of Washington, D. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1636.8, 1548.44, 1804.77, 1672.64], "bbox_id": "b1e6862336", "file": "AppomattoxNewspapers_1955-1957a_0015.pdf", "page": 1, "text": "Pamplin, Nov. 16.- Graveside services for Edward F. Pittenger were held this afternoon at 3 oclock at the Prospect Methodist Church cemetery in Prospect. Services were conducted by the Rev. A. A. Mason, the Rev. W. M. Black and the Rev. J. H. Anderson. Pallbearers were Jim Rosser, Alex Rosser, Luther Nash, Thurman Wayne, Richard Williams and How ard Williams"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Alex Rosser, Luther Nash, <mark>Thurman</mark> Wayne, Richard Williams and"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Alex Rosser, Luther Nash, <mark>Thurman</mark> Wayne, Richard Williams and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.91, 1520.63, 1782.37, 1732.17], "bbox_id": "0c8d6ef469", "file": "AppomattoxNewspapers_1892-1898a_0132.pdf", "page": 1, "text": "owned and operated by the Lynch burg Manufacturing Company, of which Thomas N. Davis is president and Charles T. Plunkett secretary and treasurer. Mr. Plunkett esti mated the two buildings at  12 , 000  the machinery at  8 , 000 , and the stock on hand at 6,000 to 7,000, making a total of 26 to 27,000. on, and the senator and his guide j He coud not tell the amount of in- was taken to Waynesville, where the 1 suranCe carried, hut said it was not Ronbideaux bubbles up again in a eqnai to half the loss, magnificent spring, taking up its J The loss by fire according to the course on the surface once more like, above estimates, is from 60,000 to a well behaved, navigable river.St. j 05,000 insurance, less than half Louis Globe-Democrat. _  that amount. Neither the owners of the prop- , uor Chief Thurman, of the fire"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "the prop- , uor Chief <mark>Thurman</mark>, of the fire"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "the prop- , uor Chief <mark>Thurman</mark>, of the fire"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1991.48, 1224.74, 2138.61, 1582.71], "bbox_id": "2a47bbdb67", "file": "TimesVirginian_1976_0292.pdf", "page": 1, "text": "Out Of Tm duals Attend ietUinp Out of town guests here for the marriage of Miss Linda Kay Sullivan to Richard Clark Lewis, Jr. on Saturday evening, August 7 included Mr. and Mrs. George W. Deputy, Mark and Beth Ann of Rockville, Md. Mr. and Mrs. John C. Crist of Hyattsville, Md. Mrs. Michael Cady and Michelle of Odenton, Md. Mr. Alfred K. Sullivan of College Park, Md. Mr. and Mrs. Charles W. Prettyman and Christine of Kensington, Md. Mr. Wes Martin of Memphis, Tennessee Mr. and Mrs. Thurman E. Bullard of Winston Salem, N.C. Mr. and Mrs. Herman C. Moore, Mr. and Mrs. Abner Martin, and Patricia, and Mr. Villiam Sanders, all of Richmond Miss Annette Robertson of Ferrum Mr and Mrs. Danny Williams and Mr. Eston Harvey of Falls Church Mr. and Mrs. Wayne Bowman of Tuberville and Rev. and Mrs. T. E. Jackson and Sharon of Roanoke."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Tennessee Mr. and Mrs. <mark>Thurman</mark> E. Bullard of Winston"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Tennessee Mr. and Mrs. <mark>Thurman</mark> E. Bullard of Winston"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [338.38, 664.05, 483.42, 946.89], "bbox_id": "72f117dfd2", "file": "AppomattoxNewspapers_1971-1973a_0040.pdf", "page": 1, "text": "Otis Jones, J r., 38, of Ap pomattox, died W e d n e s d a y , September 1, in Johns Hopkins Hospital in Baltimore f r o m burns suffered in an accident at his home. He was the son of Mrs. Annie Jones and the late Otis Jones. An employee of a contracting firm in Baltimore, he was a member of Mt. Airy Baptist Church. Survivors, besides his moth er, include three b r o t h e r s , Charles Blackwell, Lawrence Jones and Thurman Jones, all I of Appomattox and a sister, Mrs. Katie Walker of Detroit, Mich. Funeral services were con ducted at 2 p.m. Saturday, Sept. 4 at the Mt. Airy Baptist Church by the Rev. H. W. Pryor. Burial took place in the family ceme tery. West Funeral Home took charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Blackwell, Lawrence Jones and <mark>Thurman</mark> Jones, all I of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Blackwell, Lawrence Jones and <mark>Thurman</mark> Jones, all I of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1919.78, 221.69, 2450.78, 268.88], "bbox_id": "528bf4464c", "file": "AppomattoxNewspapers_1962-1965a_0458.pdf", "page": 1, "text": "OBITUARIES New Crewe Air Field To Hold Tjiurmau II. Wayne Thurman Hayes Wayne, 75, of j Pamplin, a retirad carpenter. . diedat 2 30 a m Monday at V ir - p 0 r m a J Opeillllg Oïl AUgUSt 2 ginia Baptist Hospital."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Hold Tjiurmau II. Wayne <mark>Thurman</mark> Hayes Wayne, 75, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Hold Tjiurmau II. Wayne <mark>Thurman</mark> Hayes Wayne, 75, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1601.05, 943.81, 1774.84, 1690.35], "bbox_id": "713eb763e8", "file": "AppomattoxNewspapers_1939-1943a_0354.pdf", "page": 1, "text": "Oakville, Oct. 8.- Mr. and Mrs. Burton Daye and baby, Mr. and Mrs. W. C. Bass and daughters, Mary and Christine, Dick Bass, and Miss Bessie Daye visited in Peters burg recently. Mrs. W. C. Bass spent the week end with her daughter, Mrs. Burton Daye, at Toga, Va. Harry Byrd Stanley spent Satur day night with Dick Bass. Those who attended Mrs. O. W. Martins quilting bee last week were Mrs. Raymond Martin, Mrs. Royal Coleman, Mra A. M. Johnston, Mrs. J. C. Moore, Mrs. Graydon Mar in, Mrs. Hubbard Moore, Mrs. Sid ney Martin and daughters, Bessie nd Mary Jane, and Mrs. Melvin Drinkard. Mr. and Mrs. Robert Wells and hildren, of Farmville spent Sunday vith Mrs. Wells parents, Mr. and Mrs. Tom Page. Mr. and Mrs. John Owen, of Con- ord spent Saturday night with Mr. nd Mrs. T. E. O.wen. Albert Page, of Chatham visited lis parents, Mr. and Mrs. Tom Page ast week-end. Miss Helen Martin, of S. T. C., Farmville, spent the week-end at her home here. Mr. and Mrs. Marshall Hunter .pent several days last week with relatives in this community. The Oakville boys howled-7 their first game of the tournament last Thursday night, against the Sears earn. W. H. Ayers is sick at his home here. Lewis Doss spent the week- end with his family here. John Ed Stinson spent the week end with his parents, Mr. and Mrs. J. B. Stinson. The many friends of T. Burge Moore are glad to hear that he s much better, and able to be out again. Mrs. Lizzie Ferguson is visiting in the home of her neice, Mrs. Elmo Wilkerson. The W. M. U. members of Red ! Oak church attending the mission study class held last Wednesday at the home of Mrs. Curry Abbitt were Mrs. E. J. Marsh, Mrs. Clarence Adams, Mrs. C. D. Lewis, Mrs. Jim Childers, Mrs. Harry Harris, Mrs. LeRoy Marks, Mrs. Harry Lucado, and Mrs. Dick Smith. It ,was a most enjoyable day for everyone. Mr. and Mrs. White Lucoda, Lila and Thurman Wilcox, and ,Mary Bass leave today for Ohio. They are go ing to see Mrs. Lucados mother, who is to return with them at the end of this week."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "White Lucoda, Lila and <mark>Thurman</mark> Wilcox, and ,Mary Bass"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "White Lucoda, Lila and <mark>Thurman</mark> Wilcox, and ,Mary Bass"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [153.59, 587.43, 308.12, 1192.16], "bbox_id": "4fe429c1ac", "file": "TimesVirginian_1978_0516.pdf", "page": 1, "text": "November 13 - Farmers were glad of the tobacco season last week. George Kress returned home from the hospital on Monday. Mrs. Kenneth Richardson had surgery at Virginia Baptist Hospital last week. A speedy recovery is wished her. Rev. A. M. Taylor was called back to D avenport, Iowa because of the illness of his daughter-in-laws brother who was undergoing an operation last week. Mrs. Helen Inge and Mrs. Louise Roach attended a council meeting at Brookneal church on Wednesday. Sympathy is extended the McDowell family of Brookneal. Rev. W. H. Elder attended the funeral at Falling River Church on Wednesday. Mr, and Mrs. Kenneth SC John returned from Canada oh Wednesday afternoon after a most delightful trip to see their eon, Dennis and family. M rs. M argaret M arshall returned to the home óf her son Jimmie near Oakville on Sunday. Rev. A. M. Taylor, Helen Inge, Louise Roach and Ruby Almond will attend the General Association in-toanipke on Tuesday. Rev. Jerry Lethco was visiting in the neighborhood last Monday while in a revival at Rustburg last week. Rev. and Mrs. W. H. Elder attended the funeral, of Mrs. Doc Franklin at Hollywood Church Sunday afternoon. A very large crowd was there. Ronnie Richardson returned from a week in Kansas City, Mo. after a most delightful trip. Mr. and Mrs. S. E. Ranson spent Saturday night in Roanoke with Mr. and Mrs. Thurman Wilcox. The Friendship Circle had their November meeting with"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "with Mr. and Mrs. <mark>Thurman</mark> Wilcox. The Friendship Circle"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "with Mr. and Mrs. <mark>Thurman</mark> Wilcox. The Friendship Circle"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1869.62, 203.13, 2020.28, 846.45], "bbox_id": "20b2a7b2d9", "file": "AppomattoxNewspapers_1974-1975a_0071.pdf", "page": 1, "text": "NOV. 11 - Has November ever had more lovelier days than we have had so far. If many leaves make a hard winter, we have it. Trooper W. R. Roach has returned from a hunting trip to I Montana. Katherine Dickerson left last Tuesday on a trip to Hawaii. Rev. Don Wagner went to Winston-Salem, N.C. Tuesday for the day. Mr. and Mrs. S. E. Ran son and Mr. and Mrs. Thurman Wilcox left Saturday for Kings port, Tenn., to visit Mr. and Mrs. Strode Burks over the  week end. Sympathy is extended Mrs. Patsy Richardson in the death of her aunt, Mrs. Emma Reynolds of Appomattox, on Saturday night. Mrs. James Thackston of High Point, N.C. is visiting her mother, Mrs. Maude Ranson and sister, Mrs. Pearl Wilson. Mr. and Mrs. Ernest Farrar and Mr. and Mrs. Calvin Coleman left Friday to visit Mr. and Mrs. J. W. Allen and Mr. 1 and Mrs. Max Duffey, of Fairfax, over the week end. The R. A. leaders, Thomas Ranson and Joe Almond ac-i companied by Bill Caldwell and Lloyd Richardson took a num ber of R.A. boys to Richmond Saturday. The Rocks Quartet furnished the bus for them to  go and Herman Richardson donated the gas. Mr. and Mrs. Allen James of Winston-Salem, N.C., attended services at Rocks Church Sunday and were guests of Rev. and Mrs. Don Wagner and Gary. Dont forget the Foreign Mission Study at Elon Church on Thursday night at 730 p.m. Sunday is high attendance goal at Rocks. Wont you plan to help reach it and go over, if possible. Rev. Don Wagner will attend the State General Association in Roanoke this week. The Rocks Quartet went to Providence Church Sunday night to sing."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "and Mr. and Mrs. <mark>Thurman</mark> Wilcox left Saturday for"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "and Mr. and Mrs. <mark>Thurman</mark> Wilcox left Saturday for"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1628.63, 889.94, 1791.94, 973.16], "bbox_id": "c11ccf70fe", "file": "AppomattoxNewspapers_1908-1909a_0172.pdf", "page": 1, "text": "NOTICE I have secured a decree of court, to sell my property of Dr. A. G. Thurman located near Ap pomattox. Will sell either pub licly or privately. Write Mrs. Lessie Thurman, Vinton, Va."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "of Dr. A. G. <mark>Thurman</mark> located near Ap pomattox."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "of Dr. A. G. <mark>Thurman</mark> located near Ap pomattox."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1975.2, 1717.95, 2479.55, 1773.33], "bbox_id": "caa1d2b9b7", "file": "AppomattoxNewspapers_1912-1915a_0388.pdf", "page": 1, "text": "No capital stock. Object Hunt club ---- , for fox hunting and other sports. Geo. though his mind, poisoned perhaps by Barcl Rlveg president, Cobham F. the treachery he had suffered, was not   Thurman, secretory and treasurer,  ,jje shooting. He disappeared and ha. entirely free from guile. I . 3 j. Holloway, master of j not been located. Wright is a son of TO BE COWnMUEOJ i  I chariottesviUe.  Moses Wright, of Bristol."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "had suffered, was not   <mark>Thurman</mark>, secretory and treasurer,  ,jje"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "had suffered, was not   <mark>Thurman</mark>, secretory and treasurer,  ,jje"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1816.31, 217.72, 2164.92, 668.1], "bbox_id": "585418cde0", "file": "TimesVirginian_1983a_0008.pdf", "page": 1, "text": "Niée warm weekend. Much colder cake over WTTX. here now. Happy New Year to one Lawrence Stewart, of Richmond, and all. Many of the sick ones got spent a few days during  the home for Christmas. So thankful for Christmas with his sisters, Mrs. that. .4  W   v Evelyn Almond and Mrs. Gertrude Ufa. Luther Nash had to go bad Wooldridge of AppOmattox.  to the hospital for the fourth time It was good to have Mr. and Mrs. this,year and he hopes to be home Thurman. Wilcox,.of Roanoke, to before the year ends. A quick, visit here during the Christmas, recovery to wished him. Harry Almond, of Keysville Raymond Moore, of New. York, Nursing Home, w ss. in th e  arrived today to visit his father, W. community on Sunday.    R. Moore, and Bernard Moore who Many families had their children has been here for sometime with hto with them during Christmas for .father. dinner. Mr. and Mrs. Linford Cumby and A nice ordination service was held Mitty toft last Sunday to spend a Sunday for Frank Lee Elder who part of Christmas to Richmond with was ordained as new deacon at their daughter, Jean and family. Rocks. .Several more who were off Nancy Richardson, of Massachus- the Board were restored back, etts, arrived Christmas Eve to The new garment factory at spend Christmas-with her mother, Pamplta will open on January 2. Myrih Richardson, of Pamplto. This to-good news. Rev. and Mrs. Wes William Next Sundav, January- 2, will be spent Christinas day with her communion time at Rocks and mother, Mrs. Bennett, of Danville, baptizing service for refugees, Ri. A very nfoe Christmas Eve and Chin, service was held at the church. A Mrs. Roy Lucado to to a Richmond candlelight service .followed with hospital Get well wishes go out to communion. Then the group went her. . v qver to the parsonage for fellowship Mark Hipps and sons, Greg and time and the singing of Christinas Todd leftTueaday for Tennessee to carols. see his father for a few days. Greg The Rocks Community Club will hadnt seen his grandfather for m eet on January 13 in th e three years. The formers daughter, Fellowship Hall at 786 p.m. Note Kim, will arrive to January to spend change of date her leave here with her parents. The Friendship Circle will meet Congratulations to Mr. and Mrs. onJ January 4 at 136 p.m. with Mark Hipps who will celebrate their Nancy Williams at the parsonage.  25th wedding anniversary when all Congratulations to Opal and Ida the children get together later. Allen who had their 28th wedding December 28th is the anniversary anniversary last week and got the date."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "hopes to be home <mark>Thurman</mark>. Wilcox,.of Roanoke, to before"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "hopes to be home <mark>Thurman</mark>. Wilcox,.of Roanoke, to before"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [148.3, 241.3, 296.69, 1566.71], "bbox_id": "7e670c1806", "file": "TimesVirginian_1980a_0272.pdf", "page": 1, "text": "news Bred Allen of DQlwn. spent Mqndzy night with Scott Morris. Mr. usd Mrs. Roger Morris, Sarah and Becky were Sundey visitors of Ifr and m John Thurman at Midlothian.   M rs. Agee Glover C Hixbufg and M r. and M i Rico Seay of Anderson vflie .were recent visitors of lfa and Mrs. C . Henson M w iit Mr. and Mrs. Edward Senger spent Mat- week visiting relatives in Abbur- don, Bristol, Oeston, n T c . and Melvin, Kentucky. v.  Mr. and Mrs. Dale Senger wnd children attended home coming at Belfast Baptist Church at Crewe Sunday. Mr. and Mrs. Earl Morris of Farmville visited in the home of Mr. and Mrs. V. C. Proffitt Sunday.  Cook Hix, Kemper Beas ley, Sr. and Ja ck  Mania visited Howard Townsend and Rosser Fulcher in Virginia Baptist Hospital Sunday. Mrs. John Waycaster and children and Mrs. A . N. Morris were Friday visitors of Mr. and . Mrs. Charlie Parker in Lynchburg. They were also visitors of Mr. and M r.  Shorty Kidd of Dillwyn Saturday. Mrs. Jane Speck and daughter, Elizabeth Ann of Dunfries were Friday lunch guest in the home of Mr. and Mrs. K . M. Beasley, Jr . Kathy Beasley attended a slumber party.at the home of Cheyl Simpson at Appomattox Friday night and Mrs. K . M. Beasley, Jr . and Kemper IH spent the night with Mrs. Katherine Carson at Spout Spring. Mrs. Lucy Glover is a patient at Lynchburg Gen eral Hospital. Her visitors during the weekend were Mrs. C. W. Morris, Mrs. Virginia Maxwell and Mar tha, all of Appomattox, Mr. and Mrs. Charles Garrett of Evergreen M rs. Kerm it Cook of Chesterfield Linda Morris of Richmond Mr. and Mrs. Robert Glover of Lynchburg Mis. John Glov er of Appomattox. Mr. and M rs. Ralph Repass and Mrs. T. N. Saul were Sunday visitors of Mrs. Janie Repass at , Heritage Hall nursing home in Blackstone. Brenda and Susan Meek of Virginia Beach were week end visitors of Mrs. Charlie Forbes. Johnie Harris, Aaron and Adam visited her parents, Mr. and Mrs. A . G. Waycaster of Dillwyn Satur day. Gladys Morris Bethesda, Maryland spent the week end with her brother, Bruce. H. Flood Harris .of Green Bay visited Mr. and Mrs. Russell L. Harris Saturday. Mrs. Robert Metcalfe and Mary Ann and Allison Wade, all of Virginia Beach spent the weekend with Mr. and Mrs. W . T. Cook. Mr. and Mrs. Edward T . Cook. Kenneth and Randy of Prospect, M r. and Mrs. William L . Carter of Burke- ville joined them for lunch Sunday. r Robin Keith of Glen Allen spent last week in .the home of Mr. and Mrs. Roger Morris. Mr. and Mrs. JEtice Seay of AndereonviUe were Sunday night visitors in the same home. Rev. C. W . Shumaker of Victoria brougkt a very inspiring message at the Chestnut Grove Baptist Church Sunday. Rev. Jerry Halloway of Bon Air will preach Sunday, Aug. 24 at 11KW a.m. at the Chestnut Grove Baptist Church in the absence of the pastor who is on vacation. Mrs. V. C . Proffitt and Ethel and Mr. and Mrs. Kemper M. Beasley, Sr. were Wednesday visitors of Mr. and Mrs. T. C. Beasley at Troutville. Mrs. Louise Milar of Front Royal spent Wednesday night in the home of Mr. and M rs. C. Hanson Morris route home from a trip to Hawaii."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Ifr and m John <mark>Thurman</mark> at Midlothian.   M rs."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Ifr and m John <mark>Thurman</mark> at Midlothian.   M rs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1583.5, 240.95, 1905.95, 454.05], "bbox_id": "93d073a54e", "file": "AppomattoxNewspapers_1908-1909a_0486.pdf", "page": 1, "text": "Nelson Thurman, of Vinton recently spent a part of his va cation here. Mr. Thurman is a former resident of Appo mattox. -   , . . . . . __ Little Viola Blackwell cele- Lt, retifrned to lus home brateJ. her eighth birthday Richmond Wednesday. . g nday and Rebecca Johnson Mary Featherston IS èame in for her part of. the visiting her auntj, Mre. Mattie cejekration for her sixth birth day. Richard Leigh Burke, Jr., left last week with his uncle W. C. McGill, on a three weeks trip South, going as far as Florida. Leigh reports a fine trip. Mr and Mçs. A. R. Har wood, Mr. and Mrs. C. A. Han cock, Miss iaomi Hancock"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Nelson <mark>Thurman</mark>, of Vinton recently spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Nelson <mark>Thurman</mark>, of Vinton recently spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1453.85, 450.15, 1587.65, 479.6], "bbox_id": "994ba42995", "file": "AppomattoxNewspapers_1955-1957a_0408.pdf", "page": 1, "text": "nd Mrs. Kern Mays spent with Mr. and Mira. Thurman Altavista, Va."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "nd Mrs. Kern Mays spent with Mr. and Mira. <mark>Thurman</mark> Altavista, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "nd Mrs. Kern Mays spent with Mr. and Mira. <mark>Thurman</mark> Altavista, Va."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1912.46, 425.99, 2077.78, 1773.23], "bbox_id": "e462f00129", "file": "AppomattoxNewspapers_1892-1898a_0100.pdf", "page": 1, "text": "N ot U nlikely th a t Senator D an iel W ill B e Offered the P lace. The Richmond Times Washington correspondence Monday, says The question of the successorship to Judge Bond is one which is receiving a consideration in Virginia which has been unparalleled within the history of the State for the number of good men who are absolutely seek ing the office rather than the office seeking them. This is not the fact with the men whose names I have or will mention, as they are men whose friends and acquaintances have un- stintingly recommended them, inde pendent of theirown preferences in the matter. Virginia is the only onb of the States comprising the district, save that of South Carolina, which has not now a flattering representation in the federal judiciary, and conse quently it would seem within the bounds of legitimate reason that Mr Cleveland would well consider the candidacy of its meritorious citizens. In South Carolina the state of affairs is such that the President would hardly dare make an appointment without feeling assured that he an tagonized some element of Democ racy, and thus in our Commonwealth alone does he find a number of capa ble eligible and worthy men, which from their standpoint would natur ally be the subject of his considera tion. The story that Mr. Clevelands former desires to appoint Judge Keith, of Warren ton, asohief justice of the District Court, is fresh in the minds of all of our people, and the fact that his commission, already made out, was withheld only at the personal request of Judge Thurman, who was his partner upon the national ticket, warrants, at least, the assumption that now the judge may receive his most favorable inves tigation. It is reported today that Senator Ransom, of North Carolina, is a candidate for this position, and his recent action in the Senate may have some tendency to impress upon the President his claims, yet the fact remains that Senator Ransom has not been in active practice for more than twenty years, and indulging, as he has continuously, in the details of politics, he has detracted very much from what years ago would have been a formidable application. The two latest aspirants for the office are said to be Judge S. G. Whittle of Henry county, and Judge Berryman Green, of Danville, both of whom are gentlemen well equipped for the place in question. However, they will hardly be considered by the President in advance of Con gressman Tucker, the Hon. C. V. Meredith, of Richmond, or others whose claims have already been pre sented. Beyond all of this there may be possibly a surprise in store for the people of Virginia, growing out of the fact that Mr. Cleveland has always proven a man of surprises. The average guesser would hardly suppose that Senator John W. Dan iel would be selected for a place like this, owing especially to the fact that he led the opposition to Mr. Cleveland in the State campaign of 1892, and during the recent debate in the Senate he has preferred to ally himself with the interests which were most pronounced to the panacea propounded by the President. Yet the appointment of ex-Senator Eustis  of Louisana, to the Court of St. Jamees was no more of surprise than ! that which would be created by the appointment of Senator Daniel, and j yet Mr. Cleveland named him for ! that important post. The adminis- ! tration has already signified to some of the callers that the candidacy of Major Holmes Conrad and General Lee for the United States Senate was equally agreeable to the President, and that he would aid them as far as possible The appointment of Sen ator Daniel will leave, of course, an opportunity for both of these gentle men to come into the United States Senate, and while it is assured that I one of these places will be captured by either General Hunton or Hon. j Thomas S. Martin, of Scottsville, it is possible that Mr. Cleveland would j prefer to have any of the allies in"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "personal request of Judge <mark>Thurman</mark>, who was his partner"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "personal request of Judge <mark>Thurman</mark>, who was his partner"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1654.3, 1085.93, 1822.64, 1429.81], "bbox_id": "fdd9624970", "file": "TimesVirginian_1983a_0258.pdf", "page": 1, "text": "my specialty, too says. .Its ray malion-doUar secret. A native at Thurman, W. Va., Maude haa been oooking for mere than 40 years. She was reared near Bent Crook in Appomattox, and moved to Washington, D.C., in her Into teens. A fter  working in Washington for ID years, she returned to Appomattox in 1945 to cu e for her father and er, who had taken ill. While caring for her father and grandmother, she began baking tarts and pies, which were sold in Appomattox at Gobeis Service Station and Mrs. Reynolds Grocery Store. Response to her baked goods was, so good that she opened a small restaurant in December at 1946. a couple at miles east of the town of Appomattox on Route 460. Four years later, in i960, Maude moved her restaurant to a new building on west of the town at Appomattox on Route 460. Though she left that business to move to Lynchburg in 1967. the restaurant still bears the name Maude rad attracts customers from here and elsewhere who through the years have grown accustomed to the film"}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "secret. A native at <mark>Thurman</mark>, W. Va., Maude haa"}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "secret. A native at <mark>Thurman</mark>, W. Va., Maude haa"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.48, 727.01, 1498.88, 757.86], "bbox_id": "bfe4ee576c", "file": "AppomattoxNewspapers_1954-1955a_0394.pdf", "page": 1, "text": "Mrs. Thurman Wayne are  mother, Mrs. Susie Roach ton, D. C."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Wayne are  mother, Mrs. Susie Roach ton, D. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Wayne are  mother, Mrs. Susie Roach ton, D. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [355.7, 520.11, 522.1, 569.01], "bbox_id": "45532d3c7c", "file": "AppomattoxNewspapers_1955-1957a_0378.pdf", "page": 1, "text": "Mrs. Thurman Wayne and Mrs. Luther Nash are visiting their sis-- ter, Mrs. Daye Oarwile, at Wash ington, who has been on the sick list, but is better now."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Wayne and Mrs. Luther Nash are visiting their sis-- ter, Mrs. Daye Oarwile, at Wash ington, who has been on the sick list, but is better now."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Wayne and Mrs. Luther Nash are visiting their sis-- ter, Mrs. Daye Oarwile, at Wash ington, who has been on the sick list, but is better now."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [430.54, 695.32, 596.24, 733.87], "bbox_id": "97e224c52b", "file": "AppomattoxNewspapers_1955-1957a_0228.pdf", "page": 1, "text": "Mrs. Thurman Wayne and Miss Edna Mae Davis spent the week end with relatives at Washington, D. C."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Wayne and Miss Edna Mae Davis spent the week end with relatives at Washington, D. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Wayne and Miss Edna Mae Davis spent the week end with relatives at Washington, D. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1297.9, 354.87, 1458.49, 383.37], "bbox_id": "1befade589", "file": "AppomattoxNewspapers_1939-1943a_0303.pdf", "page": 1, "text": "Mrs. Thurman Large, of Cine, nati, Ohio, spent last week with her sister, Mrs. R. H. Lucado."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Large, of Cine, nati, Ohio, spent last week with her sister, Mrs. R. H. Lucado."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Mrs. <mark>Thurman</mark> Large, of Cine, nati, Ohio, spent last week with her sister, Mrs. R. H. Lucado."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1604.9, 786.99, 1776.54, 835.18], "bbox_id": "7c622e2ab3", "file": "AppomattoxNewspapers_1960-1962b_0647.pdf", "page": 1, "text": "Mrs. Rosa Marks returned home Wednesday from North Carolina with her son-in-law, Sgt. Thurman Wilcox, who was enroute to Washington for a few days."}, "highlight": {"text": {"matched_tokens": ["Thurman"], "snippet": "Mrs. Rosa Marks returned home Wednesday from North Carolina with her son-in-law, Sgt. <mark>Thurman</mark> Wilcox, who was enroute to Washington for a few days."}}, "highlights": [{"field": "text", "matched_tokens": ["Thurman"], "snippet": "Mrs. Rosa Marks returned home Wednesday from North Carolina with her son-in-law, Sgt. <mark>Thurman</mark> Wilcox, who was enroute to Washington for a few days."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
