{"document": {"bbox": [1423.87, 1012.51, 1604.05, 1795.8], "bbox_id": "3f8ddc6afa", "file": "AppomattoxNewspapers_1926-1933a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first, M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third, M F Moon. White potatoes, first, Mrs W A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, H ailey  Inge second, Mrs T H Inge. Mixed peas first, S L Ferguson second, Howard Inge third, T H I Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, Homer Babcock. Potato pumpkin, first, G W Reynolds second, R A Jones third, Miss Annie Caldwell. Watermelon, first, L E Smith second, M F Moon. Three squash, first, Mrs Wi P Gills, Egg plants, first, Mrs E L Smith. Navy beans, first, Mrs R F Jamerson second, Ira Burrell, third, C F Moore. Butter beans, first, Mrs Guy Smith second, Ira Burrell third,  Mrs E M Stratton. ! Lima beans, first, Mrs M C  Smith. Sheaf wheat, first, Willie Moon. Irish potatoes, first, J E Bur nett second, Guy Smith third, M C Smith. Green mountain potatoes, first, F T Cawthorn second, BessieI Gunter. Stalks cane, first, M F Moon, second, RC Jones third, C S  Cawthorn.  Sweepstakes, first, W W Far rar, second. W W Farrar, third, Mrs J R Caldwell. Peanuts, first and second none third, George Carson. Buckwheat, first, Mrs. H B Marshall. Celery, first, Mrs C R Cald- I well, second, Mrs. C R Caldwell. Beets, first, Mrs W A Moon, second, Raymond Tinsley Craw ley, third, Guy Smith. Stalks corn, first, Stratton Bros. Sheaf of wheat, first, none, second, William Moon. Bale hay, first, E L Smith. Bunch soy beans, first, Mrs 0 L Scheffler, second Ira Burrell, third, W W Farrar."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "A Moon, second, Raymond <mark>Tinsley</mark> Craw ley, third, Guy"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "A Moon, second, Raymond <mark>Tinsley</mark> Craw ley, third, Guy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1892.41, 293.81, 2036.97, 362.43], "bbox_id": "8cf9ef2164", "file": "AppomattoxNewspapers_1962-1965a_0518.pdf", "page": 1, "text": "William A. Smith, the said Ralph C. Lester having resigned as Trustee and the undersigned, Robert E. Tinsley, having been j duly appointed according to the terms of the Deed of Trust here-1 in referred to on September 10"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "the undersigned, Robert E. <mark>Tinsley</mark>, having been j duly"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "the undersigned, Robert E. <mark>Tinsley</mark>, having been j duly"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1776.03, 301.6, 1941.21, 1645.64], "bbox_id": "86dd2cfd5d", "file": "AppomattoxNewspapers_1902-1905a_0064.pdf", "page": 1, "text": "Virginia pensionsLewis Pende- gast and Philip Grigliette, both of Na tional Soldiers Home. Elizabeth City county, 8 each Charles Gordon, N a tional Soldiers Home. Elizabeth City county,  12  Lucy A. Pullin, Luray.  8  Joseph Mi.ler, N ational Soldiers Home, Elizabeth City county, ao Charlotte W hitlock, Otlio,  8  minot of John J. Long, Bridgewater, io Agnes H atton, Tanners Creek.  8  W alter Sm ith, H ickory,  8  John Smith, National Soldiers Home, Eliza beth City County,  8  John Arrnel. Armcl, io Levin Griffin, Townsend,  8  AvecyB. Howell. Roan.-ike,  8  Israel Butt, Berkley,  6 . Dick C arter shot and fatally wounded Clarence Hodges, aged 18 years, in H odges home, in Roanoke. It seems that Carter, who hails from W inston, N. C., went to Roanoke with a companion named Shelton. They were going to W est Virginia, but, it is alleged, C arter drank heavily and went ino the room s over a saloon occupied by. Fannie H odges and her son. H e claimed to be a Secret Service agent of the Governm ent, it is said, and un dertook to dislodge the tenants. W il liam M artin grappled with hint in his attempt to shoot young Hodges, but . failed in his effort. The bullet entered the left side of tire neck and evidently lodged about the spinal cord. H is en tire body was paralyzed and his con dition is extrem ely serious, fa rte r at tempted to escape, but was captured and lodged in jail. A trial in Stafford County Court in volving the ownership of a cow afford ed much amuiement to a large crowd of spectators. Joe Baker had been a tenant on the Green Bank farm of M ajor W. S. Ernbrey for 16 years, and was displaced. In turning over the farm property Baker claimed a certain cow as thc property of his wife. M ajor Embrcy was confident thc cow belong ed to him. The case first came up in a m agistrates court, and was removed to thc County C ourt of Stafford, where four lawyers took part in the proceed ings before Judge Chichester. .The case went against Baker, and wasap pealed, and will b e . carried to the cir cuit Court. Mrs. Baker, who claims the cow, though only 43 years old, is thc m other of 17 children. 1.4 of whom arc living and 5 are married. In the Circuit Court at W inchester. S. H. Braithvvaite was given 1200 damages against Charles K. M cllwee for alienation of his wifes affections. Mr. Baithwaite asked for 5000 dam  ages, claiming that M cllwee had not only alienated his wifes affections, but had also caused her to desert him and his five children. All the parties con cerned are prom inent residents of the county. Some sensational evidence was introduced during the trial. G eorge Christian, colored, was elec trocuted at N ew port News by coming in contact with a live wire. H e caught hold of the wire leading to a 16 -candle- power light at a point where the insu lation was worn off. It is thought the feed wire m ust have been crossed witlj a street wire, as death was instantane ous and there was current enough to burn off three fingers. The barn of J. A. Storm , near Lew- insville, Fairfax county, was burned and 14 horses and four cows were burned or lost in the fire. J t is esti mated that the loss will be over  4000 . Panhandle coal operators refuse to accept the scale adopted at thc subdis trict conference and state that they will oppose it to the last. Business men of Crewe have formed a trade organization, with these officers President, Thomas B. O liver first vice- president, C. E. W ilson secretary, B. N. W aterhouse treasurer, Capt. E. F. Loc kett. The Virginia Anthracite Coal Com pany is building a railroad to open up the large area of coal lands iii Mont gomery county. The line will later be extended so as to run from Christian- burg to Blacksburg. George Tinsley, one of five negroes charged with robbing German sailors of the steamship Albano, was given eight years in the penitentiary ait Newport News. The evidence showed that i ins- ley was in the crowd that beat the sail ors. The fact that several German coins lost by one of the sailors were found in his pockets convicted him. Thc Jamestown Exposition advocates in thc House have thc whip-hand, and succeeded in defeating the bill to appro priate an additional  100,000 for the im provement and enlargement of the Capi tol. They also succeeded in having April 2 set as a date for again taking up the Jamestown appropriation. 1 he Mann Prohibition bill was prac tically killed in the Senate Finance Com mittee after being so amended as not to apply to towns of over 1,000 or to sum mer resorts. A business mens league has been formed at Buena Vista with R. W. VVin- borne as president. Anoth i-annery is under construction at the lower end of Arnolds Valley, Rockbridge county, owned by R. McC. Paxton  Bro. and T. Rapp. The contracts have been let for build- ing-at Cape Henry a pavillion which will accommodate 15.000 people and cost  30 , 000 , and also for bathhouses near by. The buildings will he finished in about 60 days. W ork will begin this wreek. Fish -are beginning to run well in the Potomac and Rapnahannock rivers and their tributaries. H erring arc now sell ing for i.Co per hundred, shad 40 cents to 80 cents a pair, perch 15 cents to 50 cents a bunch and rockfish 30 cents to 60 cents a hunch. Sheriff Curtis, of Hamoton. has re ceived information that Emmett Lends, colored, who is wanted in Hampton on the charge of killing George Davidson, is in Cincinnati. Samuel Carey, colored, said to be the oldest man in Virginia, died at his home on M ulberry Island, in W arwick county. Carey leaves several sons, all of whqm have reached an advanced age. H e claimed to be 117 years old. At W illiam sburg the jury acquitted Nancy Thornton, the negro conjur er, who was charged with the m urder of her husband. The m arriage of Miss K atherine Crawley to Mr. Elisha W oodfin M ad ison is announced to take place at Centenary Church, Stoddcrt, on April 1 st."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "burg to Blacksburg. George <mark>Tinsley</mark>, one of five negroes"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "burg to Blacksburg. George <mark>Tinsley</mark>, one of five negroes"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1018.11, 1337.42, 1162.57, 1767.9], "bbox_id": "21384da900", "file": "TimesVirginian_1976_0077.pdf", "page": 1, "text": "VIRGINIA Ita the Clerks Office of the Circuit Court of Appomattox County, on the 23rd day of February, 1976. IVY WILLIAM BURKS Plaintiff Against LOUISE H. DEAN BURKS, 5138 Yellow Pine Street Si. Petersburg, Florida 33709 The object of this Suit is to obtain a divorce a vinculo matromonii from the defend ant on the grounds that since May, 1973, your complainant and defendant have lived separate and apart without any cohabitation and uninterrupted down to the present time. And it appearing by affidavit filied that the said defendant, Louise H. Dean Burks is a non-resident of the State of Virginia, and that her last known Post Office address was 5133 Yellow Pine Street, St. P etersburg, Florida 33709 hereby required to appear Within ten days after the due publication of this order and do is jhecessary to protect hdr interests. Tst6 I BARBARA R. WILLIAMS,   Gerk ROBERT E. TINSLEY, p.q. Attorney at Law P 0 , Box 246 Amherst, Virginia 24521 2-26-4t"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS,   Gerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS,   Gerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1666.1, 876.65, 1812.77, 1309.27], "bbox_id": "2ab1724a97", "file": "TimesVirginian_1976_0092.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomattox County, on the 23rd day of February, 1976. IVY WILLIAM BURKS i Plaintiff Against LOUISE H. DEAN BURKS, 5133 Yellow Pine Street  t. Petersburg, Florida 33709 , The od jeet of tius suit ix to obtain, a divorce a . vinculo matromonii from the defend ant on the grounds that since May, 1973, your complainant and defendant have lived separate and apart without any cohabitation and uninterrupted down to the present time. And it appearing by affidavit filed that the said defendant, - Louise H. Dean Burks is a non-resident of the State of Virginia, and that her last known Post Office address was 5133 Yellow Pine Street, St. P etersburg, Florida 33709 hereby required to appear within ton days after the due publication of this order and do what is necessary to protect her interests. Tosto BARBARA R. WILLIAMS, Clerk ROBERT E. TINSLEY, p.q. Attorney at Law P. 0. Box 246 Amherst, Virginia 245212-26-4t"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS, Clerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS, Clerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [425.74, 535.33, 570.22, 969.66], "bbox_id": "74c3a3eb5c", "file": "TimesVirginian_1976_0084.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office ef the Circuit Coart of Appomattox County, on the 23rd day of February,1976. IVY WILLIAM BURKS Plaintiff Against- LOUISE H. DEANBURKS, 5133 Yellow Pine Street St. Petersburg, Florida 33709 The object of this suit is to obtain a divorce a vinculo matromonii from the defend-, ant on the grounds that since May,. 1973, your complainant and defendant have lived separate and apart without any cohabitation and uninterrupted down to the present time. And it appearing by affidavit filed that the said defendant, Louise H. Dean Burks is a non-resident of the State of Virginia, and that her last known Post Office address was 5133 Yellow Pine Street, St. Petersburg, Florida 33709 hereby required to appear within ten days after the due publication of this order and do what is necessary to protect her interests, Teste BARBARA R. WILLIAMS, Clerk ROBERT E. TINSLEY, p.q. Attorney at Law 0. Box 246 Amherst, Virginia 245212-26-4t"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS, Clerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS, Clerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1651.7, 189.25, 1796.9, 620.44], "bbox_id": "ca0a9329c9", "file": "TimesVirginian_1976_0101.pdf", "page": 1, "text": "VIRGINIA  la thé Clerks Office of die Circuit Court of Appomattox County, on the 23rd day of FobroaryfT976. IVY WILLIAM BURKS Plaintiff Against LOUISE H. DEAN BURKS, i f 5133 Yellow Pine Street   St. Petersburg, Florida 3?ÎÎ9 The object of this suit is to obtain a divorce a vinculo tnatromonii from the defend ant on the grounds that since May, 1973, your complainant and defendant have lived separate and apart without any cohabitation and uninterrupted down to the present time. And it appearing by affidavit filed that the said defendant, Louise H. Dean Burks is a non-resident of the State of Virginia, and that her last known Post Office address was 5133 Yellow Pine Street, St. Petersburg, Florida 33709 hereby required to appear within ten days after the due publication of this order and do what is necessary to protect  her interests. Teste BARBARA R. WILLIAMS, Clerk ROBERT E. TINSLEY, p.q. Attorney at Law P.O. Box 246 Amherst, Virginia 24521 2-26-4t"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS, Clerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "WILLIAMS, Clerk ROBERT E. <mark>TINSLEY</mark>, p.q. Attorney at Law"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1644.21, 308.81, 1805.71, 1532.35], "bbox_id": "8a5199706d", "file": "AppomattoxNewspapers_1902-1905a_0080.pdf", "page": 1, "text": "V irginia pensions W illiam Tipton? Pine Top, io Patrick M cGowan, io Thomas R. H icks, 12, and Charles A. Bacon, 17, all at National Soldiers Home, Elizabeth City county James Berkley, 12 Herman Scheibe, 10 both of National Soldiers Home, Eliz ibeth City county Henrietta V . West. Onancock, 12 Daniel McGowan, Sol diers Home. Elizabeth City county, 5  6  Levin BuXter, Soldiers Home Elizabeth City county, 12 Nancy Cor nick, N orfolk, 8 minors of Daniel J Reedy W ar with Spain. Portsmouth, 16 Isaac N. Swatz, Broadway, 6 John L. Ellison, Chatham, 12 Lean der Gilbert. Dryden, 10 Thonia Daily, 10 William Cox, 8, Nationa Soldiers Home. Elizabeth City county Margaret A. Dunning, Norfolk. 8 Elizabeth A. Copeland, W est End, 8 M ajor Alexander Quail, of Iowa, anc his bride, who was Mrs. Maggie Rawl mgs, of Spottsylvania, arc now on an ex tended bridal trip North. This marriage occurred a few days ago at the home oi the bride, and the courtship leading ur to it was most romantic. M ajor Quail while in Fredericksburg last year, save the photograph of Mrs. Rawlings, anc when lie returned home he wrote to her rhis led to a correspondence, which cul minated in their marriage at their first meeting. M ajor Quail is a man of con siderablc means and his bride is an ac complished lady. They will for the pres ent reside at Spottsylvania Courthouse A son a i Mr. Edgar Goodrick, oi Fredericksburgv had his leg broken anc his foot badly mashed by being caught ir. a pile of rolling railroad ties on which he was sitting. Former Mayor Davis Edmondson Mrs. Lucy Maltestcr and Albert Rhodes of Middletown, were held on it addi tional indictments, charging arson anc robbery, by a special grand jury in the County Court. Edmondson and photic are under indictment for burning Ed mondsons property to secure the insur ance. These latest indictments charge that Edmondson, through revenge, hirec Rhodes to burn other valuable husinesi property after robbing it. and that the Maltester woman acted as their fence. Both houses of the Virginia Legisla ture agreed on a bill to prevent chile labor in factories and it was sent to the Governor for his signature, which wili make it a law of the State. The bill at agreed upon is practically the Lyle bill, the House receding from its principal amendments. It provides that no chilei under 12 years of age shall be employee in factories in this State and regulate the hours of work for children under 1 1 years. An official statement was made thal the T. C. Williams Tobacco Company of Richmond is to be sole! to the British American Tobacco Company and thal the deal is about to be closed. The W il liams Company has an enormous forcigr trade, enjoying almost a monopoly ir. Australia, and it was for this reason tha the trust was so anxious to acquire it. The four Belgian sailors from the British steamship St. George, arrested a Newport News on the charge of smug giing tobacco ashore, were released bj United States Commissioner Garret. The Commissioner did not think the tobaccc would have been brought ashore but fo  solicitation, on the part of the ge-bc tween, who already had arranged for the capture of the alleged smugglers. A lex Johnson, colored, was drownee in the Rappahannock river, near P or Royal. He was out in a skiff, which war upset by the high winds, and though ai expert swimmer, did not succeed ir reaching the shore. The National Elks Home at Bcdforc City will be dedicated on M ay 21. The orator for the occasion will be Meade D Detwellcr, of Harrisburg, Pa. Addresses will lie made by Senator Daniel and Governor Montague. By the collapse of a floor overloaded with brick four workmen On the Frs National Bank building at Harrisburg, were precipitated from the third story tc the ground. A white man named John Long was killed. French Turner, col ored, received injuries from which ht cannot recover and two colored boy? were badly hurt. Ihe Petersburg Chamber of Com merce and the Young Mens Business Association were consolidated under the name of the Petersburg Chamber oi Commerce. Simon Seward was elected president. Miss Ida Briscoe, a young girl about 16 years of age, was killed by the acci dental discharge of a shotgun neat Abingdon. The trouble between Parkersburg and the Baltimore and Ohio Railroad Com pany has been compromised. The city grants the railroad the right to lay track for a few feet on Avery street, and th railroad promises to lay no more track. there without 30 dav notice. Members of the Virginia Legislature arc to play bail in Richmond for the benefit of the Confederate Bazar. Clifton Maynard was arraigned in 1 Richmond court, charged with stealing diamond rings from a jeweler. Aftei changing his name in the indictment tc Manor he pleaded guilty and was sent tc the reformatory. George Blaine, who was shot in Staun ton by a Chesapeake and Ohio con ductor, is wanted by Roanoke authori ties, charged with killing a conductor o the Norfolk and Western, near Roanoke Blaine is in the Staunton jail. The large barn and its contents on th farm of Tinsley H. Twyman, of Spott sylvania county, was destroyed bv fire High winds were destructive to fishing property along the Potomac river. It Potomac creek a large skiff , was cap sized and sunk, three fishermen having a narrow escape from drowning. An increase of wages has been grantee to boiler-makers of the Norfolk anc Western Railroad"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "on th farm of <mark>Tinsley</mark> H. Twyman, of Spott"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "on th farm of <mark>Tinsley</mark> H. Twyman, of Spott"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [822.72, 227.21, 983.17, 945.0], "bbox_id": "00c7e94681", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "Unofficial, though approxi mately correct. Serial No. Name 258, Frank P Glover 458, Samuel Scruggs 576, Bedford Morris 887, Joseph Hill Fulcher 275, Hal F Clark 509, Charles Rock Scruggs 564, Jasper Jackson Smith 596, James Edward Alvis _ 536, John Millard Lucado 548, John McCormick 126, Peroy B. Whitaker 107, Wm. Samuel Reynolds 616, Robert Jackson Garrett 373, Robt. Coleman Thornton 486, Harvey Lee McFadden 507, Samuel Henry Morgan 309, Joe Hancock 637, S Guy Smith 604, Charles Lester Carson 43, Archer Wade Gallier 420, Alvis Louis Herncall 488, W alter W Scott 514, Raymond Bell 10, H M Burge 140, Hallie Dillard 487, Hurley Ashby McFadden 87, Casper Lyle Forsythe 482 Oscar L Scheffler 18, John Wesley Coleman 658, Robert Lee Abbott 601, Jack Sears Caldwell 606, Joseph W Crews 513, Everett W. Blackwell 46, Robert T Gills 182, Dudley McCaw Johnson 223, Dean Alpha Pugh 117, James Henry Stanley, jr 890, Conrad R Brown 75, Lacy D Marshall 280, Hurley Clem Davis 332, John Cage 379, Allen Walker 194, Frank Wm. Fleshman 552, Wm. Albert Owen 298, Joseph B Tinsley j 675, Thomas Edgar Moore I 348, Henry Clay Holesapple 15, Thomas Ennis Childress 452, Calvin Chanie Woods j 855, Alex Price ! 530, Herman Harding 645, Dobney Clinton Tweedy . 218, Philip O. Paulett j 620, Frank Edward Jennings I 550, Oscar L. McCormick 31, Tomie Wiley Ferguson j 574, Ulysses S. Austin i 677, Cogineeo McCoy"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Owen 298, Joseph B <mark>Tinsley</mark> j 675, Thomas Edgar"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Owen 298, Joseph B <mark>Tinsley</mark> j 675, Thomas Edgar"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1041.28, 1179.36, 1204.48, 1243.51], "bbox_id": "04591f4d84", "file": "AppomattoxNewspapers_1922-1923a_0220.pdf", "page": 1, "text": "ually added per acre in fertilizers if dissem inated through the first two feet of the soil would scarcely show on analysis, and yet w e know that they show a marked effect on the yield of the crop.J. D. Tinsley, in the Amer ican Cultivator."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "of the crop.J. D. <mark>Tinsley</mark>, in the Amer ican"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "of the crop.J. D. <mark>Tinsley</mark>, in the Amer ican"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2177.25, 241.5, 2325.28, 888.93], "bbox_id": "a63914bba1", "file": "AppomattoxNewspapers_1962-1965a_0530.pdf", "page": 1, "text": "TRUSTEES SALE Pursuant to the term s of a deed of trust dated July 10, 1961, granted by Louis Lee Pannell, single, arid Fayne Rene Hubbard single, to Ralph C. Lester and W illiam A. Sm ith, the said Ralph C. Lester having resigned as Trustee and the undersigned, Robert E. Tinsley, having beeh duly appointed àcctordlng to the term s of the Defcd tot Trust here to referred to ton Keptetober 10, 1964, as substitute Trustee act ing under thè aftoresaid Deed of Trust which Is of record to the Clerks Office of the Circuit Court for the County of Appo m attox, Virginia, to Deed Book 74 at page 240, default having been made to the paym ent of debt thereby secured and being requested so to do by the holder of said debt, the undersigned w ill, on the prem ises on Satur day, the 28th day of November. 1964 at 200 oclock p m ., se ll ak public auction to the highest bidder, for cash, the following described real estate, to-wlt AH of that certain fat and parcel of land situated about one m ile South of the Vil lage of Stonewall in Stone wall M agisterial D istrict of Appomattox County, Virgin ia and being a portion of the real tostate that was deeded onto the said Mary Lambert Hubbard by a deed dated May 1. 1953 duly adm itted to record in the Clkers Office of the Otrcuit Court of Appo ni ottox County in Deed Book 58 at page 472 thereof, which parcel of laud hereby con veyed la m ère specifically described as folio wb  Beginning at a point 107 ft. West of the boundary lino of  Thomas Hubbard w here ft adjoins S t a t e Secondary Road Nto 608 and thence In a general northwestern direc tion 200 feet to a point 167 feet West of the lands of Thomas Hubbard hence la a general W estern direction parallel with Road No. 608 50 feet thence in a general Southern direction back to State Secondary Road No! 608 200 feet parallel with the first line run here in above m entioned thence along the northern edge of Ropd No. 608 50 feet on State Second ary Road No. 608 and ex-"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "the undersigned, Robert E. <mark>Tinsley</mark>, having beeh duly appointed"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "the undersigned, Robert E. <mark>Tinsley</mark>, having beeh duly appointed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1914.7, 442.25, 2235.8, 954.28], "bbox_id": "3eacbcfdc7", "file": "AppomattoxNewspapers_1915-1918a_0091.pdf", "page": 1, "text": "Tower Bill. The new year came in like spring and thsYfbrmers coml menced cleaning up and plow ing, hut winter Mt in Friday in 1 which had been selected, ready earnest and thegpround is now l filled by Bro. Carson were then covered with snow. I guesaI passed to each member of the that people ho have ice- lecbooi as their names were cal- houses aré thinking about get ting ice.  fiÜf There were sotpe visitors in our neighborhood Xmas. Mr. Richard Vlujjlps, of New- pòri News, w iifM tin g his old! home Mr. W illiam Mills and child ren, Mr. and Mrs, Howard Cash and little son add Mrs. Bessie Cunningham, all of Lynch burg, spent Xmag at Mr. W. A. I Wells. Mr. W. R. Tinsley, of Roa noke, spent several days in this neighborhood last week. He was tfc e guest of J W. Dix on while here. i Mr. R. H. Clark, the county surveyor of Buckingham, was also in the neighborhood doing some surveying. Our W. M. Society meet every third Ounday after preaching. Our Sunbeam So oiety meets at Mr. A B. Thorn - bills every first fiundav after noon at 2 oclock. Mr. Thorn hill is our president and will be glad for all the children to meet there every first Sunday afternoon.  Misses Willie. And W alter Tinsley, of Roanee, who were visi tiñg frieowìfiwthis"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Wells. Mr. W. R. <mark>Tinsley</mark>, of Roa noke, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Wells. Mr. W. R. <mark>Tinsley</mark>, of Roa noke, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1375.45, 587.08, 1500.22, 642.58], "bbox_id": "a76343a77c", "file": "AppomattoxNewspapers_1902-1905a_0188.pdf", "page": 1, "text": "Tinsley, ?!f Culpeper, a cadet at Linia Polytechnic Institute was vw and killed by a tram at the 4 depot in Salem. He was 22 years Ti b supposed that he accidentally ora a passenger train and was run freight. His body was terribly"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "<mark>Tinsley</mark>, ?!f Culpeper, a cadet"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "<mark>Tinsley</mark>, ?!f Culpeper, a cadet"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [519.08, 371.94, 680.36, 886.13], "bbox_id": "1eec58ac90", "file": "AppomattoxNewspapers_1933-1936a_0232.pdf", "page": 1, "text": "Those from Trinity who attended the quartelyCnference at Herman last aturday were Messes W. A. Weakley and son Otto, Charlie and Thomas Martin,, A. F. Drinkard, H, R. an J. J. Moore Misses Elizabeth and Gladys Cole man of Oakville were viisitors of Mr. and Mrs. M M Drinkard last week. w. A and Mrs. W. A. Weaklev and children spent Sunday week in Roanoae wuh his son Ott Weakley .aid family. A. B. Chick was dinner guest on ast Thursday of Mr. and Mrs M. M Drinkard. In the afternoon allthe ab ove were guests af Mr and Mrs. A., F. Drinkard. J. I. Moore had misfortune last Sat, eve to have one or more ribs broken by a milk cow who was waddling oil the flier and butt him in the side The accident was very painful until thi Dr. came and banaged his side. About twenty of our Epworthers had a weiner social at Mrs. A. D. Krinkards last Sat. night. They had planed to have the outing on the river near Stapleton but weather pevented. The committee on childrens day at Trenity have set fourth Sunday morn at regular preaching hour to have  hr program. Mrs, C. E Carson, Mrs. Lyle Cald well and two daughters were Friday guests of the formers sister, A. F. Drinkard. Mr. R. A? Weakley on last Sat visited his daughter Mrs. G. C. Wil- nv-r at Piney Ridge. F. E. and Ed Andrews were dinner guests of Mr. and Mrs. J. T Moore on Sunday week Misses Edith and Helen Martin of Oakville accompan ied them to their home in Roanoke xor a week visit. W. R. Tinsley was in the neighbor hcod last week attending to business ind spent the night in the home of Mr. and Mrs. A. F. Drinkard. Miss Mckie Langhon who recently spent a week in Lynchburg as the of Mrs. C. M. Harvey reports a most enjoyable visit, while there she had some dental work done. Born to Mr. and Mrs. Hazel Camp- bel on june 6th a baby girl."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "week visit. W. R. <mark>Tinsley</mark> was in the neighbor"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "week visit. W. R. <mark>Tinsley</mark> was in the neighbor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [861.34, 220.62, 997.54, 514.51], "bbox_id": "f26c947441", "file": "AppomattoxNewspapers_1974-1975a_0357.pdf", "page": 1, "text": "these vital raw m aterial suppliers, but took this opportunity to spell out details of the insurance program and the Sears merchandise bonus plan that it is making available to them. Following the indoctrination Rhett Mozingo, Wood Procure ment Manager. Tom Marshall, Assistant Wood Procurement Manager and Woodyard Mana ger, and their team of Foresters - Mike Gibbs, Blair Meredith, Marvin Tinsley and Jim Wood - hosted the group at a barbecue on the mill grounds. With start-up so close at hand, the event was most timely. Once in production, the mill will require some 3,500 cords of pulpwood per week. This continuous need will provide hundreds of loggers in the area with a dependable market for their harvest - a fact that both Virginia Fibre and the wood producers appreciate."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Gibbs, Blair Meredith, Marvin <mark>Tinsley</mark> and Jim Wood - hosted"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Gibbs, Blair Meredith, Marvin <mark>Tinsley</mark> and Jim Wood - hosted"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.88, 255.85, 2004.97, 1518.79], "bbox_id": "b295bad360", "file": "AppomattoxNewspapers_1922-1923a_0214.pdf", "page": 1, "text": "Thelma, the five-year-old daughter of Nickolas Ferrell, of Lamberts Point, who was badly bitten by a dog, is the object of great anxiety. Her face was so lacerated that six stitches were re quired to close the wounds and one of her teeth was forced out. The dog was lolled and its head sent to the Pasteur Institute to ascertain if the animal was mad. While the dredge of the Atlantic Dredging Company was dredging the Ap- pamattox River at Petersburg it brought up a live turtle, the largest ever seen in that section. It measured 28 inches wide and 40 inches long and took two men to take it off the cutter head of the dredge. Alfred Gastons, a well-known negro of Westmoreland County, while digging a well, near Hague, was killed by the cav ing in of the sides of the well. He was suffocated. It was announced at Lynchburg that J. C. Paxton, a lime manufacturer, of Woodstock, had given 5,000 for the pur pose of erecting a new cottage at the Presbyterian Orphanage, which is located near Lynchburg. - The members of the Lynchburg bar tel egraphed Judge Beverly Crump an ex pression of their confidence in his per sonal and official integrity, and express ing themselves as believing he is still thoroughly competent in all respects to remain as a member of the State Corpor ation Commission, despite the censure placed upon him by the investigating committee of the Legislature. The pa per was circulated by J. Tinsley Coleman, Who was associated with the defense of J. Samuel McCue, who was hanged at Charlotteesville. It was signed my many attorneys. Henry Campbell, a traveling salesman, whose home was at Middlesboro, Ky., was found dead in his room at the John son Hotel, at Pennington Gap. By his side was an empty laudanum bottle. The annual meeting of the stockholders of the South Atlantic Life Insurance Company, of Richmond, was held in the Mutual Building. The reports showed a fine financial condition. Edmund Strud- wick was reelected president. Several offers to buy the company have been rejected and the South Atlantic Life will continue on an independent basis as a home company. Judge R. Carter Scott, of the Circuit Court of Henrico, has not yet made an appointment to fill the vacancy created by the death of County Treasurer Todd. Among those being mentioned by their friends for the treasurership are Deputy Treasurer, H. C. Hechler, T. Walker Jeter, a deputy of the former treasurer, Mr. Brauer, and T. J. Todd, the late treasurersson. The treasurers office is closed pending the appointment. With the back of his head seamed by deep gashes and his face bruised and beaten into pulp, the body of a negro about 60 years old was found on the Chesapeake and Ohio viaduct in Fulton, lying face down between the rails. Cor oner Taylor held an inquest. The man is supposed to be H. Martin Diggs, of Lo cust Creek, Louisa County. It is thought he fell from a train. Ulysses Hottel, employed by the South ern Railway as a coal-passer at Stras- burg Junction, suddenly became a raving maniac in a coal bin. He is thought to be hopelessly insane. He keeps at work constantly shoveling coal and shouting that he is getting rich. The efforts of railroaders to quiet him have been in vain. His home is in Woodstock. If was announced from the general offices of the Jamestown Exposition Company that a tower exceeding in alti tude the celebrated Eifel Tower at Paris will in all probability, be erected on the Exposition grounds. A cablegram has been sent to London for plans and speci fications. The -tower would carry up ward of 10,000 incandescent lights and could be seen for miles at sea at night. The brother of C. H. Riggins, who died in the jail at Norfolk, purposes to sue fhe city for the neglect of his broth ers welfare. Riggins was arrested and sentenced to jail for 30 days for steal ing a ham. He was addicted to the mor phine habit, and the contention of his brother is that he was under the influ ence of morphine and that he had no intention of stealing. The autopsy show ed that he died as thc result of organic disease of the liver. Mrs. Mary Augustus Allen, formerly Miss Ironmonger, of Portsmouth, filed a suit at Norfolk, asking for a divorce from her husband, Dr. M. R. Allen, a homeopathic physician. Mrs. Allen ap plies for a limited divorce, alleging cruel ty, failure to provide and many other things. She demands alimony, her attor neys fees and 3,000 in money loaned before and since the marriage. The marriage occurred in Brooklyn, N. Y., May 12, 1904. There are no children. After being out for about two i.ours, the jury in the case of John Gerkin, at Newport News, charged with killing Walter Felton, brought in the verdict of not guilty. The case was taken up in the Corporation Court and the jury ren dered its verdict about 7.40 oclock P. M. The evidence in the case showed that Gerkin was employed as Feltons helper in the plant of the Citizens Electric Company. The men quarreled over some work. Felton struck Gerkin and Gerkin, drove a screw driver through Feltons head. Gerkin is only 17 years old.1 John L. Lee, of Lynchburg, associated, with R. M. Lee for the defence, made a powerful plea for the prisoner,. causing jurors and spectators to shed tears. The prisoners mother and f-ther came from North Carolina and were in the courtroom during the trial."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "was circulated by J. <mark>Tinsley</mark> Coleman, Who was associated"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "was circulated by J. <mark>Tinsley</mark> Coleman, Who was associated"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1272.5, 734.11, 1444.47, 1132.44], "bbox_id": "b4dc60aa75", "file": "TimesVirginian_1983a_0203.pdf", "page": 1, "text": "The wedding of Miss Sherry Lynn Roope -to Mr. Lewis Leon Paulk, Jr. took place on the afternoon of May 28 at 2 p.m. on the lawn at the home of Mrs. Eliazabeth Harrison. The Reverend Douglas Randlett, youth pastor of Thomas Baptist Church was officiating minister. A program of music was presented by Mr. Lowell Freemire with recordings by Daniel Stratton, pianist. The bride is the daughter of Mr. and Mrs. William Dean Roope of Concord and the bridegroom is the son of Mr. and Mrs. Paulk, Sr. of Columbus, Ohio. The bride, given in marriage by her parents, wore a gown of taffeta and net etched in lace, with a fitted bodice, accordin pleats. The front of the skirt flowed back into a chapel train. Her headpiece of net was accented with seed pearls and lace. She carried a bouquet of white rose birds with ivy. streamers and lilac and white lace trows. Miss Cheryl Dawn Davis of Appomattox was maid of honor. Sue wore a gown of lilac taffeta and lace and carried a rattan fan with wild lilac flowers. Christina Goodlin of Lynchburg, friend of the bride, was flower girl. She wore a lavender check ginghain dress with white pinafore and bloomers. Scott Tinsley of Amherst, cousin"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "pinafore and bloomers. Scott <mark>Tinsley</mark> of Amherst, cousin"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "pinafore and bloomers. Scott <mark>Tinsley</mark> of Amherst, cousin"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [523.89, 1581.73, 685.9, 1793.34], "bbox_id": "95744508f6", "file": "AppomattoxNewspapers_1892-1898a_0105.pdf", "page": 1, "text": "th e following Real and personal Estate conveyed by Joseph M. Moore to Ann Megginson and children by deed dated August 24tn, 1887, viz 1st. Two mules, wagon, farming implements, household and kitchen furniture. 2nd. A tract of about 133 acres, known as the Speekers Field, place, on which there is a good dwelling and other buildings. 3rd. A tract of about 67 acres, known as the Phelps place,. on which there is also dwell ing house. 4 th. A tract of about 33 acres, about half of which is James River bottoms. This piece formerly belonged to the Phelps place, and the dividing line between the two is the old fence on the ridgt running parallel with the river. All the above property is in Appomattox county, near Stonewall Ferry on James River, about one mile from Stapleton depot on the Chesapeake A Ohio railroad, and adjoining the lands of Mrs. F. B. Moore, Joseph M. Grow, D. A. Langhorne and others, and considered fine property. Sale of Personalty absolute, but the sale of the Real Estate is subject to the confirmation of the Court. TERMSAs to Personalty, for cash as to Realty, cash as to one-fourth, residue payable in three equal installments of one, two, and three years, purchasers to give bonds bearing Interest from day of sale, with approved per sonal security. Title retained till pureni money is paid. WM. B. TINSLEY,"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "is paid. WM. B. <mark>TINSLEY</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "is paid. WM. B. <mark>TINSLEY</mark>,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2325.07, 232.43, 2473.47, 306.68], "bbox_id": "97c67b34c3", "file": "AppomattoxNewspapers_1962-1965a_0530.pdf", "page": 1, "text": "tending back between paral lel lines 200 feet. TERMSCASH taxes and to surance to be pro-rated as o f. date of sale. . Robert E . Tinsley  Substitute Turstee., 10-29-3t"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "tending back between paral lel lines 200 feet. TERMSCASH taxes and to surance to be pro-rated as o f. date of sale. . Robert E . <mark>Tinsley</mark>  Substitute Turstee., 10-29-3t"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "tending back between paral lel lines 200 feet. TERMSCASH taxes and to surance to be pro-rated as o f. date of sale. . Robert E . <mark>Tinsley</mark>  Substitute Turstee., 10-29-3t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1286.89, 1324.58, 1449.06, 1360.43], "bbox_id": "afddcb94d6", "file": "AppomattoxNewspapers_1898-1902a_0106.pdf", "page": 1, "text": "Tbomaa Tinsley, the New York million aire, U still In jail In Houston, Tex., and has been for the past two years, for con-j tempt of coart fn refusing to produce cer-  tain books."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Tbomaa <mark>Tinsley</mark>, the New York million"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Tbomaa <mark>Tinsley</mark>, the New York million"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.3, 475.94, 1846.45, 891.32], "bbox_id": "5651087d8f", "file": "AppomattoxNewspapers_1912-1915a_0591.pdf", "page": 1, "text": "T ow er H ill. There is right much sickness in our neighborhood. Miss Mamie Beal, who has been sick for several months is no better. Mrs. Pink Harris is quite sick at this time. Mrs. Kate Carter and her daughter, Kate, of Roanoke, are Spending the summer at her old home. Mrs. William Dickerson, who has been visiting her daughter, Mrs. Charley Carter, returned to her home above Lynchburg last Wednesday. Protracted meeting will com mence at Maple Grove the 4th Sunday in this month. Mr. Wm. Tinsley, of Roa noke, who is spending the sum mer in this neighborhood for his health, is attending the En campment at Virginia Beach. Messrs. Robert and Kirk Meg- gison and Sam Gunter are also attending the Encampment. . A protracted meeting com mences at Liberty Ohapel Church the 3rd Sunday in A u gust. Rey. Mr. Gordon, the pastor of the church, will do the preaching."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "this month. Mr. Wm. <mark>Tinsley</mark>, of Roa noke, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "this month. Mr. Wm. <mark>Tinsley</mark>, of Roa noke, who"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1514.4, 943.37, 1812.52, 978.97], "bbox_id": "fefa3adb80", "file": "AppomattoxNewspapers_1902-1905a_0003.pdf", "page": 1, "text": "sree. lust the r T wumi6 11 wim uc iuunu f, q . Tinsley vs. Geo. VV. Colemuu report! n so manf It has been tested commissioner confirmed, aud flnul decree. y 4 jn hospital work, in private practice,. ghe helpless too poor to pur chase relief fcas proved gg successfui"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "uc iuunu f, q . <mark>Tinsley</mark> vs. Geo. VV. Colemuu"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "uc iuunu f, q . <mark>Tinsley</mark> vs. Geo. VV. Colemuu"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [515.96, 172.1, 690.05, 1391.91], "bbox_id": "8d1a5f00be", "file": "AppomattoxNewspapers_1918-1922a_0551.pdf", "page": 1, "text": "son, 8 L. Ferguson, Wm. A. Gleason, Jr , W. T. Harrison, Thomas F. Ryan, R. F. Burke, J. T Fitzpatrick, Joseph But ton, Oscar Portner, E W. Hub  bard, W. F. Tinsley, Joseph F I Lowman, A. 0- Portner, Dr. E I A. Alderman, Claude F.itcheu, jE. Lee Trinkle, Wm F Rhet., j Dr Thomas Nelson Page, R. L Burke, Alfred P Thom, Wm H Manu, Breckinridge Long. Ken neth cKellar, Joseph T. Rob inson, Oscar W. Ufiderwood, Judge Henry T. Wickham, Dr A. 8. Priddy, Joseph M Bauser man, Judge 8 C. Graham. James Hay,Joseph A Glasgow, Dr James Abbitt, W. W. Sale, Robert Lansing,Henry 0 Stuart , Geo. Peary, C. Lee Moore, John R. Saunders, Julian Gunn, J D. Hank, J. E West, N. R Feath erston, Judge Goe. J. Hunk ley, S. C. Stratton, F. C. Moon, Bland Massif, M. B. Booker, C J. Campbell, Clyde 8aunders, W E. Carson, E. V. Barley, A. H. Williams. Our special Washington cor respondent says of him The death of Flood is directly due to his fine devotion to his State and partv When tbs Republicans gave it out that they were going to break into the solid South and that Vir ginia was to be the gateway, everyone knew that it meant another loosening of the strings of the long purse that poured out millions and millions for the election of Harrison, Me Kinley, Roosevelt, Taft and Hardingthe long purse of privilege. The Virginia leaders looked over the field and could see no one but Flood to lea the fight to prevent the Repub licans again getting a foothold in the State that was still re- membring painfully the days of the carpet baggers So Flood wae drafted for the iob, though already Chairman of the Demo cratic Congressional Commit tee, he went into it like he went into every other fight with every ounce of force there was in him Of course he wod , aud the Democrats carried Vir ginia by the biggest majority ever known, but Flood came back to Washington and took to hi bed, never to leave it. Of him it can be truly said  He died with the harness on, the broad sword leaping, the wild fight surging fast  Rich as the party is in leadership, Democracy can ill spare him, this proud Virginian, proud of his clean hands, his clean pub tic record, Lis clean profession al career and his spotless personal character. It is re membered of bim that when he first came t j Congress, defeat ing Jacob Yost, a Republican, the result was very close ano he was offered the certificate of election on. a technicality, wbereu ton be refused to accept it, preferring to stand aside until the status of every ques cioned ba lot wae determined, be knew he might lose by so doing, but be preferred it that way. The folio wiug tribute paid our distinguished countyman by a life-long friend is worthy of both men Nobody seems to be able to realize chat Hal Flood, of Ap pomattox, is dead. We cannot grasp the fact that the mao of vigor and force and activity upon wuern we Had learned to rely, and under whose devoted watch care we had learned to feel secure has been suddenly called from his earthly duties, ank that our friend is no more. Mr. Floods great abilities and worth in public life were uaiversaly recognized. But to the people of Appomattox nr was held in esteem as nowhere else, because it was here that tiis worth in private life was best known. Many years"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Hub  bard, W. F. <mark>Tinsley</mark>, Joseph F I Lowman,"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Hub  bard, W. F. <mark>Tinsley</mark>, Joseph F I Lowman,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1830.22, 944.93, 1990.13, 1440.9], "bbox_id": "1be7f359d7", "file": "AppomattoxNewspapers_1939-1943a_0309.pdf", "page": 1, "text": "Serial No. Nama 51 Clayton Edward Burge 52 Aubrey Neal Morris 53 James Edward Tweedy 54 John Sam Harvsy 55 Lawrence Samuel Jennings 56 William Herbert Richardson gf Floyd Malcolm Jarrells 58 James Edward Paige 59 David Chester Jacobs 510 Claude Earnest Stevens 511 Wiley Ferguson 512 Willie Marshall Austin 513 Chap Everette Patterson 514 John Eldridge Eagle 515 Russell McConnie Shelton 516 Bernace Rice Moore SI 7 Oscar Tinsley Whitten S18 Lordon Dde ward Thomas Thomas Pervis Almond Clarences Edward Webber Will Henderson Ferguson Lewellyn Giles, Jr. S23I Samuel Esmond Robertson S24 William Nathaniel Bryant Willard Cordell Johnson Clarence Alfred Agee Paul William Sarver Rchard Floyd Burke, III Ollie Ramsey Hammock Alfred M-undy Moore Thomas Edward Hubbard William Garland Mitchell Thomas Edward Childers Shelton Ould Kouton Claude Alfred Jamerson Charles Henry Phelps Eddie Roscoe Saunders Robert Bruce Patterson Maurice Elliott Gordon 540 Volney Wilson Garrett 541 Holmsey Inge, Ir. Henry Willard Reed James Terry Roger John Walter Harvey William Monroe Carrico 546 Nelson Franklin Fields 547 Frederick Dickerson 548 Giles Cephas Walker 549 Leonard Bernsr5 Woody S.O John Howard Goin 551 Arthur Allen Blackwell 552 Randoplh Delaward Guill 553 lizekiah Williams 554 Aubrey C. Calloway"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Moore SI 7 Oscar <mark>Tinsley</mark> Whitten S18 Lordon Dde"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Moore SI 7 Oscar <mark>Tinsley</mark> Whitten S18 Lordon Dde"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2164.66, 1340.08, 2327.13, 1480.79], "bbox_id": "87cdd808bc", "file": "AppomattoxNewspapers_1933-1936a_0219.pdf", "page": 1, "text": "saw mill to the Walter Tinsley farm. Mr. and Mrs. H. E. Burge apd .laughter and Mrs. Alberta Burga l Petersburg spent several daya  tais community last week. Mi.. A. F. Drinkard and Mrs. Ini.in Drinkard were the dinner .j-..ts last Friday of Mr, and Mrs 14. C. Moore. Mrs. Eugene Drinkard, who is untVr treatment ,n Lynchburg fa yc..bjig m improving slowly. Chap"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "mill to the Walter <mark>Tinsley</mark> farm. Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "mill to the Walter <mark>Tinsley</mark> farm. Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [294.94, 662.24, 1025.47, 793.76], "bbox_id": "9de08a01b4", "file": "AppomattoxNewspapers_1962-1965a_0524.pdf", "page": 1, "text": "SANTHEMUMS nice assortment  g g y  1 J  j SST w S PkS Hubbard! SilnSfr SSt AUTOMATIC ZIG-ZAG SEWING 1.00 per dozen. Select them now I J J   f  Evan? Jr 115 -U Single. to Ralph C. Lester and Sw  d  ite d L and  s MACHINE Wanted local party while in bloom. Also turnip salad P m A B EVanS J  115111 William A. Smith, the said Ralph WE CRY FOR VOU Dickerson C. Lester having resigned a s 1 Phone EX 2-35561 Trustee and the undersigned, 5-16-tf  Robert E. Tinsley, having been duly appointed according to the w vr,nr, terms of the Deed of Trust h e r e - --------------------------- _____________________________j i r w acoU R T p r e L S ie tor ! referred to on       10, TWO APARTMENTS 3 rooms WANT TO BUY FOUR BED-1 Luther LeGrand Floiist Flow-i 1964 as substitute Trustee act-1 with private bath on ground floor ROOM HOME in or near Ap- j   f i r r n . 1118 under the aforesaid Deed of  R- B- Haley, Sr. 10-29-2p j Trust which is of record in the  - ------------------------------------ i Clerks Office of the Circuit APARTMENT 3 rooms and bath"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "undersigned, 5-16-tf  Robert E. <mark>Tinsley</mark>, having been duly appointed"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "undersigned, 5-16-tf  Robert E. <mark>Tinsley</mark>, having been duly appointed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [813.85, 513.51, 988.55, 875.11], "bbox_id": "00c52595a4", "file": "AppomattoxNewspapers_1943-1947a_0494.pdf", "page": 1, "text": ".Samuel Edward Dickerson cele brated his 5th birthday Sunday. Emory, Wiley and Winston Ran son went to Lynchburg Saturday to see their father, who thirl. Miss Gertrude Ranson is on the sick list at Appomattox. Mr. and Mrs. C. M. Evans, of Maloney and the Rev. and Mrs. Cecil Carter, of Evergreen, were inner guests of Mrs. Claudie Ran son and Miss Annie C. Martin on Sunday. Donald and Rodney Roach left early Saturday for Waynesboro to spend the week-end with their sis ter and brother-in-law. Mr. and Mrs. L. W. Williams. Mr. and Mrs. Hudson Dickerson and son, Dannie, of Brookneal, spent Sunday with Mr. and Mrs. Lewis Dickerson. Rev. Cecil G. Carter preached a very fine sermon at Rocks Church Sunday morning. Miss Joyce Tinsley, of Lynch- burg attended Sunday School at Rocks Sunday, while visiting Miss Etta Ranson. Miss Odelle Ranson, of Appo mattox and Mr. and Mrs. Richard Ir.ge. of Farmville were dinner guests of Mrs. D. R. Inge and Mr. and Mrs. Toby Inge Sunday. Mrs. L. K. Almond spent Satur day in Lynchburg with her daugh ter-in-law. Mrs. Edward Almond, who is improving at the Virginia"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Sunday morning. Miss Joyce <mark>Tinsley</mark>, of Lynch- burg attended"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Sunday morning. Miss Joyce <mark>Tinsley</mark>, of Lynch- burg attended"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1335.38, 961.43, 1473.73, 1055.93], "bbox_id": "4232feef50", "file": "AppomattoxNewspapers_1892-1898a_0148.pdf", "page": 1, "text": "S. Commissioner Tinsley, of chburg, tried a case at Browns rday, against Mr. J. A. Brown ght by a Mr. Carr, for improper ter sent through the mail on a 1 card. Hon. H. D. Flood counsel for Mr. Brown. The was dismissed."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "S. Commissioner <mark>Tinsley</mark>, of chburg, tried a"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "S. Commissioner <mark>Tinsley</mark>, of chburg, tried a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2011.2, 1573.34, 2349.62, 1676.24], "bbox_id": "ef1f31ab9c", "file": "AppomattoxNewspapers_1939-1943a_0293.pdf", "page": 1, "text": "Richmond, June 4 VPA.- Organ ization of the Virginia Aircraft proceeding Organizer? have been named in each of the w. __ ______ ______  ___ _ 111 districts to recruit a total of Tinsley Coleman, Wm. McLi Fergu-1 18,000 male volunteers who will man son, Bernard C. Goodwin, Marvin L. I observation posts  1 Gray, Richard W. Ruffin and L. Lake Triplett, and A. Fleet Dillard, secretary."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "recruit a total of <mark>Tinsley</mark> Coleman, Wm. McLi Fergu-1"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "recruit a total of <mark>Tinsley</mark> Coleman, Wm. McLi Fergu-1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [554.65, 1159.47, 693.45, 1589.01], "bbox_id": "2d5eb1ff33", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "Raym ond Bell W alter W Scott H arrison Morton Burge . Hurley A shby McFadden H allie Dillard Oscar Luther Scheffier John Wesley Coleman Robert Lee Abbott Jack Sears Caldwell Joseph W adsw orth Crews Dudley NcCaw Johnson Everett W ilson Blackwell Robert Terrill Gills Dean Alfred Alpha Pugh Jam es H enry Stanley, jr. W illiam Littleton Cardwell Conrad R Brown Lacy Douglas M arshall H urley Clem Davis John Case Allen W alker H ubert Moore Frank W illiam Fleshm an William Albert Owen Joseph Blanohard Tinsley Thomas E dgar Moore Henry Carl Holesapple Thom as Ennis Childress Calvin Ghanie Woods A lexander Price g erm an H arding abney Clinton Tweedy Philip d a n d e r Paulett Frank Edw ard Jennings Oscar Leonard McCormick Ulyssess Sympson Austin Tomie W iley Ferguson Coeinsco McCoy Charles Douglas Doss Jam es Edw ard Jordon William Walter G unter A rthur Cleveland Almond Alexander Lane Leonard N athaniel Gregory Ailliavm rviI  - I... .  a"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Albert Owen Joseph Blanohard <mark>Tinsley</mark> Thomas E dgar Moore"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Albert Owen Joseph Blanohard <mark>Tinsley</mark> Thomas E dgar Moore"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1365.84, 404.29, 1504.54, 427.29], "bbox_id": "44787c2859", "file": "AppomattoxNewspapers_1922-1923a_0259.pdf", "page": 1, "text": "r. Walter Tinsley of Roanoke siting in the county."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "r. Walter <mark>Tinsley</mark> of Roanoke siting in the county."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "r. Walter <mark>Tinsley</mark> of Roanoke siting in the county."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [506.91, 1539.88, 668.15, 1820.31], "bbox_id": "100dc3a617", "file": "AppomattoxNewspapers_1892-1898a_0098.pdf", "page": 1, "text": "Pursuant to the decree o f the Circuit Court o f Appomattox county. Virginia, entered June term UK, in the suit o f Rosa A. Meggin- son against Norman Megginson et ala, the un dersigned will sell at public auction, on the prem ises, on Saturday, Nov. 18th, 1893. fug rJo sep h beginning at 2 oclock, p. ul , the follow ! id by Joseph n and children by Real and personal Estate conveyed b M. Moore to Ann Megginson ant deed dated August st n. 1H7, viz 1 st. Two m oles, wagon, fanning implements, household and kitchen furniture. 2nd. A tract of about 133 acres, known as the Speekers Field. peace, on Which there la a good dw elling and other buildings. 3rd. A tract of about C arres.known as the -Phelps place- on which there is also dw ell- nr fcKitmpt w . A ta c t of about 33 acre, about h ttf of which is Jaw  K tct bottom s. TMs piece form erly belonged to the Phelps place. and the dividing line between the two is the oM fence oc the rMfft running parallel with the river. AH the above property is in Appomattox county, near Sttmewail Ferry on James River, about one m ile Jrom Stapleton dm ot on the Chesapeake A Ohio railroad, and adjoin in f the lands o f I n . F. B. Moore. Joseph M. Grow, D. A. Lanffhorne and others, and considered fine property. Hale of Personalty absolute, but the role of the Baal Estate is subject to the confirmation of the Court. TMKMfiAs to Personalty, for caahae to Baalty.oash as to one-fourth, residue payable in throe equal install pants of one. two. and throe yaaro purchasers ro icive boaoi heart na interest from day of sale, with approved per- soaal security. T itle retained till pitreaaae money i pakl. WH. II. TINSLEY. Hpecial Comr. Bond executed as required by mw. Jetshbr. Gao. T. Puros Clash."}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "i pakl. WH. II. <mark>TINSLEY</mark>. Hpecial Comr. Bond executed"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "i pakl. WH. II. <mark>TINSLEY</mark>. Hpecial Comr. Bond executed"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1750.07, 884.56, 1915.32, 1701.32], "bbox_id": "49d20b3c0f", "file": "AppomattoxNewspapers_1908-1909a_0541.pdf", "page": 1, "text": "Prof. Elvin Ligon, of Black- stone, was a recent guest of rel atives here. Mrs. . George -Webb- and daughtar.were driving to Pamp lrnn Monday and were struck by a truck which killed t h e horse and injured th e little girl very badly- The truck was driven by Mr. Cloes son, Miss Mary West Terry re turned from .the University of N. C., last week accompanied by Misses Georgie and Maty Love Couch, of Durham - Dr. James H Franklin, of N. Y., was the recent guest of his sister. Miss Kate Franklin and daughter, Miss Carolyn Frank lin .. .  Rev- H. L- Reeves is holding a vacation Bible School at the Presbyterian Church at Madis- sonville. The attendance is fine. T Messrs. Charlie and Will Price, of near Madisonville, made ever 2000 bushels of wheat. The largest yield in this section- Six cars of wheat- have been shipped from Pamp lin at 50 Jcentff per bushel, Truck loads of melons from Charles City, come through town frequently. Miss N. A. Davis, of Rich mond, is spending her vacation with her home people here. Miss Merle Davis has re turned from a visit to Alabama- Miss Ljucy Rice is visiting Charlottesville and Washing ton, where she will spend her vacation with relatives. Rev, B. B. Abbitt, of Hemp stead Long Island, is spending his vacation with relatives in Appomattox County-, The Odd Fellows had a laWn party at the Masonic Hall oh Friday night. A nice sum of money was realized. Miss Pearl Edwards of Chat ham was the recent guest of Miss Lucille Paulette. Mrs. R D. Bald vin is visit ing her daughter, Mrs. Frank lin Young, of Crewe.  Mrs. Lacy Dickerson spent sometime at Virginia Beach. Mr Will Thomas, of West Virginia, -is here visiting his sister, Mrs. Thomas Young . Mrs. Joseph Tinsley of West Virginia, is spending-her vaca tion here with friends and rel- atives- i f f i - he young son of Mr. Law rence Young toas seriously hurt by an automobile on Wed nesday. -  Mrs. William Black has as her guest her sistop from Flu-. vanna.-. i,  - - . Miss Xllene MClenny has re turned from a , visit to Glad stone."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Thomas Young . Mrs. Joseph <mark>Tinsley</mark> of West Virginia, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Thomas Young . Mrs. Joseph <mark>Tinsley</mark> of West Virginia, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [712.84, 1315.87, 869.89, 1495.42], "bbox_id": "6a8e548c10", "file": "AppomattoxNewspapers_1892-1898a_0302.pdf", "page": 1, "text": "pOMMISSIONER8 OFFICE, V West Appomattox, April 16th, 1896. Megginson vs. Megginson and others. To K osaA. Megginson, Norman Megginson, Norvell Megginson, Clinton Megginson ldn B. Megginson, Clifton Megginson, Wvman Megginson, H attie Irona Megginon Estelle Megginson J. V. L. Fleshmnn Guar aieuad litem and Marv tiebriclc Plaintiffs and Defendants in the above suit  V ou are hen by notified that I have fixed upon Wednesday, the 20tliday of Mav 1898 as the tim e and my office at Appomattox C. H., as the place, for talcing the several ac counts in the above styled suit, oriered bv the decree therein o f April Term, 1896,towit 1st, An account of the amount that Marv Debricks is entitled to out of the tatOTeat crF the said Ida K. Meggidson, Ada Estelle Meg ginson and H attie irona Megginson in tie estate of Ann Moggirison, ln Me 2nd An accon tof the transaction of W. B. Tinsley, decd, late iteciean in the above cause. Given iiiu I di - my hand the date aiim .  S. FEKCi lin o s . Commissioner H. D. FLOOD, p. tj."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "transaction of W. B. <mark>Tinsley</mark>, decd, late iteciean in"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "transaction of W. B. <mark>Tinsley</mark>, decd, late iteciean in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [359.3, 253.34, 518.0, 1133.74], "bbox_id": "b40356ec4c", "file": "AppomattoxNewspapers_1892-1898a_0303.pdf", "page": 1, "text": "Policeman James P. Hsll was held by the mayor in C00 security at Alexandria for the action of tbe grand jury to answer a charge of assaulting William Blight with intent to kill. Bright is about eighteen years of age. Ho ran away from the policeman on tbe river front near Reeds icehouse, and UaH shot him in tho right side, Inflicting wbat is feared may prove to be a mortal wound. The jury could not agree upon a verdict In tbs Nelson murder trial at Charlottesville, and the court adjourned. Judge George H. Harrison, a member of the Buprome Court of Appeals of Virgin a, met with a distressing accident at his resi dence In Staunton, la attempting to move an upright piano about tbe drawing-room the Instrument toppled over and fell on Judge Harrisons right leg, breaking tbe larger bone and fracturing the smaller bone below the knee in two places. Tbe frac tures were reduced by Doctors A. M. and H. Henkel. Alexander Lushbaugb, aged 39 years, died In Staunton as tbe result of a singular Injury received tho Monday previous, and at that time considered of a trifling nature. Eok, as he was popularly known, was en gaged In lath work at the Bodley Works, when bis chisel point struck a knot in the rapidly revolving wood, and Luehbaugh re ceived quite a blow In the abdomen, though there was no cub So little was thought of tbe blow that Lushbnugh continued his work. Perlton tee ensued and caused his death. He was a fear ess volunteer fireman, and last summer when small-pox appeared In Btaunton he rondered courageous and valuable service In guarding and nursing patients. The body of an unknown woman supposed to have Been A passenger on the Old Domin ion steamer Wyaneke when that vossel was sunk off Newport News, was ashore on the beach at that place. Her name Is not known. The bodies of three other persons, supposed to have been passengers on tbe Wyanoke, are said to have come ashore on the Isle ol Wight beach, but the Old Dominion people have not as yet received any information concerning them. No definite steps have been taken as yet to raise the Wyanoke, and she still remains where she went down. Mr. 8. F. Saey, of Columbia, Fluvanna county, was robbed In Richmond of 465 while traversing tho streets. He had tbe money in a valise, and when he got to the bank, whero he was to take up a note,, the money was miss ng. Col. George W. F. Vernon, of Baltimore, bos been invited by George D. Summers Po-t O. A. R., to deliver th e memorial ad dress at Berkeley Springs on Decoration Day. Some of the members of this post were comrades of Colonel Vernon during the war. Prof. Randolph W. Tinsley, son of Mrs. C. C. XI nsley, of Charlottesville, has been elected to the chair of nutural sciences, in the University of New Mexico, Albuquerque, N. M. He to a graduate of the University of Virginia. Rappahannock county is rapidly becoming one of the lead ng apple counties of the State. Many thousands trees have been planted out this season with more to follow. George Whito, of Fauqulr county, cut down a bee tce several days ago from which ho took a barrel of honey and four young coons. A bill baa passed both houses of Congress providing for semi-annual sessions of tbe United States Court at Roanoke. Eugene McNerhauey was run over and killed on the Southern Railway, in Fairfax county, last week. Five Swiss gent emen have recently pur chased farms in Bedf rd county. J. Preston Ware, section master of the Chesapeake and Ohio Railroad at Maysviiie, Ky., mot with a terriblo and fatal accident at Sml hs Creek, west of Staunton. In at tempting to board the passenger train No. 1 he fell between the wheels and, with skull crushed and both legs eut off he died in half an hour at Clifton Forge The decease was la the Clift .n Forge section looking into bis real estate interest there. He was a Mason"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "war. Prof. Randolph W. <mark>Tinsley</mark>, son of Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "war. Prof. Randolph W. <mark>Tinsley</mark>, son of Mrs. C."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1561.86, 502.47, 1733.49, 626.22], "bbox_id": "6e95f88611", "file": "AppomattoxNewspapers_1939-1943a_0582.pdf", "page": 1, "text": "Patty Featherstcn vent to Rpanoke recently to attend tne fu- lor 92 f MIrSrrMinnie Tinsley Tay- resident Tay,or was a former Vr f Appomattox County.He- rather, Mr. Ben Tinsley was a fori er owner cf the Scott farm near the old court house. She was living in Washington at the time of he? in RnnFr erc- S-ervices  were held in Roanoke. She is survived by one daughter, Mrs. Sidney Alexander togtoiTD?1  randchildren- of Wasli-"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "lor 92 f MIrSrrMinnie <mark>Tinsley</mark> Tay- resident Tay,or was"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "lor 92 f MIrSrrMinnie <mark>Tinsley</mark> Tay- resident Tay,or was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1037.24, 251.3, 1196.45, 312.9], "bbox_id": "a541625695", "file": "AppomattoxNewspapers_1915-1918a_0556.pdf", "page": 1, "text": "Pamplin Mrs J. B. Tinsley and baby of Lynohbafg, are spending some time with her mother lere, Mrs. M. . Clark."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Pamplin Mrs J. B. <mark>Tinsley</mark> and baby of Lynohbafg, are spending some time with her mother lere, Mrs. M. . Clark."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Pamplin Mrs J. B. <mark>Tinsley</mark> and baby of Lynohbafg, are spending some time with her mother lere, Mrs. M. . Clark."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [222.25, 1026.72, 2253.27, 1261.64], "bbox_id": "6e1c5e1e53", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "Pamplin City Dr. J. T. Tinsley, the dentist in Mineral andDr. B. S. Venter, thedentist in Beat Crock. Druggist listed in the directory in 1888 for Appomattox included H. C. Babcock in Mineral he was the grandfather of feed residents, H. W ebster Babcock, owner-operator of Babcock Manor M arniet Babcock Seargent, and Bfenche Babcock Poe. In Bent Creek the drimgist was J. J. Bolton and in Pamplin City D. W. Gills. H. the dentist and the druggnt couldnt ease the pdm then augroe it would have been time to call on one of the distillers in the county bade then __ jail nice and legd tool According to the directory. Tower Hfll and Evergreen had the most. In Evergreen, the distillers were George T. Farrar, William A. Glover, A. N. Harvey. In Tower Hfll, if booae Who Make Appomattox Countys"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "City Dr. J. T. <mark>Tinsley</mark>, the dentist in Mineral"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "City Dr. J. T. <mark>Tinsley</mark>, the dentist in Mineral"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [922.32, 193.72, 1081.9, 422.39], "bbox_id": "e6a0ec94a5", "file": "AppomattoxNewspapers_1918-1922a_0294.pdf", "page": 1, "text": "Pam plin 1 Business outlooc h encouiaging Btsl es tate Is In dem nd at good prices, practical y none on the market. About all known as tbe Thornton addition been taken up, Tbe Rosser Milling Co. are now building a 50 barrel roller Hill, which is muoh needed. Its a four story building of concrete tea wood. The Ligons are now planning a 5000 addi tion to their drying plant. Installing a 210 horse power boiler which will be ready fir the fall season,  The Pamplin Faotory and Veneering pla-t, incorporated, are preparing to build a 30,- 000 plant as soon as material can be found. I Busine-s Is good. We are still short o i hay and sugar. The finals ot onr high school ill begin Thursday night. The baccalaureate sermon will be preached on Sunday by the Rev. A J .f Ponton, for ten years pastor here. He will be welcomed by a host of friends who bold him in high esteeni Mrs. Tinsley, nee Clark, spent last week with h--r mother here also Mrs. Paris, for merly. Miss Fracker."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "in high esteeni Mrs. <mark>Tinsley</mark>, nee Clark, spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "in high esteeni Mrs. <mark>Tinsley</mark>, nee Clark, spent last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1752.49, 182.11, 1918.39, 727.87], "bbox_id": "2cd6dd6cef", "file": "AppomattoxNewspapers_1915-1918a_0133.pdf", "page": 1, "text": "P a m p lln A good deed of sorap iron etc., is being bought here and shipped aw ay in c a r load lots. M iss G eneva Davis, w h o is atten d in g school m Farm ville, visited hom e people S aturday and Sunday. M any of the Com m ercial travelers visit th is tow n in au tom obiles. Can sta rt and stop w hen and where th ey please We have alm ost gotten accus tomed to seeing th e statio n on its new site, good deal of level ing and etc., being done about it now. Mr. J . 8. Tinsley and Miss V era Clark both of th is place w ere united in m arriage a t the B abtist Parsonage on la st Sat u rd ay evening. Rev. Mr. Tay. lor officiating. Mr. Sam F ran k lin w ho has been quite unw ell for th e past week we a ie g lad to see him out again. Cha-lie G arst, a little boy. about eleven y ears old of this tow n, died last T hursday night, after a short illness. Much sym pathy is felt and expressed for the bereaved fam ily, and especially the afflicted father.  The play here last F rid ay n ig h t, from M adisonvilie, was well attended, door receipts being about th irty -th ree and half dollars. Mrs. M aron now of Lynch burg, w hile visiting friends here w as taken quite sick, but is now m uch better. There is some talk of a can nery a t th is place the com m ing season."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "now. Mr. J . 8. <mark>Tinsley</mark> and Miss V era"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "now. Mr. J . 8. <mark>Tinsley</mark> and Miss V era"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1004.89, 208.81, 1163.98, 438.07], "bbox_id": "98612c6b66", "file": "AppomattoxNewspapers_1918-1922a_0160.pdf", "page": 1, "text": "P a m p lin Business outloo Is eneouiaglng. Beal es tate lain dem nd at good prices, practical y none on the market. About all of w hat ia known as the Thorn-on addition has now been taken up . The Rosser Milling Co. are now building a 50 barrel roller mill, which is much needed. Its a four story building of concrete and wood. The Ligons are now planning a 5000 addi tion to their drying plant, installing a 100 horse power boiler which will be ready for the fall season. The Pamplin Factory and Veneering p la t, .ncorporated, are preparing to build a 30,- OGO plant as soon s m aterial can be found. Eusine s is good. We are still short on hay and sugar. The finals of our high school  ill begin Thursday night. T h e baccalaureate sermon will be preached on Sunday by the Rev. A.J. Ponton, for ten years pastor here. He will be welcomed by a host of friends who hold him in high esteem. Mr, Tinsley, nee Clark, spent last week with h r m other here also Mrs. Paris, for merly Miss Fracker."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "in high esteem. Mr, <mark>Tinsley</mark>, nee Clark, spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "in high esteem. Mr, <mark>Tinsley</mark>, nee Clark, spent last"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1681.88, 221.35, 1847.51, 966.67], "bbox_id": "6e1091a9ca", "file": "TimesVirginian_1978_0055.pdf", "page": 1, "text": "over 95 pounds. An educational approach to I weight loss is used by the I Conway Diet Institute to teach I its clients how to take weight  off fast and keep it off. The  1,000 calorie a day diet, j reinforced with weekly meet- I ifiga, provide rapid weight loss.  Now nine years old, the 1 Institute conducts 700 weekly meeting in 22 states. Topics for the meetings, I which-encourage member par ticipation, include nutritious I dieting, emotional conditioning, I health and longevity, the I profile of ah overweight person, behavior m odification, and I will-powerdesire. The groups I discuss cause of overweight, I attitudes toward food, home I environment, anxietyovereat- I ing, mid responses to challenge I and success. The diet itself is a 1,000 I calorie, highly nutritious and I satisfying program which ex-  ceeds all the daily nutritional requirements established by I the .AM A. It consists of three I well-balanced meals a day plus I snacks. The Institute publishes its  own cookbook, Appetizing I Slenderizing Recipes, which is I filled with delicious recipes and I food preparation hints. After members have reached I their ideal weight, they are I taught how to reintroduce into I their daily eating patterns, in I moderate amounts, the fatten- I ing foods they have given up. I The program promises perma- I nent slimness if the members I use the knowledge, insight and I motivation that they have   developed at seminars. Headquarted in Columbus, Ohio, the Institute had its beginnings in Virginia in January, 1977. Betty Tinsley of Darlington Heights is lecturer for the Appomattox class. Mrs. Tinsley attended Longwood College and was employed by the Foreign Mission Board of the Southern Baptist Conven tion in Richmond. She later worked in the shipping office of Appom attox Garment Com pany, and is now employed solely by Conway. Further informaiton may be procured by contacting Mrs. Tinsley at 24841771. Area Meetings - Appomattox - Mondays, 730 jjn , -j Fidefity Bank Bid.. Moses j"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "in January, 1977. Betty <mark>Tinsley</mark> of Darlington Heights is"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "in January, 1977. Betty <mark>Tinsley</mark> of Darlington Heights is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1030.29, 888.52, 2277.67, 996.96], "bbox_id": "387badf237", "file": "AppomattoxNewspapers_1933-1936a_0311.pdf", "page": 1, "text": "Optometrist  OptieiM the titiP o f fo, w v ite-  a  ! B roth ers Three contains _t e 01 tne book, is also fine spectacle of a family el toArpj-wio gT at h,ouse which. together through bonds of aB to Arabella Tinsley of industrial tion, taking its flyer into sin a f h f h  civilization. then returning local. The reader has watchd the  6 rise of the great Mildand indus-1OMahwna 5011 irom whici trial family. He now watches Ara- sprang and hiding the fun bella marry to gain possession of mentals of living still there. Mi White Ladies. He sees the im- is crowded into John Oskiso s r s r j f f The"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "of aB to Arabella <mark>Tinsley</mark> of industrial tion, taking"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "of aB to Arabella <mark>Tinsley</mark> of industrial tion, taking"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.09, 732.65, 1622.33, 1131.23], "bbox_id": "addcab911a", "file": "TimesVirginian_1983a_0203.pdf", "page": 1, "text": "of the bride, was ring bearer. Mr. Lewis was his sons best man and ushers were David Roope and Troy Roope, brothers of the bride. The brides mother wore a street length dress of navy and white with a corsage of white rosebuds and babys breath. The mother of the groom wore a street length dress of cream Color with a corsage of white rosebuds and babys breath. Also attending the wedding were Miss Debra Paulk of Columbus, Ohio, sister of the bridegroom and Mr. and Mrs. Stoart of Texas, grandparents of the bridegroom. Immediately following the wed ding, the parents of the bride were hosts for a reception at their home. Helping them serve their guests were Mrs. Louise W right of Lynchburg and Mrs. Katherine Cashmore of Waukegan, Illinois, aunts of the bride and Mrs. Delores Tinsley of Amherst, and Mrs. Joyce Ray of Madison. Heights, cousins of the bride. The bride is a graduate of Appomattox County High School and will be employed by a florist in Columbus, Ohio. The bridegroom was graduated from Northside Christian School and is an employee of C P P Security in Columbus. The couple will make their home in Columbus."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "bride and Mrs. Delores <mark>Tinsley</mark> of Amherst, and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "bride and Mrs. Delores <mark>Tinsley</mark> of Amherst, and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [532.29, 419.46, 1295.38, 645.79], "bbox_id": "27c9c857a7", "file": "TimesVirginian_1983a_0412.pdf", "page": 1, "text": "Obituaries Ms. Mary Tinsley of West Virginia and Ms. Sadie Robertson of Rhode Island one son, Sidney . Robertson of West Virginia 40 grandchildren 60 great grandchildren 20 great-great-grand children a host of nieces, nephews, other relatives and friends. A funeral services was held Thursday at 3 p.m. at Mount Airy Baptist Church with interment in the church cemetery.  West Funeral Home, Appomattox, was in charge of arrangements. Mrs. Wade H. Steele Mrs. Alice Weinman Stéele, of Concord died at 1045 p.m. Saturday, tCsuttauedeupageli ,"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Obituaries Ms. Mary <mark>Tinsley</mark> of West Virginia and"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Obituaries Ms. Mary <mark>Tinsley</mark> of West Virginia and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [922.24, 700.36, 1065.13, 1259.43], "bbox_id": "a26ed7e5d8", "file": "AppomattoxNewspapers_1962-1965a_0564.pdf", "page": 1, "text": "N. Garrette, of Concord, t o o k place Saturday, December 19, at 4 oclock at Hebron Baptist Church in Appomattox. The Rev. John P. Leitner per formed the double ring cere mony. A program of wedding music was provided by Mrs. V. Howard Ford, organist, and Mrs. David Goode, soloist. Given in marriage by her fath er, the bride wore a gown of silk organza and net over taffeta designed with long sleeves and a princess bodice accented with appliques of alencon lace em broidered wih seed pearls. The rounded skirt ending in a chapel train featured an obi sash also appliqued with lace and em broidered with seed pearls. The brides fingertip veil of illusion fell from a crown of seed pearls and sequins, and she carried a bridal bouquet of seasonal flow ers centered with a white orchid. Mrs. Robert E. McClenny, Jr., of Danville, was her sisters ma tron of honor. Bridesmaids were Mrs. Lyle N. Garrette, Jr., of Covington. Miss Carsonette Gar rette, sistfer of the bridegroom, and Miss Dawn Tinsley, of For est. Mr. Garrette was his sons best man. Ushers were William D. Carson, of Parksley, brother of the bride Lyle N. Garrette, Jr., of Covington, brother of the bridegroom Harry T. Coyner, of Waynesboro, Daniel E. Carson, of Appomattox, cousin of the bride and Edward L._Busic,,of Hornaker. After the ceremony, the brides parents entertained with a re ception in the social hall of the church. The bride is a graduate of Vir ginia Baptist Hospital School of Nursing. The bridegroom is a senior at Virginia Polytechnic Institute. After a southern wedding trip, the couple will make their home in Blacksburg."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "bridegroom, and Miss Dawn <mark>Tinsley</mark>, of For est. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "bridegroom, and Miss Dawn <mark>Tinsley</mark>, of For est. Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1110.5, 464.81, 1291.04, 646.46], "bbox_id": "18bb970d93", "file": "TimesVirginian_1983a_0411.pdf", "page": 1, "text": "Ms. Mary Tinsley of West Virginia and Ms. .Sadie Robertson of Rhode Island one son, Sidney Robertson of West Virginia 40 grandchildren 60 great grandchildren 20 gTeat-great-grand- children a host of nieces, nephews, other relatives and friends. A funeral services was held Thursday at 3 p.m. at Mount Airy Baptist Church with interment in the church cemetery. West Funeral Home, Appomattox, was in charge of arrangements. Mrs. Wade H. Steele Mrs. Alice Weinman Steele, of Concord died at 1045 p.m. Saturday, Continued on page II"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Ms. Mary <mark>Tinsley</mark> of West Virginia and"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Ms. Mary <mark>Tinsley</mark> of West Virginia and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1424.16, 279.15, 1580.37, 300.2], "bbox_id": "61d8aaa1ed", "file": "AppomattoxNewspapers_1902-1905a_0313.pdf", "page": 1, "text": "Mr. Tinsley Kindred is visiting in the county."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Mr. <mark>Tinsley</mark> Kindred is visiting in the county."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Mr. <mark>Tinsley</mark> Kindred is visiting in the county."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [657.84, 202.0, 823.17, 664.0], "bbox_id": "3e8566aa5e", "file": "AppomattoxNewspapers_1922-1923a_0051.pdf", "page": 1, "text": "Mr. Hubert Martin, of Lynch burg, was the week-end guest of Messrs. John and Tipton Paulette. Mr. John W. Evans continues ill at the home of his son, Mr J. O Evans. We are sorry to hear of Mrs Tipp Jennings illness. We are all much grieved to hear of the death of Mrs. Mat- tie Tinsley, of Amherst, who was formerly the wife of Mr Sam Dickerson, of this neigh borhood. Mrs. Nora Farrar entertained a number of her neighbors and relatives Saturday night and among those present were Mr. and Mrs. Johnnie Farrar of Evergreen Miss Louise Simmons, Mrs. W. I. Austin Mr. Bob Jennings, Messrs Clarence and Billy Simmons ice cream was served and al reported a nice time. Mrs. Alice Pea, of Lynchburg visited relatives in this neigh borhood last week. Messrs Luiher and Whitney Evans motored from Brooknea Sunday t,o see their father and grandfather jwho are sick. Mr. Hamner Moses is home from school. MisB Hazel Doss was the week end guest of her cousin, MisB Effie Smith."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "of Mrs. Mat- tie <mark>Tinsley</mark>, of Amherst, who was"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "of Mrs. Mat- tie <mark>Tinsley</mark>, of Amherst, who was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2120.64, 357.17, 2296.18, 395.32], "bbox_id": "f17381ca2d", "file": "AppomattoxNewspapers_1943-1947a_0454.pdf", "page": 1, "text": "Mr and Mrs. Joe Tinsley, of Lo- 7 Va were visiting her uncle and neice, A. A. Baldwin and Cass- ie Wednesday afternoon. i"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Mr and Mrs. Joe <mark>Tinsley</mark>, of Lo- 7 Va were visiting her uncle and neice, A. A. Baldwin and Cass- ie Wednesday afternoon. i"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Mr and Mrs. Joe <mark>Tinsley</mark>, of Lo- 7 Va were visiting her uncle and neice, A. A. Baldwin and Cass- ie Wednesday afternoon. i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [931.89, 426.07, 1099.34, 512.62], "bbox_id": "40c0ff54f7", "file": "AppomattoxNewspapers_1947-1949a_0561.pdf", "page": 1, "text": "Mr. and Mrs. Harry Ranson and Mr. and Mrs. Otis Ranson went to Crewe Saturday to attend the fu neral of A. C. Tinsley, supervisor of buildings and bridges for the Norfolk and Western Railway, who was killed ir. an accident Friday on Route 460 near Farmville."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "neral of A. C. <mark>Tinsley</mark>, supervisor of buildings and"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "neral of A. C. <mark>Tinsley</mark>, supervisor of buildings and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1327.91, 1086.51, 1488.36, 1145.71], "bbox_id": "44fcd3bb02", "file": "AppomattoxNewspapers_1905-1912a_0298.pdf", "page": 1, "text": "Monday the sale of the old Tinsley I tract of laud at Old Courthouse was closed. Mr. John Show, of N. J, being the purchaser. Dr W. J. Quick sold ihe property o 7,000."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "sale of the old <mark>Tinsley</mark> I tract of laud"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "sale of the old <mark>Tinsley</mark> I tract of laud"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2289.79, 625.57, 2432.52, 863.81], "bbox_id": "73ab1500e0", "file": "TimesVirginian_1978_0325.pdf", "page": 1, "text": "Miss Patricia Ann Harvey and William Thomas Stone, Jr., were united in marriage on Saturday, July 1, at 6 p.m. on the lawn, at the home of the brides parents. The bride is the daughter of Mr. and Mrs. William Robert Harvey, of Cullen. The groom is the son of Mr. and Mrs. William Thomas Stone, of Norfolk. The Reverend J. E. Shock- ley, of Crewe, officiated at the double ring ceremony. The bride was given in marriage by het father. Honor attendants were Miss Margaret SnciU Hunter, of Appomattox, and Mrs. Betty Childress Tinsley, of Darling ton Heights.  Ashley Laurqn Berry of"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "and Mrs. Betty Childress <mark>Tinsley</mark>, of Darling ton Heights."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "and Mrs. Betty Childress <mark>Tinsley</mark>, of Darling ton Heights."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.74, 1357.6, 1971.22, 1808.12], "bbox_id": "fbfddbdefa", "file": "AppomattoxNewspapers_1892-1898a_0296.pdf", "page": 1, "text": "Megginson vs. Megginson and others. To Rosa A. Megginson, Norman Megginson, Norvell Megginson, Clinton Megginson, Ida B. Megginson, Clifton Megginson, Wyman Megginson, Hattie Irona Hegglnon, Ada, Estelle Megginson, J. P. L. Fleshman, Guar- dieu ad litem and Mary sebriok.  noutn. Plaintiffs and Defendants in the above In Alabama a brass and iron foundry suit You are hereby notified that 1 have . . . .  . . . . -hair fixed upon Wednesday, the 20th day of May, being established at Birmingham, a cnair 1896, as the time and my office at Appomattox factory in Florence an extensive Improve- C. H.,as the place,for taking the. several ac- . . - ____ __ . an awtnaive counts in the above styled suit, or lered bymellt el furnaces at Ironton. an extensive the decree therein of April Term, 1896,to-wlt development of iron ore property near Jack- let. An account of the amount that Mary. hrnwn ora to Debricks Is entitled to out of the interest of jsonville for the shipment of brown ore vo the said Ida B. Meggidson, Ada Estelle Me- furnaces In Alabama and Tennessee the pur- ginson and Hattie Irona Megginson In the Istate of Ann Megginson, 2 nd An accout of the transaction ofW. B. Tinsley, decd, late Heclean in the above CaQiven under my hand the date above. S. L. FERG USON, Commissioner. BALLY OF DEMO CBATS. Who favor the free coinage of silver vei, at Buckingham County Court, the second Monday in May, 1896. The meeting will be addressed by distinguished speakers. The crisis is upon us  it is necessary for us to speak or forever hold our peace. We hope the attendance will be large. Camm Patterson, M. W. Fitzpat rick, G. W. Patterson, A. S. Hall, J. Allen, E. C. Woolridge, William Williams, Samuel D. Holman,Creed T. Davis, R. A. Glover, E. M. Miles, C. R. Baird, W. R. Moore, J. H. Fitzgerald, Jr., P. P. Glover, C. L. Davis, H. D. Omohundro, W. H. Baird, E. H. Miller, M. S. Jones, E. P. Dunnevant, D. M. Word, R. H. Payne, C. D. McCraw,R. H. Wooten, H. F. Chappell,W. A. Chambers,Jr., J, T. Rogers, Jeff Davis,?. C. Moon, E, W. Hubard."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "the transaction ofW. B. <mark>Tinsley</mark>, decd, late Heclean in"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "the transaction ofW. B. <mark>Tinsley</mark>, decd, late Heclean in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [690.24, 1339.17, 824.1, 1492.82], "bbox_id": "3a948c4838", "file": "AppomattoxNewspapers_1892-1898a_0300.pdf", "page": 1, "text": "Megginson and others. To Rosa A. Megginson, Norvell Megginson, tin II. Megginson. Chiton Megginson, H attie lro Estelle Megginson, J. 1. dieuad litem and Marv i Plain tills and ieUiu s u it You are hereby fixed upon Weduesduy.  1896. as the time and my  C. H., as the place, tor ta counts in the above sty the decree therein of A p 1st. An account of the Debricks is entitled to o the said Ida B. Meggidsc ginson and H attie Iron estate of Ann Megginaor 2nd An aceout of the t Tinsley, decd, late 1  cause. Given under my hand the date abovi 13. L. FEiUi USON, Commissioner H. D. FLOOD, p"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "aceout of the t <mark>Tinsley</mark>, decd, late 1  cause."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "aceout of the t <mark>Tinsley</mark>, decd, late 1  cause."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [613.4, 348.86, 756.08, 844.36], "bbox_id": "34b08f11bb", "file": "AppomattoxNewspapers_1939-1943a_0318.pdf", "page": 1, "text": "Maurice Elliott. Gordon Volney Wilson Garrett. David Chester Jacobs Wiley Ferguson Licrdon Dele ward Thomas Oscar Tinsley Whitten Charles Henry Phelps Aubrey C. Calloway John Howard Goin Hezekiah Williams Clarence Alfred Agee Ollie Ramsey Hammock Giles Cephas Walker Richard Floyd Burke, 111 Eddie Roscoe Saunders Floyd Malcolm Jarrells Clarence Edward Webber Claude Earnest Stevens Willard Cordell Johnson Chap Everette Patterson John Walter Harvey Nelson Franklin Fields Willie Marshall Austin Frederick Dickerson Thomas Edward Hubbard Jlolmsey Inge, Jr. i William Monroe Carrico  John Eldridge Eagle t James Terry Rogers l Randoplh Delaward Guil!  Bernace Rice Moore  Samuel Esmond Robertson 9 Thomas Pervis Almond 1 Arthur Allen Blackwell 1 Will Henderson rerguson 2 LewelVyn Giles, Jr. William Herbert Richardson 2 Henry Willard Reed Aubrey Neal Morris Clayton Edward Burge Lawrence Samuel Jennings 5 Russell McConnie Shelto John Sam Harvsy 13 Thomas Edward Childers t James Edward Tweedy t 9 Leonard Bernerd Woody 5 John William Trent 27 Paul William Server 35 Claude Alfred Jamercon 8 James Edward Paige 28 Robert Bruce Patterson 24 William Nathaniel Bryant 30 Alfred Mundy Moor  Shelton Ould Routon William Garland Mitchell"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Dele ward Thomas Oscar <mark>Tinsley</mark> Whitten Charles Henry Phelps"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Dele ward Thomas Oscar <mark>Tinsley</mark> Whitten Charles Henry Phelps"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.94, 652.05, 2006.56, 979.58], "bbox_id": "a48ba0c776", "file": "TimesVirginian_1980a_0403.pdf", "page": 1, "text": "matching lace to which vas attached the finger tip length veil of illusion. The bride carried a cascading bouquet of white and yelloiv  rosebuds, and babys breath. Miss Joan Marie Ellyson of Chesapeake, cousin of the bride was maid of honor. She wort a floor length dress of forest green fashioned with high sheer neckline. She carried a mjsegay of bronze mums and miniature daisies. Bridesmaids were Miss Julie Ryan and Miss Sharon Townsend of Farrmrille. They wore dresses-identical to that of the honor attendant. -   Mr. Lwelyn Gilliam of Pamplin was best man and usher? were Mr. Henry Womack and Mr, Rodger Childress, cousin of the . bride. Miss Christy Lynn Pugh .was flower girl and Jason Tinsley, cousin of the bride was ring bearer. Following thp ceremony, the brides parents enter-"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "flower girl and Jason <mark>Tinsley</mark>, cousin of the bride"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "flower girl and Jason <mark>Tinsley</mark>, cousin of the bride"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.81, 1346.09, 2000.15, 1720.68], "bbox_id": "d704426eda", "file": "AppomattoxNewspapers_1915-1918a_0368.pdf", "page": 1, "text": "m attox and three times bully  and clear. She 8ing8 with feel. for her public spirited citizens ing and ha8 the artl8tio tom_ Who know how to accomplish peram ent-News-Lender,Rich- th,n8 Imond, Va. Judge Hundley opened court The recital of John Powell here Monday and granted the and Anna Jones attracted a . following soft drink licenseslarge crowd, who were delight- R. D. Baldwin, J. W. Neigh- ed at the program presented. I Owners If a corporation, give bors, H. R. Hancock, G. W. Times Dispatch, Richmond,Va. names andaddresaesof stockhold- Watson, E. P. Tanner, B. L. j The interpretative excellence era holding 1 per cent or more of Wheeler, W. H. Robertson, of Anna Joness vocalism in a  total amount of stock. A. H. Franklin Bros., J. R. Hamilton, group of American songs added  Element, H. D. Flo id, Appomat- C. T. Evans, Evergreen Supply to the charm of an unusually tox Co., J. T. Ferguson, L E. beautiful voice.The Reporter, I nown bondholders,mortgagees and Smith, J. T. Turnes, H. M. Holly Springs, Miss. Burge, Ed. Scruggs, R. W. Ab- Anna Jones gave a varied bitt, R.. W. Burkey  Son, Pat program that proved her musi- Chandler, Evans  Dickerson, ciansbip. Her gifts as an in- Qlenfall Mercantile Co., W. D. terpreter, and her imaginative Hix  Co., Chas. F. James, H. faculty were revealed in each M. Marshall, Ida F. Marks, W. group of songs. She has a E. Moore  Son, Wm. T. Nash, pleasing voice and enters into  Mrs. V. C. Tinsley, Inge  Mor- the atmosphere of every song, ris, Holmsey Inge, H. C. Bab- Hackettstonian, H a c k etts- cock and J. E. Childers. town, N. J. In the case of H. W. Me Kin- The range and quality of uey, admr. of W. H. Shively, voice, her fluent technique, and jr., vs. N.  W. Ry. Co., the remarkable interpretative ver- court set aside the verdict of satility combined to make An- 10,000 awarded at last term of na Jones a singer of unusnal court to the plaintiff and award-  p o w e r .  Greensboro . Daily d the defendant  new trial. News, N. 0,"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "into  Mrs. V. C. <mark>Tinsley</mark>, Inge  Mor- the atmosphere"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "into  Mrs. V. C. <mark>Tinsley</mark>, Inge  Mor- the atmosphere"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1015.45, 543.81, 1168.56, 608.96], "bbox_id": "39fc8a128d", "file": "AppomattoxNewspapers_1922-1923a_0085.pdf", "page": 1, "text": "Lynchburg.Mrs. I. W. Tinsley has received information of the death at Tulsa, Okla., of Harry E. Mason, of Okmulgee, Okla., who was a native of Amherst county- and who has many relatives in tin county. He is sur vived by his widow and two daughters."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Lynchburg.Mrs. I. W. <mark>Tinsley</mark> has received information of"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Lynchburg.Mrs. I. W. <mark>Tinsley</mark> has received information of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1462.0, 812.76, 1747.54, 1039.01], "bbox_id": "f8c844d97a", "file": "AppomattoxNewspapers_1943-1947a_0289.pdf", "page": 1, "text": "LOOK HERE 1 Men and son oi Lynchburg are visiting wanted to sta rtin bus-! ter Parents Mr- and Mrs- Jessie   some 200 j Harvey, Thousands  Mrs. George Alexander, of Chevy Chase, Washington, D. C., visited the Featherstons this week. Mrs. Alexander was the former Miss Sydney Taylor, and the grand daughter of Mr. Ben Tinsley, who arW ivu  one time owned and lived at STUKM j j.jjg i!0me now owned by the Scotts m your. at the old court house. 50 to 35 Ise fam- Miss Patty Featherstton visited paint for in Lynchburg this week, s in six building Mr. and Mrs. J. C. Caldwell and DeWITT Mr. and Mrs. R. M Mann plan to - attend the William and Mary and Tennessee football game Saturday. __ , The Emma Hancock Circle will , , meet Wednesday afternoon, Octo- Iso three j jjer io at 3 oclock, with Mrs. W. gs, either P. Gills."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "daughter of Mr. Ben <mark>Tinsley</mark>, who arW ivu  one"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "daughter of Mr. Ben <mark>Tinsley</mark>, who arW ivu  one"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [421.39, 633.03, 552.16, 809.38], "bbox_id": "63d3613865", "file": "TimesVirginian_1980a_0397.pdf", "page": 1, "text": "K ment. He will discuss to estimate the feeding value of these forages and ways to determine how these feeds should be supplemented. extension A gents, Sp encer Tinsley and Sam Waddell, will explain assis tance available to dairy farm ers through county Extension offices, including availability of disaster loans, procedures for testing for age quality, and assistance with planning of economical feeding programs."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "A gents, Sp encer <mark>Tinsley</mark> and Sam Waddell, will"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "A gents, Sp encer <mark>Tinsley</mark> and Sam Waddell, will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1140.01, 186.56, 1302.38, 952.14], "bbox_id": "f9f29344f7", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "j Serial No. Name j 416, Floyd Custis Gordon  617, George Wiley Harding  526, Lewis L Doss  613, Cleveland Eagle 609, Harry S. Drinkard 316, Russel Jenkins 274, James Burton 546, Hunter Milton Moore 511, Thomas Vawter 206, Shelton Herry Hudson 342, Sam Henry Goin 293, Charles Willie Orange 460, Charlie W. Soruggs 427, Joel Thomas Morris 666, Geo. Washington Green 241, Ed Reed 40, Kenneth W Furbush 100 , Samuel Arlington Per dieu 572, Harry Tucker Woodson 167, Benjamin Patterson 214, Lawrence Mann 236, Floyd Wyatt Harvey 647, Willie A. Weakley 629, Oolonel Thomas Mays 29, Walter Emerson Durham 533, Robert Thomas Kyle 61, Eugene Watson Harris 114, Easel LeRoy Smith 151, James Leonard Moss 618, Wm. Edward Harris 603, Joseph Owen Carson 33, Arthur Fleshman 209, Walter Clifton Lee 32, Ernest Ferguson  63, Odell Howerton I 362, William Lee Goode I 371, William Henry Marshall j 529, John Samuel Guill j 64, O. Kendall Hunter 382, Robert Odie Abbitt  224, Ernest Reid 449, Geokge Wesley Wright 41, Lawrence E. Furbush 38, Marshall Hubert Franklin j 48, Wiley W Godsey 640, Stratton Marvin Ander- son  668, Luther Johtr-Hubbard 88, David P Moon 127, Samuel D Whitaker j 287, Herbert H u d s o n Jen- niugs  260, Joseph P Panlett ! 473, Freeman Thomas Tinsley 586, Samuel Johnson 527, William Herman Guill 254, Daniel W Dinkins 446, Alfred Berkley Turnes 89, Wm. Archer Moon 358, Wiley Young 573, George Washington Aus tin 451, R Childress Wright"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Panlett ! 473, Freeman Thomas <mark>Tinsley</mark> 586, Samuel Johnson 527,"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Panlett ! 473, Freeman Thomas <mark>Tinsley</mark> 586, Samuel Johnson 527,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1750.1, 314.25, 1916.26, 1644.89], "bbox_id": "923419c43e", "file": "AppomattoxNewspapers_1902-1905a_0385.pdf", "page": 1, "text": "J. B. Gray contracted to sell his es tate, Travelers Rest, in Stafford county, to the wife of Dr. O. D. Nor ton, surgeon in the United States Navy, for 23,000. Mrs. Norton has paid only 500. She has made repairs, to the residence, -but it is understood that she now declines to take the property. Mr. Gray has entered suit here for 10,000 damages and has levied on valuable furniture Mrs. Nor ton has stored. In the Circuit Court of Charles County Judge Thomas W. Harrison sentenced Joseph H. Copenhaver for 12 years in the Virginia Penitentiary. Copenhavers attornies, Marshall Mc Cormick and Blackburn Smith, se cured a stay of sentence for 90 days and will take the case to the State Supreme Court. Copenhaver shot and killed his wife last April while on a spree.  He had been confined in the  insane asylum at Staunton on several occasions.  J. Lewis Evans, one of the oldest locomotive engineers in the world, died in Lynchburg, in the seventy- ninth year of his age. He had been in the employ of the Southern and the older companies for over half a cen tury, and for 40 years was engineer on passenger trains, having operated the first train on the old Grange and Al exandria Railroad. He had lived in Lynchburg about 40 years, but during the past year had been very feeble. Mrs. Catherine A. Brady, widow of the late John L. Brady, of Scotttsville, Albemarle county, died at the home of her daughter, Mrs. Robert A. Sanders, at New Baltimore in her ninety-first year. As the result of a row at Buena Vista, Stuart Farrow, a resident of thatt city, had his legs cut off by a freight train, and Edward Tinsley is now confined in the jail at Lexington for shooting Robert White. The lat ter are negroes and quarreled ovet liquor. Farrow was watching the fight and did not notice the approach of the train. He is not expected to live. Mrs. Jane B. Meade, widow of Rich ard Kidder Meade, died .t her home, hear White Post, Clarke county, aged 86 years. She was a daughter o Benjamin Grymes, of Somerset, King George county. A large mortgage is now being spread upon the records of the Cir cuit Court of Warren County. II is  deed of trust by the Norfolk and Western Railroad Company to se cure the sum of 35,000,000. The in strument, which is in book form, bears the date of July 1, 1904, and contains 79 pages of closely printed matter. The State tax amounts to 20,964, and the document has to be recorded in every county through which this railway passes. The trustee is the Guaranty Trust Company of New York. The attempt to wreck a freight tram on the Chesapeake and Ohio Railway near Lynchburg evidently wai planned by four men whose purpose was robbery. One of the men was on the train when it struck the obstruc tion,. and when it stopped he began throwing mOrohandise from, a car. The attempt to loot the train, how ever, was unsuccessful. Roy Christie, 14 years old, of New port News, was thrown from a bicy cle and had his skull fractured from ear to ear. He was removed to the hospital and an operation was per formed, but the physicians entertfiin little hope for his recovery. The boy was speeding along the street on his way from school, when his wheel struck a rock. In the Police Court, at Lynchburg Mayor Smith acquitted E. E. Lips comb, an expressman, of the charge of feloniously shooting Pullman Con ductor Charles L. Harrison in that city two weeks ago, the evidence showing that the shooting was ar accident. A fine 25 was imposed on Lipscomb form criminal carelessness in handling a loaded weapon. The case will be appealed. The-Lynchburg City Council adopt ed a resolution in joint session author izing the City Attorney to take steps to stop the pollution of the James river by pulp mills. It is believed thal this is the beginning of a big fight to be made against pulp mill owners in the vicinity of Covington. Recent ly the water has become black. Mrs. William Corcoran Eustis, of Oatlands, has donated to Leesburg the free services of a professional nurse in memory of her sister, Miss Morton, daughter of ex-Vice Pres ident Levi P. Morton, of New York, who died recently in Paris from ap pendicitis. Walter S. Johnson, of New York, has sold his minority of 3,500 share in the Norfolk and Southern Rail road, and Albert H. Flint, of New York, president of tthe Chesapeake Transit Company, is in control of the two properties. The merger of the roads was determined months ago, but was stopped on the application of the minority stockholders by an injunc tion from Judge Greenbaum, of New York. The price was less than 400,- 300 , but the names of the purchasers are withheld by the attorney who made the transfer in New York. This sale confirms the merger of the two roads and assures the value of the Chesapeake Line to Cape Henry by he profits of the Norfolk and South- rn. Benjamin F. Levy, 20 years of age, af Norfolk, was sent to fail for beat ing his mother, 60 years of age, after 1 quarrel about a rifle the boy wished to take. The third annual exhibition of the Lynchburg Horse Show Association, o be held at Lynchburg on October 11, 12, 13 and 14, promises to be one of the most successful events of its haracter ever attempted in the State of Virginia. Work was commenced on the instal lation of a police patrol system in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "freight train, and Edward <mark>Tinsley</mark> is now confined in"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "freight train, and Edward <mark>Tinsley</mark> is now confined in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2252.9, 1699.26, 2409.78, 1736.31], "bbox_id": "fa46678c33", "file": "AppomattoxNewspapers_1892-1898a_0096.pdf", "page": 1, "text": "interest from day of rale, w ith approved per sonal security. Title retained till purchase money is paid. W it. B. TINSLEY, Special  Bond executed as required bylaw . Gxo. T. P Oct. 5-4 w."}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "paid. W it. B. <mark>TINSLEY</mark>, Special  Bond executed as"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "paid. W it. B. <mark>TINSLEY</mark>, Special  Bond executed as"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1733.26, 461.25, 1874.33, 609.24], "bbox_id": "7e07d3ba11", "file": "AppomattoxNewspapers_1971-1973a_0367.pdf", "page": 1, "text": "ing to Texas for boot training. Mr. and M rs. Tom McVetty and daughter of Michigan are vi siting her mother, Mrs. Elie Thornhill. Mr. and M rs. Clinton Gallaspie went to New London last Sunday for a family reunion - The Tinsley. Mr. and M rs. Tom David son and family went to Char lottesville Sunday afternoon to visit Mr. and Mrs. C l a u d e Trent. Becky will spend this"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "a family reunion - The <mark>Tinsley</mark>. Mr. and M rs."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "a family reunion - The <mark>Tinsley</mark>. Mr. and M rs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [742.3, 934.73, 1032.94, 1358.93], "bbox_id": "93051fc551", "file": "AppomattoxNewspapers_1962-1965a_0524.pdf", "page": 1, "text": "In the Clerks Office of the Cir cuit Court of Appomattox Coun ty, on the 13th day of October, 1964 G. M. WOOTEN, Complainant Vs. DOROTHY ANN WOOTEN KIN- CHEN and BUFORD KINCHEN, Defendants IN CHANCERY ORDER OF PUBLICATION The object of the above styled suit is to have a partition in one of the modes prescribed by law of certain real estate owned by G. M. Wooten and Dorothy Ann Wooten Kinchen as tenants in common in Appomattox County, Virginia, and for other, further and general relief and it ap pearing from affidavit in due form of law now filed that the defendants, Dorothy Ann Wooten Kinchen and Buford Kinchen, are not residents of the State of Vir ginia that the last known post office address of Dorothy Ann Wooten Kinchen and Buford Kin chen is Jacksonville, Texas. On consideration whereof, it is ordered that the said Dorothy Ann Wooten Kinchen and Buford Kinchen do appear here within ten days after due publication of this order and do what is necessary to protect their inter ests. It is further ordered that the foregoing portion of this order be published once a week for surance to be pro-rated as of four successive weeks in the date of sale. j Times-Virginian, a newspaper Robert E. Tinsley published in the County of Ap- Substitute Turstee pomattox, Virginia. 10-29-3t I Aldah B. Gordon, Clerk"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "a newspaper Robert E. <mark>Tinsley</mark> published in the County"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "a newspaper Robert E. <mark>Tinsley</mark> published in the County"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2104.08, 197.06, 2245.28, 490.24], "bbox_id": "6555eb19bf", "file": "AppomattoxNewspapers_1971-1973a_0029.pdf", "page": 1, "text": "I am come a light unto the world. John 1246 Mrs. J. P. Leitner of Ports mouth spent the week end with Mrs. Elsie Thornhill. So very nice to see her at Hebron Sun day. Mr. and Mrs. Steve Tinsley of Lynchburg spent Su nd a y afternoon with his sister and her husband, Mr. and Mrs. Clinton Gillaspie. The picnic of Home Dem. Club was well attended at He bron Friday night. About 50 was present. Mr. and Mrs. Clinton Gil laspie, Mr. and Mrs. Dallas Gillaspie and girls, Mr. and Mrs. Bill Roope and children and Mr. and Mrs.W. E. Bon- durant, Jr. and sons attended the centennial Sunday at Madi son Heights Baptist Church. Rev. Floy Cox was guest prea cher of Columbia, S. C. where he has a church. Mr. and Mrs. Steve Miller"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Mr. and Mrs. Steve <mark>Tinsley</mark> of Lynchburg spent Su"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Mr. and Mrs. Steve <mark>Tinsley</mark> of Lynchburg spent Su"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1890.52, 1396.3, 2217.75, 1692.45], "bbox_id": "95aaba0cd3", "file": "AppomattoxNewspapers_1908-1909a_0500.pdf", "page": 1, "text": "i -, A- h T. Burge MoorerC Oakville stisses Mary and Ella Rob- spent a few days last week fish- ertsnf of Lynchburg, and ing with his brother, C. A. prank Robertson and Sam Wy- Moore, on James river. riCk, of Greensboro, N.C., spent Mr. and Mrs. C. A. Mopre Sunday in the home of Mr. n d were gladly surprised Sunday!Mrs. W. D. Robertson, by having all their children tors. W. D. Robertson is in grandchildren, and in-laws Virginia Baptist hofspitol and present for the day. will undergo an operation on W. R. Tinsley, of Roanoke, Friday. was a visitor in this neighbor-1  -------- oh ----- -r hood the past week. V Will Preach at Evergreen The Epworth League of the The Rev. R. E. Redding, pas- two churches, M t Comfort and tor of the Appomattox group of Trinity, are expecting to meetjpresbyterian churches, _wiu Wednesday afternoon on the preach at the Evergreen Pres- James for a fish fry.  byterian church Sunday, May ________ _ _______ _ 29, at 11 AM. Het taketh Notice away the First that He may es- -------- - tablish the second, will be his 1931 taxes must be paid now. germon subject for this occa- We will be at the treasurers I gin. office on Court day, June 1, on1 Saturday, May 28, and Satur day, June 4. F. T. Cawthom, Dep. Treas. B. E. Megginson, Dap. Treas."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "operation on W. R. <mark>Tinsley</mark>, of Roanoke, Friday. was"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "operation on W. R. <mark>Tinsley</mark>, of Roanoke, Friday. was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2284.8, 173.65, 2568.35, 859.87], "bbox_id": "a954b5e002", "file": "AppomattoxNewspapers_1974-1975a_0214.pdf", "page": 1, "text": "Hodge T .J. Appomattox 2452S Kress John Christian Pamplin 2395ft Kress Mildred P.O. Box 66 28958b- Mann R.C. Evergreen 23939- Martin FredH. Rt. 1 2452 Martin Fred H.. Jr. Rt. 1 _ je 24522- Mayberry HenryT. P.O.BOX 281 24522-  Mayberry PeggyC. P. 0. Box 281 2452- 23939- Mitchell Ann Evergreen Moore Allen Butler Evergreen 23939  Moore Morris Elizabeth K. John A. Evergreen Appomattox 23939 24522- Paulett Ethel F. Appomattox 2452fc Ran son Maude Rt. 1 23958 Ranson William C. Concord 2453Ég Reed Harry T. Appomattox 24522fCv Scruggs Elizabeth Gladstone 24658  St. John Carrie Rt. 1 2452SÖ Taylor James R. P. 0. Box 595 2 4 5  23939 g  Tolbert Barbara Jane Evergreen Weatherhold Wesley W. Rt. 1 239Öfcfb Weatherholtz Doris Rt. 1 2395? Weatherholtz Evelyn Pamplin 23958 Webb Vera Westalene Rt. 2, Box 278 23939 Webber KayC. Pamplin 23958 Webber Lawrence H. Rt. 1 23958 Webber Ruby S. Rt. 1 23958 Williams Helen Appomattox 24522 56 DELETED PER PRECINCT LOCALITY 011 APPOMATTOX COUNTY PRECINCT 201 CHAP Bailey Nannie Appomattox 24522 Baker Alma Rt. 1 24522 Baker Robinson Rt. 1 24522 Biglow Frank Mathew Rt. 1 24522 Boydston Wayne E. K tl 24522 Brown James Irvin Appomattox 24522 Brown Maude 8. Appomattox 24522 Burns Tinsley Rt. 1 24522 Clark Earnest Rt. 1, Box 281 24522 Clarke Ethel Henry Rt. 1 24522 Coleman Rosa J. Appomattox 24522- Cordell Sam Appomattox 24522. Crews Chester Edward Appo.,Rt. 1 24522 Daniel Floyd Appo., Rt. 1 24522 i Daniel Walter Lenwood,Jr. Appo., Rt. 1 24522 . Eames OUthur Rt. 1 24522 Elder James Fred Rt. 1 24522 Fleshman Ruby Ann Rt. 1 24522 Fleshman Sylvia G. P.O. Box 515 24522 Godsey Charlie B. Rt. 1 24522 Godsey Edith M. Rt. 1 24522, Hamilton Jack Marion Rt. 1 24522 Hamleti Sadie Appomattox 24522 Hancock William E. Rt. 1 24622 Harvey Elmira Rt. 1 24522 Harvey John Sam Rt. 1 24522 Hicks RoscoeE.  t.l 24522 Hicks Sarah C. Rt. 1 24522,. Hudson Billy Wayne Rt. 1, Box 227 24522 Hudson Lillian Appomattox 24522 Jones Hilda A. Appomattox 24522  Jones Warren O. Appomattox 24522. Jordon Charles Rt. 1 24522"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "8. Appomattox 24522 Burns <mark>Tinsley</mark> Rt. 1 24522 Clark"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "8. Appomattox 24522 Burns <mark>Tinsley</mark> Rt. 1 24522 Clark"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [566.34, 1226.59, 726.32, 1589.63], "bbox_id": "21b907f004", "file": "AppomattoxNewspapers_1915-1918a_0537.pdf", "page": 1, "text": "here. Subject Preventing Ty phoid Fever. He will also vis it the school and examine the children. Mrs. Callie Holden and chil dren, of Blue Ridge, are visit ing Mrs. Q. D. Sizemore. Messrs Lloyd Inge, Jamie Thornton, Galvin Baldwin and Chester Hindley were up from Camp Lee to spil Sunday with home people here. Mrs. F. 8 . Callah.vi  visit ing her home people in Peters burg. Mr. V. P. Paulett, who has been in St. Lukes Hospital in Riohmond for medical treat- men .returned to his home here a few days ago, we hope much improved. Mr. H. B. Young, who has been sick for several weeks, is still confined to his room. Mrs. J. B. Tinsley and baby of Lynchburg, are visiting her mother here, Mrs. M. A. Clark. Mrs. N. A. Davis was in Lex mgton last week visiting her son, Calvin, who is attending V. M. I."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "room. Mrs. J. B. <mark>Tinsley</mark> and baby of Lynchburg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "room. Mrs. J. B. <mark>Tinsley</mark> and baby of Lynchburg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1844.6, 1028.21, 1972.35, 1058.11], "bbox_id": "5b419d46b7", "file": "AppomattoxNewspapers_1952-1954a_0483.pdf", "page": 1, "text": "Helen Tinsley and Mrs. H h, of Lynchburg spent Mon h Mrs. E. B. Martin."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Helen <mark>Tinsley</mark> and Mrs. H h, of Lynchburg spent Mon h Mrs. E. B. Martin."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Helen <mark>Tinsley</mark> and Mrs. H h, of Lynchburg spent Mon h Mrs. E. B. Martin."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [658.1, 807.63, 976.76, 903.58], "bbox_id": "d12c010abf", "file": "AppomattoxNewspapers_1902-1905a_0440.pdf", "page": 1, "text": "having been skillfully prepared by his attorneys, J. L. Lee and Tinsley Cole man, of Lynchburg. There were 45 assignments of error, one being on a point hitherto not raised-Mhe right of jurors to read the daily papers during the progress of a case. I merit ______ It. will be remembered that Judge net. Svstem  George W. Morris, who presided at Me- New cMt Oe,eo e Sy t . Cues trial, allowed the jury to read the I The President issued a most impor.- oapers, but cautioned them to avoid the tnat order appointing a board, coqsis  r .  . . . ,1 fPL - A  I  _ ri Wof raft. I ,16111"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "J. L. Lee and <mark>Tinsley</mark> Cole man, of Lynchburg."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "J. L. Lee and <mark>Tinsley</mark> Cole man, of Lynchburg."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1823.73, 443.95, 1991.82, 613.3], "bbox_id": "dc11648ff9", "file": "AppomattoxNewspapers_1933-1936a_0257.pdf", "page": 1, "text": "had their tonsils removed, They re turned home Saturday morning with h B four patients getting along nicely. Last Thursday r i g h t  many from Trinity attended the, annual circuit S i c at the Mtehocmt nr.rsonage Ovite a in umber were p ---- boinHful dinner was served m p.cmc stvJe The younger ones enjoyed the aav playing croquet, checkers and oth r games while the older and more s date! enjoyed t h e m  J v e s in social conversation and sitting under the shade of the old oak tree. I Mr and Mrs. Ashby Martin ana Mrs. R. Mays were dinner guest Monday of Mr. and Mrs. A .F. Dnnk ard. . R W Tinsley of Roanoke was in"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Dnnk ard. . R W <mark>Tinsley</mark> of Roanoke was in"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Dnnk ard. . R W <mark>Tinsley</mark> of Roanoke was in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.77, 1472.38, 1603.82, 1786.52], "bbox_id": "fae0dcaa17", "file": "AppomattoxNewspapers_1908-1909a_0049.pdf", "page": 1, "text": "Green mountain potatoes, first, F T Cawthorn second, Bessie Gunter. - Stalks cane, first, M F Moon, second, R C Jones, third, C S Cawthorn. Sweepstakes, first, WW Far rar, second, W W Farrar, third, Mrs J R Caldwell. - J- Peanuts, first and second none third, George Carson.  Buckwheat, first, Mrs. ,B B Marshall. -   Celery, first, M r s C R Cald- I well, second, Mrs, C R Caldwell. Beets,, first, Mrs W A Moon, second, Raymond Tinsley Craw ley, third, Guy Smith, p r Stalks corn, first, Stratton Bros. . Sheaf of wheat, first, none, Second, William Moon. I Bale hay, first, E L Smith. .jS Bunch soy beans, first, Mrs O L Scheffler, second Ira Burrell, third, W W Farrar."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "A Moon, second, Raymond <mark>Tinsley</mark> Craw ley, third, Guy"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "A Moon, second, Raymond <mark>Tinsley</mark> Craw ley, third, Guy"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1408.99, 376.16, 1707.15, 426.41], "bbox_id": "627965e9c3", "file": "TimesVirginian_1981a_0240.pdf", "page": 1, "text": "F IV E GENERATIO NS PR ESEN T AT TH E TURNER-DUFF reunion from left Hattie Turner Al vis first generation, Inex Turner Smith second. Marrian Duff Tinsley third, Sheila Walsh Johnson and R om Johnson fourth and fifth, and William Walsh and Scott Walsh fourth and fifth."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Smith second. Marrian Duff <mark>Tinsley</mark> third, Sheila Walsh Johnson"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Smith second. Marrian Duff <mark>Tinsley</mark> third, Sheila Walsh Johnson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1763.73, 505.72, 1932.33, 917.27], "bbox_id": "9da5737d73", "file": "AppomattoxNewspapers_1915-1918a_0107.pdf", "page": 1, "text": "F arm ers are q u ite busy ttrip - ping and hau lin g th eir tobacco to m arket. C. W . Phelps, J . O. H arris, J . W . Dixon and Leonard T hornhill of th is vi cinity sold tobacco a t Appo m attox last week and all were very well pleased w ith the prices. Mrs. Id a Kyle is visiting in R ichm ond a t this tim e. Mr. W . H. Beal, of Pam plin, visited his fath er, T. O. Beal a sh o rt w hile last week. There h as been r g h t m uch grippe an d m easles in Our com m unity and the doctors are k ept busy. Mr. EL P. Sw artz, of Biue- fieid, W . V a., was in th e neigh borhood last week looking a fte r a farm he bought of Mr.  W. R. Tinsley, of Roanoke. He is h av in g the land cleared and expects to bet out a lot of fruit I trees and may bring his saw mill dow n and cut the tim bdr I before he builds on the fafm . j I Miss Ballow returned to her I school a t B ent Creek last week! I afte r having been on the bickl I list for a week. She is g ettin g Ion nioeiy w ith her school suldi I has a larg e enrollm ent.  Mr. and I Mrs. C-JW . P hafa"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "of Mr.  W. R. <mark>Tinsley</mark>, of Roanoke. He is"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "of Mr.  W. R. <mark>Tinsley</mark>, of Roanoke. He is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [268.31, 839.32, 426.81, 944.62], "bbox_id": "f3ccdb8a93", "file": "AppomattoxNewspapers_1902-1905a_0157.pdf", "page": 1, "text": "Ex-Judge Archer A. Phlegar is a candidate for the Staite Senate in the Montgomery-Hoanoke district. Mr. Aylett B. Coleman, of Hoanoke city, a younger half-brother of onr friend J. Tinsley Coleman, of Lynchburg, is a candidate for the House of Dele gates, and will be declared the nomi nee without opposition."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "of onr friend J. <mark>Tinsley</mark> Coleman, of Lynchburg, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "of onr friend J. <mark>Tinsley</mark> Coleman, of Lynchburg, is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [131.29, 210.7, 281.03, 759.42], "bbox_id": "bb04349d7c", "file": "TimesVirginian_1980a_0266.pdf", "page": 1, "text": "Eldridge W. Allen, Sr. Eldridge William Allen Sr., 35, of Spout Spring died at 825 a.m. Monday in Lynchburg General Hospi tal. His wife is Yvonne Bartley Allen. t Born in Amherst County, he was a son of Mrs. Roxie Allen Brown of Madison Heights and the late Eldridge B. Allen. He was a member of Spout Spring Baptist Church, a construc tion superintendent and a lay Baptist preacher1. He was a Vietnam veteran and received a bronze Star with V Device for Valor. In addition to his wife and mother, he is survived by his stepfather, Willie E. Br own of Madison Heights three sons, Eldridge Bud- o dy Allen Jr., Dale Patrick Allen and Gregory Scott Allen, all of Spout Spring a daughter, Jennifer Marie Allen of Spout Spring his paternal grandmother, Mrs. W. S. Birdie Allen of Amherst six brothers, Dr. Raymond F. Allen of ., Blacksburg, Robert L. Allen of Lynchburg, Edward W. Allen of Monroe, Kenneth E. Allen of Centreville, Henry  L. Allen and Joe W. Allen, both of Madison Heights two sisters, Mrs. W. Tinsley Roxie Apn Hill of Amherst and Mrs.Donny R. Bettie Sue Jennings of Madison Heights.      Funeral services were held at -11 a.m. Wednesday V in  Spout .Spring Baptist Church by the Rev. George Kreidel, Sr. and, Dr. Ray mond Allen. Burial was in the church cemetery. Robinson Funeral Home was in charge of arrange ments."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "two sisters, Mrs. W. <mark>Tinsley</mark> Roxie Apn Hill of"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "two sisters, Mrs. W. <mark>Tinsley</mark> Roxie Apn Hill of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1894.7, 479.08, 2040.97, 967.2], "bbox_id": "aa6cb1c7ad", "file": "AppomattoxNewspapers_1962-1965a_0518.pdf", "page": 1, "text": "day., the 28th day of November, 1964 at 200 oclock p.m., sell at public auction to the highest bidder, for cash, the following described real estate, to-wit All of that certain lot and parcel of land situated about one mile South of the Vil lage of Stonewall in Stone wall Magisterial District of Appomattox County, Virgin ia and being a portion of the real estate that was deeded unto the said Mary Lambert Hubbard by a deed dated May 1, 1953 duly admitted to record in the Clkers Office of the Circuit Court of Appo- mottox County in Deed Book 58 at page 472 thereof, which parcel of land hereby con veyed is more specifically described as follows Beginning at a point 107 ft. West of the boundary line of Thomas Hubbard where it adjoins S t a t e Secondary Road No. 608 and thence in a general northwestern direc tion 200 feet to a point 107 feet West of the lands of Thomas Hubbard thence in a general Western direction parallel with Road No. 608 50 feet thence in a general Southern direction back to State Secondary Road No. 608 200 feet parallel with the first line run here in above mentioned thence along the northern edge of Road No. 608 50 feet on State Second ary Road No. 608 and ex tending back between paral lel lines 200 feet. TERMSCASH taxes and in surance to be pro-rated as of date of sale. Robert E. Tinsley Substitute Turstee 10-29-3t"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "of sale. Robert E. <mark>Tinsley</mark> Substitute Turstee 10-29-3t"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "of sale. Robert E. <mark>Tinsley</mark> Substitute Turstee 10-29-3t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.1, 1008.25, 2058.12, 1305.08], "bbox_id": "89937b2560", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "County surveyor w ie A. S. Swan.  Chrbtian. the grandfather of local Treasurer for the county was J. F. dtissn, Chesley Christian and the W  rA im tj finwiintirfnnir e t father of the late Dr. David Christian, Revenue was George W. Abbitt, who Sr. H.T. Parish, R B . Poore and C. H. incidently, was the grandfather of Sackett. several Appomattox redden ts. Retired If you happened to be. livmg in the Congressman Watkins M. Abbitt, community of Evergreen in 1688 you H erbert M. A bbitt, pharm acist, had only a short walk to a law Retired Judge George F. Abbitt, Jr. office.....the attorney was J.P.L . and Mrs. Dora Abbitt Conner.  Fleshman located there in the village. In 1888 Appdlnattox County Pamplin City had not one, but two Commonwealths Attorney was W. C. law offices. One was that of W. C. Franklin. Franklin, also the County Common- As it is today, three, county wealth Attorney. The second Pamplin supervisors made up the governing attorney w asE .R Woodson. body for the county. They were William B. Tinsley wad an attorney Wflfiam A. White, Chairman D. R with an office in Mineral, community in Marshall and H. E. Gilliam. the area known today as Bent Creek. There was no shortage of attorneys If you lived in Tower HOI community in Appomattox bad in 1888. Attorney the lawyer to see was T. J. Thornhill. T.S.Bocoek had iris law office set up m There were no automobile dealer- the community of Tower Hfll which is ships back in 1888 but plenty of coach near what is today Routes 60 and864. and wagonmakers. Stephen Beasley Appomattox Court House had four was the man to see for a new coach or law offices. One attorney was D. A. wagon if you lived in Tower HilL E. E. Chism and W.W. Ragland were coach A a fi f  and wagon m ake in Evergreen. J.W.  Clark, Samud Davis and Z. Taylor in"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "They were William B. <mark>Tinsley</mark> wad an attorney Wflfiam"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "They were William B. <mark>Tinsley</mark> wad an attorney Wflfiam"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1824.5, 1556.05, 1997.97, 1816.36], "bbox_id": "60ec08f34f", "file": "AppomattoxNewspapers_1947-1949a_0342.pdf", "page": 1, "text": "Collision With Podoifrlan Rostoros Votorans Momory  WICHITA, KAN.Collision of two pedestrians on a street brought back the memory of one suffering from amnesia. Calvin W. Tinsley. 98, a navy vet eran of Davenport, Iowa, rushed into police headquarters to ask wmere he was. H learned he was 700 miles from home. Tinsley told police the last thing he remembered was leaving his job with a construction company at Rock Island, 111., near Davenport. Searching hie pockets, the youth found a list of unbought groceries, 24 cents in change and an empty billfold. Tinsleys wife and parents tele phoned that they were coming here for him. He had been missing four days. The disappearance had not been ra ported to Davenport police."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "from amnesia. Calvin W. <mark>Tinsley</mark>. 98, a navy vet"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "from amnesia. Calvin W. <mark>Tinsley</mark>. 98, a navy vet"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2046.89, 220.15, 2189.14, 436.09], "bbox_id": "3885b3635c", "file": "AppomattoxNewspapers_1974-1975a_0414.pdf", "page": 1, "text": "cM auuU n  W edding Out of town guests to the Campbell  Maraden wedding held Aug. 17, 1975 at Davis Memorial Presbyterian Church were Miss Marie Campbell, Charlottesville Mr. and Mrs. Phillip Gay, Mr. and Mrs. vlewton Glenn, Mrs. Roxie .tones, Mrs. Virginia Dunkley, Mrs. Mary Watson, Mr. and Mrs. Russell Hanna, Mr. and Mrs. Jim Clark, all of armville Mrs. Jack Swan, Mrs. Blanche Gilliam, Miss Janet Bowles, Mrs. Ruth Southall, all of Pamplin. Also, Mr. and Mrs. Dallas Tinsley, Mrs. Bflly Harvey, Mrs. Virgil Mabery, all of"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Mr. and Mrs. Dallas <mark>Tinsley</mark>, Mrs. Bflly Harvey, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Mr. and Mrs. Dallas <mark>Tinsley</mark>, Mrs. Bflly Harvey, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [675.84, 410.15, 839.63, 912.19], "bbox_id": "87fe4b599d", "file": "AppomattoxNewspapers_1922-1923a_0066.pdf", "page": 1, "text": "club and among them the stunt which won first prizs on the Fourth of July This was the Appomattox Surrender pre sente i in an unexpected man aer. The first scene revealed a courting couple, who repre sented tbe surrender of the South to the North. The wed ding ceremony shown in the second scene represented the union of the North and South cogetber again. At the close of the. stunt the entire club sang -Carry Me Back to East Virginia. The prize given was a free ticket to the movie pfby The Last of the Mohicans. During the Eummei session the club plans to have various socials events sucb as picnics spelling bees, baking ba.e etc. The members of this club xre Mamie Callop, president, Appomattox Margaret Chilton, vice president, CampbellGrace Anderson, Secretary Tear! Jordan, Mathews Eva Brock well, Surry Lucile Watts, NelionNola Burkey, Appomat tox J. Harry Sloan, Charlotte Claude Cox, Fairfax Louise Wright, Harriet Bibb, Ruth J Donaghy, Orange K1 ie Bat iins, New Knt Pearl Kyle, Margaret Pritchard, Nora Cam den, Ethel Tinsley, Irene Hes son, Lillian Johnson, Amherst ffi. Carter, Halifax Altha Arthur, Campbell Sarah Hub bard, Rockingham."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Nora Cam den, Ethel <mark>Tinsley</mark>, Irene Hes son, Lillian"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Nora Cam den, Ethel <mark>Tinsley</mark>, Irene Hes son, Lillian"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [538.79, 1588.17, 856.77, 1689.7], "bbox_id": "238076573b", "file": "AppomattoxNewspapers_1898-1902a_0325.pdf", "page": 1, "text": "Ch9 T o u r n a m e n t Open.  Munich By Cable.The congress of the German Chess Association was for mally opened here. There are 17 con- Miss Esther Nicholson Barney, daugh- ! testants in the international touina- ter of the late Commodore, was chosen ,  . to be sponsor for the torpedo-boat Bar- ! Pillsbury and Showalter, of Ameri- ney . ca Burn and Tinsley, of England Ja-  . ... ... . - nowskl, of France Von Baredelben, Executors of the will of George W. Gottschall, Cchn. Billecard and Pul man turned over to the directors j Jakob of Gemany Halprin. Berger, of the Free Manual Training School gcijieciiter, Marco, Wolf and Popiel, of"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "ney . ca Burn and <mark>Tinsley</mark>, of England Ja-  . ... ... . - nowskl,"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "ney . ca Burn and <mark>Tinsley</mark>, of England Ja-  . ... ... . - nowskl,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1655.49, 1328.71, 1814.83, 1484.06], "bbox_id": "d8030ca844", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "C OMMISSIONERS OFFICE, West Appomattox, April 16th, 1896. Megginson vs. Megginson and others. To Rosa A. Megginson, Norman Megginson, Norvell Megginson, Clinton Megginson, Ida B. Megginson, Clifton Megginson, Wymai Megginson, Hattie Irona Megglnon, Ada Estelle Megginson, J. P. L. Fleshman, Guar dieuad litem and Mary Debrick. Plaintiffs and Defendants in the above suit  You are hereby notified that I have fixed upon Wednesday, the 20th day of May, 1896, as the time and my office at Appomattox C. H., as the place, for taking the several ac counts In the above styled suit, orlered by the decree therein of April Term, 1896,to-wlt 1st. An account of the amount that Mary Debricks is entitled to out of the interest of the said Ida B. Meggidson, Ada Estelle Meg- giusonand Hattie Irona Megginson in the estate of Ann Megginson,  _ _ 2nd An accout of the transaction of W. B, Tinsley, decd, late Kcclean in the above"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "transaction of W. B, <mark>Tinsley</mark>, decd, late Kcclean in"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "transaction of W. B, <mark>Tinsley</mark>, decd, late Kcclean in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1562.92, 856.23, 1723.07, 1176.68], "bbox_id": "20095d3d45", "file": "AppomattoxNewspapers_1892-1898a_0057.pdf", "page": 1, "text": "C ircuit C ourt. Circuit Court convened on Mon day. The lawyers in attendance were Judge W. H. Mann, of Nottoway Messrs. T. S. Kirkpatrick, W. M. Lile, 0. H. Sackettj E. S. Brown and W. B. Tinsley, of Lynehburg T. Watkins, of Charlottesville R. B. Poore, W. C. Franklin, H. D. Flood, J. P. L. Fleshman and Judge D. A. Christian, qf Appomattox. A large quantity of chancery busi ness was disposed of during the first few days of court. The following law cases have been disposed o f Wade vs. Moore compromised. Trent vs. the Norfolk and West ern Railroad compromised. Marshall vs. same compromised. Pittman vs. same compromised. Abbitt vs. same dismissed. Eldridge vs. game non-suit. Staples vs. same verdict for the plaintiff for 1,000, and set aside by the court."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Brown and W. B. <mark>Tinsley</mark>, of Lynehburg T. Watkins,"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Brown and W. B. <mark>Tinsley</mark>, of Lynehburg T. Watkins,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1377.11, 820.45, 1657.71, 1012.14], "bbox_id": "2e1c8c675d", "file": "TimesVirginian_1978_0287.pdf", "page": 1, "text": "BETTY JUSTICE TAKES OFF POUNDS! The Conway Diet Institute has been in operation in Appomattox since January of 1977. Many local people are successfully taking weight off in the Monday night meetings, one of whom is Mrs. Betty Justice of Appomattox, shown above, who recently received her 20-pound achievement pin. The 20-pound mark is the first major goal we try to reach at the Conway Diet Institute, says Betty Tinsley, lecturer for the Appomattox Club. After reaching a 20-pound loss the dieter feels a new self assurance and more positive self-image. This enables him to be more confident and successfully reach his total goal. Mrs. Justice is doing a beautiful job of taking off her excess pounds and I feel that she will emerge as a real winner in our weight reduction program, says Mrs. Tinsley, j Area meetings are held- on Mondays-at 730 p.m. in the Fidelity American Bank, HUlcrest Branch on Moses Street. Anyone interested may contact Betty Tinsley at 248-6771 for more information."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Diet Institute, says Betty <mark>Tinsley</mark>, lecturer for the Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Diet Institute, says Betty <mark>Tinsley</mark>, lecturer for the Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1895.04, 1386.93, 2058.86, 1633.83], "bbox_id": "c31688a3c7", "file": "AppomattoxNewspapers_1926-1933a_0500.pdf", "page": 1, "text": "BECKHAM, May 25.-Mrs. H. R. Moore has been sick for several days, hut is reported better at this writing. T. Burge Moore, of Oakville spent a few days last week fish ing with his brother, C. A. Moore, on James river. Mr. and Mrs. C. A. Mopre were gladly surprised Sunday by having all their children, grandchildren, and in-laws present for the day. W. R. Tinsley, of Roanoke, was a visitor in this neighbor hood the past week. The Epworth League of the two churches, Mt. Comfort and Trinity, are expecting to meet Wednesday afternoon on the James for a fish fry. ------------ o ----------- - Notice"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "the day. W. R. <mark>Tinsley</mark>, of Roanoke, was a"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "the day. W. R. <mark>Tinsley</mark>, of Roanoke, was a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.51, 494.47, 2162.25, 840.22], "bbox_id": "43785fa7e1", "file": "AppomattoxNewspapers_1915-1918a_0394.pdf", "page": 1, "text": "Baldwin, W ill Hoyle, Bald win, H arry Terry, Baldwin, Robert Lewis, Barton, Jam es, Olam, H al F ., Oumby, Willie Olifton, Davis, Jim m ie Thom as, Davis, John Wiley, Davis, Floyd Robert, Davis, Hurley Olem, Davis, Leslie, D a v i s H enry Hunter,D iokerson, Sam uel H enry, H arvey, Zebulon Vance, H arvey, Royal Peniok, Hoffman, Law rence William, Jennings, H ubert H u d s o n , Leffel, Claude Everton, Loving Samuel Pieroe, M artin, H unter Freem an, M axwell, Benjamin Oakes, E m m e t t Warren Orange, Charlie Willie, Pugh William F rank, Riohardson Jam es E verett, Riohardson Wiley Richard, Snyder, Frank Tinsley, Joseph Blanckard T h o r n t o n , Robert Jam es Thornhill, Allen, Tolley, Rob ert Lewis, Tolley, Jam es Hen ry, Webber, F rank Edw ard Webber, H erm an, Williams Howard Thom as, Williams Will Wood, Williams, Rad Wal h er"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Wiley Richard, Snyder, Frank <mark>Tinsley</mark>, Joseph Blanckard T h"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Wiley Richard, Snyder, Frank <mark>Tinsley</mark>, Joseph Blanckard T h"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2389.43, 986.1, 2569.9, 1485.44], "bbox_id": "4cd6c286f9", "file": "AppomattoxNewspapers_1939-1943a_0244.pdf", "page": 1, "text": "At present State Senator Moses represents the Eleventh Senatorial District, composed of the counties of Appomattox, Charlotte, Bucking ham and Cumberland. The new pro posal would do away with this dis trict and put Appomattox and Buck ingham in with Amherst and Nelson counties in the Fourth Senatorial District, tag Cumberland on to the Ninth District, now represented by Senator Robert K. Brock, and tag Charlotte on to Halifax. That woulq leave Senator Moses and Senator I, Paul Wailes, of Amherst and Nel son in the same district, and one would have to be eliminated. In the proposal for Tediatrlcting the House of Delegates,. John B. Boatwright, who now represents Ap pomattox and Buckingham, woukl be blitzed by a similar maneuver. . Appomattox county would be put in with Amherst county which is twice its size and Buckingham co unty would be put in with Nelson county, now represented by Delegate J. Tinsley Coleman. IThe approximate 1940 population of these counties follows Appomattox, 9,012 Buckingham, 13,389 Amherst 19,020 Nelson, 16,241. Ibis proposal is only tentative. A public hearing on it will be held at the State Capital March 17, at 11 A. M. The Commission is headed by State Senator E. R. Fuller, of Richmond. Even if the proposal re mained unchanged by the Commis sion, it would have to run the gauntlet of passing the next session of the General Assembly, and not be effective until 1943 elections. The object of the reshuffling is to provide additional representation for sections of Virginia which have had extraordinary increases in pop ulation in recent years."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "represented by Delegate J. <mark>Tinsley</mark> Coleman. IThe approximate 1940"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "represented by Delegate J. <mark>Tinsley</mark> Coleman. IThe approximate 1940"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.38, 618.49, 1602.47, 944.62], "bbox_id": "6eeab57325", "file": "AppomattoxNewspapers_1974-1975a_0414.pdf", "page": 1, "text": "as honor attendants. The bridesmaids were Mrs. Dallas Tinsley of Cullen, Va., Miss Pat Harvey of Martinsville, Va., Miss Gale Layne of Pamplin, Va., and Miss Joy Adams of Richmond, Va. Miss Mary Jo Dunkley of Farmville, Va., niece of the bride, was Junior Bridesmaid. The long and full bridesmaids dresses were of navy sheer voile with touches of gold and white. The flower girls, Miss Melinda Page Dunkley of Farmville, niece of the bride, and Miss Laurie Allen of Prospect, wore gold floor length gowns with navy ribbons and white lace. Master Winston Marsden of Cullen, Va., son of the groom, and Master Allen Dunkley of Farmville, Va., nephew of the bride, were ring bearers. The best man was Mr. Charles Shorter of Farmville, Va. Head ushers were Mr. John Campbell of Madison Heights, Va., brother of the bride, and Mr. James Shreck of Farmville, Va., cousin of the groom. Also"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "bridesmaids were Mrs. Dallas <mark>Tinsley</mark> of Cullen, Va., Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "bridesmaids were Mrs. Dallas <mark>Tinsley</mark> of Cullen, Va., Miss"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1837.2, 1567.53, 1922.8, 1615.66], "bbox_id": "26429b5e90", "file": "AppomattoxNewspapers_1892-1898a_0195.pdf", "page": 1, "text": ",an n cr  Jo n es ................. ren t. Jam es ...................... Toney, J no. Ms. E state .. Thornhill, Nelson ............. Tinsley, E m aline ............... Lyree, M artha J .............. 1hornton, Lacy ................. Torrence,A arons E state."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "E state .. Thornhill, Nelson ............. <mark>Tinsley</mark>, E m aline ............... Lyree,"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "E state .. Thornhill, Nelson ............. <mark>Tinsley</mark>, E m aline ............... Lyree,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2293.11, 1007.98, 2462.17, 1345.06], "bbox_id": "426c15c625", "file": "AppomattoxNewspapers_1971-1973a_0108.pdf", "page": 1, "text": "Allen, Everett D.  A lice H. Berkley, T. A. Booker, Martha Jane Johnson Est. c o Clarence Booker Christian, Chas. c o M rs. Ida F. Marks, Est. Cooper, W. M. Heirs, c o Mrs. Ida F. Marks, Est. Culpepper, Lyle Davis, Eliz. c o Va. Dicks Davis, Sarah E. Davis, Thomas W. Davis, Thos. Douglas Davis, Tom  Mary Ferguson, Roger L. et al., c o Arneta Agnes Ferguson Franklin, George Washington  Annie Jackson Franklin, George Washington Si Annie Jackson Franklin, Laughorn  Emma Me. Franklin, Wm.  Eleanor Hamlett. Ray Hancock Scott, c o John Hancock Howerton, Edward A. E st. c o James Tinsley Hubbard, Samuel V.  Nellie Hudson, Janet Marie Hudson, Mary BeUe Si Burford, Jr. Hundley, Elijah Jamerson, Thomas Melvin Est. Johnson, Phinizee"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "st. c o James <mark>Tinsley</mark> Hubbard, Samuel V.  Nellie"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "st. c o James <mark>Tinsley</mark> Hubbard, Samuel V.  Nellie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [175.2, 979.16, 333.36, 1122.51], "bbox_id": "bd076c0a7a", "file": "AppomattoxNewspapers_1898-1902a_0306.pdf", "page": 1, "text": "A t 10 oclock on Saturday niht. th e L ynchburg jury in the case of young Edw d. J . Doyle, charged with an attem p t to ravish Miss Maggie Coomes, gave the accused one year iu the city jail aud a fine of 1,000. M r. J . Tinsley Coleman aided Com m onw ealths A ttorney Yancey iu the prosecution. Messrs. Lee  Howard appeared for the defence. T he a t torneys on both sides showed m uch skill and ability in legal fencing."}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "1,000. M r. J . <mark>Tinsley</mark> Coleman aided Com m"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "1,000. M r. J . <mark>Tinsley</mark> Coleman aided Com m"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1170.29, 225.02, 1360.34, 956.26], "bbox_id": "763a85e7a9", "file": "AppomattoxNewspapers_1915-1918a_0433.pdf", "page": 1, "text": "378, Robert Coleman Thornton 486, Harvey Lee McFadden 600, John Elisha Burnett 507, Samnel Henry Morgan 420, Alvix Louis Nicodemus Herncall 10, Harrison Morton Burge 487, Hurley Ashby McFadden 18, John Wesley Coleman 613, Everett Wilspn Blackwell 602, William Littleton Cardwell 75, Lacy Douglas Marshall 1280, Hurley Clem Davis j 332, John Case 379, Allen Walker 542, Herbert Moore 194, Frank William Fleshman 98f Joseph Blanchard Tinsley 343, Henry Carl Holesapple 15, Thomas Ennis Childress 530, Herman Harding 1218, Philip Olander Paulette 620, Frank Edward Jennings 550, Oscar Leonard McCormick 574, Ulysse8s Simpson Austin 677, Cosiusco McCoy 1183, James Edward Jordan 350, Alexander Lane 440, Andrew Smith 685, James Willis Watson 341, DeWitt Talmage Goin 391, Thomas B Bryant 637, George Wesley Powell 356, Van Bur en Webb 112, Claude W Smith 11, Jerry Allen Burke 363. Willie Hunter 664, Nathan Fleshman 93, Lewis Saunders McCormick 345, Walter Allen Heflin 103, Edward Traynham Price 388, Edward Irving Bingham 406, Wade Hampton Ferguson 1519, Harry Leonard Cumby 25, Joseph Edwin Dinwiddie 1392, Eddie Carter 383, Thomas Homer Babcock 122, Bernard Dickerson Thomas 292, Emmett Warren Oakes 191, Charlie Washington Tanner 477, William Ffetoher Garrett 130, Henry Harrison Williamson 168, Edward Watson 424, Willie Wesley Mitchell 657, Claude Davidson 524, Harry Leonard Doss 632, James Clarence Horsley 49, Alfonso Godsey 557, Thomas Talmage Phelps 685, Samuel Boyd Johnson 323, Colonel Oscar Patterson 438, Wilmer I Smith 492, Wesley Abbitt Smith"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "Fleshman 98f Joseph Blanchard <mark>Tinsley</mark> 343, Henry Carl Holesapple"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "Fleshman 98f Joseph Blanchard <mark>Tinsley</mark> 343, Henry Carl Holesapple"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [525.87, 1599.81, 687.37, 1807.76], "bbox_id": "2ba40a61fb", "file": "AppomattoxNewspapers_1892-1898a_0109.pdf", "page": 1, "text": "1st. Utaro mules, wagon, farming implements, household and kitchen furniture. 2nd. A tract of about 133 acres, known as the Bpeekers Field, place, on which there is a good dwelling and otner buildings. 3rd. A tract of about 87 acres, known as the Phelps place,. on which there is also dwell ing house. 4th. A tract of about 33 acres, about half of which is James River bottoms. This piece formerly belonged to the Phelps place, and the dividing line between the two is the old fence on the ridgt running parallel with the river. All the above property is in Appomattox county, near Stonewall Ferry on James River, about one mile from Stapleton depot on the Chesapeake  Ohio railroad, and adjoining the lands of Mrs. F. B. Moore, Joseph M. Grow, D. A. Langhome and others, and considered fine property. Sale of Personalty absolute, but the sale of the Real Estate is subject to the confirmation of the Court. TERMSAs to Personalty, for cash as to Realty, cash as to one-fourtn, residue payable in three equal installments of one. two, and three years, purchasers to give bonds bearing interest from day of sale, with approved per sonal security. Title retained till purenase l puren WM. B, TINSLEY, Special Comr. Clerk."}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "l puren WM. B, <mark>TINSLEY</mark>, Special Comr. Clerk."}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "l puren WM. B, <mark>TINSLEY</mark>, Special Comr. Clerk."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [836.65, 1614.04, 1014.41, 1814.88], "bbox_id": "47b783b73b", "file": "AppomattoxNewspapers_1892-1898a_0103.pdf", "page": 1, "text": "1st. Two mules, wagon, farming implements, household andkitchen furniture. 2nd. A tract of about 133 acres, known as the Speekers Field, place, on which there is a good dwelling and other buildings. 3rd. A tract of abont 67 acres, known as the Phelps place,. on which there is also dwell ing house. 4th. A tract of about33 acres, about half of which is James River bottoms. This piece formerly belonged to the Phelps place, and the dividing line between the two is the old fence on the ridgt running parallel with the river. I All the above property is in Appomattox F h county, near Stonewall Ferry on James River, Eff about one mile from Stapleton depot on the Chesapeake  Ohio railroad, and adjoining the lands of Mrs. F. B. Moore. Joseph M. Grow, D. A. Langhorae and others, and considered fine i property.  Sale of Personalty absolute, bnt the sale of the Real Estate is subject to the confirmation of the Court. TERMSAs to Personalty, for cashas to Realty, cash as to one-fourth, residue payable in three equal installments of one, two, and throe years, purchasers to give bonds bearing interest from day of sale, with approved per sonal security. Title retained till purchase money is paid. WM. B. TINSLEY, Special Comr. yn"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "is paid. WM. B. <mark>TINSLEY</mark>, Special Comr. yn"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "is paid. WM. B. <mark>TINSLEY</mark>, Special Comr. yn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1479.33, 210.96, 2402.17, 233.71], "bbox_id": "ee527d1c25", "file": "AppomattoxNewspapers_1915-1918a_0548.pdf", "page": 1, "text": "- s b b    The financial statements of miok who ieft Camp Lee with-1trict, to bo voted for at the and Tuesday. I Miss Dorinda Perrow has SDAY i MAY 2,  our county banking institution a  ou Permission, have returned election of November 5,1918, as Mrs. J. B. Tinsley, of Lynch- been ill for several months, but"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "as Mrs. J. B. <mark>Tinsley</mark>, of Lynch- been ill"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "as Mrs. J. B. <mark>Tinsley</mark>, of Lynch- been ill"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1433.05, 386.47, 1565.31, 557.22], "bbox_id": "697ec77b56", "file": "AppomattoxNewspapers_1947-1949a_0561.pdf", "page": 1, "text": ". c. Tinsley, 49, of C W dent of bridges and build- the Norfolk Division, N A d, was killed instantly at Friday when struck by the r a railway derrick which ed while hoisting a 83-tom rder at an overpass con- on Route 460 just west of e . _____ oad Workers Ian For Snow"}, "highlight": {"text": {"matched_tokens": ["Tinsley"], "snippet": "c. <mark>Tinsley</mark>, 49, of C W"}}, "highlights": [{"field": "text", "matched_tokens": ["Tinsley"], "snippet": "c. <mark>Tinsley</mark>, 49, of C W"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2117.47, 659.02, 2363.21, 842.04], "bbox_id": "22bbf8ebce", "file": "AppomattoxNewspapers_1912-1915a_0035.pdf", "page": 1, "text": "These coupons are good for hundreds of valuable pres ents, such as watches, toilet articles, silverware, furni ture, and dozens of other articles suitable for every member of the family. You will surely like Dukes Mixture, made by IAggett if Myers at Durham, N. C., and the presents cannot fail to please you and yours. As a special offef, during O ctober and November onkr toe will eend you our hew illustrated catalog o f presente F RE E  Just send us your name and address on a postal. Coupons from D u k tl M ix tu re m ay bo assorted w ith to r s trows HORSE f HOE, J . T., TINSLEYS NATURAL"}, "highlight": {"text": {"matched_tokens": ["TINSLEY"], "snippet": "f HOE, J . T., <mark>TINSLEY</mark>S NATURAL"}}, "highlights": [{"field": "text", "matched_tokens": ["TINSLEY"], "snippet": "f HOE, J . T., <mark>TINSLEY</mark>S NATURAL"}], "text_match": 578730089005449337, "text_match_info": {"best_field_score": "1108074561536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730089005449337", "tokens_matched": 1, "typo_prefix_score": 1}}
