{"document": {"bbox": [411.11, 399.3, 584.14, 1564.64], "bbox_id": "050ffeb920", "file": "AppomattoxNewspapers_1926-1933a_0155.pdf", "page": 1, "text": "New Vorjfcr-Bight oclock In the morning Is  thé Sero hour for enter tainment in NSw York. Nothing re mains, apparently, bat to crawl Into a taxi and Ive tlife driver your home address. That Is, of course. If you do act belong to that cfass of New Yorkers who know all the little Intimate tblnga about their home town. For Instance, that when Its eight oclock In the morning, when youve dissipated the best part of your bank roll, when yon still prefer any place to home, yon can turn toward Sixth avenue and find the bacchanal spirit runnlDg riot to the strains of a mechanleel pi ano In a penny arcade. The early morning recreation prob lem has been solved by this thought ful amusement resort that lings wide Its doors at T80 and within half an hour has collected a swarming throng of customers. The silken and the seamy citizenry of New York la there. Dont be sur prised to see the former In tuzedos and spangles debark noisily from an open victoria at the curb. Gold Mine to Arcade. These rich once-ln-a-whllers arc a gold mine, for they do the works at an outlay of 1.50 eachthe tariff on the entire 150 machines designed for the publics enjoyment. They may even give another dollar to he photo graphed before the canvas scenery of a bar painted with such sentiments ns Drink Here and Die at Home. The average customer, however. Is good for only about three cents, the change from a breakfast of cold slnw. an ice cream sandwich and orangeade at a cheap restaurant next door. Tim. the florid faced manager. Is probably the- worst cynic on Sixth avenue. It beats his Irish understand ing how crooked a guy can be In Ithe matter of a cent. Youd never believe it, but there are people thet will swear falàely they put In the money and the ma chinery wouldnt go. he deplores  Tim asserts that hla employe get gypped out of pleinty of money a year this way. Hes been changing nickels for pennies during two decades of service for the single corporation which monopolizes ownership of the few remalnlag peep palaces In New York. Tim says that about J.100 people come In every day. And at least 1.007 are out on the pretext of visiting the Sixth avenue employment agencies that cluster around the district at the rate of ten to a block. Although the arcade keeps open till midnight, bust ness falls off perceptibly as soon- as the Joh exchanges close. The arcade offers a diversity of amusements. The athletic, the super stltlous. the musically hent. the prac tlcal, and. of course, .the seeker for thrills, have nil been remembered. Fortunes Told. Visitors come first to fifteen or six teen fortune tilling devices. The lit tle Gypsy, for the suit!! consideration of a copper, will answer briefly. Can I trust my love? Am I a llart Is there any hope for me? or Is my salary going to be raised? She wont give you any particulars, except reg istering Yes, No or Maybe. But who would say that It isnt worththe price? The mystic wheel also assures you that you Can have1 a preview of your bridegroom. While the wheel actually comes across with his photograph, theres a futility In It at that. TI ip man looks ready to leap on a bicycle built for two. If he Is still alive somewhere he probably wants a wife who con run a wheel chair. The surprising artistic allurement Is the crank driven mntoscope or peep show that gives you two eyefuls, for the same reasonable price asked In 1SSI7. .The shapely Indies have stood the strain remarkably well. The Death Chair at Sing Sing has exhausted. Its melodramatic hor rnrs and works no longer. The at traction called What Girls do When They Are Ylone gives the education al information that they skip rope clad In flannel night dresses. Another well worn one Is the caption, For Men Only. Here you have a whim sical little piece about an artist who falls nsleep while drawing a skeleton In his dreams his model assumes the well rounded lines of a .1000 chorus idrir whom Ms modest duhconsctoul mind discreetly covers with fights of a heavy woolen texture. On your way out treat yourself, to a penny squirt of perfume and stop to listen to Edisons first conception of a gramopbon. If youve never heard fVàléùda Or The Prisoners S om  stick rubber tubes In your ears àtid turn on the current."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "tblnga about their home <mark>town</mark>. For Instance, that when"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "tblnga about their home <mark>town</mark>. For Instance, that when"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 1, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
