{"document": {"bbox": [789.1, 593.72, 1114.04, 810.56], "bbox_id": "353404c302", "file": "AppomattoxNewspapers_1912-1915a_0115.pdf", "page": 1, "text": "Woman Captured Prisoner. It is rarely indeed that a woman claims a regard offered for the appre hension of a criminal. Such a claim was not only made, but was substan tiated and paid by the State, on .order of the Governor. The recipient of a warrant for 100 is Miss Anne Norvell, of Charlotte Courthouse. She captur ed Eli Morton, a negro who had shot an officer, and turned him over to the custody of the law. There was mtach excitement a few months ago when Morton wounded the town sergeant at Charlotte, while the officer was at tempting to arrest him. Bloodhouqds were rushed from the State Prison Farm. It seems that Miss Norvell saw the fugitive, and, intent on captur ing him, invited him into her house. When he entered she locked him in and Immediately summoned the min trict. As one of the new members of _____ __________ ___ ____ the House, he had an insight into the I ions of the law. Morton was brought beginnings of a new Congress and the ! to Richmond for safekeeping pending"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "when Morton wounded the <mark>town</mark> <mark>sergeant</mark> at Charlotte, while the"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "when Morton wounded the <mark>town</mark> <mark>sergeant</mark> at Charlotte, while the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.4, 614.61, 1170.15, 689.86], "bbox_id": "8fb0f2fc90", "file": "AppomattoxNewspapers_1922-1923a_0085.pdf", "page": 1, "text": "Winchester.The town sergeant of Front Royal was held blameless by cornoners jury ai. that place for shoot- ingand killing Jjoseph Baltimore, col ored, who assaulted the officer with stones while being arrested for slash ing another negro with a knife or razor during a fifeht."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Winchester.The <mark>town</mark> <mark>sergeant</mark> of Front Royal was"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Winchester.The <mark>town</mark> <mark>sergeant</mark> of Front Royal was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2338.8, 1177.32, 2505.08, 1265.82], "bbox_id": "234c405511", "file": "AppomattoxNewspapers_1947-1949a_0397.pdf", "page": 1, "text": "WatJ a job? The Town of Appo mttox is advertising for a man t be assistant to Town Sergeant J. W. Cawthon and aid in maintain ing the town streets, sewer system and many other tasks long en trusted to his capable hands. Th  town council recently voted to try to find an assistant."}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "t be assistant to <mark>Town</mark> <mark>Sergeant</mark> J. W. Cawthon and"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "t be assistant to <mark>Town</mark> <mark>Sergeant</mark> J. W. Cawthon and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [224.14, 1178.14, 556.91, 1419.53], "bbox_id": "bea3232757", "file": "AppomattoxNewspapers_1908-1909a_0518.pdf", "page": 1, "text": "Virginian to know that the right-of-way of No. 13 is being cut now through the mountain that furnishes water for Buck Hollow spring., The spring   will be on the right hand side of the road, coming next to the river. T h e bridge across Bent Creek on No- 307 has not been. , _ let as yet. It was suposed to IN HD1 J v IllF u e ro r A t have been let to the Allic Con- n w t  Struction Co., of Bristol, b u 11 O CO ttSV U le W e d n e s . that was an error. The con tractor on 307 report good I Stewart Newsome, 29 year progress so far. Jold mechanic, who has confess- George and Charley Dixon,led to shotting and killing Mrs Marshall and Milton Hunter,Violet Applewhite, in Rich- aow with the CO wire force, I mond Tuesday night, was ap- - visited home -people Monday I prehended by officersin Scotts- and Tuesday. ville yesterday afternoon. He Miss Eunice Cumbie spent surrendered to town sergeant thq week-end with friends at Dameron, who turned him over"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Cumbie spent surrendered to <mark>town</mark> <mark>sergeant</mark> thq week-end with friends"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Cumbie spent surrendered to <mark>town</mark> <mark>sergeant</mark> thq week-end with friends"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [122.9, 298.45, 302.25, 1781.25], "bbox_id": "ff7afa7f99", "file": "AppomattoxNewspapers_1912-1915a_0022.pdf", "page": 1, "text": "V F A R M V I L lilfi. The  oldest inhabitants never passed through hotter days than we have been hav ng in tne recent pa t. Men. I know, are much uiven to say ing,  Lever knew a day so hot a? this, but it has been said with em phatic troth of late. And then the drouih. But why write of such thinSa when life thrill with the in teresting and inspiring things. We are having pi ms, Jy ridee, water melon feass, sweet cider to d ink and sweet  taters to eat. The mortal who enjoys good hecHh, sleeps well at at night, eats t..ree square meals a day and ni t too mnch perplexed with financial prob lems and yet not happy ahonld go around the coiner and kick himself And then the Normal girls are with u s ayain in full force and fervor and fairne s. Happy old world this, with very prosp ct pleasing and only man is vile. Peace ir spite ol politicians, progress in spi .e of bad laws. The Lord reigns, let the earth rejoice. Mr. H. E. Barrow lost by fire re cently two stables, three valuable hoises, our vehicles and twelve sets of harness. Insuiance 1,025. Mr. Barrow estimates his loss at 2,500, Others -relieve that the fire was ol incendiary orig n, bu Mr. Barrow Wi 1 not admit that Thinks it - foi lowed the careless tossing of -match or stump of cigarette. The fire de partment did good work and pro tected valuable proper y in- close proximity. Reapo ae was prompt and two full streams of water soon played on the banning mass. Mr. J J. Gilliam, who was so desperately wounded by a mad bull aome weeks since, wasiu town today mnch improved but not yet the old self. Still he has confidence in the anima1 and will not shoot and kill as he has been advised to do. Prince Edward has sixteen tax payers to repoit more, than two thousand income. Mr. W. G. Dunuington making the largest re tarn, 22,000 a farmer, H. A. Stokes, nex, 8,000. And he made all his money on a Sonthside Vir ginia farm, his principal money crop being tobacco though he a-ways has other farm products to ell year by year. The Board of Trade has ordered a booklet to advertise the advanta.es of Farmville and the surrounding country. It will be illns-rated with country and town scenes. Tne Normal and warehouse bells are filling the ait with music again. J dgo Watkins is the only Prince Edward lawyer who returns an in come of over 2,000. At the -dose of the fiscal year foi the town Sergeant Hubbatd report ed collections within a few hundred dollars of fall amount of taxes due. This is nniq e in the history of the town. The late J. A. Spencer left hfe insurance approximating 3,000. A draft from far off China was re eently received here, amount 50, to pay life premium to one of onr local agencies. Mr. Srml. Nicholson, of Crewe, was in town on yesterday and gave an interesting account of the doablt tracking of theNorfolk A Western now being pressed at different point along the line. Large quantities of timber are be ing received via Tidewater  West ern. The Normal girlB make a large addition to ch -rch attendance aod they are divided between all the churches. The popnlar drink of the towr . just now is sweet cider though th dispensary still has its patrons. Mr. J. A. Davidson has rente the handsome residence of Mrs Mattie Loigh Walker on East Thiro Street and will occupy it with h  family. All of the five new residence s ii the west end are nnder roof and wil soon be ready for use.  Tranks piled mountain high o the platform of the passenger cepm when the girls arrive. Old girls though none are old, meet the new girls and give them cordial greeting The fight against home-sickness is an active one. r One of the farmers of the conn y if introduced a uew foi m of irrigatior t r t , H e simply closed his ditches and . forced the water to ran among the rows. And he baa as the result of his experiment a fine crop of oorn. Necesai.y still the mother of inven tion. Mr. C. L. Baltimore, whose farm j i on the north side of the Appo- ox, wae first to it tobacco. He i only sixty acres in the fans and"}, "highlight": {"text": {"matched_tokens": ["town", "Sergeant"], "snippet": "fiscal year foi the <mark>town</mark> <mark>Sergeant</mark> Hubbatd report ed collections"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "Sergeant"], "snippet": "fiscal year foi the <mark>town</mark> <mark>Sergeant</mark> Hubbatd report ed collections"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1662.26, 897.49, 1830.75, 1111.54], "bbox_id": "206b044454", "file": "AppomattoxNewspapers_1943-1947a_0344.pdf", "page": 1, "text": "Under the classification of flow ers to the living, we would like to comment that the services of J. W. Cawthon are invaluable to the town of Appomattox. As the town sergeant, he has devoted some 20 years of his ife to the interests of the town g ernment, and no one in Appomst.jx is on a par with him in knowing the business of the community.  Cousin Jimmy hap at his finger tips information on every property line in town, facts by the yard on town finances, and complete knowledge of the towns laws and ordinances. When he speaks on matters pertaining to the town, his words bear the label of civic welfare. We pray - that he may be spared -many more years to serve the people of this thriv ing community."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "of Appomattox. As the <mark>town</mark> <mark>sergeant</mark>, he has devoted some"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "of Appomattox. As the <mark>town</mark> <mark>sergeant</mark>, he has devoted some"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2241.11, 1188.39, 2408.16, 1225.99], "bbox_id": "f76e9cafe7", "file": "AppomattoxNewspapers_1943-1947a_0047.pdf", "page": 1, "text": "Town Sergeant J. W. Cawthcn has anneunced that trial weekly collection of trash and garbage will begin in Appomattox next Tuesday,"}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "<mark>Town</mark> <mark>Sergeant</mark> J. W. Cawthcn has anneunced that trial weekly collection of trash and garbage will begin in Appomattox next Tuesday,"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "<mark>Town</mark> <mark>Sergeant</mark> J. W. Cawthcn has anneunced that trial weekly collection of trash and garbage will begin in Appomattox next Tuesday,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2120.16, 1543.97, 2320.2, 1637.76], "bbox_id": "0ebf4e054b", "file": "AppomattoxNewspapers_1943-1947a_0391.pdf", "page": 1, "text": "THt town has also employed Byron Cole as a town police of- I ficer. Mr. Cote was town police .. man prior to his entering the arm- n.se ed forces and was recently dis- . charged from the A rosy. David T. 1 Robertson is also retained as a full-time police officer, and E. T. Mitchell is a special officer. J. w! Cawthon is town sergeant-"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "J. w! Cawthon is <mark>town</mark> <mark>sergeant</mark>-"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "J. w! Cawthon is <mark>town</mark> <mark>sergeant</mark>-"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [292.64, 554.54, 465.64, 1712.23], "bbox_id": "42e9d81e5b", "file": "AppomattoxNewspapers_1905-1912a_0175.pdf", "page": 1, "text": "The three new business houses which are being erected on Thud streets, are now under roof, and the residences on Viiginia street and iu east Farmville are receiving finish ing touches. A Retail Merchants Association wa 3 formed here some time since, bnt so far as 1 am advised it was not represented at the recent State meeting in Salem. From the news paper reports it was an interesting meeting too. Mnch has been said and written on the subject of pure food but I never hear of au inspector with us. I dont know that we need looking after bnt as there are such officials drawing pay it oocnrres to me that they should be around and about. On i he death of Mrs. Bettie Ven able, of Hampden-Sidney, the col lege will come ino the possession of other valuable real estate left under the will of the late Major R. M. Venable, who died iu Baltimore. The family of Mr. W. W. Jack- son will soon move to town from their country home and occupy the residence of the late Dr. White, which is the old Jackson home. I am fully persuaded that the Farmville people, who have gone away f_-r the summer are, pining to get back home. Any how those who do return enter our gates all smiles. We have had 0 disagree able nights during the summer and no healthy f erson has bean burden ed with the heat of the day. Mr, Joe Hazlegrovo, of Cumber land, brought to maiket the finest peaches I have seen so far. He owns the old Perkins farm, in the Guinea neighborhood, which has long been known as tht prince of fruitgrowing ground. And it is as well adapted to tobacco as it is to fruit. Judge Perkins during his life time had one of the finest vine yards there I ever saw. And you may know the wine was good too, though in these W. C. T. U. days one runs ri ,k in saying any idling good of any wine. Mr. H. N. Madi son, a.other farmer of Cumberland, comes to town once a week and never without bringing with him choice qn triers of lamb. I often wonder what Farmville would do without Cumberland and Bucking ham to draw from. My regret is that neither of these counties has any macadam over whiuti to send the loads to market. But whenever 1 mention this fact to any one of the citizens of the one or the other rhe same reply is given,  nor do we have a dispensary. So thecontro versy ends right th re. The First National Bank is dis tributing sduvenirs in the form of whet stones made of fine quality of soap stone, and as he presents one of the keep-Bkes Cashier Vaden is sure to add, sharpen up your wits and do business with the First Na tional. Wide awake bankers and. other business men know and ap predate the value of advertising. Everlastingly at it is the way to win. Mr. R. D. Miller, who has been town sergeant for more than twenty years, will on his retirement. Sept, 1st, move out to a farm near town and spend the evening of life peacefully, and pleasantly. He is making a wise choice. The Summer Normal closed on last Saturday after a session marked by great earnestness on part of tea chers and students. And while bnsy at their work many pleasant diversions were provided for them, And living under the same roof the and congi nial"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Miller, who has been <mark>town</mark> <mark>sergeant</mark> for more than twenty"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Miller, who has been <mark>town</mark> <mark>sergeant</mark> for more than twenty"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1051.41, 1251.87, 2349.15, 1574.62], "bbox_id": "bf112f8692", "file": "AppomattoxNewspapers_1939-1943a_0069.pdf", "page": 1, "text": "the inside double glazing removed, with the result that it is fogged up almost immediately. When this pic ture was taken the inside room tem perature was 71 degrees, while out side the thermometer stood at 15 de grees above zero. Active nallbearers were Herbert C. Pulliam, R. W. Stanley, Calvin H.  Robinson, Garland Morris, Robert Hubbard and Irving Btngham. Dea cons of tbs church and present and former town officials acted as honor ary pallbearers and ladies of her. Bible class served as flower bearers. She is survived by her husband, J. W. Cawthon, town sergeant and clerk of the Town of Appomattox by five daughters, Mrs. R. C. Simp kins and Mrs. William Thrasher, of Mount Hope, W. Va., Mrs. Thelma Caldwell and Mrs. Charles Hanen- krat, of Appomattox, and Mrs. John Tweedy of this county and one Sis ter, Mrs. S. A. Anderson, of Cram- erton N. C. 15 grandchildren and 1 great grandson. The sympathy of the community is extended to the bereaved family. This expression of Gods will is but another reminder that our sojourn on earth is but a prelude to the larger life with God, and Christian understanding enables us to rejoice when Gods chosen are called to their inherritence."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "husband, J. W. Cawthon, <mark>town</mark> <mark>sergeant</mark> and clerk of the"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "husband, J. W. Cawthon, <mark>town</mark> <mark>sergeant</mark> and clerk of the"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [875.99, 842.45, 1344.13, 1026.7], "bbox_id": "4ee405081c", "file": "AppomattoxNewspapers_1926-1933a_0235.pdf", "page": 1, "text": "S h in e O n M e   I Shin i S t B e fe e n d  llarB W S r e P r e se n te tiv e o f the a n in e u n m e , i  nau rsot c e i lu n a c y a c c o u n ts. th e r a c -r a ilr o a d c o m p a n y to s e e if th e t  VC w ai1d rkGw- Gn1  I counts allowed wetState de-din from whistles and bells This World On Fire One O fpariment of Healthppropri- could be moderated. ation for rural santon work I Complaint against the noise 250 L- E. Smith,,ter files,made from a car operated in  i V- M. Hancoiand Co-, town with .a straight exhaust water, 850 Telerpie Co., I were also brought up- 4.50, L. M. Mitel, paint-land the town sergeant was in- ing cannon, 4.00 ppomat-1 structed ufider the authority box Hdw. Co-, pain3-90 L. I of an ordinance prohibiting S- Giles, work on Qt House I the operation of a gasoline en- The Organization committee I porch, 2.50 E. itchell, Igine within the corporate lim- of the Dark Tobacco Growers I j anitor, 10.50 Vifia Pub-1 its without an efficient muffler Marketing Association met last I lie Service Corporat 1 R. Ito notify the owner to have a Saturday morning in FarmvillejL. McDan, repairinheel onlinuffler pqt on. bo formulate plans for a mem-TVa n n o n, 9-00_ ldfens  ------------ o_ bership campaign. Home Society of Vir, 2001"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "M. Mitel, paint-land the <mark>town</mark> <mark>sergeant</mark> was in- ing cannon,"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "M. Mitel, paint-land the <mark>town</mark> <mark>sergeant</mark> was in- ing cannon,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [232.8, 1271.95, 557.71, 1554.18], "bbox_id": "cfd87ff789", "file": "AppomattoxNewspapers_1926-1933a_0518.pdf", "page": 1, "text": "river. T h e bridge across Bent I Creek on No- 307 has not been - - _ let as yet. It was suposed to  lN HO J H u r d e r o r A t have been let to the Allic Con struction Co., of Bristol, b u t that was an error. The con tractor on 307 report good I Stewart Newsome, 29 year progress so far. I old mechanic, who has confess- George and Charley Dixon, ed to shotting and killing Mrs Marshall and Milton Hunter, Violet Applewhite, in Rich- now with the CO wire force, mond Tuesday night, was ap- visited home people Monday prahended by officersin Scotl and Tuesday. ville yesterday afternoon. He Miss Eunice Cumbie spent surrendered to town sergeant the week-end with friends at Dameron, who turned him over Norwood. Mrs. A. H- Stephens, who has been on the sick list for some time, is much better. The other sick folks seem to be im proving. Mrs- Anna Viar, of Naruna, is visiting friends here. Mrs. Nelson, of Lynchburg is the guest of Mrs. M. S- Me- Cormick."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Cumbie spent surrendered to <mark>town</mark> <mark>sergeant</mark> the week-end with friends"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Cumbie spent surrendered to <mark>town</mark> <mark>sergeant</mark> the week-end with friends"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2154.43, 1255.73, 2321.65, 1304.67], "bbox_id": "c5960dd35f", "file": "AppomattoxNewspapers_1943-1947a_0387.pdf", "page": 1, "text": "Request From Town Sergeant"}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "Request From <mark>Town</mark> <mark>Sergeant</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "Request From <mark>Town</mark> <mark>Sergeant</mark>"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1709.51, 323.88, 2029.72, 725.38], "bbox_id": "93e69dea33", "file": "AppomattoxNewspapers_1915-1918a_0109.pdf", "page": 1, "text": "remains to be seen whether or organs need strengthening nee, not his hogship is a true w eath-, a tonic, need FOOD. er forecaster.  stella - vitae wai supply wht m We are glad tO learn th a t! needed, will supply It in thc lor-n that  . Mrs. J O. le ttin g e r who h a .      h boon ,ick for some tim e Is n o - much better. natures Great Restorer to the Mrs N A Davis who Was womanly organs. For THIRTY YEAR.. Mrs. JN. A. XiaviB wuu  t haa helping suffering women sick w ith grippe last week has i  .. recovered .ufflciently 0 be out S f S S S again. failed to help youyou owe IT TO YOUR- Stcangers are in town nearly    every day. Most of thdm are northwestern people seeking homes in the more congenial climate of Virginia. Mrs. Charlie Mason, of Lynch burg, visited friends here last week. Rw Mr. Lambden has re turned from the hospital much improved in health. Mr G. D. Sizemore has.re- jntly been appointed town sergeant to tucceed Mr, F rank lin, resigned. Miss Mary Beale returned to Madison Heights Monday to resume her work as teacher, after spending some time with her sick father here Mr, Sweeney Meadows, sec tion foreman on the new belt I line has recently moved into"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "has.re- jntly been appointed <mark>town</mark> <mark>sergeant</mark> to tucceed Mr, F"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "has.re- jntly been appointed <mark>town</mark> <mark>sergeant</mark> to tucceed Mr, F"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2105.03, 164.89, 2265.46, 1314.07], "bbox_id": "0ab23d20d4", "file": "AppomattoxNewspapers_1915-1918a_0031.pdf", "page": 1, "text": "Pamplin. Mr. H. T. Terry was in Bati more last week purchasing fall goods. Mr. Sizemores little son George who has been quite siek is now up again. Mr. P. M. H annahs reputa tion its a grower of large water melons a t this season of the year has been well sustained this season. We are glad to know th a t all of the teaehers have found niee pleasant board aooomoda- tions real near the school room Mrs. W illie Brig tw ell takes one and Mrs. R. W. Beale two. Mr. R. W. Beale sp n t last Friday in Lynchburg. Mr J. F. Connally and wife are spending a few days with friends and relatives in Rich mond- This town is putting down oement sidewalks We are not yet advised as to how much of this work will be done here Town Sergeant Franklin is looking after this work. , Master Galvin Davis who is a graduate of the Appomattox Agriculture 8chool will attend Randolph-Macon Oollege and left on the 9th for that purpose. Mr. John Gilliam has just sown to alfalfa one of the prettiest and highly im proved plots of ground in this plaoe. He has been able to get from this lot from 6 to 6 cuttings of alfalfa each year for th e past 8 years. , This is a secondiseed- ing to this grass. The ohildren here have been in a flutter of excitem ent pre paratory to starting to school on Monday next, Miss Drink ard of Appomattox will be Principal and Miss Smith and Miss Coleman will have charge of under grades.  The new M. E. Church here will be dedicated on the 2nd Sunday in Oot. Another coat of paint will be applied be- betweennow and the dedicatory services. Last week Mrs. Mollie F rank lin had with her a friend from Poughkeepsie, N. Y. Mrs Ella Parris of Appomat tox and Mrs. Diugan of Cov ington, Va, are visitors at the Hotel. Dr. T. H. Lukins father of Mayesville Campbell C o , Va is visiting them this week Mr. and Mrs W ysong and Ur. and Mrs. Beard made a visit to the historio battle grounds at Appomattox, on last Sunday. Dr. E. E. W alker, and Mr. Charlie Parris were in Lynch burg last week. . Mr. and Mrs V. D. Johnson were with friends in Roanoke several days last week. Misses Geneva and Luey Davis have just returned from a visit io Crewe and Suffolk, Va. We are glad to learn th at Dr Franklin will in the near fu ture make a visit to his parents here Mr. and Mrs. S. H. Frank- in. Nearly all the residences liere now have oement walks and those who have not are now on the prospective list. There was a Citizens meeting here last night Monday Every person in the town is requested to be present a t these meetings."}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "will be done here <mark>Town</mark> <mark>Sergeant</mark> Franklin is looking after"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "will be done here <mark>Town</mark> <mark>Sergeant</mark> Franklin is looking after"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [161.75, 296.36, 399.32, 1693.98], "bbox_id": "e19e7095cf", "file": "AppomattoxNewspapers_1905-1912a_0545.pdf", "page": 1, "text": "PA A thrill e through Prill of. the tarrlbl country home recently when J. P. Morse, a hitherto quiet and respect ed citizen, shot to instant death his wife and father-in-law. lie used a shot gun and emptied Loth barrels directly over the heart ot each ol his victims. The man came here some six years ago, bought a farm near town and has won the respect and confidence of hi neighbors. I d F ebruary last he returned alone to bis old home in Iowa where he worked on the farm of a brother un til he received a letter from his wife in wbioh she asked him to return to her and the children. He took thi- next train, reached here on the morning of the 19th, went at once to his borne, spent a quiet day, a- he says, nntil in the afternoon h saw the old man, his wifes father, standing in the door with the gnu in his hand, and from that time he remembers nothing that happened. I their dead, and a He ays, however, that tho father-biers strong men in-law attempted to shoot him and missing the mark killed the wile. This is denied by a negro woman at work in the garden who heard the wife, after tho first shot, pleading for her life. In jail he talks calmly, intelligently bnt throws no light on the tragedy. He may havo done the shooting bnt fails to recall the faot. It now turns ont that foi sometime 1 o has noted queerly but no stress was luid upon bis conduct. Five children, all young, are teft alone in the world. The farm had been paid for and the deed made to wife and children. Morse is strong of body and of more than ordinary intelligence. The whole sad affair is shrouded in mystery. Tlie Congressional fight in th.s district is v arming np and both can didates are using the papers to reach the voters. No speech-mak ing canvass will be made, as I am told. And this is well, as both are Democrats, lionet t and capable. With the location of the new High School lui ding in the west end, property in tIt it section has taken on now 1 f . Fifteen lots were sold on one day and at satis factory prices, A number of prospective land buyers huvo been hero of lute and some sales rvinclc. Ono-of the recent purchasers of a 500 acre farm will make a specialty of itiule-ruiHing. At 600 a pair the business should be a paying one. Circuit Court adjourned after au uneventful session. Ore of the oases that excited some interest aa that of a horse-trader against a hay seed in which the trader claims hi was cheated in the trade. This doesnt often happen in human his tory. There was a smoker held at the Prince Edward hotel on Friday evening of last week at which Mr. Labaume, of the Norfolk  West ern, made an hours talk in which he urged that more attention b paid to the introduction of farmers into this section rather than so much stress being laid on the intro duction of manufacturing plauts. The speech was attentively listened to and made a profound impression. Back to the farm is now the slogan of the hour. i A Mr. Bulger, of Ohio, has leased the Prince Edward hotel, his term to begin July 1st, when Mr. Chick Vacates. Mr. Bulger has been as sociated with the management of tho Waldorf -Astor, New York, and is now running a hotel in Ohio with more than 200 rooms. With such experience he comes well recoin mended. Mr. Serpell, the oivner ot the property, will introduce watei into the bed-iooms and put in pri vate baths. That sounds good for Farmvillo. With good fare and clean rooms the problem has bee  solved. Traveling men know a good hotel and are sure to advertise i t  We have had 3ome slight touches of frost but so far no damage done as I am told. Rev. Willis L. Wayts delivered his first sera on as pastor of the Bap tist.Church on last Sunday, and was greeted with a largo congregation that, heard him gladly. ifev4ipdrcw Allan, of Canada, wiUiCOme ns p stor of the Presbv- toriun flock. Bob Miller, who for a quarter of a oentury was town sergeant, bu"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "of a oentury was <mark>town</mark> <mark>sergeant</mark>, bu"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "of a oentury was <mark>town</mark> <mark>sergeant</mark>, bu"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1818.25, 1200.89, 2336.87, 1489.29], "bbox_id": "db1db0ba2a", "file": "AppomattoxNewspapers_1943-1947a_0387.pdf", "page": 1, "text": "On last Sunday morning, Rev. H. Frederick J-on4s f offered  his resignation as pastor of Liberty Baptist Church, to be effective the second Sunday in November, when the popular local paster plans to retire after a long and brilliant career in the Baptist ministry. Rev. Jones has been pastor of Liberty Church for nearly 6 years,, and has endeared himself to the people of the community and the county during that period, partici- J. W. Cawthon, town sergeant, pating in many civic activities such suggests that property owners cut as the Red Cross. He has lead the and trim hedges, shrubs, etc. next membership of his church into a week. The town truck will haul period of sound growth and ffour- away te trimmings, if collected ishing activity. . . . near the sidewalk. Mr. Cawthon _ . ... . _ .. asks that this be done now, so as Jn announcing this resignation, fe out of the way ln time for Rev. Jones stated that he had fixed hfi  clean-up week April 8 the second Sunday m November as 12 May 15-16, 1864. Hostesses Mrs. e effective date because date was  --------------------- J. E. Dinwiddle, Sweet Briar, V a.!h!8 birthday and the date he had Nov. 21, 330 P. M. James D. Planned or. h,s 1!etlreen.t S c H O O l C i l e a i l - U l l illoch, the Secret Service Age,   V S o v X r S it S S i    I held successful pastorates in Vir- f n 1 3 f f f c f jf f O Q g ginia, North Carolina -and Mary- 3- 3 1- XIJ. C iO land, coming here in November of _____ 1940 from Baltimore."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "partici- J. W. Cawthon, <mark>town</mark> <mark>sergeant</mark>, pating in many civic"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "partici- J. W. Cawthon, <mark>town</mark> <mark>sergeant</mark>, pating in many civic"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [216.0, 524.6, 383.32, 720.79], "bbox_id": "c3e9394441", "file": "AppomattoxNewspapers_1905-1912a_0399.pdf", "page": 1, "text": "Norfolk. Utopia seems at last to I have been found In a Virginia sum mer resort. At Virginia Beach the Town Council has sounded the vir tue of the community and, finding nothing to condemn, has voted unani mously to abolish the Police Depart ment on September X. But Town Sergeant A. F. Dozier, Virginia Beachs police force, does not re linquish his badge without protest He points to the fact that the pres ent Utopian conditions are the direct result of his administration and that It was through his efforts that Sun day whisky selling and many forms f gambling disappeared from the beach. The Town Council does not share his view that eternal vigilance is necessary to retain these condi tions and has ruthlessly abolished his position."}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "on September X. But <mark>Town</mark> <mark>Sergeant</mark> A. F. Dozier, Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "on September X. But <mark>Town</mark> <mark>Sergeant</mark> A. F. Dozier, Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1566.5, 308.08, 1738.34, 683.85], "bbox_id": "9c5a15eb52", "file": "AppomattoxNewspapers_1912-1915a_0058.pdf", "page": 1, "text": "Mr. and Mrs. R. 3. Mason, of Sheppards, Va., left today for their home after a pleasant visit to their daughter, Mrs. W. L. Garrett, in the village. Town Sergeant, Monroe Dicker- son, was snot and severely wounded by a negro at, Charlotte 0. H. last night. Mr. Dickerson has many relatives in this county. In the matter of the removal of the station at Evergreen the offici als of the Ry. Oo., visited the town yesterday in company with many lawyers. It is believed that the Company will move the depot to its new location at Evans and Cueat- hams crossing. Superintendent Needles, of the N.  W. R y, was in town yesterday looking over the improvements the Company is making here. It is understood that the Company is anxious to do away with as many crossings as possible in the town, out unless the same conveniences a-e maintained the people will not submit to it. Rev W. G. Wingfied and family have taken np their home in the"}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "Garrett, in the village. <mark>Town</mark> <mark>Sergeant</mark>, Monroe Dicker- son, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "Garrett, in the village. <mark>Town</mark> <mark>Sergeant</mark>, Monroe Dicker- son, was"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [872.9, 828.92, 1353.5, 964.06], "bbox_id": "3ba779d62d", "file": "AppomattoxNewspapers_1908-1909a_0235.pdf", "page": 1, "text": "Moved- and God Gonna Set __ __ _ ____ _  _ This World fOn Fire 0ne Of I partment of HeaitTppropri- could be moderated- These Days, in its program.  ation for rural santon work! Complaint against the noise 250 L- E. Smith,iter filesmade from a car operated in P l a n s M u rlo fn i. 1 W- M. Hancojand Co-,town with .a ,straight exhaust Plans Made lor water, 850  Telie Co., were also brought up- Tobacco Market r 4,50 L paint- and the town sergeant was in-   OOoLiU lV iai K.CI  mg cannon, 4.00 ippomat- j struqted ufider the authority 1 tox Hdw. Co-, painj3-90 L. of an ordinance prohibiting  E- Giles, work on Qt House the operation of a gasoline en- The Organization committee I porch, 2.50 E. Vitchell, jgine within the corporate lim- of the DarkTobacco - Growers I j.n r  jUR 1"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "L paint- and the <mark>town</mark> <mark>sergeant</mark> was in-   OOoLiU lV"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "L paint- and the <mark>town</mark> <mark>sergeant</mark> was in-   OOoLiU lV"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1449.6, 286.09, 1618.65, 442.49], "bbox_id": "a90d9123e4", "file": "AppomattoxNewspapers_1926-1933a_0166.pdf", "page": 1, "text": "Miss Jessalyn Hancock spent Thanksgiving in Bluefield, W. Virginia- I Mr. P. W itt Coleman has been appointed town sergeant for Appomattox, and will also-be town manager. Of course, all of Appomattox will pull for a National Park at Appomattox. The Nation is al I ready conscious of its neglect in this matter."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Coleman has been appointed <mark>town</mark> <mark>sergeant</mark> for Appomattox, and will"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Coleman has been appointed <mark>town</mark> <mark>sergeant</mark> for Appomattox, and will"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [341.49, 201.73, 509.27, 1071.18], "bbox_id": "2170803763", "file": "AppomattoxNewspapers_1905-1912a_0328.pdf", "page": 1, "text": "let us hope the real thing will not follow. Major J. R. Martin amended the Grand Council of the Royal Ar canum which met recently in Rich mond, had a good time and reports the order in flourishing condition. Mr.F, W. Hubbard, our efficient town Sergeant, and tho widow of the late E. I. whitehead, were mar ried in the city of Portsmouth r J- cently at the home of the brides brother, and will make Farmville their home. Mrs. S. D. Walton recently gave an entertaioment for the beaefit of her Home Circle of girls and realis ed seventy dollars. The handsome and hospitable home of Mrs. J. J. Walker, on Third street, was thrown open on the evening of the 19th to the Daughters of the Confederacy who gavj a feast of good things tor the raising of a fund with which to on- terttin the veterans at their annual reunion in June. The evening was a pleasant one and the proceeds will meet the demands of the reunion. Mrs. J. Talor Thompson enter tained a number of her friends Thursday afternoon of last week at a reception which was a signaj social success. Mrs. Thompson is gracious and charming hostess and gives to all entertainments at her home tact and thought and refined taste. Farmville doesnt blush at run ning a dispensary when it learns that Powhatan C. H. has been sup porting nine blind tigers. Men have yet to know just how to con trol that old enemy of tho human family know as booze. A negro merchant was recently caught mak ing some sort of whiskey out of potatoes and he found ready sale among his negro patrons. By the way it is said that the juice of the water-melon can not be ohverted into alconol of any kind. That peaks well for the watermelon. Veteran Paul Veuable is about ready to ship lettuce and I am waiting with interest for his return this season. Last season he sold one thousand dollars worth from one acre and that meant mote pro fit than from the average tobacco orop. Mr. W. N. G. Ranson, of Buck ingham, was in town one day last week Most of our merchants will close their places of business at six from May 1st, to Sept. 1st. This is not Only sensible but in my opinion profitable. I have long believed that the ten hour system on our farms wonld mean more aurl better work. And yet as I write the sug gestion 1 fancy I hear more one farmer say  You fool."}, "highlight": {"text": {"matched_tokens": ["town", "Sergeant"], "snippet": "W. Hubbard, our efficient <mark>town</mark> <mark>Sergeant</mark>, and tho widow of"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "Sergeant"], "snippet": "W. Hubbard, our efficient <mark>town</mark> <mark>Sergeant</mark>, and tho widow of"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1974.99, 1127.03, 2318.28, 1222.27], "bbox_id": "1a056d60ca", "file": "AppomattoxNewspapers_1947-1949a_0362.pdf", "page": 1, "text": "J. W. Cawthon, town sergeant, today called attention to the fact that resident of the town must ,. . - t .   pay capitation taxes in December Eaghty per cent o f. jjI in order to be eligible to vote in highway traffic rolls on the primary June8 town election. highway system - although the se- I . condary highway spate is four Martinsville discuss the city times as large as the primary sy-1 stem. 1 manager plan."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "J. W. Cawthon, <mark>town</mark> <mark>sergeant</mark>, today called attention to"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "J. W. Cawthon, <mark>town</mark> <mark>sergeant</mark>, today called attention to"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [146.65, 1365.28, 309.09, 1764.53], "bbox_id": "04700afa67", "file": "AppomattoxNewspapers_1905-1912a_0580.pdf", "page": 1, "text": "in previous years. T iDr. Abram Simon, the head of the Washington Hebrew congregation, .who has been sent to the University Bummer School under the auspices of the Jewish Chautauqua Society of Philadelphia, delivered today the first of a series of lectures of Hebrew His tory add Literature. The course bids fair to become one of the most popu lar in the school. Dr. Simon is a Doctor of Philosophy of Columbia Uni versity, a graduate of Cincinnati Uni versity and of the Hebrew University of Cincinnati and holds many hon orary distinctions.  Roanoke, Va., June 27.O. Miller Martin, town sergeant of New Cat tle, Craig county, shot down in his yard Sunday night, June 16, by Har vey D. Looney, died this morning at the Jefferson hospital, in this city, after making a desperate fight for lifeThe shooting took place in New Castle and several days later Looney was arrested in Alleghany county. He was wounded when arrested and it was thought that he had attempted to take his life. He is now in the hospital at Clifton Forge and will be charged with murder. Fredericksburg.  Depositions were taken here in the case of Maria Lu cas versus Virginia Jones, in which a negro named Benjamin Jackson died and left a tract of land in Spottsyl- vania county. Virginia Jones claims to be the only heir and has lived upon the property since the death of Jackson, 26 years ago. Maria Lucas also asserts that she is heir by reason of an ante-bellum marriage, and claims one-half of the. property."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "June 27.O. Miller Martin, <mark>town</mark> <mark>sergeant</mark> of New Cat tle,"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "June 27.O. Miller Martin, <mark>town</mark> <mark>sergeant</mark> of New Cat tle,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [767.31, 537.74, 1112.0, 626.29], "bbox_id": "abd56f50b8", "file": "AppomattoxNewspapers_1947-1949a_0395.pdf", "page": 1, "text": "In death I do the same. Daughter Nettie D. Hurt _____ ___ _ ____ 1 AGAIN YOU MAY ENJOY DE NOTICE The Town of Appo- LICIOUS SWEET CHESTNUTS by mattoj wants a man to work with Planting Early-bearing, Blight- re- the Sergeant to learn the duties of distant Chinese Chestnuts. Being the office of Town Sergeant. Any- .ucceslly grown from Maine to  one interested see Mayor G. B. Florida. Twi 3 to 4 ft. Bearing size i Buchanan. __________________ ltc Trees - Special Offer No. 38-8"}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "Being the office of <mark>Town</mark> <mark>Sergeant</mark>. Any- .ucceslly grown from"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "Being the office of <mark>Town</mark> <mark>Sergeant</mark>. Any- .ucceslly grown from"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.9, 812.11, 2016.08, 1496.3], "bbox_id": "96c8d8a5b8", "file": "AppomattoxNewspapers_1939-1943a_0519.pdf", "page": 1, "text": "Heres a letter from Pvt. Warren Barlow to his mother, Mrs. K. V. Barlow, Appomattox, Va. Derr Mother, I received your letter today. Was lad to hear from you. I will fcr.ve o answer today. This will be the ist ime j can write you from here. T t . _ , .. ,   cant tell you where we are go- Up_to now we have three black- or whe we are goIng. l wU1 We outs effective in Appomattox. The first two were very successful. The last one was not thoroughly carried out. We believe the main reason for this was lack of understanding of what was expected. It was a combi nation dim-out and- blackout. We know, of course, that there were no intentional violations of the rules governing these tests. In either a dim-out or a black out, no lights should be seen from the streets. In a blackout, all people must be in their homes, or at least off the streets except those assist ing in the blackout. The only differ ence between a.dim-out and a black out, is that people may be on the streets during a dim-out, and traffic may continue as usual, with hooded lights. However, during a blackout, all citizens are supposed to be off the strets and all traffic slopped. In the event that you attempt, to us blackout shades br curtains, be sure to test them out a night or two b. forehand, to be certain that no light shines through or by your shades. Ordinary window shades do not blackout. No light, regardless of its color, should be visiblefrom the outside. Flashlights, lighted cigars or cigarettes or matches are prohibit ed. Civilian defense officers on duty during the blackout must guard against striking matches or smoking. In he past, the auxiliary police have called the peoples attention to any violation of the.rules, explaining the violation to them and asking.that it not be repeated. In the future, the o.ice will give no further warnings r.nd no explanations to any of us. It is felt by the State authorities that all of us have had sufficient expla nation and instructions regarding the regulations, and we should govern ourselves accordingly. We are in structed to say further that if any one is found in violation of any of the regulations governing dim-outs or black-outs, that person will auto matically and promptly be summons ed to the mayors court of the town of Appomattox. By order of the local defense council, Appomattox County Va - C. S. McDeaymon, mayor, Appomat tox, Va. George F. Abbitt Jr., di rector of Defense, Appomattox Co., Va. J. W. Cawthorn, town sergeant Appomattox, Va. D.A Comer, head of  Auxiliary Police,  Appomattox, Va. J. A. Burke, local Coordinator,"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Va. J. W. Cawthorn, <mark>town</mark> <mark>sergeant</mark> Appomattox, Va. D.A Comer,"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Va. J. W. Cawthorn, <mark>town</mark> <mark>sergeant</mark> Appomattox, Va. D.A Comer,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.99, 376.57, 2220.59, 810.22], "bbox_id": "41fecf1358", "file": "AppomattoxNewspapers_1912-1915a_0585.pdf", "page": 1, "text": "burbs of this town. Sergeant Franklin has been I rounding up the orap shooters  of this, town for the past two weeks. They are arraigned be-1 fore Mayor Peterson, who gives the usual fines whioh are at once collected or the alterna- young  tive whioh is tbe lock up. Booster Chautauqua came to I this town pn last Thursday and gave performances in the Jim Megginson pitched s o m e afternoon and at night ball in the last gamp, but theU bree day consecutively Steadfast boys had been so tendance good eveiy day completely conquered in the  all seemed to be pleased with  first game they gave out in t b e I the show. fifth with the score 15 to 5 W ildcats at the big end. Following is the line-up. WILDWAY Len Childers,  Tom Christian Jim Megginson Jim Childers Pollard Kinney Jud K inney Perry Cum by John Megginson Mosee Treasurer, A. T. Inge Con-1 j i m Lucado Eductor, H. M. Burge Warden, R.  Mann Inside Sentinel, T. R.  Hancock Outside Sentinel, 1. R. Packet Trastees, E. E. Gills, S. L. Ferguson, B. F. Oden."}, "highlight": {"text": {"matched_tokens": ["town", "Sergeant"], "snippet": "burbs of this <mark>town</mark>. <mark>Sergeant</mark> Franklin has been I"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "Sergeant"], "snippet": "burbs of this <mark>town</mark>. <mark>Sergeant</mark> Franklin has been I"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1782.24, 1480.88, 1946.49, 1502.38], "bbox_id": "091cdc7b00", "file": "AppomattoxNewspapers_1892-1898a_0469.pdf", "page": 1, "text": "and town sergeant, Mr. F. L. Agee few"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "and <mark>town</mark> <mark>sergeant</mark>, Mr. F. L. Agee few"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "and <mark>town</mark> <mark>sergeant</mark>, Mr. F. L. Agee few"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1462.08, 725.06, 1621.98, 1301.71], "bbox_id": "64a333fcb8", "file": "AppomattoxNewspapers_1892-1898a_0081.pdf", "page": 1, "text": "A Set-to. Knucks and hard hits were the order of the day on Thursday even ing last, As Knucks was in quest of something stronger than water, he desired Hardhits to set em up but the refusal of the latter caused the irascible and inebriatedKnucks to demand satisfaction by a resort to the pugilistic arena. The resort though not a summer resortwas still a very warm one, and Kuncks, when the sojourn was over, became the proprietor. Hardhits, after putting in some good work, retired from the scene of his activity to work off some of his worked-up feelings. Some inquiry has been made as to where our town sergeant and his officers were when the difficulty occurred. They should not have missed the pleasure of an attendance. Sunday-School Convention. The Sixth Annual Convention of the Vifginia Sunday-School Asscia- tion of all protestant denominations will be held in the city of Charlottes ville, Va., Thursday, Friday and Sat urday, September 28-29-30, 1893. Each county is entitled to four del egates, in addition to the President, Secretary and Superintendent. Each city is entitled to two delegates from each denomination. Ministers of all Protestant denominations, Superin tendents of Sunday-Schools from any part of the State, Presidents of Sun day-School Associations, and frater nal delegates from other States are ex-officio members, and are cor dially invited to attend. Homes will be provided, and reduced rates of travel given on all routes. For credentials, and all other in formation, apply to Chas. P. Rady, Corresponding Secretary, Richmond, Va. T. H. E llett , President."}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "as to where our <mark>town</mark> <mark>sergeant</mark> and his officers were"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "as to where our <mark>town</mark> <mark>sergeant</mark> and his officers were"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2373.59, 618.28, 2539.79, 707.28], "bbox_id": "7921c2de9a", "file": "AppomattoxNewspapers_1939-1943a_0460.pdf", "page": 1, "text": "A letter, rejecting the application was received Monday. Immediately upen receipt of the letter, town of ficials decided to send a committee to Washington to seek reconsidera ron of the case. Town sergeant J. W. Cawthon. fire chief Robert Lynch and coUncilmen Lewis McDearmoh and C K. Hunter went to Washings ton Tuesday."}, "highlight": {"text": {"matched_tokens": ["Town", "sergeant"], "snippet": "ron of the case. <mark>Town</mark> <mark>sergeant</mark> J. W. Cawthon. fire"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "sergeant"], "snippet": "ron of the case. <mark>Town</mark> <mark>sergeant</mark> J. W. Cawthon. fire"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [231.08, 1203.54, 551.95, 1299.08], "bbox_id": "4f1b66e4a3", "file": "AppomattoxNewspapers_1926-1933a_0217.pdf", "page": 1, "text": "yet. Mr. Coleman will contin ue his work until aftei he au- calls The county agent spent 57 dit of the t o w n AnCTTEs has lice, and wrote 242 letters in been made. He has held his days during the year in his of- position for the last three years- the interests of farming. Sev- Besides town manager, he has en training meetings were held also been commissioner of the, lor local leaders with thirty- revenue, sergeant, and town seven attending. The totul treasurer."}, "highlight": {"text": {"matched_tokens": ["sergeant", "town"], "snippet": "leaders with thirty- revenue, <mark>sergeant</mark>, and <mark>town</mark> seven attending. The totul"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant", "town"], "snippet": "leaders with thirty- revenue, <mark>sergeant</mark>, and <mark>town</mark> seven attending. The totul"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [122.12, 581.02, 290.6, 1744.89], "bbox_id": "4f52564245", "file": "AppomattoxNewspapers_1905-1912a_0159.pdf", "page": 1, "text": "F A R M V I L L E . At the laBt meeting of the repre sentative business men of Farm- ville a joint si ock company was formed to prosecute the work of boaring for oil and gas, with the as surance given out by an expert that if neither oil nor gas are found an abundant supply of pure artesian water will be. And this woalu mean much for this town. To have a flowing well instead cf a pumpng station, and pure water rather than that from a creek would mean im mense gain. The venture will now be prosecuted with vigor. A son of Farmvill  was greatly honored recently in the great city of New York. Mr. E. R. Booker, who has been doin a successful insur ance business here for many years, though still a yonng man, was called to New York by a telegram from the president of the Westchester Fire Company, and when he went to the office waa offered the position of ad juster for the company his territory being the States of Virginia, West Virginia, North and South Caro lina. His salary was fixed at 2,000 a yeir with all traveling expenses paid by the company. In the mean time he retains his home in Farm- ville and keeps np the bnsiness al ready established here. I am ad vised that there were thirty appli cants for the position and the fact of winning ont with anch competi tion is indeed high honor. Mr. Booker had his training iu our bnainess circles and won his busi ness spars m this field. I some times feel that our boys are neglect ing advantages of education becanse of the fact that they see so many yonng men entering business circles early in life and making money from the word go. And sb the money craze is abroad in the land 1 do not wonder at their course. Mr. R. D. Miller, who has served the town as Sergeant from 1881 till now, has tendered his resignation to take effect Sept. 1st. He haB made an honest and capable officer and would have heid on to the hon or so long as he would have consent ed to serve. And the position is a desirable one as the commissions amount to a comfortable bunch of money. Oapt. S. W. Panlett will have things to tell about wnen he ges back from that mingling of the  Gray and the  Blue at Spring- field, Ills. I presume they will al low him the privilege of giving the genuine rebel yelL Messrs. Johns and Booker have brought to town a new automobile the best of any we have yet seen By the time, however, we get ac customed to the luxury gome one will be ordering a bird of the air and we will be taking the upper ronte. Times change and men change with them. Other new residences for East Farmville and the three stores on Third street are going up rapidly.  Wash, the driving horBO of the late Gov. McKinley, now past thirty I presume, sustained an injury in his stall a few nights ago and the present owner thinks it will be beB t to chloroform the old hero and put an end to his sufferings. The last time he was driven down on Main Street I remarked to a friend that I thought he would last many years yet. I heard one of our merchants ex pressing joy at the coming of the BHtnmer Normalites, adding that we the regnlars badly from busi ness circles. Even if the girls only spent a dime each a day it would mean something. One of our con -"}, "highlight": {"text": {"matched_tokens": ["town", "Sergeant"], "snippet": "who has served the <mark>town</mark> as <mark>Sergeant</mark> from 1881 till now,"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "Sergeant"], "snippet": "who has served the <mark>town</mark> as <mark>Sergeant</mark> from 1881 till now,"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [529.64, 784.5, 694.95, 893.85], "bbox_id": "c34fe890ed", "file": "AppomattoxNewspapers_1915-1918a_0036.pdf", "page": 1, "text": "W. B. Andis, sergeant of the town of  Jonesville, was shot and killed there by Charles H. Hines, politician and foreman of the Lee County chain gang. The shooting occurred on the main street of the town. Andis had arrest ed Hines on a charge of disorderly con duct. Mayor Gibson dismissed the case when Hines promised to go home. He left the court room, procured his shotgun, returned to the center of the town and the shooting followed."}, "highlight": {"text": {"matched_tokens": ["sergeant", "town"], "snippet": "W. B. Andis, <mark>sergeant</mark> of the <mark>town</mark> of  Jonesville, was shot"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant", "town"], "snippet": "W. B. Andis, <mark>sergeant</mark> of the <mark>town</mark> of  Jonesville, was shot"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [232.8, 1201.37, 553.33, 1276.02], "bbox_id": "71b84152b2", "file": "AppomattoxNewspapers_1908-1909a_0217.pdf", "page": 1, "text": "dit of the t o w n flnffïBD has flee, and wrote 242. letters in been made. He has held his days during the year in his of- position for the last three years the interests of farming. Sey- Besidea town manager, he has en training meetings were held also been commissioner of the i tor local leaders with thirty- revenue, sergeant, treasurer. and town"}, "highlight": {"text": {"matched_tokens": ["sergeant", "town"], "snippet": "leaders with thirty- revenue, <mark>sergeant</mark>, treasurer. and <mark>town</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant", "town"], "snippet": "leaders with thirty- revenue, <mark>sergeant</mark>, treasurer. and <mark>town</mark>"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2162.65, 1670.36, 2460.09, 1713.1], "bbox_id": "169b4e1487", "file": "AppomattoxNewspapers_1908-1909a_0507.pdf", "page": 1, "text": "R. E. Staples, mayor of Vic toria Clarence Cheston, town the incumbent, Mr sergeant and E. W. Kidd, all not inter the June contest, of Victoria were welcome vial-  . ........... . O"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "R. E. Staples, mayor of Vic toria Clarence Cheston, <mark>town</mark> the incumbent, Mr <mark>sergeant</mark> and E. W. Kidd, all not inter the June contest, of Victoria were welcome vial-  . ........... . O"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "R. E. Staples, mayor of Vic toria Clarence Cheston, <mark>town</mark> the incumbent, Mr <mark>sergeant</mark> and E. W. Kidd, all not inter the June contest, of Victoria were welcome vial-  . ........... . O"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [116.14, 299.21, 285.15, 1789.53], "bbox_id": "e4f6bd7dd0", "file": "AppomattoxNewspapers_1905-1912a_0532.pdf", "page": 1, "text": "FABHViLLK. r, The fruit trees arc in fall bloon and as I write there is frost ii tin air. Let as hope, however, it will jfpmain there and not light on tin buds. The promise of a frnit croj as never so good. Messrs. Ransoi d Banghan, of Buckingham, an ipeiul of a bumper crop in thei lighborhor d. The Green, nurse, y in fall bloom and with no io Kraoh it will be the place beautiful  Mr. C. A. Price, who goes ou Korn Farmville as one of the com pany of that large body of Knight of the Grip, spent a few days a home recently, and was busy plant rag out fruit trees. He is de er rained that his acre lot in East Farmville b ar as much fruit and a great variety of vegetables as any other acre beneath the stars. Now Sfoid then I meet with a farmer who doesnt seem to nave time to work the garden, and never was a  routei mistake made. No acre on the farm half so valuable, and to waste time on tobacco and then not make a profit on the crop is sheer mad- pess, Farmville has been visit d bj more wind atorms and bnt for the fact that we have bad a genuine tornado they would have been reck oned as severe. Other venerable shade trees were biown down and pamag 8 done to roofs. I If the Voters of this district had known before voting that 25,090 for a high school building that the county superintendent would have the power of designating the site for the building, they would have gone slow. After the Board had named the present site the superintendent interposed his objec ion and that Hjhaa stirred the voters and tax payers. A mass-meeting has been called and the matter will be considered. The Sheeting will likely be a warm one. And this site-fight will look like Ifthirty cents when the one far a Government building is on. But Mr. Turnbull, who was here recently, gave ns to understand that we need not expect an appropriation this set iion. I- One of the best housekeepers of  the country has thirty spring ouick- ens ready for frying, weighing two Bounds each, for which she expects forty cents a pound, making 24 for p0 small chickens. Thats some- Bhiug new under the sun. I As I recall Madisonville, in Char- j lote county, was once known as 0hicken Town, and that would not now be misnomer for Farmville. Chickens galore on well nigh every dot and they aw all busy cacklir g, paying or setting. Thirty to forty ejg? a day taken from one ben house rounds like it might have happened cut in the open country. And many of the best varieties, the eggs selling for fancy prices. And yet what parse can buy spring fryers at forty cents a ponnd ? Farmville has been divided into wards with the plan of having two eouncilmen from each ward. Bnt as all voters of the town vote for all oouncilmtn it is possible to have them all from one ward. The c un oil will elect the town officials, trea surer, sergeant and clerk, and about such election most interest attaches. And there will be a genei al manager of the utilities, water,  sewer and electric, the most important position lot them all. There are two ball teams connect fed with the high school and they are practicing daily and earnestly. Recently the Junior Bangers crossed bats with the team of the Worsham school and beat 13 to 3. Professor Martin, principal of the Farmville school, is a devotee of the game ami encourages the sport. Such a thing as a teacher of the olden day taking part in the plays of the boys was never dreamed of in any philosophy It may be that in thee days more attention is being paid to muscle than to mind and yet I am not go ing to be bold enongh to make the charge. The habit of one of the husbands of Farmville is to kiss the good wife whenever he leaves the home, and the queen of the house says it is her salary as cook. Still she doesnt de maud increase of wages and sticks to the job with unflinching loyalty. Just here I am reminded that souk one has said that cooks wouldat bt satisfied in heaven for the simple rea son they couldnt leave. H the average bill collectors were i successful as the lady collectors L churches there would le few w hen a new year dawn- pld world. I witneskd street on yester- church collec in gentlemen from"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "oil will elect the <mark>town</mark> officials, trea surer, <mark>sergeant</mark> and clerk, and about"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "oil will elect the <mark>town</mark> officials, trea surer, <mark>sergeant</mark> and clerk, and about"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [127.8, 586.68, 389.27, 1712.74], "bbox_id": "7bf6fd0c62", "file": "AppomattoxNewspapers_1905-1912a_0175.pdf", "page": 1, "text": "PARM VlLiLfS. Pluma grown in this section this season are superior to any I ever saw. Many of them are as large as the average apple and are as delici ous as they are large. If the land owners of this section are not en- conraged to pay more attention to fruit growing in the future then object lessons are of not muon im portance. I very much doubt that California can beat us on the plum lines. There is promise of a warm pri mary town election even in the warm weather of the  summer. There are some fifteen applicants for the town sergeantcy made va cant by the retirement of Sergeant Miller, and it is proposed to decide between them by a primary. The office is worth some 1,500 a year, rather a good pull at publio pap, the aspirants afe all popular and the race will be exciting from start to ánisb. Another suggestion is to do away with a town treasurer and have the sergeant to do tho work alohg with that of his own office. The charter says there must be a treasurer, but it does - not say that the sergeant may not be trea surer. The combination would sive them 800 a year to the town and in the management ol ones private business that amount saved would be reckoned as desirable. Still another suggestion is that a general manager be appointed to have charge of the street improve ments, the electric light system and the water and sewer should the town buy the last two. What work has heretofore been done by members of the oonncil, principally by chair men of certain committees who serve without compensation and ii is urged that this is requiring too much of business men. i The town is waking up on ail lines rave on the advertising line. We are n.t letting the outside world hear about ns, and this in my opinion, is of prime importance. Larger cities are advertising as never before in their histories, and if it is necessary with them places like Farmville can not afford to neglect if. Atlanta has been made on printers ink, and Jacksonville is feeding at th-j same trough. Des . inoines perhaps leads them all and results ts-ere have been far ahead of all exp ctations. And whats true of towns and cities is equally true of merchants. Wanamaker is now 72 and yet he advertises as though he was beginning a new business for he has new goods to sell day by day. There are no shop-worn goods on the shelves of merchants who advertise. Not spasmodically but regularly and intensely. Prof. Binford gave an illustrated lecture on the subject of public schools in Virginia before the Sum mer Normal which was of genuine interest. Many schools of the State were pictured before the audience The people of the town have re sponded generously to the claims of the widow and children of Mr. Barnwell, who was killed by light ening. The burial of the father and son frpm the same home at the same time was something new in my experience. Mr. R. H. Panlett and the ma dam are at Asbnry Park Mr. and Mrs. D. T. Elam at the Greenbrier White Mrs. Tabb and daughter at Yellow Sulphur Rev. Hill and family at Wrightsville Beach, N. C. Rev. Fugate and family at Abing don, and Rev. Boogher has jnst re- j family was a happy"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant", "Sergeant"], "snippet": "fifteen applicants for the <mark>town</mark> <mark>sergeant</mark>cy made va cant by the retirement of <mark>Sergeant</mark> Miller, and it is"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant", "Sergeant"], "snippet": "fifteen applicants for the <mark>town</mark> <mark>sergeant</mark>cy made va cant by the retirement of <mark>Sergeant</mark> Miller, and it is"}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1501.9, 1295.19, 1668.73, 1333.79], "bbox_id": "df31246388", "file": "AppomattoxNewspapers_1939-1943a_0486.pdf", "page": 1, "text": "Glad to have seen Sergeant Jam es Hancock m town Saturday. This Appomattox soldier has done splendidly in the Army."}, "highlight": {"text": {"matched_tokens": ["Sergeant", "town"], "snippet": "Glad to have seen <mark>Sergeant</mark> Jam es Hancock m <mark>town</mark> Saturday. This Appomattox soldier has done splendidly in the Army."}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant", "town"], "snippet": "Glad to have seen <mark>Sergeant</mark> Jam es Hancock m <mark>town</mark> Saturday. This Appomattox soldier has done splendidly in the Army."}], "text_match": 1157451470904230009, "text_match_info": {"best_field_score": "2211897606144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470904230009", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [748.55, 1295.7, 916.09, 1653.21], "bbox_id": "3f842aa557", "file": "AppomattoxNewspapers_1943-1947a_0251.pdf", "page": 1, "text": "Yank Finds His Mother In Town at Czech Line WITH AMERICAN TROOPS IN GERMANY.  An American ser geants reunion with his mother brought tears to the eyes of every body in the little Czech border town of Barnau. Maj. Dan Riddle of Marksville, La., had to go to Barnau with a captain and his driver. May I go along? asked Sgt. Harry Alden of Pelham, N. Y. My family used to have a summer home there. As they rode toward Barnau the ser geant told of his birth in Nuemburg of German-Jewish parents and how he came to the United States in 1938, became a citizen, and joined the army. There it is! There is my house, the sergeant shouted as they neared the town. He leaped from the jeep and pounded on the front door. His grandmother came to the door. She told him his mother was in town, helping the American troops, so Alden and his friends drove on. Major Riddle saw two women one tall and statelywalking down the street, and on impulse he stopped the jeep. The taU woman was Harrys mother and when she saw him she cried out Hans! My boy! anJ came running with open arms. Thai was when the crying started."}, "highlight": {"text": {"matched_tokens": ["sergeant", "town"], "snippet": "is my house, the <mark>sergeant</mark> shouted as they neared the <mark>town</mark>. He leaped from the"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant", "town"], "snippet": "is my house, the <mark>sergeant</mark> shouted as they neared the <mark>town</mark>. He leaped from the"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1520.11, 192.91, 1685.92, 216.41], "bbox_id": "60dbfe54b5", "file": "AppomattoxNewspapers_1912-1915a_0597.pdf", "page": 1, "text": "Sergeant Franklin, of Pamplin, was in town Sunday."}, "highlight": {"text": {"matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Franklin, of Pamplin, was in <mark>town</mark> Sunday."}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Franklin, of Pamplin, was in <mark>town</mark> Sunday."}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.81, 572.14, 1617.27, 969.78], "bbox_id": "0f6b24823c", "file": "AppomattoxNewspapers_1908-1909a_0262.pdf", "page": 1, "text": "Mrs. Eva Hayden and little daughter, Betty Jane, are visit ing Mr. T. C. Harvey at Vera. Mr. Maurice OBrien, of Johnston City, Tenn, is visit ing relatives ip this county Mrs. Robert Lee Burks has returned from hospital and is feeling much better.  Town taxes hiave been paid and Sergeant Coleman is nohv mowing weeds from the streets. Mr. Billy Byrne, of Blacks- burg, was a visitor in .town this week. Miss Frances Caldwell is do ing nicely at Shriners hospital in South .Carolina. Mrs. J. B. Abbitt, of Norfolk, has returned to her homo after a visit to relatives here.  Miss Mary Grey Sears is visiting Miss Ann Abbitt in Norfolk. Mr. Frank OBrien, of Mis souri, is visiting relatives in Ap pomattox. It Mr. Herbert Wood, of Rich-? mond, has been on a visit to relatives at East Ridge. ! . Rev., J J. Clarke and, wife i.havq been On.a vtyit to Alex-"}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "is feeling much better.  <mark>Town</mark> taxes hiave been paid and <mark>Sergeant</mark> Coleman is nohv mowing"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "is feeling much better.  <mark>Town</mark> taxes hiave been paid and <mark>Sergeant</mark> Coleman is nohv mowing"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.13, 332.6, 1622.71, 1060.27], "bbox_id": "f8a80aeba9", "file": "AppomattoxNewspapers_1926-1933a_0262.pdf", "page": 1, "text": "Miss Neola Barlow is visiting her sister in Clifton Forge. Mrs. Sally Hancock is visit ing relatives and tfriends here. Mrs. J. A. Burke Is visiting in Norfolk. Miss Avis Brown left today for Virginia Beach. Mr. Edward Ramsey spent the week-end in New York. Miss Phoebe OBrien is spending theiweek in West Va. Copious showers have re freshed our crops. C. Wagner is indes- Mrs. R. poised. Postmaster Irby is not so well this week. Mrs. Eva Hayden and little daughter, Betty Jane, are visit ing Mr. T. C. Harvey at Vera. Mr. Maurice OBrien, of Johnston City, Tenn, is visit ing relatives in this county. Mrs. Robert Lee Burks has returned from hospital and is feeling much better. Town taxes hjave been paid and Sergeant Coleman is noW mowing weeds from the streets. Mr. Billy Byrne, of Blacks burg, was a visitor in .town this week. Miss Frances Caldwell is do ing nicely at Shriners hospital in South .Carolina. Mrs. J. B. Abbitt, of Norfolk, has returned to her home after a visit to relatives here. Miss Mary Grey Sears is visiting Miss Ann Abbitt in Norfolk. Mr. Frank OBrien, of Mis souri, is visiting relatives in Ap pomattox. Mr, Herbert Wood, of Rich mond, has been on a visit to relatives at East Ridge. Rev. J. J. Clarke and. wife, have been On a visit to Alex andria. Everett Connor and F. H. Hawley are dadies of new baby girls. Mrs. Eleanor children are -in for the summer."}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "is feeling much better. <mark>Town</mark> taxes hjave been paid and <mark>Sergeant</mark> Coleman is noW mowing"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "is feeling much better. <mark>Town</mark> taxes hjave been paid and <mark>Sergeant</mark> Coleman is noW mowing"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2225.29, 586.06, 2384.59, 885.42], "bbox_id": "0a2d7f9ec6", "file": "AppomattoxNewspapers_1908-1909a_0577.pdf", "page": 1, "text": "The town of Appomattox is going to observe Clean-Up Days next Monday, Tuesday and Wednesday, May 8, 9 and 10, sergeant J. W Cawthorn, Jr., announced yestrday. Town residents are asked tc clean their premises Monday o next week and place rubbage garbage, etc., on the streé ..onts and Tuesday and Wed nesday it will be called for and aken away. This clean-up period is an nually iised as a means of beau tifying the town and making premises more sightly i nap- pearance and the cooperation of the public is urged. The town furnishes feee drayage of rubbagç on these days, . ----- o -------- -- ---------- - Miss, Franklins Pupils To Have Recital May 17"}, "highlight": {"text": {"matched_tokens": ["sergeant", "Town"], "snippet": "8, 9 and 10, <mark>sergeant</mark> J. W Cawthorn, Jr., announced yestrday. <mark>Town</mark> residents are asked tc"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant", "Town"], "snippet": "8, 9 and 10, <mark>sergeant</mark> J. W Cawthorn, Jr., announced yestrday. <mark>Town</mark> residents are asked tc"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1395.08, 1309.61, 1540.17, 1393.05], "bbox_id": "7d73a9c11f", "file": "TimesVirginian_1981a_0418.pdf", "page": 1, "text": "The property committee of the Appomattox Town Council has awarded contract to F.T. Sergeant for surveying, mark ing and plating the Appomattox town corporate boundary lines. The town requests the understanding and cooperation"}, "highlight": {"text": {"matched_tokens": ["Town", "Sergeant"], "snippet": "committee of the Appomattox <mark>Town</mark> Council has awarded contract to F.T. <mark>Sergeant</mark> for surveying, mark ing"}}, "highlights": [{"field": "text", "matched_tokens": ["Town", "Sergeant"], "snippet": "committee of the Appomattox <mark>Town</mark> Council has awarded contract to F.T. <mark>Sergeant</mark> for surveying, mark ing"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [167.06, 982.69, 331.21, 1828.36], "bbox_id": "06c905421c", "file": "AppomattoxNewspapers_1922-1923a_0453.pdf", "page": 1, "text": "testB in Buckingham. We might not be able to reproduce them in all their force and fury, but we might arrange something like them and least break somewhat upon the dull monotony of every day life. 1 for myself, would love to attend another old fashion barbecue, or well ordered Biunswick stew aud hear the orators norate and th eagle scream. 1 dont know even my county statesmen and gems of purest ray serene may be all ubout me and 1 in the meantime all un coi soious of the fact. Stir up some fuu in historic Appomattox Mr. I itor, and it may spread to Prince Edward and around us too. If th Republicans were alert they would catch us napping uud get into har ness again, MrB. Dr. Pratt has rented a suite of rooms in the home of Mrs. Wade for the next Normal session. The Misses Davidson, of Lexing ton, who have been visiting friends in Farmville, have n turned to their home. The Rev. Dr. Graham, who with liis daughter has been visiting hie son, the Rev. H. Tucker Graham, has returned to his home in Win chester. Mrs. Mag Edmunds, f f Hampden Sidney, who has teen piesiding over the new pipe organ at the Presbyterian church so acceptably for the past three months, will no longer perform that service, her contract having expired. So long as the Normal session continues there will be no trouble as to a substitute and by that time some one will be in good training to take bp the work. Theje was a Confederate mar riage in our town recently that is a daughter of Sergeant R. D. Miller was married and he and Capt. S. W. Paulett put on the Krey gav the old flags to the breeze, and raised the  Rebel yell. No doubt the groom in the mean time was congratulating himsell that peace hath her victories no less renowned than war. I am still of the opinion that Richmond wont be big enough to hold Capt. Sam and Sergeant Bob when the reunion reaches high water mark. After much waiting and no doubt much worrying, Mr. Gannett is now in charge of the Far vilie post office The salary is 000 and the duties pleasant. Mj. liugg was fortunate as a democrat to hold on to the position for four years and about two months and that too during a Republican administration. Prof . E, is. Jones, pi the Nor-"}, "highlight": {"text": {"matched_tokens": ["town", "Sergeant"], "snippet": "mar riage in our <mark>town</mark> recently that is a daughter of <mark>Sergeant</mark> R. D. Miller was"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "Sergeant"], "snippet": "mar riage in our <mark>town</mark> recently that is a daughter of <mark>Sergeant</mark> R. D. Miller was"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2170.28, 1688.4, 2492.32, 1774.1], "bbox_id": "389ece64ef", "file": "AppomattoxNewspapers_1926-1933a_0507.pdf", "page": 1, "text": "R. E. Staples, mayor of Vic toria Clarence Cheston, town the incumbent, i Mr. Rice, will sergeant and E. W. Kidd, all not inter the Junei contest, of Victoria were welcome visi- - 0   tors in Appomattox yesterday. The teachers of Oakville While here Mr. Kidd escorted school visited in the home of his friends over he historic Sur- Mr. and Mrs. J. D. Hamilton ender Grounds. Tuesday evening.,"}, "highlight": {"text": {"matched_tokens": ["town", "sergeant"], "snippet": "Vic toria Clarence Cheston, <mark>town</mark> the incumbent, i Mr. Rice, will <mark>sergeant</mark> and E. W. Kidd,"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "sergeant"], "snippet": "Vic toria Clarence Cheston, <mark>town</mark> the incumbent, i Mr. Rice, will <mark>sergeant</mark> and E. W. Kidd,"}], "text_match": 1157451470635794553, "text_match_info": {"best_field_score": "2211897475072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470635794553", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1369.18, 466.93, 1525.9, 500.27], "bbox_id": "86eedb86ef", "file": "AppomattoxNewspapers_1926-1933a_0433.pdf", "page": 1, "text": "Sergeant Coleman is getting the streets of the town in shape for the winter."}, "highlight": {"text": {"matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Coleman is getting the streets of the <mark>town</mark> in shape for the winter."}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Coleman is getting the streets of the <mark>town</mark> in shape for the winter."}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1363.67, 1353.51, 1521.53, 1386.6], "bbox_id": "d09e71b8c2", "file": "AppomattoxNewspapers_1908-1909a_0433.pdf", "page": 1, "text": "Sergeant Coleman is getting! the streets of the town in shape for the winter."}, "highlight": {"text": {"matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Coleman is getting! the streets of the <mark>town</mark> in shape for the winter."}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Coleman is getting! the streets of the <mark>town</mark> in shape for the winter."}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [628.77, 823.62, 787.61, 1172.27], "bbox_id": "cb24f829c5", "file": "AppomattoxNewspapers_1898-1902a_0297.pdf", "page": 1, "text": "Five A m ericans K illed, Officer and Two Men Missing. Manila, By Cable.On Tuesday night the Filipinos rushed San Miguel, Province of Bulacan, Luzon, garrisoned by three com panies of the Tbirty-fltth Volunteer Infan try. They swept through the surpAsed town, shooting right and left, killing flve Ameri cans and woundiDg 3even. Capt. Charles D. Roberts and two privates are missing. No Filipino dead were discovered. 8an Miguel is a few miles from Manila. While a band under the escort of troops of the Forty-sixth Infnntry was moving friom Ilang to Silang, within 25 miles of Manila, it was attacked by Ladrones, three of the party bnng killed. Lieut. Jens E. Stedje, of Company L, Forty-seventh Volunteers, commanding a scouting party in the southern part of Albay Province, had several engagements With the natives, in which 17 Filipincs were killed and 23, including a captain, were captured. Six explosive bombs and a number of val uable Filipino documents also fell into the hands of the Americans. The scouts burned the town of Yubi, the headquarters of the natives. Sergeant Brickley was killed dur- ing a slight engagement near Hlgao, Province of Albay. Scouts of tho Thirty-sixth and Thirty- fourth Regiments captured 32 rifles and 500 rounds of ammunition in the Pangasinan Province. Major Marchs van of the Thirty-third Regiment has arrived at Aparri from Ben- guet, after the hardest of mountain travel ing. The men were exhausted and ragged having followed persistently on thesupposed Aguinaldo trail. They had several encounters with the Filipinos, but found no signs of Aguinaldo."}, "highlight": {"text": {"matched_tokens": ["town", "Sergeant"], "snippet": "The scouts burned the <mark>town</mark> of Yubi, the headquarters of the natives. <mark>Sergeant</mark> Brickley was killed dur-"}}, "highlights": [{"field": "text", "matched_tokens": ["town", "Sergeant"], "snippet": "The scouts burned the <mark>town</mark> of Yubi, the headquarters of the natives. <mark>Sergeant</mark> Brickley was killed dur-"}], "text_match": 1157451470501576825, "text_match_info": {"best_field_score": "2211897409536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470501576825", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1530.9, 978.25, 1767.42, 1068.81], "bbox_id": "3d2bbdd9d1", "file": "AppomattoxNewspapers_1915-1918a_0043.pdf", "page": 1, "text": "Sergeant Higginbotham is doing road lead- miles north of town. The few kickers abont the convict force will turn to postoffioe I i0Ul praise wnen all the bad hills LeSueur, jij, jj,e county shall be made pass- o. fi. H uk lieg, post-1 dhle."}, "highlight": {"text": {"matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Higginbotham is doing road lead- miles north of <mark>town</mark>. The few kickers abont"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant", "town"], "snippet": "<mark>Sergeant</mark> Higginbotham is doing road lead- miles north of <mark>town</mark>. The few kickers abont"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1904.14, 293.08, 2087.27, 1635.68], "bbox_id": "f3e9921396", "file": "AppomattoxNewspapers_1902-1905a_0518.pdf", "page": 1, "text": "While hitching a young mule John Henry Cobb, of Buckingham County, was kicked. His skull was fractured and he was injured internally. Mr. Cobb is a leading planter of his county and is a brother-in-law of Mayor H. A. Maurice, of Manchester. J. A. Stringer, a well-known citizen of Manchester, has disappeared, and his friends fear foul play. He has not been seen since he left home Saturday morn ing. Leonard C. Carson probably was fatal ly injured by a fall from the new Capi tol building, Richmond. The Corporation Commission has hartered the Colbourn Bros. Oyster Company, of Whealton, with a capital of 50,000. A S. Colbourn is president, G. 3. Howeth vice-president and W. W. Marshall treasurer. Morris Isenton and Henry Bord, pawnbrokers, of Portsmouth, were ar- -ested by United States Marshal West I sn the charge of receiving revolvers which were stolen from the United States Government. The revolvers are valued at 15 each, and it is alleged hat Henry Crofutt, a sergeant of ma rines, sold one and J. Miller, a marine, sold the other. These are the specific harges which will be presented to the grand jury now, but recently the officers yf the navy seized many wagonloads of property in the stores of the pawnbrok- rs said to be worth 10,000. The com mandant of the station and the officers of the court have determined to sup press stealing from the ships and the. navy yard.  Two tickets have been announced for he approaching Lexington municipal flection the incumbent, Mayor Samuel B. Walker, Jr., and Capt. W. F. Pier son, former Mayor of the town. Mayori Walkers Council is composed of Messrs Paul M. Penick, W. P. Irwin, C. R., Deaver, G. W. Offlighter, A. G. Hutton ind Dr. Hunter Pendleton. A ll except he last two are members of the present Council. Capt. Piersons associates are Dr. James Lewis Howe, Dr. Reid White, Messrs. M. B. Corse, Lawrence Em- bree, L. B. Miller and T. H. Boiey. The election will take place June 13. Virginia Institute, Bristol, has just dosed a successful year. The annual lit erary address was delivered by Dr. W. 9 . Pickard, of Lynchburg. The young ladies receiving diplomas were Misses Cates, Moffett, Floy Harris, Selma Bur- ion, Emma Gholston, Alice Huskms, Cynthia Orr, Pauline Cody and Marian Johnson. Gardiner  Clark and Mahan  Tyree, wo wholesale produce firms, of Danville, were burned out. The two concerns oc- supy a three-story brick structure, owned by Mr. J. R. Jopling. The insurance on building and goods will nearly cover the loss. , . The new catalogue of the Virginia Polytechnic Institute shows the total number of students who have matricu lated for the session of 1904-1905 to be 728. Among these there are men from nearly every State in the Union, Argen tina, Canada, Cuba, Ecuador, Newfound land, Santo Domingo and Spain. Out of the senior class of 103 it is expected that about 75 or 80 will receive diplomas on commencement day. The Jewish congregation of Temple Emmanuel, of Roanoke, has _ purchased the church property of the United Breth ren and will in the future occupy it as a place of worship. Engineer A. A. Linkous, of the Nor folk and Western Railroad, had his left hand crushed off under his engine one night last week at Glade Spring. He was under the engine adjusting a part of the machinery when the engineer on an other locomotive attached to the same train pulled the throttle, starting the train. Mr. Linkous, whose home is at Vickers, barely escaped with his life. The following night some miscreant shot into the westbound passenger train of the Norfolk and Western soon after the train left Marion. The ball passed through the day coach within a few inches of the head of the conductor, Captain Walters. News has been received in Bristol that Manager Kenyon, of the Helena Lumber Company, met a tragic fate in the mountains near Damascus. A log car ran away down the mountain and collided with a car on which Mr. Ken-  yon was seated. He was thrown under  the wheels and instantly killed, his body  being mangled. Mr. Kenyon was about 50 years old. His home was at Caze- novia, N. Y.  It is reported in Bristol, although the ! report lacks confirmation, that George I L. Carter has bought the coal and min- j eral interests of the Interstate Coal and ! Iron Company, in Southwest Virginia.  The price reported to have been paid i for the companys possessions is 275,- j 000. The civil engineer of the Inter state Company Has left Southwest Vir-  ginia and is looking after the companys j interests in lower East Tennessee. Elbert Boyd, a young man who was ! to have been tried at Blountsville, Tenn., for the murder of Thomas Galloway, i has been adjudged insane by a Bristol j ! jury that heard evidence as to his men- i ial condition. He will be sent to an! 1 aSyium. The jurys verdict provided that should Boyd eventually recover his mindj he is to be brought back and tried for murder. .......  _ For the murder of William S. Bur- on a highly respected citizen of Southjj Bristol, who was shot to death one nighty last fall, Grover and Clinton Wilson orothers, both young men, were sentenced 0 15 years each in the penitentiary. The mitigating circumstance that saved them from the death penalty was that some of heir neighbors had threatened them with iolence if they did not leave the com munity. Thomas J. Glass, aged 40, a lineman or the Bristol Gas and Electric Com pany, was killed almost instantly. He 1 nad climbed up to the top of a 30-foot Dole to adjust a wire, when the pole ! broke in two at the bottom and fell, j etching the lineman and crushing in Dis breast. Glass is survived by a widow ! and three little daughters. His aged mother resides in Richmond, and is now i critically ill. . . The board of trustees of the Uni- ! rersity College of Medicine, Richmond, I las elected Dr. John F. Winn to the  ffiair of clinical obstetrics."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "hat Henry Crofutt, a <mark>sergeant</mark> of ma rines, sold"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "hat Henry Crofutt, a <mark>sergeant</mark> of ma rines, sold"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1505.51, 537.25, 1675.95, 789.95], "bbox_id": "a2c1340ba6", "file": "AppomattoxNewspapers_1939-1943a_0584.pdf", "page": 1, "text": "We have received a card from Sergeant Edward M. Harvey, who is somewhere in England, stating that he receives the Times-Virginian regularly and enjoys reading about his home town. A card from Ser geant Curtis Harris, who Ü 3 sta tioned at Los Angci-M, Cilifornia, says he has visited several homes of movie stars and was through one of the movie sudioa and says that they are really nice to soldiers in Hollywood. An appreciated let ter from Sergeant Robert Smith, who is stationed at Camp McQuadc in California, sends his regards to his many friends back home. We have a card from Sire. Billy Hub bard, wi?a is row stationed at San Antonio, Texas, And we have long letter from Thelbert M Trent, U. S. Navy, frn oversea. These fine fellows are all doing a wonderful job for their county a.ni their wel fare should be a prime concer.i of everyone of us. We are always glad to _ receiye leters or cards from them."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "received a card from <mark>Sergeant</mark> Edward M. Harvey, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "received a card from <mark>Sergeant</mark> Edward M. Harvey, who"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [417.86, 882.64, 926.88, 1176.34], "bbox_id": "cc09996721", "file": "AppomattoxNewspapers_1943-1947a_0208.pdf", "page": 1, "text": "WANTED- Man to operate flour d feed mill. Will pay salary, or nt to right man. Apply in person Not Working Now, Senor, Is Plain Mexican Logic CAMP PENDLETON.A sergeant major at Camp Pendleton writes Sgt. I. R. McVay settled in a little cottage some miles from town, where his neighbors were few and far between. One neighbor, an an cient Mexican, could be seen sun ning himself every day, indifferent to the untended condition of his farm. Taking a Sunday walk, the sergeant major stopped to chat with his neighbor. You should plant these fine fields and raise a lot of crops, the marine remarked. The old man raised one sleepy eye. For why, senor? Well, you could sell the crops and make a lot of money. The ancient one nodded his head politely. For why, senor? You could put the money in the bank and you wouldnt nave to work any more, the sergeant major said convincingly. The old man weighed this care fully for a moment, relaxed, and closed his eyes. Not working now,"}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "Mexican Logic CAMP PENDLETON.A <mark>sergeant</mark> major at Camp Pendleton"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "Mexican Logic CAMP PENDLETON.A <mark>sergeant</mark> major at Camp Pendleton"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [356.4, 827.07, 521.23, 1217.01], "bbox_id": "7bfb164b3c", "file": "AppomattoxNewspapers_1922-1923a_0480.pdf", "page": 1, "text": "W. R. Kennedy Defeats Mayor Walk er At Lexington By Three Votes. Lexington, Va. Special.At the municipal election held in Lexington Tuesday, William R. Kennedy was elected mayor over the Incumbent Samuel B. Walker by a majority of three votes. All of the present coun oilmen were re-elected. There were 108 votes polled and four thrown out as defective. Capt. Walker has senr ed two terms. This Is Mr. Kennedy first political office. . Herndon, Va. Special.  The wwn election at this place Tuesday resulted as follows Councilmen E. L. Robey, H. B. Hutchinson, F F. Russell, F. E. Reed, C. M. Bur ton, E. Dyer, and E. N. Fitzhugh clerk, M. T. Wilkins sergeant, E W. Bauchman. The result of the election is considered as favorable to Mr. Ryans candidacy for Con gress. Luray, Va. Special.In a hotly contested election for town officials here Tuesday, T. A. Smoot, a mem her of the Luray bar, defeated Thom as R. Campbell, who has been mayor for six years, by a majority of tw votes. The following ticket was elected For councilmen, John H Booton, C. G. Mason, R. T. Morrl son, and J. F. McNeally, all being new, except Councilman Booton. Chatham, Va. Special.In the municipal election here J. H. Har grave, Jr., was re-elected mayor over L. P. Clyde, by thirty-eight majority W. M. Whithead, J. W. Whitehead B. S. White, W. B. Shepherd, E. S Reid, and A. D. Bennett were elected councilmen."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "clerk, M. T. Wilkins <mark>sergeant</mark>, E W. Bauchman. The"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "clerk, M. T. Wilkins <mark>sergeant</mark>, E W. Bauchman. The"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2399.98, 404.83, 2566.76, 1038.94], "bbox_id": "0dd66af0b3", "file": "AppomattoxNewspapers_1892-1898a_0060.pdf", "page": 1, "text": "W hole Fam ilies Blown Away  and No Trace Left, v Sioux C ity , I a ., Jnly 8.A tele gram from Fonda states that five entire families were blown away at Alta, bnt the fall list ot fatalities cannot be had. D, T. Miller is known to have been killed, and Mm Gordon was killed instantly by the wreck of her house, and nothing can be found of the family of seven. No trace can be found of Edward Sergeant and bis family of five. They are supposed to he dead. Sam Horsham, wife and two cMl dren, are missing.. Mrs. Hersham was in confinement when the storm broke, and all were blown away, and it is thought they are dead. Trains arriving from Easton, on. the Illinois Central, came into Sioux City .last night with all the giassin - the OKs broken. Trainmen say they ran through a severs hail storm, bni encountered no great. wand. A t Quimby, a little town east of Chero kee, many houses are reported to hare been wreoked,and at lsfc tm persons are. known to have beetfcl killed.  They srs. Mrs. Wa-i and Mrs. MoiroesMx, Tffkjjn can be had from thk eonntry tt Is expected the loss of life wmfeft fonnd very g- at, as the region through which the eyotona passed ! thickly populated. F ort D odge , I a ., July 8. Pom eroy, a .town of nine hundred in habitants, .-in Calhoun niwpty.-wai partially wiped ont lastnight by a cyclone. Between fifty and one. hundred were killed, and nsartytii i hundred injured, the most of whom.. will die. The scenes were appalling, as men went about with lanterns in the debris. In some initanoes entire families were wiped ont, the mangled remains being found in the ruins 61. their homes. The sonth half of the town was razed. There wa no place to care for the injnred,. and the chnrch just ontside the track of the storm was used as a hospital."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "be found of Edward <mark>Sergeant</mark> and bis family of"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "be found of Edward <mark>Sergeant</mark> and bis family of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1745.74, 293.79, 1909.21, 1517.63], "bbox_id": "4c5e2c9c50", "file": "AppomattoxNewspapers_1902-1905a_0156.pdf", "page": 1, "text": "Virginia pensions Elijah Sykes, Andrew J. Hopkins. John Mackey, each 12 James Thomas, 8 Abraham Cropper, 6 William Powell, to Rob- ri Balin, Thomas R. Fawcett, William H. Matthews dead, each ia John Creme, 55 Chloe Matthews, Nancy J- Davidson. Lucy Bowers, each 8 Moses FazeweH. 8 Harrison Cole 8 Edward J. Palston, 12 Luke Up shur, Lee Lilly, each 6 Patrick Cole man, 8- William P. Hudgins, Nanc O. Conklin, each 12 Mariah Jones Sarah E. Witherspoon, each 8 Wm H. Kitchmer, John Wright, each 6 Fire broke out in the Salem Woolen Mills, at Salem, and the entire plant was destroyed, with all machinery, in cluding the two main buildings and the pants factory. The loss is estimated a! i50,ooo, with only 40,000 insurance The fire originated in a packing room, which was filled with rubbish, and wAs caused by the explosion of Night Watchman C. E. Obenchains lantern. He had just entered the room when the explosion occurred, the oil and flames spreading to the packing material, and in five minutes the building was ablaze Mr. Obenchain was carried out uncon scious, having been overcome by  th heat. It was soon evident that the fin was beyond control, and the Roanoki Fire Department called on for help, 1 special train was gotten in readmes and the fire engine and hose wagoi were soon at the scene, seven mile away, but could do nothing to save th burning building.. The Salem Woolet Mills were constructed in 1890 and wen controlled by a joint stock company with E. M. Worden president. Thej employed 150 girls, and was the mos important industry the town afforded. Rev. R. Brown, a hegro preacher was put on trial at Portsmouth lot criminally assaulting a feeble-minded white girl, Nora Burke, on June 24 The girl had been sick and was not able to attend the trial. It is alleged that Brown entered the house in tht. absence of the girls mother, committed the assault and escaped. He was ar rested .and identified recently. Thf minister was held for the grand jury. At Petersburg the legislative candi dates are Messrs. J. H. P. Leigh, Bart lett Roper, Jr., and Charles E. Plum mer. There probably will be two othe candidates. John Bell, the sexton of Tabb Street Presbyterian Church, Petersburg, wat hurt by falling down the stairway aftei having rung the bell for the late after noon service. He lay several hours be fore regaining consciousness. The ser vice was held in the basement of thi church and none present knew of thf accident. The Virginia Passenger and Powet Company has nearly completed its rail road along the bank of the canal at Pe tersburg, from Femdale Park to the head of the canal, where a large dam if to be built. The stone blasted in wid ening the canal will be used in building the dam. The Democratic committee -of Staf ford has decided to hold the county and legislative pritqary on Octobet 7- Mr. R. M. Jones is a candidate for aele-  gate. Mr. M. K. Lowry, a Republican, the present delegate, will be candidate for re-election. For Sheriff Charles Towson, Charles L. Kennedy and R. C L. Moncure are mentioned. The pres ent Sheriff, Walter Warmsley, Republi can, will be a candidate for re-election. The Stafford pickle crop this year, usually worth 25,000, is almost a failure and will not make 30 per cent of an average. The tomato crop has also been damaged, and this will reduce thf output of the canning factoriees. Workmen engaged in digging the foundation of the large law building, tc be erected on Courthouse Square, Staunton, by Hon. Edward Eckols, un dermined the foundation of the west wall of a two-story brick building in which Harlow has a barroom. Just af- tre the workmen had stopped for dinnet the west and part of the north and south walls fell, wrecking the Harlow building. Had the accident occurred five minutes earlier a number of work men would probably have been killed. The loss is about 3,000. Several bar rels of whisky wre lost. James Pratt, a Floyd merchant, was robbed of i 63 by highwaymen. al Kings store. Pratt had been to Roanoke on business and had brought a load of produce. He had camped be side the road for the night and was sur prised by two men, who struck hirr river the head with a blunt instrument, rendering him senseless. There is ne clue to the identity of the robbers. The Aleaxndria camp of Sons of Confederate Veterans has .been reor ganized with the following officers! Commander, L. D. Sullivan first lieu- tenant-commander, F. W. Ebhart sec ond lieutenatn-commander, Andrew Sullivan, Jr. adjutant, A. S. Mankin quartermaster, Fred Scwab chaplain. J. T.- O Meara treasurer, C. W. O Meara color sergeant, J. A. Luckett- historian, G. C. Charles. The Eagle Shoe Companys factor at Newport News was formally opened with exercises of an interesting charac ter. The plant will employ 200 person. and has a capacity of 600 pairs of shoe a day. Charles Heiser, of Baltimore is superintendent. A negro charged with having shot George Williams near Potomac, it Prince William county, was arreste by the Sheriff and was being taken or the noon train to Alexandria, when hi rolled out of the car at Franconia and escaped.  Members of the Corporation Com mission made a tour of inspection o the properties of the Seaboard Air Lin Railway in Virginia with a view of fix ing the assessment for taxation. The. will go over the R. F. and P. tomor row."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "mos important industry the <mark>town</mark> afforded. Rev. R. Brown,"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "mos important industry the <mark>town</mark> afforded. Rev. R. Brown,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1956.02, 888.47, 2126.77, 1352.57], "bbox_id": "e29dc36e1c", "file": "AppomattoxNewspapers_1905-1912a_0246.pdf", "page": 1, "text": "This harmless preparation will promptly digest anything you eat and overcome a sick, sour, gassy or out-of- order stomach within five minutes. If your meals dont fit comfortably, or what you eat Ilea like a lump of lead in your stomach, or if you have heartburn,that is a sign of Indigestion. Get from any drug store here In town a 50-cent case of Papes Dlapep- sin and take a dose just as soon as you can. There will be no sour ris ings, no belching of undigested food mixed with acid, no stomach gas or heartburn, fullness or heavy feeling in the stomach, Nausea, Debilitating Headaches, Dizziness or Intestinal griping. This will all go, and, besides, there will be no sour food left over In the stomach to poison your breath with nauseous odors. Papes lapepsln is a certain regula- I tor for out-of-order stomachs, and be sides it takes hold of your food and digests it just the same aB If your stomach wasnt there.  These large 50-cent cases contain more than sdfficient to thoroughly cure any case of Dyspepsia, Indiges tion or any other stomach disorder. Remember, if your stomach feels out of order and uncomfortable now, you can get relief In five minutes by taking a little Dlapepsln, 4 i i  in i   Old Petes Little Joke. Foolish questions and funny an swers were under discussion In the Trenton avenue and Dauphin street police station the other day, and after listening for a while to some amusing instances. Sergeant McCay told the following Old Pete Flood was the attendant In the Franklin cemetery some years ago, and It became the custom to ask him how business was, Just to hear hls reply. It came In a heavy bass voice  Aint burled a living soul today.  pnla"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "drug store here In <mark>town</mark> a 50-cent case of"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "drug store here In <mark>town</mark> a 50-cent case of"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1821.61, 837.74, 1988.45, 916.39], "bbox_id": "f303225e0e", "file": "AppomattoxNewspapers_1949-1952a_0556.pdf", "page": 1, "text": "There are several new homes be- ng built in town. J. E. Jamerson is building a new residence near his home, to be occupied by Sergeant Couch and family. E. 0. Johnson is building the new home of Mr. and Mrs. Fred Smith next to the Car- roll Ould home."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "be- ng built in <mark>town</mark>. J. E. Jamerson is"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "be- ng built in <mark>town</mark>. J. E. Jamerson is"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2390.02, 1268.05, 2554.57, 1335.9], "bbox_id": "38960086d8", "file": "AppomattoxNewspapers_1912-1915a_0578.pdf", "page": 1, "text": "The town of Wise held an electloik and the following officers were chosen Attorney A. C. Anderson, Mayor D. C. Dean, Campbell Slemp, W lilla Owens and J. W. Dougherty, Council- men D. A. MulUns, recorder, and W. W. Killen, sergeant"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "The <mark>town</mark> of Wise held an"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "The <mark>town</mark> of Wise held an"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1641.35, 1223.66, 1805.51, 1565.96], "bbox_id": "45d91cb1a2", "file": "AppomattoxNewspapers_1892-1898a_0336.pdf", "page": 1, "text": "The town of Tigontoh, Prince Edwards island, to reported to have been almost to- ally destroyed by fire. One man was killed and three injured by tbe collapse of a building at 147th street aud Amsterdam avenue, N. Y. Spreading rails wrecked a Chicago nnd Northwestern Railroad passenger train at North Evausvilie, 111., Injuring four persons. Herbert Do ell, aged 19, aud Miss Jessie Fisher, aged 17, were drowned at Natick, Mass., by the upsetting of a boat. By tbe explosion of the boiler of a thrash ing machine, at Santiae Centre, Mleh , Geo. Castnrlion, Da ius Lossing were killed. The British steamer Linlithgow, from San Francisco for Leith, with a cargo of barley to adrift off Acapulco, Mex., with a broken sbaft. The powder mill near East Alton, 111 ex ploded nnd three men wore killed instantly. Their names aro Henry Begas, Henry Bog. era and Thomas Keffor, all employes. Sergeant Ivy Baldwin, attachod to tbe Sig nal Service of the Department of Colorado, fell from hto balloon while making an ascent and will probably die of hto injuries. A break in the main line pipe of the La fayette Natural Gas Company near Mlcbigun- town, Ind., caused an explosion, which kill ed Robert Hanna and seriously injured two other men. By the burning of the Commercial Hotel, at Yankleek Hill, Out., five persons met death. The vicUus are Mary Louise Yon- deau, Christy Villeneuve, Josephine Des- ebamps, Mrs. T. Fiinn and Miss K. McLeod. The property loss to about 610,000."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "The <mark>town</mark> of Tigontoh, Prince Edwards"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "The <mark>town</mark> of Tigontoh, Prince Edwards"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1504.8, 345.49, 1669.06, 1430.13], "bbox_id": "d6a14795f4", "file": "AppomattoxNewspapers_1892-1898a_0430.pdf", "page": 1, "text": "the S t a t e  t f tho,board 01 Public works of U8t Issued shows the state bf tall y e PI   1 the an a ar oa nie aocordi6 to this report, in . mlle80t rallrud In operation at 164 18 are113  fisCal yeftrof whlch while the by Street car companies, wniie the balance is owned by steam railroad  following values have heen firoDerrti  aMd   the varloB kinds of Roadways and tracks, 33,252,790 aepots, depot grounds, etc., 8,000,800 21 - g n  ra estate, 1,523,706 60 cam, en- I f o 226 m haery and ther equipments, aos2,2 7!, 8 Bil0P supplies, etc., 817,- i f .. 51 teiegraph lines, 47,66t 69, stocks 2fl3-fl6i 0 miscellaneous property, 85,825total value of all prop erty. 53,789,022 03. On this valuation ttm Commonwealth reoelveB a tax of 218,996 89 .  e e o m p a n te s pay the amount named Norfolk and Western, 73,462 68 Ohesa  r n 0hl0- i48-544 66 Southern, 40,- i3v ter companies, except street car tines. 47,899 88total, 214,681 23. Street oar lines, 8,465 07. _ A Richmond builder has written a letter to City Sergeant Spps offering, If he be per mitted to pull the death trap at the Fife exe- sutlott, to ereot the gallows for that erimlnal free of cost to the Commohwealth. His.of fer will not be accepted, but the proffer in- Jloates the Interest still manifest here In the Case of this doomed negro. When Thos. 0. Cluverius was executed in 1887, the rope used was made of silk. After the maa had ex piated his crime the maker of the gallowc rope sold it out to the mdrbidly curious uhtll this was stopped by the authorities. B. E. Hughes, cashier and a director of the Traders Bank, and 0, O. Burford, a mer chant, had an altercation on Main street, Lynohburg, which resulted In the exchange of blows and tho drawing of a pistol by Bur- ford. Neither of the men was hurt. Three years ago Burford placed in the Traders Bank on a certificate of deposit several hun dred dollars. The bank closed Its doors, and Burfords failure to obtain blB money, aftei repeated demands for it, led to the trouble. Burford had two loaded pistols on bis per son, but claims that he was carrying them to h gunsmith to have them fixed. Mr. Claron J. Noel, one of the oldest and most highly respected citizens of Wytheville, Is dead. Mr. Noel came to Wytheville a young man from Charlottesvile, Va., where he had married Miss Mary Clyne. He held many offices of trust In Wythe oounty. After the war he opened a drug store In Wythe- ville, and conducted It with success and profit for many years, until he retired from active business some fifteen years ago. He leaves a widow and three childrenMr. Walter Noel, Mrs. John G. Brown and Mrs. John Williamsand a host of friends. Mr. Noel was seventy-nine years of age at his death. Luke Edwards, who had just been sen tenced to the penttqgtiary for three years for burglary, and Wesley Johnson, for the same offense, who was serving out a sentence of one year, both negroes made their escape from the Boanoke jail and as yet have not been captured. They sawed the bars of the cell In two, and once inside the corridor, mado a hole through the bricks under a window on the third floor, from which they easily descended to tbe ground. The station- keeper was nbtifled that the prisoners were escaping, but when he got to the rear of the all they had disappeared. The Norfolk and Western Bailway Com pany savt all the available crews to the Flat Top coal regions In order to get out os much coal from that section as possible before all the coal miners there had joined the strike. Michael Dase, a German market gardener, Who has resided in Boanoke and vicinity for the past eight years, committed suicide at his residence, a short distance south ot Roan oke, by shooting himself in the head with a revolver. H. M. Bruboker, a neighbor, heard the shot,and went at once to Doses house, where he found him lying unconsci ous on the floor with a bullet wound in his forehead and a revolver at his side. He was sixty-seven years old and had no relations, in this country except his brothers family,! at Harrisburg, Pa. A note was found on the floor signed M. Dase, which read Bury me In a pine box and place on the hill, and no preaching. The verdict of the coroners jury was in accordance with the above facts. The deceased had been very despondent for some time. George Saddler, a young farmer of Ches terfield county, was attacked and beaten al most to death. At the time ol the assault Saddler was asleep In his wagon. His as sailants, It is alleged, .were colored men. Saddler and some other countrymen had brought produce to town to sell and were spending the night under a shed. Sei oral colored men have been arrested, charged with the assault. At the request of citizens of Alexandria county, Representative Rixey, of this dis trict, is making an effort to secure such action on the part of the United States gov ernment as will devote the 600 or more acres of the Arlington track now unused to ex perimental farms under the control of tho Agricultural Department. Among the projects suggested in Alexan dria county is an extension of the Washing ton, Arlington and Falls Church Electric Railway from Arlington to Seminary Hill, near Alexandria, the crossing at Four Mile run to be made near Nauohs Station. It Is not known how soon an effort will be made to put this project Into execution."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "a letter to City <mark>Sergeant</mark> Spps offering, If he"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "a letter to City <mark>Sergeant</mark> Spps offering, If he"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1649.3, 375.49, 1817.88, 607.53], "bbox_id": "ba2f16bc38", "file": "AppomattoxNewspapers_1943-1947a_0366.pdf", "page": 1, "text": "The following section from the Town Ordinances of Appomattox, is published for the information of the public Section 85 1 Hog-pen, stables, etc.- No person shall keep any heg-pen, stable, or other outhouse for animals, at such place, or in such manner, as to be a nuisance, or a source of ill-health to the town, or ad oining tenant, under a penalty of not less than one nor more than twenty-five dollars, and each day the same shall continue shall constitute a separate offense, and the sergeant shall, upon the order of the mayor, abate the same at the -owners expense and all hog-pens shall be constructed with a floor at least ten inches from the ground unless such floor be of concrete, and shall be pro vided with adequate drain. J. W. CawMicn, Sergeant. 2-14-ltc"}, "highlight": {"text": {"matched_tokens": ["Town"], "snippet": "following section from the <mark>Town</mark> Ordinances of Appomattox, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Town"], "snippet": "following section from the <mark>Town</mark> Ordinances of Appomattox, is"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2003.8, 586.1, 2222.29, 842.59], "bbox_id": "f143ca67df", "file": "AppomattoxNewspapers_1912-1915a_0585.pdf", "page": 1, "text": "the  Mr. S. H. Franklin, of Lynch burg, is spending several days  with relatives at this place The new Sergeant here is en de voring to preserve order in  this town and has thus far sue-1 ceeded well. Mrs. Ethel Young, of Crewe, 1 is visiting at the home of her parents, Mr. and Mrs. R. D Baldwin. While many of the national of Europe are arrayed against  ach other in deadly conflict a kind Providence allows us to I go forth in the peaceful pur suit of business aud pleasure. I left field  Cops just harvested are good 3nd base I and the future outlook for the I catcher I growing crop is better than pitcher I last year."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "this place The new <mark>Sergeant</mark> here is en de"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "this place The new <mark>Sergeant</mark> here is en de"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [205.89, 352.12, 367.54, 847.96], "bbox_id": "196c9fadfb", "file": "AppomattoxNewspapers_1905-1912a_0497.pdf", "page": 1, "text": "that of this season. And there are others who agree with him. Still the-weather of lae haa been charm ing aid stimulating to people far health and with warm hoarth stones. FarkiuSie is all estirOn the cub-, ject of the amended charter for the town, which hae been pnaented to the legislature for approve1 In ad dition to the dividing the City into wat ds, there are marked changes a to the official. The Work hereto fore done by the sergeant will be transferred to tbo treasurer, the ser geant will be known as oMs-uf- polioe and the olerk will eet as sssa sor as well as scribe, tinder the . provisions of the Charteris sent to the legislature these Officers see to be named ey the counoil, though therein wide-spread demand that the voters shell pass upon them. Two eouneilmen are to he chosen from each ward, end the Ifeyer-wili vote oa ell questions, end when a tie arises will have t vo votes. There is some kick against this too, but no organised effort to defeat it. The speaker of Congress has two I voex under like conditions, and so! has the spesker of the lower house! of the Virginia legislature. A bnai- nWaggMuager for the utilities of tbs town krilllie elected by the counoil, and this will be the most important office of them all. Already candi dates are bobbin  up tor the several positions, and no matter who la to elect them the canva s will be wsrm and interesting. Prince Edward Hctel is being re painted, repapersd and generally proved. I am told that tha lease"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "amended charter for the <mark>town</mark>, which hae been pnaented"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "amended charter for the <mark>town</mark>, which hae been pnaented"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1543.9, 386.92, 1720.4, 1253.96], "bbox_id": "4e686ca49a", "file": "AppomattoxNewspapers_1912-1915a_0491.pdf", "page": 1, "text": "such as to hold in shadow ail but the central portion of the room. With a sigh the sergeant dropped his eyes from the wall be could barely distin guish and, following Judge Ostranders lead, passed with him under the torn folds of the cùrtain and through the narrow vestibule whose door was made of iron, into the room where, in a stronger blaze of light than they had left, lay the body of the dead negro awaiting the last rites. Would the judge pass this body, or tarn away from it toward a door lead ing front? TJie sergeant had come in at thè rfear, but he greatly desired to go out front, as this would give him so much additional knowledge of the houee. Unexpectedly to  himself the judges Intentions were in the direc tion of hS own Wishes. He was led front and, entering an old-fashioned hall dimly lighted, passed a staircase and two closed doors, both of which gave him the impression of having been shut upon a past it had pleasured no one to revive in many years. Beyond them was the great front door of colonial style and workman shjp. a fine specimen once, but greatly disfigured now by the bolts and bars which had been added to it in satis faction of the judges ideas of security, Many years had passed since Judge Ostrander had played the host but he had not lost a sense of its obligations It was for him to shoot the -bolts and lift foe bars but be went about it so clumsily and with such evident aver sion to the task that the sergeant In stinctively sprang to help him. I shall miss Bela at every turn, remarked the judge, turning with a sad emlle as he finally pulled the door open. This is an unaccustomed effort for me. - Excuse my awkwardness. Something in his attitude, something in the way he lifted his hand to push, back a fallen lock from his forehead, impressed -itself upon the sergeants mind so vividly that he always re membered the judge as he appeared to him at that minute. Certainly there were but few men like him in the country, and none in his own town. Of a commanding personality by reason of his height, his features were of a cast to express his mental attributes and enforce attention, and the incongruity between his dominat ing figure and the apprehensions which he displayed in these multiplied and extraordinary arrangements for per sonal security was forcible enough to arouse any mans interest. The sergeant was so occupied by the mystery of the man and the mystery of the house that they had passed the first gate which the judge had un locked without much difficulty before hp realized that there still remained something of interest for him to see and to talk about later. Tbe two dark openings on either side, raised ques tions wbich the most unimaginative mind would feel glad to hear explained, Ere the second, gate swung open and he found himself again in the street he had built up more than one theory in explantion of this freak of parallel fences with the strip of gloom between He would have felt the suggestion of the spot still more deeply had it been given him to see the anxious and hes itating figure which, immediately upon his departure entered this dark maze, and with feeling hands andcautious step wound its way from corner to corner  now stopping abruptly to listen, now shrinking from sòme imag inary presencea shadow among shadowstill it stood again between tbe gates from which it had started."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "With a sigh the <mark>sergeant</mark> dropped his eyes from"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "With a sigh the <mark>sergeant</mark> dropped his eyes from"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [960.52, 958.24, 1131.27, 1753.78], "bbox_id": "7f202c31e4", "file": "AppomattoxNewspapers_1939-1943a_0273.pdf", "page": 1, "text": "Somebodys kidding you, Bill. Ive known Frank ever 6 ince I was pounding a beat twenty years ago. How about this? Duggan slid the gun across the desk. His girl was carrying it. Robinsons eyes sobered. Its like this, Sarge, explained the boy, shamefacedly. Patshes Patricia Faheyis crook crazy. Nothing wrong . . . shes just a kid and . . . well, II fell for her and was afraid to tell her I was a soda jerker. So I made up this story about being wanted . . . I even bought the gun for her to carry. Trouble was, Sarge, she musta boast ed to some dame about thethe boy blushed and swallowedthe price on my head. Thats the truth, I swear. Sergeant Robinsons chins gave a  preliminary quiver. Maybe shes had a lesson, he said doubtfully. Duggan reached for the battery of push buttons. Wait. Robinson dried his eyes. You going to tell her the truth, Frank? Shell be off me for life, replied Frank, disconsolate. Pats a good kid, insisted the boy loyally. She works in a five- and-ten and hands all her dough over to her folks. Shes only seven teen, Sarge. Shell get over it. Well, if youre sure . . . say! Robinson beamed. Ive got it. A quietly understanding matron and the terrifying impersonality of a cell had done much to eradicate Patricias anti-social propensities. She came in, cast an anxious, frightened glance at the blue uni forms, and sped to Frank. Ser geant Duggan cleared his throat. Remember, Phantom !w he rasped. You may have been clev er enough to play a lone hand and fool the police ofof two continents, but sooner or later youll slip. The Federals suspect you of wounding those G-men in Iowa and if they ever get proof, God help you! Youll be Public Enemy Number . . he eyed Robinson uncertainly. Three, prompted the latter. Number Three, Duggan went on. And you know what that means! Either get a job or leave town, warned Robinson sterhly. Well be watching you, Phantom. Get out! roared Duggan. Both of you! Frank seized Pats wrist. The way to the door and freedom was clear. Mad at me, Frankie? she asked, timidly. Naw. Pat pressed closer, her immature bosom swelling with re lief and adoration. If onlyno, she dared not hope. She waited until a block was traversed. Then Will you do it? I mean, get a job? He stopped and Pat felt his arm tense. That eye looked uncom promisingly severe. Please, she urged. For me, Frankie. It seemed a long wait to Pat. In reality, it was just long enough for the boy to focus his good eye. For you, Baby, he whispered in her ear, Ill do anything . . . even go straight!"}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "the truth, I swear. <mark>Sergeant</mark> Robinsons chins gave a"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "the truth, I swear. <mark>Sergeant</mark> Robinsons chins gave a"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1513.91, 734.25, 1677.02, 1802.85], "bbox_id": "1f0cf5c68e", "file": "AppomattoxNewspapers_1918-1922a_0486.pdf", "page": 1, "text": "Sergeant Jerry Simpson Beas ley The remains of Sergeant Jerry Simpson Beasley, who was killed in France on Oct. 4th, 1918, during the World War, arrived on Saturday last and were interred in the family cemetery at Hollywood on Sun day following. Deceased was a member of Go. D., 18th In-i fantry, 1st Division. Death came to the deceased while the Argonue Forest fight was being waged. The funeral and burial services were conducted in the Hollywood church and at the cemetery respectively by Rev. Thomas Jefferson Ragland, of Evergreen, Va. Many friends and relatives were present to express their last respect and sympathy for the deceased. The pallbearers were W. Thomas Covington, Charlie J. Bagby, Herbert C. Bagby, Ster ling Franklin, Harry Jenkins and George White. Sergeant Jerry Simpson Beasley was the second mem ber of the same family to be killed during the World War. The first brother, Sergeant James Robert Beasley, was killed in the second battle on the Marne. The second broth ers remains arrived in June la st. ___________________ Big Circus at Lynchbnrg Steaming this way on four trains is the oldest, biggest and best circusJohn Robin sonsfor ninety-eight years the favorite of countless hosts of American circus fans. The  big thing is coming to Lynchburg Monday, August 22nd, on a ooast to coast tour, including Canada, playing every city of importance in North America. _________ S p o u t S p rin g Mr. Odelle Howerton left Wednesday for Roanoke on business. Mr. Marshall Howerton ar rived last Tuesday with his bride. Congratulations Mr. Howerton. Mr. Lee Garrett is on the sick list and we hope for him a speedy recovery. Mrs. Dan Dickerson, of Crew, spent Sunday with her mother, Mrs. Calhoun. The Union meeting of the churches at Spout will begin Sunday night at ths Baptist church. Rev. Marsh will preach and Rev. Jenkins of Richmond, will come Monday and preach the rest of the week and prob ably longer. It will be to the interest of all to hear this great man of God. It is said Bunk Rector is a candidate for matrimony and is not particularly fastedious. Our friend George Cheatham continues to motor to Stone wall quite often. Mr. and Mrs. Steele and family returned from Greens boro last Thursday via country. Automobiles are admonished to observe 10 miles per hour through main street of onr town. Miss Louise Bates, of Lynch burg, is visiting her uncle, Mr. R. H. Bates. The news of Spout, if all  written would occupy your en tire paper Mr. Editor, but it all oant be printed."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "<mark>Sergeant</mark> Jerry Simpson Beas ley"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "<mark>Sergeant</mark> Jerry Simpson Beas ley"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1554.51, 323.7, 1721.02, 1658.94], "bbox_id": "b30500e52c", "file": "AppomattoxNewspapers_1905-1912a_0315.pdf", "page": 1, "text": "Roanoke.In a report handed in at midnight the special grand jury calls on Mayor Joel H. Cutchin to show why be should not be removed from office, charging him with collu sion with persons of ill repute and with haying accepted gifts of various kinds from these people. The report charges Police Sergeant Lemon with the same offense. Following the pre sentation of the report Judge Seaples announced that he would ask the Governor to appoint a judge to pre side in the case of Mayor Cutchin, which will be taken up at the next term of court. The text of the re port does not come as a surprise, since the Jine of examination follow ed by the jury had been talked of for some time. Mayor Cutchin has held office for many years and is 61 years old. Mayor Cutchin issued the follow ing statement The report of the special grand jury just published is such that I ask the public to withhold its judgment until after investigation and ask my friends to believe me Incapable of in tentional wrongdoing. I declare with all the interest of my soul that I am innocent, and before an honest and just judge that fact will be shown and the motives for my prosecution disclosed. The Mayor also issued an order suspending Police Sergeant Lemon, who was mentioned in the grand jury report. Suffolk.Seeking to sacrifice her brother, Prince Carr, in the hope of securing a pardon for her husband, Ethel Edmunds is accusing the for mer of attempted assassination, a crime for which the husband, Wil liam Edmunds, already has been sen tenced to two years in States prison. Shortly after the husband was con victed In the city Circuit Court the woman said Carr was guilty of the crime. He then had left the city, but was run down and was arraigned be fore Mayor Norfleet for a hearing and held. The assistant prosecutor for the State was aided by the two law yers of Edmunds counsel, who moved Carr to save their own client. Carr had no legal adviser. Norfolk.Seeking to recover 10,- 000 each from F. Decordy Matthews and William F. Taylor, captain and lieutenant of the First and Second Companies, Coast Artillery, recently disbanded by order of Governor Mann, the State of Virginia entered suits in the Court of Law and Chan cery. The suits resulted from the inability of thie two officers to account for the equipment of the companies furnished by the United States gov ernment and for which the State is responsible. Commonwealths Attor ney Tilton filed the suits. Leesburg.Decatur White, unmar ried, of a well-known family of Lou doun county, attempted to commit suicide at his home, near Leesburg. He first drank carbolic acid and then shot himself just below the heart with a .32-calibre revolver. Illness and despondency are given as the cause. He is a retired farmer and lives with his brother, Tobias White. He is not expected to recover. Hampton.John W. Leech, aged 70 years, a veteran of the Confed erate Army, committed suicide in Phoebus jail by hanging himself with Ian improvised rope made from his khaki shirt. Fastening one end of the shirt to the top of his cell and the other around his neck, he jumped from his bunk. His body when found hanging in the centre of the room was already lifeless. Fredericksburg.John M. W. Green, of this city, has sold a part of his fine farm in Stafford county, near this city, of 105 acres, on the east side, to Wil liam Rawson, of England. Mr. Raw- son will build a residence for his home and will make a number of improve ments. Harrisonburg.An automobile ran into a culvert five miles from town, turning over and injuring both occu pants. J. W. Thompson, postmaster of Dayton, was knocked unconscious and badly bruised. William Evers, of Day- ton, suffered similar injuries, losing also a tooth and part of an ear. Harrisonburg.The annual meet ing of the trustees of the State Nor mal School elected officers as follows Hon. George B. Keezell, of Rocking ham, president Hon. Floyd W. King, of Clifton Forge, vice-president George N. Conrad, treasurer, and Julian A. Burruss, secretary. Newport News.In 20 minutes 20,- 000 worth of damage was done by fire at the Chesapeake and Ohio Railway car shops here. The blaze, which is supposed to have started from a bolt heating furnace, destroyed the ma chine, blacksmith and woodwork sheds. Lynchburg.Tho executive com mittee of the local Sunday-school as sociation met at the. Young Mens Christian Association to make ar rangements for a religious census of the city for use by the Bible schools of the city. Nearly all of the Prot estant schools of the city will aid iD I the enumeration. A sewing cabinet spacious enough to hold everything a seamstress may need in her work yet which folds up  like a screen and can be carried by handles, has been invented by a Mis- I sourians."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "The report charges Police <mark>Sergeant</mark> Lemon with the same"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "The report charges Police <mark>Sergeant</mark> Lemon with the same"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1212.91, 646.86, 1366.45, 1869.09], "bbox_id": "984eaf5fcd", "file": "AppomattoxNewspapers_1918-1922a_0366.pdf", "page": 1, "text": "Petersburg.  An unsuccessful at tempt by burglars to enter the big vault in the office of the Southern Dry Goods Company, on North Union treet was discovered when employes reported for work. Thè hlbges on the vault doors had been sawed in two, but the cracksmen were foiled in their attempts to enter the vault by a steel bar across the inside of the doors. Lynchburg.Hallie G. Witt, who served as a sergeant , in the casualty department of the Fifty-fourth Depot Brigade during the war, following an enlistment with Company G, First Vir ginia Infantry, has been elected first lieutenant of Company E, First Vir ginia National Guard here. He suc ceeds J. O. Jordan, recently trans ferred to a Roanoke Machine Gun Company, of which he has been made captain. Pulaski.  Fire of undetermined origin gutted the millinery and music departments of the store of Clyde Smith  Son. Nothing was saved from either department. A partition separated thsm from the main floor. The Arm carried about a 20,000 stock, with only Insurance of 1,000, with 500 on the building. Effective work of the volunteer fire department pre vented a section of the town being burned. Newport News.A resolution in dorsing the action of the local school board in putting a bau on dancing by high school pupils was adopted by the Ministerial Association. The resolu tion declared that the dance craze has proven one of the most distressing results of the World War, and that thoughtful people on both sides of the Atlantic are moving so unitedly to oppose it that even the dance masters are advocating reform and advertising a change of policy. Petersburg.George Lundy, son of Chesterfield County Magistrate G. E. Lundy, whose trial in the Hustings Court of this city in November on the charge of shooting and killing Clyde James at the Lundy home on the night of November 11, resulted in a hung jury, pleaded guilty to voluntary man slaughter, and was sentenced by Judge Mullen to one year in the State Peni tentiary. Lundy will be taken to Rich mond within the next few days to be gin serving his sentence. Dantfile.That, a point in Virginia is being considered as the terminal in a cross-Atlantic zeppelin service was asserted by Colonel A. B. Carrington of this city who recently returned from Europe. He said he had been assured that capitalists of France, America and England werd forming a company to operate zeppelins and heavier-than- air machines as soon as commercial flying has reached a point where it can be Undertaken on a large scale. He said a point slightly ndrth of Dan ville, Va., was under consideration, and that he had pledged the interest of his community in any such scheme, even proffering 190 acres for the land ing place. Danville.The campaign tor mem bers will be continued by the Virginia Tobacco Growers Association through out the month of January. This an nouncement was made here by W. It. Ogg, secretary treasurer of the organ ization, who is directing the campaign. The oampaign was scheduled to be completed by January 1, but owing to a number of circumstances this was found to .be inadvisable. Many coun ties were unable to get their county organizations perfected and organizers put in the field until the middle of December. The combining of the three Virginia tobacco growers organiza tions was also a large factor in chang ing the plans for the membership campaign. The condition of the roads has also hindered organization work in many communities. Fredericksburg.At a meeting of citizens of Spottsylvania county the organization of a Spottsylvania Coun ty Good Roads Association was effect ed by the election of Captain M. B. Rowe as chairman, and T. E. Thomas as secretary and treasurer. Sub-chair men will be named for the different districts in the county and an inten sive drive will be put on for member ship in the Virginia Good Roads Asso ciation to develop sentiment for better highways and make possible good roads educational work in every sec tion of the State. Petersburg.A large frame build ing at Camp Lee, formerly the colored hostess house, now used by Captains J. E. Allison and W. A. Rawls, of the Forty-third Infantry, and their fam ilies as quarters, was destroyed by fire, causing a loss of about 13,000. Origin of the fire is not known, but the build ing was a complete loss. None of the household effects were saved, the fam ilies barely escaping without injury with no clothes other then those they wore."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "who served as a <mark>sergeant</mark> , in the casualty department"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "who served as a <mark>sergeant</mark> , in the casualty department"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1173.56, 650.92, 1331.91, 1895.01], "bbox_id": "b1ede3d0d3", "file": "AppomattoxNewspapers_1918-1922a_0562.pdf", "page": 1, "text": "Petersburg.  An unsuccessful at tempt by burglars to enter the big vault In the office of the Southern Dry Goods Company, on North Union street was discovered when employes reported for work. The hinges on the Vault doors had been sawed in two, but the oracksmen were foiled in their attempts to enter the vault by a steel bar across the inside of the doors. Lynchburg.Halite G. Witt, who served as a sergeant in the casualty department of the Fifty-fourth Depot Brigade during the war, following an enlistment with Company G, First Vir ginia Infantry, has been elected first lieutenant of Company E. First Vir ginia National Guard here. He suc ceeds J. O. Jordan, recently trans ferred to a Roanoke Machine Gun Company, of which he has been made captain. Pulaski. - Fire of undetermined origin gutted the millinery and music departments of the store of Clyde Smith  Son. Nothing was saved from either department. A partition Separated them from the main floor. The firm carried about a 20,000 stock, with Only insurance of 1,000, with 500 on the building. Effective work of the volunteer fire department pre vented a section of the town being burned. Newport News .A resolution in dorsing the action of the local school board in putting a ban on dancing by high school pupils was adopted by the Ministerial Association. The resolu tion declared that the dance craze has proven one of the most distressing results of the World War, and that thoughtful people on both sides ot the Atlantic are moving so unitedly to oppose it that even tho dance masters are advocating reform and advertising a change of policy. Petersburg.George Lundy, son of Chesterfield County Magistrate G. E. Lundy, whose trial in the Hustings Court of this city in November on the charge of shooting and killing Clyde James at the Lundy home on the night of November 11, resulted- in a hung jury, pleaded guilty to voluntary man slaughter, and was sentenced by Judge Mullen to one year in the State Peni tentiary. Lundy will be taken to Rich mond within the next few days to be gin serving his sentence. Danville.That a point in Virginia is being considered as the terminal in a cross-Atlantic zeppelin service was asserted by Colonel A. B. Carrington of this city who recently returned from Europe. He said he had been assured that capitalists of France, America and England were forming a company to operate zeppelins and lieavier-than- air machines as soon as commercial flying has reached a point where it can be undertaken on a large scale. He said a point slightly north of Dan ville. Va., was under consideration, and that he had pledged the interest of his community in any such scheme, even proffering 190 acres for the land ing place. Danville.The campaign for mem bers will be cohtinued hy the Virginia Tobacco Growers Association through out the month of January. This an nouncement was made here by W. R. Ogg. secretary treasurer of the organ ization, who is directing the campaign. The campaign was scheduled to be completed by January 1, but owing.to a number of circumstances this was found to be inadvisable. Many coun ties were unabfe to got their county organizations perfected and, organizers put in the field until the middle of December. The combining of the three Virginia tobacco growers organiza tions was also a large factor in chang ing the plans for the membership j campaign. The condition of the roads has also hindered organization work in many communities. Fredericksburg.At a meeting of citizens of Spottsylvania county the organization of a Spottsylvania Coun ty Good Roads Association was effect ed by the election of Captain M. B. Rowe as chairman, and T. E. Thomas as secretary and treasurer. Sub-chair men will be named for the different districts-in the county and an inten sive drive will be put on for member ship in the Virginia Good Roads Asso ciation to develop sentiment for better highways and make possible good roads educational work in every sec tion of the State. Petersburg.A large frame build ing at Gamp Lee, formerly the colored .hostess house, now used by Captains J. E. Allison and W. A. Rawls, of the Forty-third Inflaaitry, and their fam ilies as quarter was destroyed by fire, causing a loss t about 13,000. Origin of thè fire is ndt known, but the build- ng was a compiete loss. None of tho houaold effect were saved, the fam ilies barriy esdaping without injury with no clothes,tther than those they wore."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "who served as a <mark>sergeant</mark> in the casualty department"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "who served as a <mark>sergeant</mark> in the casualty department"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [703.2, 182.98, 865.54, 513.61], "bbox_id": "e0a7963ed8", "file": "AppomattoxNewspapers_1915-1918a_0035.pdf", "page": 1, "text": "P a m p lin . Mrs John Gilliam has been quite sick for several days. Mrs. Mary Beale is now teaching at Madison Heights Lynchburg Mr. W averly Foster, who has been for several years time keener on N. Sc W. left last week for A Jlene, where he ha received a j h Dr. E. E Walker accompani ed Mr. Brookie Elam to Lynchburg on la t Friday for he purpose of an operation Mrs. Garrett who has been under treatment in Lynchburg several weeks returned on Fri dav much improve! in health Mr. Scott Rioe who has been at work at Hopewell for some time u in town for a few davs Mrs Mollie Franklin left for Richmond, for m edical treat ment on last Friday. I Sergeant Franklins mother was visiting here last week. Sergeant Fronklin arrested"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "some time u in <mark>town</mark> for a few davs"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "some time u in <mark>town</mark> for a few davs"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [145.44, 577.49, 314.02, 1734.13], "bbox_id": "bad4fc9b08", "file": "AppomattoxNewspapers_1905-1912a_0187.pdf", "page": 1, "text": "P A 1U 1 V 1 L L K . Even the arrival of the priaiingf give new life thrill to Furnivillt businesb ciices. They are the couriers that tell of the advancing army of lag?, shorts and long and these are our best money friends. Capitalists, clerks, warehouse men, merchants and laborers all interest ed and to shar in the profits. The farmer says be alone fails to make the profit, but he does make it on eggs, chickens, butter, old bams and things men feed on. If I wi s a larnier and didn t make money growing tobacco I would never grow anothe plant. It means the hard est work known to the farmers and where tn re is no money n it i should fall into innocuous desuc tude. Picnics crowd upon each cthar it quick succession, but veteran D. W. Gills, of Crewe, who attended tbt one given by the daughters of Ap pomattox to the veterans of that county, pronounces it the gem of the season, the bright particular Star of the copstelation. And he knows a good picnic when he sees it. Mr. Mace Gilliam, who went iron- this county to take service under the Government in work on the canal, is on a visit to his friends of the county, and in a recent conver sation with him he gave me many interesting facts of the work and the country. He says the work ii three-quarters finished, will be ready on time, forty-six thousand men engaged, ten thousand being Americans, the climate fine, cooler than here, no mosquitoes and th health record better than that of Virginia. This was all new to me, but Mr. Gilliam is a perfect picture of health and has been on the penin sula for four years. He has seen only three mosquitoes during the summer when I have heard the buzz of one in barmvillo. They enjoy the breezes of the ocean, and claims that the digging of the canal hm brougt about the good sanitary con ditions. Wages fine and eight houis constituting a days work. He at least is pleased with the job and 1 enjoyed his enthusiasm. However I am not disposed to apply for a place on the pay-roll. It looks as though we would have some sweeping changes in our town government. Many of the tax payers are demanding the consolida tion of treasurer and sergeant in one, and as soon as tho legislature meets to get permiHsi n to adopt the commission plan. The men at the head of the movement are leaders in business and will lead in this. The macadam has reached Wil- bornes bridge and Buckingham can oome a sailing into town even in mid-winter after reaching Princa Edward soil. A private residence which stands near the Normal was recently pur chased by the school and is now be ing made ready for the aecomoda tion of the training school. Hon. W. C. Franklin, of Iam- plins, was in town tho other day and went for your correspondent for mixing Paul and Pope. Uuther queer mixture I confess, and yet 1 have been wondtring when  Court ney formed the acquaintance of Paul. All the dogs of Farmville are either dead or mnzled. We got to bo very carelul when the scare is on. Presiding Elder, Dadman,preach ed the last of anion service sermons before a laige and interesting audi ence that assembled in the Metho dist Church on last Sunday evening. 1 never enter that splendid build"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "sweeping changes in our <mark>town</mark> government. Many of the"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "sweeping changes in our <mark>town</mark> government. Many of the"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2341.84, 443.71, 2505.89, 551.51], "bbox_id": "15f52216d0", "file": "AppomattoxNewspapers_1918-1922a_0080.pdf", "page": 1, "text": "one-cylinder flivver down the streets of the old home town. Ought to put Lizzies name on the casualty list, called a iresh gob, who was witnessing the struggle.  Whatdaya. mean? hissed the sergeant between bucks.  Missing in action."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "of the old home <mark>town</mark>. Ought to put Lizzies"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "of the old home <mark>town</mark>. Ought to put Lizzies"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1547.73, 1310.3, 1692.74, 1393.3], "bbox_id": "3357e447c5", "file": "TimesVirginian_1981a_0418.pdf", "page": 1, "text": "of all . land owners in working with Mr. Sergeant in the next few months.. If you have questions or would like additional informa tion please contact W. R. Britton, Jr. Appomattox town manager."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "in working with Mr. <mark>Sergeant</mark> in the next few"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "in working with Mr. <mark>Sergeant</mark> in the next few"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [547.68, 515.81, 867.67, 883.2], "bbox_id": "1183a69e3c", "file": "AppomattoxNewspapers_1915-1918a_0035.pdf", "page": 1, "text": "now that another national fight a negro Joe Johnson last Sun- is about to open. day for being drunk and dis-  ....... --- orderly on the strt8. He was A Wonderful Antiseptic. arrained before Mayor Peter- Germs and infection gg-ava t son Monday morning, fined Stop  10 00 and cost. Mr. R. L. Franklin, left for Lynchburg Tuesday morning for a visit of several days Concrete work seems to bo very much in order in this town at the present time. Several days ago Mr WMie Branch of Madisonville,. was hld-up on the public high way by two negroes who after relieving him of all the cash on his person made their escape. Last Saturday Sergeant Frank lin was phoned to and asked to try to locate and arrest them which he did in the vicimtv of Sheahans camp Mr. H. F. Clark was deputized to assist in making these arrests While in custody one of these negroes brokp and made good his es cape. Notwith tanding the 10 15 bullets flying around end about him The other negro was lodged in the Farmvil t"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "in order in this <mark>town</mark> at the present time."}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "in order in this <mark>town</mark> at the present time."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1710.56, 699.13, 2211.22, 875.42], "bbox_id": "ba36901e40", "file": "AppomattoxNewspapers_1912-1915a_0543.pdf", "page": 1, "text": "Mr. James A Clark, of the Engi. neeiing Department of the Atlantic oast Realty Co., of Greenville, N. ., has been in town for the last few days, sub-dividing the John D, Abbitt farm, which his company will sellvat public auction in the near future. Full particulars will he announced later. A lovely and prettily ap I Mrs. E 8. Coleman, a milea south ol Ap. , , , pointed luncheon w as served! xbos.w. odor, 2 miles south of Appomat- Sergeant J. W. Woo ?land, of tbejimmflifttftly after the cere-1 to. Va State Convict R iad Force, left yes- mony. Those assisting the t0  a.CUment2 mllee outh  Awmat- ter day for Henry County, where g ra cioU8 hostess Were, her sis- j ! W. Scott, Old ourt House. Camp No. 33 will be established at I ter. Mrs. D. P. R ogers, of I tPersons desiring to give notice to tren-  _  __ __w   passers may do so under this head for so once He will have charge ot  A m elia 0 . H ., M rs. W m . Hun-onts. Sana name and post oruco, ana your"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "N. ., has been in <mark>town</mark> for the last few"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "N. ., has been in <mark>town</mark> for the last few"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1470.96, 1422.7, 1798.45, 1719.8], "bbox_id": "10225f944f", "file": "AppomattoxNewspapers_1926-1933a_0536.pdf", "page": 1, "text": "Miss Eula May Burke a n d Miss Hazel Reynolds are at tending the Red Closs short-1 Martin spent last Friday in the course being given at the Uni-1 home of B. C. Sims, of Lynch versity, Charlottesville this burg. Mrs. Annie Martin week. Odor accompanied them home for several days stay. Town Has One Delinquent Mrs. Odor is getting along nicely. A colored woman in New Mr- and Mrs. Carl Ewers of Jersey is the only town proper-1 Lynchburg and Mr. and Mrs ty holder owner who has not Dick Pankey of Pamplin spent paid last years taxes, J. W. last Sunday in the home of T. Cawthom, sergeant, states. Mr. H. Ford. Cawthom also said it would Mr. and Mrs. J. A. Martin cost more than the amount o-f Ispenf last Sunday afternoon the ticket to sell the property, in the home of A- S. Wool- o ------ -- dridge. Auxiliary To Meet  otis Simms is spending this  , , ... ..week with his aunt, Mrs. W. C. T h e Womans Auxiliary of Lee, at Wesley Chapel, the Pbytenan Church will meet next Wednesday  r - U have moved into their new noon at the home of the Misses H Emma and Lucy Smith s ------- o ---------- Mr- and Mrs. L. T. G dsey I Misses Mary Taylor and and Miss Delphie Godsey I Catherine Gills spent Tuesday"}, "highlight": {"text": {"matched_tokens": ["Town"], "snippet": "for several days stay. <mark>Town</mark> Has One Delinquent Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Town"], "snippet": "for several days stay. <mark>Town</mark> Has One Delinquent Mrs."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [847.64, 495.21, 1001.55, 1353.55], "bbox_id": "ad67a4ec70", "file": "AppomattoxNewspapers_1918-1922a_0314.pdf", "page": 1, "text": "Lynchburg.  The Lynchburg Motor Car Company has secured an amendment to Its charter to Increase Its capital from 25,000 to 50,000. Danville.  Decreases In prices ranging from 15 to 20 per cent were announced by local lumber firms. The new prices effect dreBsed lumber, flooring, celling and siding. No ex planation of the drop is given. Lynchburg.  The Third Com pany of the First Virginia Provisional Regiment, National Guard, will take about seventy men to the State en campment, which opens at Camp Lee, July 12. Lynchburg.  A bridge over Beaver Creek, near Six Mile Bridge, on the Concord Road, leading from Lynchburg, Is reported to be in an unsafe condition and traffic is warned against its use. Clifton Forge.  George W. Stevens, president of the Chesapeake and Ohio Railway, gave a birthday dinner at his home at Greenlee, enter taining officials from all over the road, numbering about 100. Miss Helen Stevens acted as hostess. Danville.  Lee Beard, charged with manslaughter In the Henry County Circuit Court, as result of the accident near Martinsville several weeks ago, in which Joel Dodson lost his life when a car driven by Beard turned turtle, was exonerated of that charge. Lynchburg.  John A. Merry- man, a traveling salesman here, who was Injured in a Norfolk and West ern wreck at Walton, December 13 last, has recovered 25,000 damages from the railway company in the Corporation Court here. The suit was instituted for 30,000. Bristol.  Following the announce ment coming from Apalachla, Va., that a modern Moose home Is to be erected at the cost of about 40,000, an announsement Is now made that plans are being made for the erection of aVnodern new structure to be oc cupied by the Peoples National Bank here. It is understood that the build ing will cost about 30,000. Danville.J. F. Davis, formerly first sergeant In Company C, One Hun dred and Sixteenth Infantry, has re turned to Danville with his French wife after extended service overseas. Since the armistice Davis has been attached to the ordnance department and quartered at Coblenz. In the oc cupied area. He Is the only Danville soldier who won a French bride while he was In service abroad. Danville.  A novelty In build ing Is evidenced here. The new store house for Eflrd Brothers now being constructed was threatened with in definite delay through inability to get steel trusses shipped here. The con tractor Instead of waiting for the girder needed for the second floor is now putting on the roof, in other words, working from the top, down wards. Lynqftburg.  State head quar ters of the Virginia Farmers Educa tional and Co-operative Union has issued charters for locals at Maurer- town, Shenandoah county and Grose- close, Smyth County. The Maurer- town officers are S. J. Strlckler, president D. S. Rhodes, vlce-ipresl- dent. and Roy Hickman, secretary. At Groseclose the officers are J. C. Yonts, president J. M. Price, vice- president, and W. V. Stinson, secre tary."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "F. Davis, formerly first <mark>sergeant</mark> In Company C, One"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "F. Davis, formerly first <mark>sergeant</mark> In Company C, One"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1941.32, 323.33, 2102.22, 632.38], "bbox_id": "faa16ced4a", "file": "AppomattoxNewspapers_1915-1918a_0025.pdf", "page": 1, "text": "lin w as elected ohairm an of the citizens m eeting, an d h ap pointed a com m ittee of five H. T. Terry, O. E. Peterson, W. B Ford, R. R. D avis. Mr. L. W . Hoffman w as a business v isitor in Richm ond last weak. Mr. Robert T hornton, a fire m an for th e N.  W. R. R ., is visiting his fath e r, Mr. L. W T hornton, here. Sergeant F ra n k lin endeavors to keep good order in this town, and h as been very successful since he h as been w ith us. W e notioe in passing th a t Mr. L. W. T hornton has deco rated his w indow s like C h rist m as tim es. Mr Bill F ran k lin , who has been sick for a few days, is out again. The little baby of Mr. and irs . H u g h C headle, w hich h as eeri fliris mifchWdlV."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "W T hornton, here. <mark>Sergeant</mark> F ra n k"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "W T hornton, here. <mark>Sergeant</mark> F ra n k"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [357.61, 1071.98, 516.79, 1794.43], "bbox_id": "59663072f1", "file": "AppomattoxNewspapers_1892-1898a_0301.pdf", "page": 1, "text": "From the Pres, New York City. Morris Preslaner, of No. 1 Pitt Street, New York, who Is a real estate ngont and collector of rents, caught a severe o4M early lust spring, which settled upon his kidneys. 8oon he began to suffer severe pala In hisbxckbone, sides an l chest. HIS symptoms grew rap idly more alarming, until At last ho was as helpless as nchild and could scarcely move as he lay on bis bed. As Mr. Preslaner Is Well known In tho part of tho town where ha resldos, he had many sympathizers, who did all they eoul I to help him. Though n nailv of Berlin, Mr. Preslaner has lived In this country for forty years, hav ing served the country of his adoption by three years hard service In the civil war. He enlisted with the Nineteenth Illinois In fantry, taking part in d id  buttles and marohlng with General Sherman to the sea. While in Oeorgla, Mr. Preslnuor was pro moted to first Sergeant for bravery on tho fl-ld of notion. H ots now a member of Eoitra Post, fl. A. R., an I Is one of tho m03t popular men in the Post. Mr. Preslaner told a reporter the story of his dreadful Illness and wondeyful recovery. The reporter met him as he whs returning from a long walk, an l, saying that he had h nrd of his wonderiil cure, asked him to tell tho story. When Mr. Preslauor wns com fortably sealed in his pleasant parlor, he told the following story, which, he said, he hoped evoryono who was suffering as ho hud suffer!, would rend. Ills words were as follows To begin with, 1 was taken slek just n year and a mouth ago, having taken a severe cold whiuh sett I d on mv kidneys. At first I thought the pain I suffered won Id soon pass away, but, instead ot doing this, It grow more intense every dnv, so that In a week I could walk only with considerable difficulty.  I colled In a doctor, who said I had loco motor ataxia and began treating me for that disease. He did me no good, and all sum mer long I could scnrooly attend lo my busi ness at all. Thou I called another doctor and took his medicine for several weeks, btit ex perienced no relief. Dr. Truman Nichols, of No. 237 East Broadway, who I at Inst oallel In, helped mo more than anv of the other dootors, but along towards foil I grew worso, despite his treatment. I think Dr. Nichole Is a good doctor nnd understood my case, but deepito this fact his medicines did me no lasting good. Early In November the little strength I ha l In rny logs left me and I was unablo to stand. The pain in my back and sides be came almost unbearable and my limbs grew cold. An eeotrlo battery I bought failed to help, nnd for weeks I felt mysolf gradually growing weaker until all hope left mo. Sometime before this I had read of a won derful cur  a man had received from Dr. Williams Pink Pills for Pale People, bat was so prejudiced against what I thought was a patent medicine ot the usual worthless char acter hut I could not make up my mind to try them. As my pains increased and death seemed ooming near, I thought Ot what I ha I read and ot the symptoms of the man who had been cured. They were precisely the same as mine, and at last, with my wifes earnest entreaty, I consented to try Pink Pills. I am now convinced that those pills saved my.life. Gradually my strength be gun to return, the desire to live grow strong er. After having taken three boxes 1 left my bod. This was early in March. All pain had left me, and that terrible dead feeling In my legs had gone away. I was still very week, but before I bad tiiken tire fourth box I was able to got down stairs for a short walk in the open air. Now I feel as if I hail beon born again and ngi ns happy as a child. Every pleasant day I take a walk, and am sure that iu a month I will be os well ns ever. All diseiisoe, such as locomotor ataxia, St. Vitus dance, partial paralysis, sciatica, rheumatism, neuralgia, nervous headache, palpitation of the lieart, effects of la grippe, pale and sallow complexions, and all forms of weakness, cither in mun or woman, dlsip- pear when Dr. Williams Pink Pills for Pale People arc taken. Pink Pills oan be bought of any deaor, or will be sent post paid on receipt ot price, 60 cents a box or six boxes or 92.60, by addressing Dr. WlUhimp Medi cine Qo Schenectady. N. Y."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "tho part of tho <mark>town</mark> where ha resldos, he"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "tho part of tho <mark>town</mark> where ha resldos, he"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1976.68, 729.57, 2160.19, 1555.86], "bbox_id": "28293f337d", "file": "AppomattoxNewspapers_1915-1918a_0579.pdf", "page": 1, "text": "From Sergeant Aubrey Dick erson to home folks Somewhere in France. Aug. 16. My Dear Mother and All I will write you a few lines Hope you are o. k. Wylie and myself are in the same oompa ny. Have been lucky, 1 thiuk, to stay together all this loan time. Mother, you talk about pretty girls, France has them flirted with one this evening so much like my little Annie that I couldnt keep from having a tender feeling for her so when the war is over I may have the luok to bring one of these little brown-eyed girts back with me. Obi ma, I am some distance from home now I am in south ern France, Iforget the name of the town, but it is Vsome where in France. How is papa getting on farming? Tell Lewis to stick to the farm with dad, that I dont think he will lose anything by it. Well, the boys are giving the Germans a round now they captured 17,000 one day last week havent heard any thing from the lines this week, but know they are gaining. Well, ma, Wylie and myself are in the machine gun compa ny now getting to be some thing for you and dad to be proud of and am so glad that I can do something for my couu  try but mornings when I have! to get up and cant hear any mother humming in the Kitchen it makes me feel sad, but as soon as I get busy that feeling wears off, so when I return you not be proud to know your boy did his part, wont you? But here, mother, is one thing I waut to tell you remember, if I am slain over here that I am going to look for you in heaven, for I will be there I feel prepar ed to go. Tell Lewis and Hut- sou and the girls that if they never see me any more on earth that if thoy will serve the Lord they will meet me up there I want our family to be unbroken around the throne of God. Re-! member, mother, I am a chang ed boy and am now a Christian as you are. I will close for this time. Hoping to hear from you soon, 1 am, as ever, Your true sou, S amvel A ubrey D ickerson , 8gt. 18th Prov. Co., July Auto Draft, Inf. Reg. A. E. F."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "From <mark>Sergeant</mark> Aubrey Dick erson to"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "From <mark>Sergeant</mark> Aubrey Dick erson to"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [122.88, 596.27, 307.15, 1748.22], "bbox_id": "880ab2c8ca", "file": "AppomattoxNewspapers_1905-1912a_0199.pdf", "page": 1, "text": "F A R M V IL L E .  The authorities of our fair are ar ranging to have a home coming day on the firt day of the coming fair, and earnest ffort will be made to have the absent ot.e gather iu full force. It should be made a red- letter day in the history of the own and the surrounding section, lh e welcoming a drear will no d jubtbe made y one with heart in sympathy with the occas on and with tongue of genuine eloquence. I am not a yet advised as to who that will be, nor hav 1 1 one in mind. But Vir ginia is not poor in such and the proper one will be found and be ready for the opening hour. The new of the Paisley down fall was a great shock to Fa-mville and caused genuine sorrow.  Let him who is without sin first cast stone. and let ns not forget f he loving words of a loving Savionr, who simply said to the sinning wo- ma .,  Go in peace and sin no more. The greatest of these it charity. We have been having too mnch raiu of late, but the man who com plains of the season of 1910 is an iugrate. Never did onr fields bring forth more abundantly, and never was onr health record better. At the fir t session of our new town council a petition, numerously signed by the voter and tax-payers of the own, was presented, asking that the question of the sorgeantcy be settled by a primary, but the council in reply said they had no thing to do with a primary and pro ceeded to fill the office made vacant by the retirement of Sergeant Mil ler, by electing Mr. F. W. Hubbard, the vote being 8 to 1. This would indicate that a primary would not have altered the resnP, for if the council ie composed of representa tive men, Mr. Hubbard must be the choice of the people. He is a young man who has won u fine reputation in the usinesB circles of FarmviKs and will no doubt discharge the du ties incident to the position honest ly and well. He was cashier of the tizens State Bank, and when that Bank was merged into the First National, he was made second as sistant cashier. Mr. H. E. Barrow was re-elected president of the body and all the old officers retained. It is said that Mr. W. G. Dunn ing ton has given up the Austrian order which ha has held for so many ears and as a consequence some parties who held positions under him are without work. I have never heard Mr. Dunnington men tion the subject and know nothing of the details. He still holds to the Italian order, as I am told, and this means that he will remain on the market for large quantities of the weed. I have sometimes wondered why he did not give up all active business, retire to his palatial coun try home and spend the evening of life in  otium cam diguiUte. And yet the thrill of trade circles may 4 be that which givfts charm to life. Editor Hart, of the Herald, is very mnch afraid of a thundei storm, and during a recent vi lent on, says that bat for the timely ar rival of his physician with the pro per remady on hand he would have snffered a fearful collapse. I am notoertain as to the component parts of the mixture, but believe I can gaess with some degree of ac curacy. I have heard none of our voters discuss the amendments which are to be voted on at the coming elec- t on, and can not speak for them. Oar treasurer and com mission r"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "session of our new <mark>town</mark> council a petition, numerously"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "session of our new <mark>town</mark> council a petition, numerously"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1158.01, 151.99, 1297.42, 472.28], "bbox_id": "b555f329de", "file": "AppomattoxNewspapers_1974-1975a_0438.pdf", "page": 1, "text": "eight miles par ham upon streets at the time that they are crowded er congested with traffic. Rules and Regulations for Protection at Pubtie Health adopted by the Town Board of Health-Oct 10,1925 SECTION 85. Hog-pea. sta bles, etc. - No person shall keep any bog-pen, stable, or other outhouse for animals, at such place, or in such manner, as to be a nuisance, or source of ill-health to the town, or adjoining tenant, under a penalty of not less than one nor more than twenty-five dollars, and each day the same hu continue shall constitute a separate offense, and the sergeant shall upon the order of the mayor, abate the same at the owners expense and all hog-pens shall be constructed with a floor at least 10 inches from the ground unless such floor be of concrete, and shall be provided with adequate drain."}, "highlight": {"text": {"matched_tokens": ["Town"], "snippet": "Health adopted by the <mark>Town</mark> Board of Health-Oct 10,1925"}}, "highlights": [{"field": "text", "matched_tokens": ["Town"], "snippet": "Health adopted by the <mark>Town</mark> Board of Health-Oct 10,1925"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1566.23, 609.16, 1645.28, 709.16], "bbox_id": "4b436f7898", "file": "AppomattoxNewspapers_1939-1943a_0130.pdf", "page": 1, "text": "e town office a owled around a took us to an -e room and we borne-spun chew ed on a line! It was tne  private wn sergeant 3 . ugh-. 20 pounds Jim Bob Ford, t many months"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "e <mark>town</mark> office a owled around"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "e <mark>town</mark> office a owled around"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [532.87, 1137.15, 694.57, 1273.4], "bbox_id": "aaa49b6d9a", "file": "AppomattoxNewspapers_1922-1923a_0441.pdf", "page": 1, "text": "Department Anxious To Remove Slur Cast Upon Soldiers. Washington Special.The War Department is determined to pursue to the end of its legal resources  the effort to remove the slur cast upon the uniforms of the American sol dier by the decision last January of a local magistrate at Plattsburg, N. Y., that Sergeant Higgins and the soldiers who accompanied to a public skating rink in that town had no case warranting the lmpo sltion of a penalty upon the proprie tors of the place"}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "Plattsburg, N. Y., that <mark>Sergeant</mark> Higgins and the soldiers"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "Plattsburg, N. Y., that <mark>Sergeant</mark> Higgins and the soldiers"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [863.76, 182.76, 1008.22, 1045.52], "bbox_id": "1ec87e5228", "file": "AppomattoxNewspapers_1974-1975a_0438.pdf", "page": 1, "text": "by A. M The General Ordinances of The Town of Appomattox were adopted and approved on Oct j 10.1925. Reading the ordinanc es gives one some ideas of the concerns of the town at this j period of time. Of course, there are the usual ordinances pertaining to duties of official, levying of taxes, etc. The following selection is intended for the readers amusement. CODE OF THE TOWN OF APPOMATTOX, VA. 1925 Title 3 Streets, Alley and Sidewalks SECTION 3. Shade tree, injury to. - - No person shall tie a horse to a shade tree, or permit his horse to bite, or in any way injure, a shade tree, or himself in any way cut, break, or injure, a shade tree on the sidewalks, or streets, of the town, under penalty of not less than one dollar nor more than ten dollars for each offense. SECTION 12. Fast riding - Driving, or riding a horse through the streets of the town at a rate of speed exceeding eight miles per hour shall be punished by a fine of not less than one dollar nor more than twenty-five dollars. SECTION 17. Gravel shoot ers. No person shall use any instrument for projecting mis siles liable to do any injury to persons, or property, such as a grit shooter, bow and arrow, etc., on or across sidewalks, streets or alleys, under a penalty of not less than one dollar nor more than five dollars for each offense. SECITON 23. Chain gang. Any person who shall fail to pay any fine imposed upon him by the Mayor, shall be put to work in the streets, and a ball and chain may be put on all such persons, when deemed neces sary by the Sergeant. Sections 28. To prohibit the sale and delivery of ice and coal without weighing same to regulate transportoton thereof on the streets of said town and to provide penalties for the violation thereof. All ice which shall be sold by dealers within the town of Appomattox to be delviered by said dealer, or his ice wagon, or otherwise in less than standard block, shall be sold by weight of sixteen ounces to a pound. All ice transported through the streets of the town of Appomattox for sale within said town, shall ha Bold by weight of sixteen ounces to a pound. Each and every ice wagon, cart, or other vehicle, trans porting ice for sale within the town of Appomattox, through the streets of said town, shall keep a standard pair of scales on said wagon, or other vehicle,"}, "highlight": {"text": {"matched_tokens": ["Town"], "snippet": "General Ordinances of The <mark>Town</mark> of Appomattox were adopted"}}, "highlights": [{"field": "text", "matched_tokens": ["Town"], "snippet": "General Ordinances of The <mark>Town</mark> of Appomattox were adopted"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2030.66, 1199.93, 2196.67, 1409.12], "bbox_id": "38e83d491e", "file": "AppomattoxNewspapers_1943-1947a_0136.pdf", "page": 1, "text": "Bullet Helps Yank Find Spot on Map ot Leyte WITH THE 24TH DIVISION, LEYTE.A Japanese sniper solved a problem in geography for Sgt. Er nest Martin of Terre Haute, Ind., assigned to the map section of this division. Sergeant Martin was seated be fore a large map tacked to an up right board propped against a palm tree, trying to locate the Leyte val ley town of Alangalang on the map. Suddenly there was the report of a snipers gun and the zing of a bul let. It struck the map board and knocked it down. Martin hit the dirt while a patrol hunted down the sniper. Then he examined the map. The bullet had gone through the town of Alangalang."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "section of this division. <mark>Sergeant</mark> Martin was seated be"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "section of this division. <mark>Sergeant</mark> Martin was seated be"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [152.17, 686.91, 320.02, 923.46], "bbox_id": "385a5fac7d", "file": "AppomattoxNewspapers_1912-1915a_0299.pdf", "page": 1, "text": "Bondurant and I dont know any one who will be more miased. Mr. K.  Davidson will build a! handsome home on bis forty acres I recently bought near town. The death o i Captain j . H. I Knight removes another veteran I from the ranks. He entered the I Confederate service as sergeant ini Co. I, 3rd Virginia oavalry and was I its commanding officer at the close of the war. He died in the home ot his son-in-law, Mr. W. G. Dunning- ton, where i d spent the evening ot life with every comfort money could buy. 1 can recall hot seven survi vors of that company of some sixty men, three of whom stood at the of their outtradeJ. F. Edmonds and the"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "I recently bought near <mark>town</mark>. The death o i"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "I recently bought near <mark>town</mark>. The death o i"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [651.85, 490.72, 816.52, 1369.27], "bbox_id": "f28c1d4682", "file": "AppomattoxNewspapers_1922-1923a_0406.pdf", "page": 1, "text": "barter for a road from the head of Cordova Bay to a point on the Yukon River near Eakle, Alaska. The road will enter the Alaskan cop per field.  Chairman Payne, of the House M ays and Means Committee, after a vsit to the President, expressed the opinion that there was no chance at this session of Congress for the enactment of legislation increasing the compensation of government em ployes. In his maiden speech in the Sen ate, Mr. Frazier, of Tennessee, used the San Francisco school question in part to emphasize his opposition to the encroachment of the federal government upon the rights of the States. The average citizen of the United States consumed one-half his own weight in sugar in the past year, according to figures compiled by the Bureau of Statistics of the Depart ment of Commerce and Labor. The Senate passed the Indian Ap propriation Bill, after striking out the provisions giving the Court of Claims final Jurisdiction in the claim of the Confederated Band of Ute Indians of Colorado. The Naval Appropriation Bill, carrying 95,426,000, was taken up in the House, and, under the order of general debates, speeches were made by Mr. Lamar, of Florida, on the Railroad Rate Bill. Over 600 private pension hills were considered in the House, it be ing pension day. With only a few exceptions the bills were passed. The House passed the bill amend ing the act relating the withdrawal from bond tax free of domestic al cohol when rendered unfit for bever age or liquid medicinal uses by mix ture wiht suitable denaturing ma terials. Chief Engineer Stevens, of the. Panama Canal, has announced that he will resign if the construction of the canal is awarded to a contractor. A change in the methods of the Dead Letter Office has resulted in the return of a larger percentage of unclaimed letters. An extra session of the Senate is believed to be necessary to secure the ratification of the Santo Do mingo Treaty. Senator Mallory presented from the Senate Committee on Patents a minority report on the Copyright Bill. In the Senate a number of amend ments reported to the Indian Appro priation Bill were rejected. The President has signed the Gen eral Service Pension Bill, recently passed by Congress. There is danger of another clash among the Central American re publics. Mr. Clay tried to get considera tion in the Senate of a resolution calling upon the Secretary of War for a complete statement of the gov ernments military expenses in the Philippines, including the cost of railway transportation. The reso lution went over. Jacob Frazier, of Knoxville, Tenn., formerly first sergeant of Company D, Twenty-fifth Infantry, a witness before the Senate Military Com mittee in the Brownsville inquiry, said the shooting was done by citi zens of Brownsville. President Roosevelt has. received a letter from the Los Angeles Cham ber of Commerce setting forth the views of the citizens of the town re- parding the Japanese school ques tion. Complaints of discrimination against transcontinental lines were made by three of the leading cot ton manufacturers of the South to the Interstate Commerce Commis sion. The Senate passed a House hill appropriating 650,000 for four steam revenue cutter vessels after amending it to appropriate  35,000 for a similar vessel for Galveston."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "Knoxville, Tenn., formerly first <mark>sergeant</mark> of Company D, Twenty-fifth"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "Knoxville, Tenn., formerly first <mark>sergeant</mark> of Company D, Twenty-fifth"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [103.7, 818.22, 287.78, 1796.88], "bbox_id": "74bd0e49c5", "file": "AppomattoxNewspapers_1912-1915a_0026.pdf", "page": 1, "text": "and will no doubt contipne to do well in th- larger work field. It  came a . a enrpriao, however that he Should be induced to leave the pluce of his birth and where he has spent his ife so far. Bnral mail carriers are all smile - with the increase of pay Still they are not as well paid aa are the city brothers who have no horse and ve- f hide to furnish to prose ute their  work. What an improvement on the old at r route sham?. Men i have starved on those routes, or at I least suffered grevionsly. while serv icing faithfully the riches nation on I earth. Some of them may be still I suffering and should get ready re-  m . While Mr. R. B. Johns was motoring between this point and f Appomattox reoently, with Mr. and  Mrs. Engeoe Gill and Mrs. Vernon I Venable riding in the oar, he ran over a little negro boy and thought - fo r th e m o m en t th a t d e a th h a d fol lowed He was n o t Berionsly h u rt, however, and the wonder is that he soaped with hie life. The machine - was moving at about a twelve mile rate and the boy being small of body it passed over him leaving only alight bruises and no broken bones. When the machine drove in rightof the wogon in which the boy with others was riding, he suddenly jumped from the wagon and under took to erois the road immediately in front o. the oar. It was s,mpy impossible to stop the oar in time to avert the accident. Mr. Johns is a car. ful handler of the machine and this is his first mishap after thons- I ands of miles traveled. The patrons of tbe Farmville post- office have made no kick on Sundav delivery oi mails. At its first session the new town council elected 8 . W. Paulett, Jr.,  treas rer F. W. Hubbard, cleik Leslie Fogus sergean . Mr. J. E. Garland, wh has been clerk for many years, declined to be a candi date again. He could have had th honor for tho asking. Tne tree-  sures will bo paid  1,200 annually, sergeant and uiork  1,000 each. Mayor Barrow will reoeive 400, Judge Wakins, attorney, 125, and Dr.  inston, secretary Board ot Sm Health, 150. Under the new char ter there will be no street commis sioner, this work to be done under  the direction of the street com mi t- C tea The electrician is yet to le g named. W. M. Davidson, an expert accountant, examined the books of sergeant and treasurer and found them coriecL Hampden Sidney opens its 138th .ion with abont the nenal attend ance. The boys will at once get i busy with foot baU. T he sound i j first and then the soand mind. Athletes to the fore in this age of activities. And Heaven i to earth, of the material kind, i richer b on than good health. a High School opened on the fa the old building, the ne Hfl ready for use. The teaeb- ________  is I i t hi its history. The"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "first session the new <mark>town</mark> council elected 8 . W."}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "first session the new <mark>town</mark> council elected 8 . W."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [834.24, 458.43, 1001.14, 1517.12], "bbox_id": "e4753ae821", "file": "AppomattoxNewspapers_1902-1905a_0326.pdf", "page": 1, "text": "and Western Railroad met in Roanoke and authorized the issue of  J 5 ,ooo,ooc forty-year gold bonds. tig h t pel cent, of the stock vas represented bj Henry Fink, tlie president. The bond are to be designated as divisional firsi lien and general mortgage and the rate of which is not to exceed 4 l,eI cent. The Guaranty Trust Company of New York was named as trustee. President Stevens, of the Chesa peake and Ohio Railroad Company officially informed a member of the Newport News Chamber of Com  merce in Richmond that in two .weeks one of the Chesapeake and Ohio Ele vator Companys big grain elevator would be placed in operation and the exporting of grain through that porl resumed. After an exceedingly dul. period the big elevator  A  closet down on May 15 . and since that time no grain has been handled at Newport News. Now. it is said, as the farmer are putting out the product, the rail way has secured considerable busines and the port is again to have at leas a part of the trade it had for 15 year until the recent slump. Elevator  B 1 j the smaller of the two, will probably he put in operation. Patents have been granted to Johi S . Briggs, of Richmond, for a trolley wheel llarry J . Bishop, of Richmond for a steam range, and Lucius E Johnson, of Roanoke, for a railway scoop car. . , A t the town election at Coloma Beach B. L. Cooke was elected -May or. George W . Stant, J. VV. Miller M cK . Jackson and Frank Walcoti were chosen Councilmen. Mr. Cook was formerly of Howard county, Md The loss to the Virginia Vvooier M ills by fire, was much greater thar was at first supposed. The plant room and the slock room, is a tota loss. A t the height of the fire Fow ler L . Thurston, superintendent of th knitting department, died from excite ment. A number of firemen were bad lv injured by falling glass and flying debris. The steampipes in the mair building blew up, causing the walls to collapse and scattering debris ir in all directions. In the stampede which followed a number of womer were badly injured by running into a barb-wire fence. H alf a score oi women fainted. Fire at Norton, W ise county, de stroyed the whole business section ol the town, causing a loss of about  150 , 000 , partly insured. Tw o mer were seriously injured.. Norton has a population of 1,500 and is at the junction of the Louisville and Nash ville and Norfolk and Western rail roads. The town has no fire company and very little water. The Roanoke city election resulted in the election of Joseph H . Cutchir for Mayor over P. C. Leary, Republi can, by 450 majority. There were only 1,660 votes cast out of 2,400 voters A t the election two years ago Cutchir was elected  by 898 majority.  The Democrats elected 12 Aldermen and 15 Councilmen, against 2 Aldermer and 7 Councilmen by the Republicans Elfie Payne, a 13 -year-old negro girl, was run down and killed by ar excursion train. The girl went or Tinker creek bridge, a mile east o! Roanoke, to save a pet dog and th train struck them, killing both thf girl and the dog instantly. Burglars invaded the home o Charles T . Jenkins, near Carsville, an secured 80 in money and a gold watcl belonging to M rs. Jenkins, no inmatf was aroused. T he sum of 104,780 marks aboul  25 , 000  was paid out to the sailors of the German squadron now at New port News for repairs, and the mer are leaving a good deal of it with th local merchants. The Gazelle is ex pected to leave in a day or so for Germany. A t the municipal election held at Harrisonburg the republicans elected O . B. Roller mayor by 79 majority, D H . Lewis treasurer by 138 majority and T. H . Miller sergeant by 200 The democrats elected A . W . Lewii recorder and R. L . W oodson assessor and secured a majority of the coucil. The election for mayor at Edinburg Shenandoah count.v, resulted in a tit between J . W . Santmayers, republi can, and C. F. Fadeley, democrat They drew straws and Fadley was th winner. Rev. Richard M cllw aine resigned the presidency of Hampden-Sidney College, which he has held for many years. He was elected professor ol moral philosophy and Bible studies but has not indicated whether h will accept. Dr. M cllw aine was 3 prominent member of the conventior that framed the new state constitu tion. Edward W . W olcott was appointee receiver for the Norfolk Hotel Com pany, which owns the Atlantic Hotel, one of the largest in Norfolk. Thf liabilities of the company are  14 ,- 000 , with  10,000 assets. The hote will.be operated by the receiver. Sev eral out-of-town creditors pushed th hotel company, which sought relie 1 in court."}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "car. . , A t the <mark>town</mark> election at Coloma Beach"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "car. . , A t the <mark>town</mark> election at Coloma Beach"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2163.87, 814.36, 2329.32, 920.61], "bbox_id": "1695771832", "file": "AppomattoxNewspapers_1912-1915a_0372.pdf", "page": 1, "text": "Allen I. Hartess was elected Mayor ot Christlansfiurg, receiving 98 votes as against 78 tor E. S. Hagan, the in cumbent. John S. Lawrence, A. Man- nobi, J. W. Pepper, George W. Wal ters and M. C. Miller were elected councilman, and B. L. Haymaker was re-elected sergeant. It w u a hotly contested election, and the largest vote was polled In the history of the town, the total vote being 180."}, "highlight": {"text": {"matched_tokens": ["sergeant"], "snippet": "L. Haymaker was re-elected <mark>sergeant</mark>. It w u a"}}, "highlights": [{"field": "text", "matched_tokens": ["sergeant"], "snippet": "L. Haymaker was re-elected <mark>sergeant</mark>. It w u a"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1851.59, 235.46, 2019.15, 1777.76], "bbox_id": "4544d087d0", "file": "AppomattoxNewspapers_1922-1923a_0206.pdf", "page": 1, "text": "A 6,000 monument will be erected at Salem Church, in Spottsylvania County, at an early date to the memory of the Twenty-third New Jersey Regiment, of which Gen. E. Byrd Grubb was the colo nel during the Civil War. The appro priation for the monument has been made by the State Legislature of New Jersey and the ground on which it will be erected was purchased and donated by Colonel Grubb. Mr. John T. Dale, of Chicago, owner of the Southern Foundry and Machine Works, of Fredericksburg was in that city with a prominent manufacturer of Chicago with a view of inducing him to move his plant, which is the Garland Villa Gas and Machine Company, from that city to Fredericksburg, utilizing the building and grounds of the Southern Foundry for the site. Lester Ruffner, who has been on trial in the Circuit Court of Page County, was given a one-year sentence in the peniten tiary for the attempted murder of his ousin, David Ruffner, about four months ago, at which time the prisoner shot and killed his uncle, Isaac P. Ruffner. For the murder of his uncle Ruffner was given two years in the States prison. The Electoral Board of Richmond, composed of Messrs. F. C. Ebel, W. T. Hancock and Samuel Cohen, through its president, Mr. Ebel, handed its resig nation to the Clerk of the Hustings Court. Nothing can be learned of the reasons actuating the board until the letter is read by Judge Witt, who is out of the city on a fishing trip. It is thought that it is prompted by the allegations made during the grand jury investiga tion of the municipal primary. It is rumored that the members of the board would have resigned some months ago, but were restrained by the advice of friends to wait until the discussion had ceased. The Roanoke City Council and Board of Aldermen held special sessions and voted to offer 250 reward for the ar rest and conviction of the murderer of cx-City Sergeant J. B. Traynham. They also voted to allow the police Jorce 100 for contingencies to be used at the dis- cression of the Mayor. A letter was read from Governor Swanson to the ef fect that he would supplement any re ward offered by the city, and Osceola Lodge, Knights of Pythias, voted a re ward of 100. Much interest was aroused at the Cap itol by the circulation among members of the General Assembly of a pamphlet of 100 pages compiled by Judge George L. Christian to show that his son, W il liam B. Christian, Rowland P. Eubank and Julian M. Sailey were done a gross injustice by the faculty of the Virginia Polytechnic Institute in being denied matriculation because of their alleged connection with hazing. A bill had been introduced looking into intervention by the General Assembly on behalf of these young men. The pamphlet is a very interesting paper, and parts of it are spicy. Judge Christian characterizes l he course of the faculty is illegal, un just and improper. United States Sen ator John W, Daniel, in a long and strong letter in behalf of young Chris tian, says There is not a convict in the penitentiary today who did not have a fairer trial. There is not a citizen out of the penitentiary who would put him self, with respect to property, character or civil rights, in the hands of such an unfair procedure as was held at the in stitute. The Shenandoah River Light and Power Company, of Luray, has just pur chased the Luray Electric Companys property in this town for 10,000, the deal becoming operative July 1. Superintendent Driver, of Miller Park, Lynchburg, is arranging for the an nual distribution of potted plants to the children of the city, which will take place about May 1. He will distribute about 5,000 plants ready for resetting to the school children, among the number be ing 1,500 crimson rambler roses. Mr. William Wilson, for 36 years Li brarian of the Virginia Senate and a familiar figure about the Capitol for nearly a half century, is dead. He cele brated his seventy-third birthday last summer with a reunion of his children and grandchildren. Mr. Wilson wns a native of England, hut had lived here since young manhood. He served in the Naval Reserves during the Civil War. A widow, two sous and two daughters survive. An attempt was made by unknown parties to blow up Floyd Courthouse with dynamite. Hie Circuit Court is now sitting, and Judge W. W. Moffett is presiding for the first time. The charge was set off in the rear of the building within 40 feet of the county jail. A hole about three feet wide was blown out of the Courthouse just be hind the judges seat. Judge Moffett had just granted bail to Fred Hoback. who secured a new trial through the Supreme Court for the killing of John L. Jett, a hotel-keeper, over a year ago. Hoback was sentenced to eight years in the State penitentiary, but the verdict oi the lower court was set aside. Hoback was a rural letter carrier and was re turning from a trip when he and Jett met in front of the Courthouse and a difficulty ensued, in which Hoback was seriously cut screral times, after which he shot Jett, killing him instantly. Ho back will probably ask for a change of venue at the next trial, which is set for the April term of Court. Mr. F.. M. Daniel, son of Senator John V. Daniel, has resigned the presidency of the General Athletic Association of the University of Virginia and has been succeeded by Morgan P. Robinson. Os car D. Randolph was added to the ex ecutive board. William B. Auld, a Richmond sales man, was thrown from a buggy and pain fully hurt, among his injuries being a broken arm and the almost compete sev erance of one ear. H. P. Hanshaw, who has been work ing as a brakeman on the Norfolk and Western Railway, gave himself up to the Norfolk police, declaring that he was guilty of forging the name of his brother- in-law to a paper by which he obtained 63, and stating that he wanted to be sent back to his home in Tazewell, for trial. Henshaw said he was 26 years old. Tinker Ruffin, the negro charged with the shooting and wounding of Warren Brown at Hebron, Dinwiddie County, some years ago and robbing him of 600, and who was arrested at Phili- delphia recently and brought back to Dinwiddie County for trial, had a pre liminary hearing before Justice Briggs at Dinwiddie Courthouse. He was sent  5 n to the next term of the Circuit Court of the county for trial. Ruffin says he is innocent of the charge. Judge R. T. W. Duke has resigned as a member of the_ City Council, of Charlotteville, of which body he was president."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "the murderer of cx-City <mark>Sergeant</mark> J. B. Traynham. They"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "the murderer of cx-City <mark>Sergeant</mark> J. B. Traynham. They"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2272.79, 353.46, 2434.01, 772.49], "bbox_id": "1bbfcd2371", "file": "AppomattoxNewspapers_1926-1933a_0536.pdf", "page": 1, "text": "The townouhcil met in rjj- ulaPbsion lasfkLesday night witlu all members present ex cept Mayor W. L. Brown- C. S. McDearmon, chairman of the council, presided in the may ors absence. It was announced at the meeting that th e Appomat tox sign to be painted con- spicuously where it can be seen by planes passing over will be painted on the roof of the Appomattox Hardware Company. The town code in reference to the license tax on boarding housekeepers was amended to read that all persons taking a boarder or boarders shall pay a tax of five dollars. The legality of paying one half of the salary of the town attorney out of the road fund was brought up and referred to J. W. Flood. The question of parking at the intersection was placed in the hand of the street committee of which Mr- McDearmon is chairman, for consideration. The following accounts were approved Appoipattox Hardware Co., 19-60 Times irginian, 3.25 W. M. Han cock, 34.12 Telephone Co., 3.50 sergeants salary, 90 Virginia Public Service Co-, 88 J. A. Burke, insurance on ruck, 7.50,"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "Appomattox Hardware Company. The <mark>town</mark> code in reference to"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "Appomattox Hardware Company. The <mark>town</mark> code in reference to"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [2092.84, 313.93, 2253.73, 548.35], "bbox_id": "05ba9532a6", "file": "AppomattoxNewspapers_1915-1918a_0095.pdf", "page": 1, "text": "P a m p lta The Masons of th is tow n gave I a m eat supper a t th e Masonic Hall on M onday night. One am ong the features of interest were addresses by Bro. Masons o f F arm ville. Most of the town people attended as well as some out of tow n people Rev. Mr. Larabden, now lo jeated at thiB placfe, filled regu la r appointm ent a t the M E C hurch on Dundy m orning Good crow d attended services W e rag ret to le,arn of the  tow n Sergeants resignation Mr. F ran alin has filled this po sition creditably, hut who oan satisfy the w him 8ofevery oue? W e notice a good ha m y w a"}, "highlight": {"text": {"matched_tokens": ["town"], "snippet": "ville. Most of the <mark>town</mark> people attended as well"}}, "highlights": [{"field": "text", "matched_tokens": ["town"], "snippet": "ville. Most of the <mark>town</mark> people attended as well"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1687.89, 964.03, 1856.09, 1243.02], "bbox_id": "ee4ef8de3f", "file": "AppomattoxNewspapers_1954-1955a_0328.pdf", "page": 1, "text": "Dr. Carl A. Collins, Jr., was elect ed Commander of Appomattox Post 104, American Legion, at a meet ing held on Monday night. Other officers named were First Vice Commander, Paulette Second Vice Commander, Ferguson Adjutant, Berkley Guill Sergeant-at-Arms, H. B. Service Officer, Georg Wooldridge Historian, W. E. Layne. Chaplain to be elected. A picnic brunswick stew dinner will be served on the regular meet ing night in July, at which time the new officers will be installed. This meeting will be held July 25, at the American Legion Home. The local Legion is sponsoring a junior baseball team this year, and the games will be played on Wed nesday evenings at the Town Ball Park. It is hoped that the public will attend these games and help boost this project."}, "highlight": {"text": {"matched_tokens": ["Sergeant"], "snippet": "Ferguson Adjutant, Berkley Guill <mark>Sergeant</mark>-at-Arms, H. B. Service Officer,"}}, "highlights": [{"field": "text", "matched_tokens": ["Sergeant"], "snippet": "Ferguson Adjutant, Berkley Guill <mark>Sergeant</mark>-at-Arms, H. B. Service Officer,"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
