{"document": {"bbox": [2100.27, 1178.6, 2242.42, 1236.89], "bbox_id": "0eb67b97f0", "file": "AppomattoxNewspapers_1947-1949a_0334.pdf", "page": 1, "text": "Superintendent, D. L Smith. A sst Supt., R. M. Webb Secretary, Treasurer, R. s Franklin Asst. Sec.,-Treas Vernon Beasley."}, "highlight": {"text": {"matched_tokens": ["R", "Treasurer", "R", "s", "Franklin"], "snippet": "Superintendent, D. L Smith. A sst Supt., <mark>R</mark>. M. Webb Secretary, <mark>Treasurer</mark>, <mark>R</mark>. <mark>s</mark> <mark>Franklin</mark> Asst. Sec.,-Treas Vernon Beasley."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "Treasurer", "R", "s", "Franklin"], "snippet": "Superintendent, D. L Smith. A sst Supt., <mark>R</mark>. M. Webb Secretary, <mark>Treasurer</mark>, <mark>R</mark>. <mark>s</mark> <mark>Franklin</mark> Asst. Sec.,-Treas Vernon Beasley."}], "text_match": 2314894167592927353, "text_match_info": {"best_field_score": "4419510927360", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167592927353", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2235.12, 1534.45, 2393.61, 1597.65], "bbox_id": "b2950fb7c9", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "V IRGINIA In ten Circuit court of Appo mattox county. The County School Board of Appomattox oounty a g a in s t John R. Franklin, late Treasurer of Ai mattox county   . D. Thornton, J. F. 8on- nally and 8 . 11 , M. Robertson.  A - - .... - until  _ nally and 8. It. Franklin, bis surettes, and D."}, "highlight": {"text": {"matched_tokens": ["s", "R", "Franklin", "Treasurer"], "snippet": "a g a in <mark>s</mark> t John <mark>R</mark>. <mark>Franklin</mark>, late <mark>Treasurer</mark> of Ai mattox county"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "R", "Franklin", "Treasurer"], "snippet": "a g a in <mark>s</mark> t John <mark>R</mark>. <mark>Franklin</mark>, late <mark>Treasurer</mark> of Ai mattox county"}], "text_match": 2314894167190274169, "text_match_info": {"best_field_score": "4419510730752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2314894167190274169", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2241.33, 779.91, 2400.71, 888.96], "bbox_id": "f728ca18c6", "file": "AppomattoxNewspapers_1892-1898a_0059.pdf", "page": 1, "text": "v i r g i n i a   r in tee uirouit oouri oi Appo mattox oounty. _ y _  -SX m  The County School Board of Appomattox county . ACAINST . g  i-f -t- John B, Fraukiiii1_lato Treasurer ofAgpo- iiuiu, iare ifçaou.u dì _AEP I mattox county  w, D.- Thornton. J.F . Odn- ÌT iìei Me naiiy and S- R. Franklin, his sureties, and D. M, SobT  P ertson. EXTRACT FROM DECREE AT THE JUNE TERM TO Un consideration whereof the court doto adjudge, order and decree that this cause be referred to-cne of the commissioners of this court, wlthdireetlcns to take, state and set tle toe accounts of the defendant, J. R. Frank lin. as late Treasurer of Appomattox oounty"}, "highlight": {"text": {"matched_tokens": ["S", "R", "Franklin"], "snippet": "iìei Me naiiy and <mark>S</mark>- <mark>R</mark>. <mark>Franklin</mark>, his sureties, and D."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R", "Franklin"], "snippet": "iìei Me naiiy and <mark>S</mark>- <mark>R</mark>. <mark>Franklin</mark>, his sureties, and D."}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2401.46, 944.83, 2570.33, 1339.68], "bbox_id": "296280e4e1", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "sureties, and 1, MottRobertson. XTRAOT n o x naoBxx at tmx On consideration whereof the oonrt adjudge, order aim deeree that this  referred to one of the commissioners court with directions to take, state j the accounts of the defendant, H.C as late Treasurer of Appomattox  plaintiff is concern nnln of his fa until his removal I at the said H.  S auras P is. I mo the 1 teat tas sata h . o . I commissioner à foil tlons as such Trees , Including aU  statement urer during I before i w etraW i term of oS_ pertaining to I TRACT THOM DSCRIX AT THS JUKS TSBM,  And It Is ordered that the cause be refern to B. B. Poore, as e epaplel commissioner, to take the accounts herein ordered. 1  j o o ss iM io n s t O m oa t .v A ppomattox 0.H..VX,JunenTlM  f 7 N otioelshetebygtveatothejiirtlestohM l P suit, that I have appointed July SM.1N8, M the time end theUbv office of H. D. t lo n lj l Appomattox C. H Va., as the place Mat r execution of thhsaid orderof referen . I if not concluded on that dur tt will beet tlnued from Unte to time unul oomplateA _ _ _ k. B. Poona,1 H. D. FliOOD, p. q. l i e T7TRGINIA   I In the Circuit Court of mo matto oounty. The Board of Supervisors of Appomattox oounty aoanmr John B, Franklinjate Treasurer of Appomat tox county! w . D. Thornton, J. F. Connelly god S. R. Franklin, his sureties, and D. Host Robertson. XTRAOT FROM DnOBBBgTTHI rORBTRRM, VS. On consideration whereof the court doth adjudge, order and decree that this cease be referred to one of the commissioners of thu court! with direction to take, state and eettM the accounts of defendant J. R. Franklin as late Treasurer of Apomattox oounty in so far as the Plaintiff Is ooneerned thereth, from the beginning of bis term to the end thereof, and ltls ordered that the said J. K. Franklin do lay before said commissioner a full state ment of hie transaction as suoh Treasurer during his term of office aforesaid. Including all books and papers pertaining to said office. XTRAOT FBOM D BO BBS AT TUB JVBR TBBM, VS. And it is ordered that this cause be referred to R. B. Poore as a special commissioner to e the accounts ordered therein. COMMISeiOHBRS O ffiob ,  Appomattox C. H., Va June 1MSM. f"}, "highlight": {"text": {"matched_tokens": ["S", "R", "Franklin"], "snippet": "J. F. Connelly god <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, his sureties, and D."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R", "Franklin"], "snippet": "J. F. Connelly god <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, his sureties, and D."}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [770.65, 243.83, 919.51, 772.91], "bbox_id": "84df881017", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "Stuart Farrar, of Pamplin, happened upon a shelf of Lyn chburg directories among the records in the court house, Ly nchburg. In the oldest directory there, 1887-1888 he found sev eral pages of interesting in formation about this county back when  Rose Bower ,  Neb raska ,  Reedy Springs etc. were post office locations.  Ne-  braska , of course was the pre sent county seat,the Town of Appomattox. Population in 1887 was 10,080 with 5,153 white and 4,927 colored. County seat was  listed as Appomattox CH the  old village, now Appom attox j Court House National Historical j Park with a population of 100.  Average assessed value of j lands in 1887-1888 was 4.13 j per acre. The Circuit Court of I the Fifth Circuit met on the 15th  of March and 15th of Sept, with  Judge John D. Horsley and Geo rge T. Peers as clerk. Henry T. Parish was county judge and Mr. Peers serving as clerk and County Court met at the Court House Thursday after the 1st Monday in each month. County officers 84 years ago were T. B. Bryant, sheriff A.S. j Swan, surveyor, J . R. Franklin, Treasurer George W. Abbitt, commissioner of the revenue and W. C. Franklin, common wealths attorney. The supervisor board, then as now, was composed of three representatives, one from each district Wm. White was chair man together with D. H. Mar shall and H. E . Gilliam. County magistrates were A. Womack, C . H. Gilliam, Pam plin City Ja s. A. Walker, Tower Hill N. W. Owen, Oakville C. W. Cardwell, Spout Spring C.B ."}, "highlight": {"text": {"matched_tokens": ["R", "Franklin", "Treasurer"], "snippet": "j Swan, surveyor, J . <mark>R</mark>. <mark>Franklin</mark>, <mark>Treasurer</mark> George W. Abbitt, commissioner"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "Franklin", "Treasurer"], "snippet": "j Swan, surveyor, J . <mark>R</mark>. <mark>Franklin</mark>, <mark>Treasurer</mark> George W. Abbitt, commissioner"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["S", "R", "Franklin", "R"], "snippet": "H. Gills, Cooch Plunkett, <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, D. Mott Robertson, <mark>R</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R", "Franklin", "R"], "snippet": "H. Gills, Cooch Plunkett, <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, D. Mott Robertson, <mark>R</mark>."}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2091.6, 912.84, 2255.6, 1204.55], "bbox_id": "4c93a05871", "file": "AppomattoxNewspapers_1892-1898a_0062.pdf", "page": 1, "text": ".J K I Uuly 22d. UBS, as the time and the lav offioe o t EL D. i f Appomattox C. H., V a , aa the place _____ execution of thh said order of reference, and if not concluded on that day It win be con tinued from time to time until completed, HPfiHBnsaHpHpnHM B. B. P o o r e , Spedai Com fi. D. F lood , p. q. June nrr. une224w K IBGINIA In tbe Circuit Court of Appo mattox oounty. The Board of Supervisor of Appomattox oounty AGAINST John B. FrankltrUate Treasurer of Appomat tox oounty W. D. Thornton, J. F. Connolly and S. R. Franklin, ms sureties, and D. Mott Robertson. EXTRACT FROM DECREE AT THE JUNK TERM, 88. On consideration whereof the oourt doth adjudge, order and decree that this cause be referred to one of the commissioners of this court, with direction to take, state and settle the aeoounts Of defendant J. H. Franklin as i late Treasurer ot Apotnattox county in at  tar as the Plaintiff la concerned therein, from the beginning of his term to tbe end thereof, and It Is ordered that the said J. R. Franklin do lay before said commissioner a full state ment of his transaction as suoh Treasurer during his term of offioe aforesaid, including all books and papers pertaining to said offioe. EXTRACT FROM DECREE AT TBE JUNE TERM, 98. And it to ordered that this cause be referred to B. B. Poore as a special commissioner to e the accounts ordered therein. C ommissioner  s O ffice Appomattox C. H., V a , June 19, Notice is hereby given to the parties to this suit that I have  M the time, and AiiyartiwTvHP execution of the said order of reference, and If not concluded on that day it will be contin ued from time to time untf"}, "highlight": {"text": {"matched_tokens": ["S", "R", "Franklin"], "snippet": "J. F. Connolly and <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, ms sureties, and D."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R", "Franklin"], "snippet": "J. F. Connolly and <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, ms sureties, and D."}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2233.45, 974.04, 2393.11, 1255.64], "bbox_id": "773de36330", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "if not concluded on that day it will be oon-  ime to time until compie H. B. Poona, Spedai Oommr, H . D. F lood , p. q. Juno 82 tw VIRGINIA Y  In the Ciroult Court of Appo mattox county. The Board of Supervisors of Appomattox oounty AGAINST John R. Franklin Jato Treasurer of Appomat tox county W, D. Thornton, J. F. Connally and S. R. Franklin, his sureties, and D. Mott Robertson. EXTRACT PROM DECREE AT THE JUNE TERM, 88. On consideration whereof the oourt dote adjudge, order and decree that this cause be referred to one of tho commissioners of this court, with dlreotlon to take, state and settle tee accounts of defendant J. R. Franklin as late Treasurer ofApomatiox oounty In so far as tee Plaintiff is concerned therein, from tee beginning of his term to tee end thereof, and It is ordered that the said J. R. Franklin do lay before said commissioner a full state ment of his transaction as such Treasurer during his to rn of office aforesaid, including all books and papers pertaining to said office. EXTRACT THOM DECREE AT THE JUNE TERM, H6. And it is ordered that this cause be referred to R. B. Poore as a special commissioner to e tee aooounts ordered therein. C o m m is s io n e r  s O f f ic e , I Appomattox C. H., Va., June 1971888.  Notice Is hereby given to tee parties to this suit teat I have appointed July 22nd, 1898, as the time, and tee law office of H. D. Flood, at Appomattox C. H., Va., as the place for the execution of the said order of referenoe, and if not concluded on that day It will be contin ued from time to time until completed. R . B. P o o r e , o m r, H. D . F l o o d , p. q. June 22 4w."}, "highlight": {"text": {"matched_tokens": ["S", "R", "Franklin"], "snippet": "J. F. Connally and <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, his sureties, and D."}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R", "Franklin"], "snippet": "J. F. Connally and <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, his sureties, and D."}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1712.56, 1466.08, 1871.65, 1750.67], "bbox_id": "fec1513c10", "file": "AppomattoxNewspapers_1892-1898a_0051.pdf", "page": 1, "text": "E. B. Brady, agent Norfolk and Western railroad at this place, made a short visit to his family in Roa noke on Saturday evening last. Miss Lizzie Pankey expects to leave tomorrow morning for Phila delphia, Pa., on a visit to her brother. R. L. Woody, of Crewe, was in town on Sunday. Mrs. A. L. Woody, of Crewe, left for home yesterday after a visit of a few days to her parents, Dr. and Mrs. Hamlet. H. F. Booker, oue of our old towns men, is in town on a visit to his family. S. R. Franklin, ex-postmaster at this place, left this morning for West Virginia, where he has a position as salesman in a store. v J. H. Robertson, deputy treasurer, is in town today on business. Pamplin City, May 24."}, "highlight": {"text": {"matched_tokens": ["S", "R", "Franklin"], "snippet": "visit to his family. <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, ex-postmaster at this place,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R", "Franklin"], "snippet": "visit to his family. <mark>S</mark>. <mark>R</mark>. <mark>Franklin</mark>, ex-postmaster at this place,"}], "text_match": 2312642367913459833, "text_match_info": {"best_field_score": "3319999365120", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367913459833", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [351.6, 1365.37, 516.16, 1794.32], "bbox_id": "5d8b4a41d9", "file": "AppomattoxNewspapers_1892-1898a_0394.pdf", "page": 1, "text": "H on . R. T. S cott , A ttorney General of Vir ginia, Richmond, Va, d b a r s ib  In Feb. 1896 the School Board of Appomttos by a unanimous voto allowed Mr. H. D Flood a foe of 150.00 fof the prosecution of four chancery suits he had brought against two Ox-Treasurerof the Cointv and in which lie had recovered a large sura for the school fund  nt the time tills allowance was made Mr. Flood was Attorney for the Jommon- wc ilth of said County, and on that account the Superintendent of Schools.contende-i that he was not ontit ed to a fee. Mr. Flood de clined to accept, the warront unless in your Opinion he was entitled to a fee and at hi sug gestion a committee was appointed to make a statem ent of the facts iu the case to you, The undersigned is the committee. We subm it the attached statem ent signed by the members of the School Board when Mr. Flood was retained, ns a true statem ent of tlife acts of the case and desire your opinion, from these facts, as to whether we had power to allow a fee to Mr. Flood, out of the fund re covered by him in the four chancery suits. That there are bu t three School D istricts n Appomattox and were bu t three in 1890, so there were only nine trustees. Respectfully, T. A. S mith , J. T. M oses , J. W. G ii . i , iam , Committee, To Messrs. .1. T. Moses, T. A. Smith and J. W. Gilliam Committee of the School Board appointed to ascertain the facts in connec tion with allowing a fee to H. D. Flood at the moeting of the School Board of Appo m attox county on February 6 th 1896. We the undersigned desire to state th at we were mombers of tho School Beard of Appo mattox county on the 8 th day of January 1890 and for sometime th ereafter that there was a meeting of sad board on that day for the purpose of having settlem ents with Mr. J. R. Franklin late treasurer of said oounty that anticipating some trouble in securing a set tlem ent with Mr. Franklin and the A ttorney for ihe Commi nwealth of said oounty being W. C. Franklin, esq., the son of Mr. J H Franklin the board a t the instance of Mr c  H. Chilton, superintendent of schools for Ap pomattox county retained Mr. H. D. Flood as their counsel to bring about this settle ment. Mr. Flood was present and a sottie ment was reached by which it was agreed that Air. Franklin should pay 108.47 and th at this should he accepted in full of the amount due by Mr. Franklin and if tins was paid that the question of the 2 percent of the penalty lidded after December 1st In each year should not be raised as to Mr. Franklins term. Sub sequently Mr. Franklin raised some question About this settlem ent and Mr. Flood as the representative ef the Bourd some two years later brought suit fer a new settlem ent, Mr. Hood was isscruetod to investigate Mr! Shearer liability for tile 2 per cent of the 5 p ercen t penalty added after December 1st in"}, "highlight": {"text": {"matched_tokens": ["R", "Franklin", "treasurer"], "snippet": "ents with Mr. J. <mark>R</mark>. <mark>Franklin</mark> late <mark>treasurer</mark> of said oounty that"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "Franklin", "treasurer"], "snippet": "ents with Mr. J. <mark>R</mark>. <mark>Franklin</mark> late <mark>treasurer</mark> of said oounty that"}], "text_match": 2312642367779242105, "text_match_info": {"best_field_score": "3319999299584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367779242105", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1805.53, 1098.06, 1978.87, 1304.82], "bbox_id": "5a2aa9f3d7", "file": "AppomattoxNewspapers_1947-1949a_0376.pdf", "page": 1, "text": "W. Franklin Marshall was named Wor. Master of Monroe Lodge No 301, AF  AM, at the regular com munication held Monday night, De cember 13. Also chosen to servo ss officers by the Lodge were George P. Brannan, Sr. Warden Tames R. Redding, Jr. Warden J. r. Hud gins, Treasurer C. S Booth, Secre tary John S. Ginels, Sr. Deacon R. B. Haley, Jr. Deacon, R. L Burke, Jr., Tiler W. C. Dudley, Reporter J. H. Lucado, Sr. Ste ward C. K. Hunter, Jr Steward, and Rev. J. Marshall Walker, Chap lain.The newly elected officers were installed by Rt.Wor.Chas F. James. Pamplin Lolge"}, "highlight": {"text": {"matched_tokens": ["r", "Treasurer", "S"], "snippet": "Redding, Jr. Warden J. <mark>r</mark>. Hud gins, <mark>Treasurer</mark> C. <mark>S</mark> Booth, Secre tary John"}}, "highlights": [{"field": "text", "matched_tokens": ["r", "Treasurer", "S"], "snippet": "Redding, Jr. Warden J. <mark>r</mark>. Hud gins, <mark>Treasurer</mark> C. <mark>S</mark> Booth, Secre tary John"}], "text_match": 2312642367510806649, "text_match_info": {"best_field_score": "3319999168512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367510806649", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2082.69, 1466.05, 2244.1, 1543.65], "bbox_id": "c21d3e8df3", "file": "AppomattoxNewspapers_1892-1898a_0059.pdf", "page": 1, "text": "S. It. Fn Robertson. EXTRACT FROM DECREE AT THE JUNBTERM , 88. On considerationwhereof tho oourt doth adjudge, order and decree that this cause be  referred to one of the commissioners of this 1 court, with direetionjk take, state and settle the accounts of defendant J. R. Franklin as I late Treasurer of Apomattox county in so far as tho Plaintiff is eopcerned therein, from I the beginning of his term to the end thereof id it Is  id that the said J. R Frankli"}, "highlight": {"text": {"matched_tokens": ["R", "Franklin", "Treasurer"], "snippet": "accounts of defendant J. <mark>R</mark>. <mark>Franklin</mark> as I late <mark>Treasurer</mark> of Apomattox county in"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "Franklin", "Treasurer"], "snippet": "accounts of defendant J. <mark>R</mark>. <mark>Franklin</mark> as I late <mark>Treasurer</mark> of Apomattox county in"}], "text_match": 2312642367510806649, "text_match_info": {"best_field_score": "3319999168512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367510806649", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2234.66, 1263.49, 2393.36, 1528.79], "bbox_id": "ecdf98ba24", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "VIRGINIA V In tbe Ciroult pourt of Appo mattox county. The County School Board of Appomattox county  AGAINST H. C. Shearer, late Treasurer of Appomattox oounty J. R. Franklin, H.E. Gilliam, Martha J. Franklin and W. W. Statham, hlNsureties, and D. M. Robertson. EXTRACT PROM DECREE AT THE DECEMBER TERM, 1881. On consideration whereof tbe court doth adjudge, order and decree that this cause be referred to one of the commissioners of this oourt with directions to take, state and settle tee accounts of tee defendant, H. C. Shearer as late Treasurer of Appomattox county, in so far as the plaintiff Is concerned therein, from tee beginning of his term of offiee, July 1st, 1887, until bis removal therefrom, and It is ordered that tee said H. C. Shearer do lay be fore said commissioner a full statomentof his transactions as such Treasurer during hit- term of office, including all books and papers pertaining to his said offiee. EXTRACT PROM DECREE AT THE JUNE TERM 88. And It is-ordered that this cause be referred to R. B. Poore as a special commissioner to take the accounts ordered therein. C o m m is s io n e r  s O f f ic e , 1 Appomattox C. H., Va., June 19,1886. f Notice is hereby given to the pasties to this suit, that I have appointed July 22nd, 1888, as the time, and the law office of H. D. Flood, at Appomattox C. H Va., as tee place for the exeentlon of tee said order of reference, and if not concluded on that day It will be contin ued from time to time until completed. R. B. P o o r e , Special Commissioner. H. D. F l o o d , q. June 22 4w."}, "highlight": {"text": {"matched_tokens": ["Treasurer", "R", "Franklin"], "snippet": "H. C. Shearer, late <mark>Treasurer</mark> of Appomattox oounty J. <mark>R</mark>. <mark>Franklin</mark>, H.E. Gilliam, Martha J."}}, "highlights": [{"field": "text", "matched_tokens": ["Treasurer", "R", "Franklin"], "snippet": "H. C. Shearer, late <mark>Treasurer</mark> of Appomattox oounty J. <mark>R</mark>. <mark>Franklin</mark>, H.E. Gilliam, Martha J."}], "text_match": 2312642367376588921, "text_match_info": {"best_field_score": "3319999102976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367376588921", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2096.41, 1226.3, 2258.7, 1753.2], "bbox_id": "79b0ecb0aa", "file": "AppomattoxNewspapers_1892-1898a_0062.pdf", "page": 1, "text": "VIRGINIA V In tbe Circuit Court of Appo mattox oounty. The County School Board of Appomattox county - AGAINST H. O. Shearer, late Treasurer of Appomattox county J. R. Franklin, H. E. Gilliam, Martha J. Franklin and W. W, Statham, hirsuretles, and D. M. Robertson. EXTRACT FROM DECREE AT TBE DECEMBER TERM, 1891. On consideration whereof the court-doth adjudge, order and deoree that this cause be referred to one of the commissioners of this oourt with directions to take, state and settle the accounts -of the defendant. H. C. Shearer as late Treasurer of Appomattox oounty, In so tar as the plaintiff Is concerned therein, - -  r of his term of office, July removal therefrom, and It is _____________ said H C. Shearer ao ley be fore said commissioner a full statementof his transactions as suoh Treasurer during his term of offioe. including aU books and papers pertaining to ills said office. EXTRACT FROM DECREE AT THE JUN E TERM 93. And It is,ordered that this cause be referred to R. B. Poore as a special commissioner to take tbe accounts ordered therein. C ommissioner  s O ffioe , . I Appomattox C. H., V a , June 19,1863 j Notice Is hereby given to the pasties to this suit, that I have appointed July 22nd, 1868, as the time, and the law offioe of H. D. Flood, at Appomattox O. H., V a , as the place for the execution of the said order of reference, and if not concluded on that day it will be contin ued from timo to time until completed. B. B. P oore , Special Commissioner, H. D. F lood , f. q. June 22 4w. V IRGINIA In the Circuit court of Appo mattox county. Tbe County School Board of Appomattox oounty AGAIN8T John B. Franklin, late Treasurer of Appo mattox county W. D. Thornton, J. F. Con- nally and 8. R. Franklin, bis sureties, and D. M. Robertson. EXTRACT FROM DECREE AT THB JUNE TERM 92, On consideration whereof the court doth adjudge, order and decree that this cause be referred to one of the commissioners of this court, with directions to take, state and rot tle the accountsof the defendant, J. R. Frank lin, as late Treasurer of Appomattox county In so far as the plaintiff Is concerned therein, from the beginning of his term to tbe end Itlso rd thereof, and 1 i ordered that the said J. R. Franklin do lay before said commissioner a full statement of his transactions as such Treasurer during his term of office aforesaid, including aU books and papers pertaining to qald office. EXTRACT FROM DECREE AT THE JUNE TERM 93. And it Is ordered that this cause be referred to B.B.Poore as a special commissioner to take the accounts ordered therein. C ommissioner  s O ffice , 1 Appomattox C. H., V a , June 19,1893. Notiee Is hereby given to the parties to the suit that I have appointed July 22nd, 1898 as the time, and the law office of H. D. Flood, at Appomattox C. H., Va., as the place for the execution of the said order of reference, and if not concluded on that day it will be con tinued from time to time until completed. R. B. P oore , Special Comr. H. D. F lood , p. q.  June 22 4w,"}, "highlight": {"text": {"matched_tokens": ["Treasurer", "R", "Franklin"], "snippet": "H. O. Shearer, late <mark>Treasurer</mark> of Appomattox county J. <mark>R</mark>. <mark>Franklin</mark>, H. E. Gilliam, Martha"}}, "highlights": [{"field": "text", "matched_tokens": ["Treasurer", "R", "Franklin"], "snippet": "H. O. Shearer, late <mark>Treasurer</mark> of Appomattox county J. <mark>R</mark>. <mark>Franklin</mark>, H. E. Gilliam, Martha"}], "text_match": 2312642367376588921, "text_match_info": {"best_field_score": "3319999102976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367376588921", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1954.59, 303.62, 2122.83, 1790.28], "bbox_id": "d974ab246c", "file": "AppomattoxNewspapers_1902-1905a_0549.pdf", "page": 1, "text": "Miss Martha P. McGavock, of Max Meadows, a frtaster of arts of the Lynch burg Randolph-Macon Womans College and a bachelor of philosophy of the Uni versity of Chicago, will have chargei of the chair of mathematics and science in Sullins College, Bristol, next year. Col. Robert A. Marr, professor of en gineering at the Virginia Military Insti tute, at Lexington, has resigned to go to the Virginia Polytechnic Institute, at Blacksburg. It was ascertained in Lynchburg on good authority that the impending re- port of the Southern Railways business for the fiscal year ended June 30 will be one of the most remarkable annual re ports ever made by a railroad in the South. The year has been the best the system has ever enjoyed, and the in crease in revenues is said to make a wonderful showing. The report is tc be issued in the next few days. The corner-stone o the elaborate monument to be erected in Richmond to Jefferson Davis, President of the Confederacy, will be laid November 8 with simple ceremonies. It is proposed to unveil the monument June 3, 1907, the ninety-ninth anniversary of the birth of Mr. Davis. The contract for the purchase of the real estate necessary as a site for the memorial was closed. The memorial will be located at the intersec tion of Cedar and Franklin streets, and is to be surrounded hy a circle with a radius sufficient to afford an environ ment in keeping with the massive and handsome design. The monument is to consist of a semi circular structure of columns connected and surmounted by a massive cornice and with a towering column within the arp. This great column is to be sur mounted by a figure of Liberty, while beside the column on an appropriate ped estal will stand a statue of the Confed erate President. There were for a long time differences of view as to the proper site for the mon ument. Monroe Park having been fitst selected. Later there was a movement to locate it at the corner of Twelfth and Broad streets and make it in the form of a greht arch, spanning Broad street, near the site of the White House of the Confederacy. Owing to the ob jection of Mrs, Davis to the Broad street site this plan was abandoned. Mrs. Davis also disapproved the design of the arch and later the semi-circular de sign was chosen. It is proposed to in vite the United Confederate Veterans to hold their reunion in Richmond in 1907 and to take part in the unveiling cere monies. This invitation will be extend ed at the meeting next year. Mr. George F. Rathvon, a dry goods merchant of Danville, has filed a deed of assignment. Mr. E. T. Lewis is named as trustee. Mr. Rathvons sched uled debts amount to about 6,800. The assets, consisting of a stock of dry goods, furniture and fixtures and several hun dred dollars worth of accounts, are about 5,000. Although her mother cautioned her not to do so, Mollie France Funkhouser, who liver rlfcar Strasburg, attempted to kindle a fire with coal oil while her mother was in the yard The can ex ploded, setting fire to her dress. The child was horribly burned and died in intense agony. Several members of the family were burned while extinguishing the flames. There is considerable excitement near Scotts Factory, Isle of Wight county, over an attempted assault upon Mrs. James Jones by William Wingfield, a negro. Wingfield, who worked about the place, was ordered to cut up stove wood. After completing the task he car ried an armful into the kitchen, threw it into the woodbox and then grasped Mrs. Jones by her shoulders. There was a fierce struggle, during which Mrs. Jones cries attracted her husbands at tention. Jones got a shotgun and snap ped it twice at the negro, hut the piece would not explode, and Wingfield es- . caped. Officers and a posse have been scouring the woods, but no trace of the negro has been discovered. Fire destroyed the factory of the Eure- ca Furniture Company, near Manches ter. The loss is about 25,000, with 12,000 insurance. The building, ac cording to the night watchman, J. R. Anderson, was set on fire by a flash of lightning. He was on the second floor and was forced to jump for his life. He was badly burned and otherwise hurt. Dr. William E. Harwood, of Peters burg, Grand Commander of the Con federate Veterans of Virginia, granted charters to two camps of Confederate Veterans, one to be the Jefferson Coun ty W. Va. Camp and the other of the Halifax County Camp. He has desig nated October 25, 26 and 27 as the date for holding in Petersburg the next State reunion. Full returns from the re-assessment of real estate in Rockingham county show a total valuation of 8,801,778, a gain of 1,208,343 since the assessment of 1900. This is a net increase of 16 per cent. In Harrisonburg the increase amounts to 341,836, or 46 per cent. The present town valuation is 1,079.530 The property owned by negroes in town and county is assessed at 54.665. show ing a 10 per cent, increase. Rev. Dr. Arthur S. Lloyd, of New Jersey, formerly of St. Lukes Church, Norfolk, is one of the ministers most frequently mentioned for bishop coad jutor o fthe Southern Diocese o f.V ir ginia. This office will be filled at a special meeting of the Episcopal Coun cil, to be held in October. Mr. E. M. Maxwell has sold Mr. S. F. Millers place, Riverside Farm, neat Manassas, to Mr. Hepburn. It is re-  ported that the price was 17,000. j A ferry boat will probably be plying between Washington and Alexandria . . .  .  _ ___ _ T _ 1 __ _ 1 wiihin a , shott time. Manager John Caj- laban says t lie company will not wait for the two new boats now building to be finisiied, which will 1be the firsit of October, , but will at once secure a boat to be usved f or the ferry service. fhe New Cleveland Company, Ml- j corporatcd, has been chartered to do a general real estate business in Norfolk, with capital from 5,000 to 25,000. Isaac Kershaw, of Philadelphia, is president John J. Cummins, of Syracuse, N. Y., vice- president, and R. S. Jeffries, of Norfolk, secretarv and treasurer. Attorneys Frederick D. C. Faust, rep resenting the Government, and H. S. Hayden, representing the Southern Rail way, have been in Norfolk taking evi dence in the claim of the Southern Rail way against the United States for dam ages growing out of a collision in this harbor between the army transport Sum ner and Southern Railway transfer barges. , The historic old hostelry Mountain Top, situated about a half mile west of Afton, was sold to Hon. Thomas E. I Watson, of Georgia. Mr. Watson, who is a well-known author and magazine 1 writer, will reside at Mountain Top about half of -each year."}, "highlight": {"text": {"matched_tokens": ["R", "S", "treasurer"], "snippet": "Y., vice- president, and <mark>R</mark>. <mark>S</mark>. Jeffries, of Norfolk, secretarv and <mark>treasurer</mark>. Attorneys Frederick D. C."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "S", "treasurer"], "snippet": "Y., vice- president, and <mark>R</mark>. <mark>S</mark>. Jeffries, of Norfolk, secretarv and <mark>treasurer</mark>. Attorneys Frederick D. C."}], "text_match": 2312642367242371193, "text_match_info": {"best_field_score": "3319999037440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642367242371193", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1400.67, 1148.75, 1553.97, 1808.76], "bbox_id": "52cfa0ce83", "file": "TimesVirginian_1980a_0054.pdf", "page": 1, "text": "time. What you moat? I tppomattox in 1961, and faced Tree Great Depres- skm. But the decade I recall moat was The Roaring Twen ties. Fresh from victory in World War I we wore aglow with wide and power. Wo had Mary Pfekfbr. Douglas Fair banks, Charlie Chaplin and Rudolph Valentino. Bobby Jones, BUI T ildes, Jack Dempsey, Red, Grange and Knots Rockne. Ah yea, Billy Sunday and Cal Coolidge. The Talking Movies. What a Decade. And how waa it in - Appomattox? Our Town was incorporated in 1925, with Barnes W. Cawthrene as first Mayor, followed by W. L. Drown and C. 8. McDearmon. C. W. Smith waa county dark, TL W. McKinney waa Sheriff, J. H. OBrien commissioner of .revenue, D. A. Conner game warden, R. F. Burke and then A I Burke treasurer S. L. Ferguson, H. D. Flood,- Joel W. Flood, prominent attorneys. I soiling local merchants were L. E. Smith, H. M. Burge, A. T. -Inge, J. D. and W. M. Morris, H. C. Pulliam, Will Smith, J. M. Rosser, Mias Emma 8ntith, Mr. and Ifrs. W. R. RaynMda, Chaa. V . James, and we had the leadership of A. R. Harwood, H. C. Babcock, L. M. Wilkes, Don .Moses, Prof. L. Crawley. Do you remember Mias Kate Franklin, Mias M. Anna Jones, C. K. Hunter, Rev. Peter Price, Rev. W. M. Thompson, Alee Ringham. R. W. Wilkins, B. G. Anderson, J. A. Burke, LeRoy  Smith, R. S. Wheeler, Walter -Stott, W. M. Hancock. JJkv D. N. Twyman, Das u . A. Christian, Jr., Baa Caldwell, E. T. Mitchell? JE . Sears. N. R. Featheratqa, nob Craig, Spflier Trent, M. P. Porter, T. W. Mooed, Rev. R. E. Redding. . Miaa Eula Mae Burke, Dr. H. G. AbMtt, Latter B. Harvey, W. T. Nash, A. A. Baldwin, and H. G. Johnson, and ao many fine penonaNMp of the tMOTal 1 could double the Hat.  . Appomattox la A Growing. Town and so many have helped - ,r"}, "highlight": {"text": {"matched_tokens": ["R", "treasurer", "S"], "snippet": "A. Conner game warden, <mark>R</mark>. F. Burke and then A I Burke <mark>treasurer</mark> <mark>S</mark>. L. Ferguson, H. D."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "treasurer", "S"], "snippet": "A. Conner game warden, <mark>R</mark>. F. Burke and then A I Burke <mark>treasurer</mark> <mark>S</mark>. L. Ferguson, H. D."}], "text_match": 2312642366973935737, "text_match_info": {"best_field_score": "3319998906368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642366973935737", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1036.51, 275.25, 1183.36, 468.85], "bbox_id": "008fb151be", "file": "AppomattoxNewspapers_1962-1965a_0554.pdf", "page": 1, "text": "Judge George F. Abbitt, of Appomattox, was among six  trustees elected to the Board of Trustees of Virginia Baptist Hos pital last week. Calvin W. Fal-1 well, Jr. and Leonard S. Bradley1 of Lynchburg were elected along j with Lacey Putney, of Bedford Mrs. Malcolm Fuller, Bluefield, W. Va., and J. H. Denny, of! Amherst. Trustees reelected this year were W. Ewart Royall, of Lynch- j burg, and N. R. Burroughs, of Martinsville. Officers reelected  are Basil G. Watkins, president, E. Franklin Younger, Jr., vice j president R. E. Jones, vice  president Royall, treasurer, and Charles S. Elliott, secretary."}, "highlight": {"text": {"matched_tokens": ["R", "treasurer", "S"], "snippet": "Jr., vice j president <mark>R</mark>. E. Jones, vice  president Royall, <mark>treasurer</mark>, and Charles <mark>S</mark>. Elliott, secretary."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "treasurer", "S"], "snippet": "Jr., vice j president <mark>R</mark>. E. Jones, vice  president Royall, <mark>treasurer</mark>, and Charles <mark>S</mark>. Elliott, secretary."}], "text_match": 2312642366973935737, "text_match_info": {"best_field_score": "3319998906368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642366973935737", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1509.57, 1441.56, 1583.13, 1657.95], "bbox_id": "46efc30905", "file": "AppomattoxNewspapers_1974-1975a_0004.pdf", "page": 1, "text": "le to Appomattox te W. L. Brown Md the Town 10860 of C.S.  G. Johnson, J . y Sears, R. S. C T. Moses, with thon as town  snd treasurer. Bo was Mayor of  the Town Coun- iJ.ILPmfc R. J-W. Franklin, W. D- Carwile tigerald. Mr. accessful building Juvenile Court. Peace were L. T. W. Moses. W. Marks, R. E.  T. Steele and"}, "highlight": {"text": {"matched_tokens": ["R", "S", "treasurer"], "snippet": "Johnson, J . y Sears, <mark>R</mark>. <mark>S</mark>. C T. Moses, with thon as town  snd <mark>treasurer</mark>. Bo was Mayor of"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "S", "treasurer"], "snippet": "Johnson, J . y Sears, <mark>R</mark>. <mark>S</mark>. C T. Moses, with thon as town  snd <mark>treasurer</mark>. Bo was Mayor of"}], "text_match": 2312642366839718009, "text_match_info": {"best_field_score": "3319998840832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642366839718009", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [284.41, 529.02, 428.94, 1124.59], "bbox_id": "c4fcdfe090", "file": "AppomattoxNewspapers_1974-1975a_0339.pdf", "page": 1, "text": "We had a very successful Bible School at Hollywood Church last week. Rev. Paul Balthaser was principal with Mrs. Shirley Franklin as assistant. Delorious Ann Deaver was secretary and treasurer. The teachers were Rev. Balthaser, Mrs. Balthaser, Mrs. Annie Webb, Mrs. Myrtle Jennings. Mrs. Delorious Deaner, Mrs. Shirley Franklin, Mrs. Louise Franklin, Mrs. Roberta Austin and Mrs. Mary Lou Franklin. M rs. Lucile Sheets, Mrs. Betty Webb and Mrs. Mary Bagby had charge of the refreshments each day. Everyone had a good time at the picnic Friday and family night was enjoyed by all. We are glad Mrs. loan Mayberry is feeling better. We hope she may soon be well. We are so sorry to hear Mr. and Mfs. Wilson Scruggs remain critically ill at their home. A good many friends from Hollywood Church attended the funeral of Mr. Julian Jenkins Monday in Lynchburg. Ricky and Pam Franklin visited in the home of Mr. and Mrs. Thomas Woodall and family Friday afternoon. Mr. and Mrs. Basil King and son, of Covington, called in the home of Mrs. Mary Bagby Sunday afternoon. Mr. and Mrs. Thomas Woodall and Lisa, Mr. Frank Covington, M r s . Francis Brown, Mrs. W. T. Covington and Mrs. M. L. Covington visited Mr. and Mrs. Lewis Bryant and family, of Concord, Sunday afternoon. Mr. and Mrs. W. H. Wingfield, Miss Julia Wingfield and Miss Delorious Deaner were guest of Mr. and Mrs. Rufus Wingfield and family, of Roanoke, last week end. They visited Mr. and Mrs. James Waldron of Bedford, Sunday afternoon. We are very sorry"}, "highlight": {"text": {"matched_tokens": ["r", "s"], "snippet": "Mr. Frank Covington, M <mark>r</mark> <mark>s</mark> . Francis Brown, Mrs. W."}}, "highlights": [{"field": "text", "matched_tokens": ["r", "s"], "snippet": "Mr. Frank Covington, M <mark>r</mark> <mark>s</mark> . Francis Brown, Mrs. W."}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [867.58, 579.52, 1034.85, 737.15], "bbox_id": "c5fe4c2571", "file": "AppomattoxNewspapers_1955-1957a_0206.pdf", "page": 1, "text": "The Vera P.-T. A. held its last meeting of the session at the school Thursday evening. May 31, at 730. S. N. Thornhill held the devotion. The new slate of officers for the coming year was presented by the nominating committee, as follows President, J. R. Megginson vice president, Mr. Leonard Garrett secretary, Mrs. Thelma Franklin treasurer, Mrs. Willis Carter. The seventh grade pupils had charge of the program, which was centered around, Light. Guest speaker for the evening was Dr. A. L. Keesee."}, "highlight": {"text": {"matched_tokens": ["Franklin", "treasurer"], "snippet": "Garrett secretary, Mrs. Thelma <mark>Franklin</mark> <mark>treasurer</mark>, Mrs. Willis Carter. The"}}, "highlights": [{"field": "text", "matched_tokens": ["Franklin", "treasurer"], "snippet": "Garrett secretary, Mrs. Thelma <mark>Franklin</mark> <mark>treasurer</mark>, Mrs. Willis Carter. The"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.29, 296.74, 1934.81, 1529.23], "bbox_id": "b87d8dce8c", "file": "AppomattoxNewspapers_1902-1905a_0120.pdf", "page": 1, "text": "Pensions granted VirginiansWil liam Quigley. John H. Perine and Philip Lenz, 10 each Pinkney Jordon dead, 17 Mary E. Jordon, 12 Henry P. Ambrose, 6 Daniel O. Connell, John H. Minnick, 12 each Caleb Garrison, William H. Melions. Virginia Farrar and Martha Jane Lovern, 8 each Mitchell W. Graham. 12 Miranda T. Nelson, 8 Lewis Walton, 30 John T. Fry, 8- Statten H. Gooden. 6. While Mr. John Shonn was at J. S. Clems blacksmith shop in Mount Jack- son, his team became frightened at a passing vehicle and ran away. Mr. Shonn held on to the reins, but soon lost his balance and was dashed to the ground. When he was. picked up it was found that his neck and one rib were broken, by the force of the con cussion. Mr. Shonn was a respected citizen and resided about two miles south of Cedar Grove. Rev. Dr. J. Ernest Thacker, of Nor folk, has declined a call to Alabama. The N. C. Pine Association held its June meeting at Old Point Comfort. The Northern Coal and Coke Com pany has purchased 2000 acres of coal lands in Wise county and Letches county, Tenn., for 50,000. Judge Archer A. Phlegor, of Chris- tiansburg, has declined the position of professor of law in Washington and Lee University recently tendered him. Col. William H. Stewart, of Ports mouth, urges a reunion on the battle field of the Richmond, Petersburg, Franklin, Suffolk, Norfolk and Ports mouth survivors of the charge upon the Petersburg crater. Dr. Joseph W. Eggleston, of Rich mond, brother of George Cary Eggle ston and the late Edward Eggleston, both writers of national renown, has signed a contract with the Neale Pub lishing Company, of Washington, for he publication of a new Confederate novel, to be called Tuckahoe. Cary Craig, a Pennsylvania negro, sent to the penitentiary from Henrico for murder in the second degree, made a desperate attempt to kill Guard George P. Chiddix, of Washington county. Craig had been ordered punished for not doing his task in the shoe shop properly. He approached the guard, who was seated at a desk, from behind and seizing him y the collar, dragged him baewkard and ittempted to get his pistol. C. R. Lewis, 1 white convict, went to the aid of the guard. In the struggle the pistol was lischarged twice, Lewis receiving a Wound in the calf of his leg and the negro getting a scratch on the thigh. Mr. John Show.v?, of Shenandoah ounty, was instantly killed at Mounl Jackson while endeavoring to stop hit runaway horses. His foot slipped and the heavy wagon, ran over nis neck breaking it. He was 55 years of age and is survived by a widow and a largf family of children. Hunter B. Frischkorn, a dealer in Richmond, has received an order from a firm doing railway contract work in West Virginia for 20 tons of dynamite The explosive will be shipped to Nauga tuck, W. Va. The total contract calls for 13 carloads of dynamite. The Virginia Court of Appeals handed down a decision upholding thecompul sory pilotage law for coastwise vessels. The graduates of the Norfolk Acad emy are W. Hodge Baker, A. L. Hen- dren, A. C. Philpots, E. O. Thomas, T F. Truitt, R. B. Tucker. Charles Cummings, 19 years old, an alleged deserter from the ship Nevada, now in Hampton roads, was arrested at Buckhorn. He wore a naval uniform. Cummings said he had a 15 days fur lough in which to visit his home in Pensacola, Fla., but had no money and was trying to beat his way. He was sent to jail. Three hundred . delegates attended  meeting at the home of Mr. L. Passano. near Warrenton, to discuss the good roads problem. Col. Thomas Smith was elected president, J. B. Beverley firs vice-president, S. D. Parrar.a second vice- president, G. S. Fletcher secretary and John S. Gaines treasurer. Rev. George D. Booth, the new presi dent of King College, in Bristol, is onlj 26 years of age. He was graduated frorr the Southwestern Presbyterian Univer sity at Clarkesviile, Tenn., and ther spent two years in a theological seminary Dr. J. T. Henderson, recently elected president of Virginia Listitute, is de tained at Jefferson City Tenn., on ac count of the illness of Mrs. Hendersor who, it is reported, has smallpox. Miss Roberta Campbell Maupin daughter of Mr. A. L. Maupin, died a Clear Brook, aged 24 years. Her fathe- is a near relative of Abraham Lincoln She was a native of Rockv-gham county and a member of a distinguished Vir ginia family. At the Bluff City crossing of the twe railroads at Bristol a freight train on till Southern railway plunged through r Virginia and Southwestern freight train One engine was derailed and turned over and several cars were wrecked. Thi crejv of the Southern train jumped tc sefely. No one was injured. John Baker, of South Norfolk, i- years old, fell from a swing Sunday and broke both legs above the knee. Dr. A. S. Priddy, first assistant physi cian at the Southeastern State Hospital of Virginia, has tendered his rcsigna tion. This leaves two vacancies on th staff of that institution. Benjamin Turner, colored, was rur down by a Norfolk and Western trair and sustained injuries which resulted ir, his death at the St. Vincent de Paul Hospital in Norfolk. A second crop of strawberries is rip ening at Norfolk. R. S. Cromwell, ol Norfolk county, picked 20 crates ol berries from his fields, which he says are the finest of the season. Vines are two-thirds full of blossoms."}, "highlight": {"text": {"matched_tokens": ["R", "S"], "snippet": "rip ening at Norfolk. <mark>R</mark>. <mark>S</mark>. Cromwell, ol Norfolk county,"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "S"], "snippet": "rip ening at Norfolk. <mark>R</mark>. <mark>S</mark>. Cromwell, ol Norfolk county,"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1395.11, 354.5, 1680.5, 461.31], "bbox_id": "d0e398c245", "file": "TimesVirginian_1978_0558.pdf", "page": 1, "text": "P ic t u r ed a bo v e a r e n ew o f f ic e r s o f t h e spo u t SIRRING RURITAN CLUB installed at Annual Ladies Night held at Maudes Restaurant on Monday evening, December 11,1978. Front row, left to right, Curtis Wooten, president A1 Reynolds, vioe-president Franklin Vaughan, secretary back row, left to right, Norman Ferguson, 1 year director R. M. Harris, 2 year dupetor E. D. Jones. 3 year director Byron Moody, new mem b e r not present for picture was Claude Dickerson, treasurer.   sp  . M p jL S 81 iM Hg i  ACHS Co-ed HLY"}, "highlight": {"text": {"matched_tokens": ["r", "s"], "snippet": "f f ic e <mark>r</mark> <mark>s</mark> o f t h"}}, "highlights": [{"field": "text", "matched_tokens": ["r", "s"], "snippet": "f f ic e <mark>r</mark> <mark>s</mark> o f t h"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1455.84, 481.32, 1882.52, 559.77], "bbox_id": "2d43f9dce9", "file": "TimesVirginian_1980a_0030.pdf", "page": 1, "text": "Installation of officers for 1980 of Monroe Lodge 301 installation of Officers for 1900 of Monroe Lodge 301 was heM on December io, 1979 at their regular stated meeting. v   Officers are, from left to right, Donald R. Pulliam, junior warden George S. Williams, Jr., senior warden Kermit Campbell, worshipful m aster Dennis W. Drinkard, junior steward William H. Moore, tyler Herbert H. Chambers, junior deacon H. Lloyd Garber, senior deacon C. S. Booth, treasurer Samuel B. Doss, senior steward W. Dean Conner, chaplain and C. Max Franklin, treasurer. - -y"}, "highlight": {"text": {"matched_tokens": ["Franklin", "treasurer"], "snippet": "chaplain and C. Max <mark>Franklin</mark>, <mark>treasurer</mark>. - -y"}}, "highlights": [{"field": "text", "matched_tokens": ["Franklin", "treasurer"], "snippet": "chaplain and C. Max <mark>Franklin</mark>, <mark>treasurer</mark>. - -y"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1756.28, 248.05, 1932.39, 1047.36], "bbox_id": "792b17307f", "file": "AppomattoxNewspapers_1926-1933a_0264.pdf", "page": 1, "text": "I Mr. and Mrs. W. H. S. Bar- jlow, Misses Christine and Neo- I la Barlow and Messers Ralph Barlow and Percy Staton motored to Roanoke Monday to attend the burial of Mr. W. N. Barlow, who died suddenly at his home in Chicago. Inter ment was made in Fairviewj Cemetery, Roanoke, Va., the home of his boyhood days. Dr. Havilah Babcock jrelates quite a fish story, which is en tirely vouched for by members of the party. Tuesday on I James River he struck a New! River Cat with hook and line, jot the monster in pight and realizing the catch was too much for the tackle used, Dr. umped . into the water gath- ared his catch and lifted, it out. The scales went down at 3 pounds. It is said to be the largest cat caught in this sec tion of the State. Mrs. Sarah Jane Hall cele- Ibrated h e r seventy-second birthday last Friday at heri I home near here. She lives in aj I house by the side of the road and is a friend to children. The following children Assisted her to observe her birthday in the most pleasant manner possible Caroline, Virginia and Clara Witney Moses, Hilda and Hel en Wagers, Doris and .Edith Lucado. Little Miss Caroline Moses baked the birthday cake, which was elaborately decorated in lavendar and pink with candles. This estimatable  woman, living alone, plants and does all the work in her garden, which is a most flour-J .shing and promising plot. The Appomattox Chapter U. D. C. held its regular monthly . meeting at the home of Mrs. E. jE- Gill? Thursday afternoon. I Mrs. Gills and Mrs Mollie Law-! son being joint hosiess. The following officers were elected for the ensueing year Mrs. C. F. James president, Mrs. H. B. Pack, vice-president, Mrs. M.l Moore, second vice-president,! Miss Bessie Zimmerman, cOr-l responding secretary, Mrs. J. AI Burker recording secretary,! Miss Kate Franklin, treasurer, I Mrs. J. D. Morris, registrar, Mis? I Louise Gills, historian. Mrs. S.l A. Ferguson was elected an I honorary member. Mrs. C. A. I Hancock was received for reg-P ular membership. After the business an ice course was served by the hostesses. The July meeting will be enter tained,by Mrs. W. L. Brown, j -------------o ------------- -- Liberty Baptist Church"}, "highlight": {"text": {"matched_tokens": ["Franklin", "treasurer"], "snippet": "recording secretary,! Miss Kate <mark>Franklin</mark>, <mark>treasurer</mark>, I Mrs. J. D."}}, "highlights": [{"field": "text", "matched_tokens": ["Franklin", "treasurer"], "snippet": "recording secretary,! Miss Kate <mark>Franklin</mark>, <mark>treasurer</mark>, I Mrs. J. D."}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2235.6, 1599.19, 2395.78, 1790.6], "bbox_id": "4c8fee13ea", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "EXTBACT FROM DECREE AT THE JUNE TERM 92. On consideration whereof tee court doth adjudge, order and decree that this cause be referred to one of tee commissioners of this oourt, with directions to take, state and set tle the accounts of tee defendant, J. R. Frank lin, as late Treasurer of Appomattox county in so far as tee plaintiff is concerned therein, from the beginning of his term to the end thereof, andlt Is ordered that tee said J. R. Franklin do lay before said commissioner a full statement of his transactions as sneh Treasurer during his term of offiee aforesaid, including all books and papers pertaining to qald office. EXTRACT FROM DECREE AT THE JUNE TERM W . And It Is ordered teat this cause be referred to R.B.Poore as a special commissioner to take the accounts ordered therein. C o m m is s io n e r  s O f f ic e , I Appomattox C. H., Va.. June 18,1883.  Notice is hereby given to tee parties to tee suit that I have appointed July 22nd, 1888 as the time, and tee law offiee of H. D. Flood, at Appomattox C. H., Va., as tee place for the execution of tee said order of reference, and if not concluded on that day It will be con tinued from time to time until completed. _ H. B. P oore , Special Comr. H. D. F lood , p. q. June 22 4w."}, "highlight": {"text": {"matched_tokens": ["R", "Franklin"], "snippet": "that tee said J. <mark>R</mark>. <mark>Franklin</mark> do lay before said"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "Franklin"], "snippet": "that tee said J. <mark>R</mark>. <mark>Franklin</mark> do lay before said"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2072.9, 704.09, 2244.49, 1005.1], "bbox_id": "d76ce8ccd9", "file": "AppomattoxNewspapers_1955-1957a_0499.pdf", "page": 1, "text": "At a regular meeting of the Ap pomattox County Junior Chamber of Commerce held Monday night at the Appomattox Garment Com pany cafteria, the following office re were elected for the 1957-58 year President, Dr. S. R. Lawwin Internal Vice-pres., Ben H. Mar shall External Vice-pre., J. Robert Jamerson Secretary R. W. Mitchell Treasurer, David M. Trent State Director, Frank McCann Directors Fred H. Lawson, Rob ert E. Trent, Hugh M. Mitchell. Jaybird, J. Ed. Gawthome Parliamentarian, H. W. Conner. Plans are being made to install these officers at a dinner meeting in June. . Three new members were induct ed into the Jaycee Chapter at this meeting. They were James R- Redding, Franklin Vaiughn Md Stpart Paulette. . ------   AIR Ft-CE ACADEMY APPOINTMENT"}, "highlight": {"text": {"matched_tokens": ["S", "R"], "snippet": "1957-58 year President, Dr. <mark>S</mark>. <mark>R</mark>. Lawwin Internal Vice-pres., Ben"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "R"], "snippet": "1957-58 year President, Dr. <mark>S</mark>. <mark>R</mark>. Lawwin Internal Vice-pres., Ben"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2236.28, 257.71, 2395.31, 525.12], "bbox_id": "ed4378eeb7", "file": "AppomattoxNewspapers_1892-1898a_0059.pdf", "page": 1, "text": "VIRGINIA V In the Circuit Court of Appo mattox county. -X Tho County School Board of Appomattox county S û  . AGAINST - , XX X H. C. Shearer, late Treasurer of Appomattox county  J. K. Franklin, H. E. Gilliam. Martha J. Franklin and W. W. Statham, his sureties, and D. M. Robertson. EXTRACT FROM DECREE AT TRS DECEMBER TERM, 1891. ..y,-!! On consideration whereof the court doth adjudge, order and decree that this causeaba referred mbébb   referred to one of the commissioners of this court with dtreotionsto take, state and settle the accounts of the defendant, H. C. Shearer as late Treasurer of Appomattox county, in so far as the plaintiff Is concerned therein. from tlje beifinnlng of bis term of office, Jul 1st, 1887, untu his removal therefrom, and i t  ordered that the said H. C. ttta iw do lay be fore said commissioner a full atatementof bis transactions as sueh Treasurer during his term of office. Including all books and papers pertaining to bU said office. EXTRACT FROM DECREE AT THE JUNE TERM TO. And it is ordered that this cause be referred to R. U. Poore as a special commissioner to tiiko the accounts ordered therein. . . . C ommissioner  s O r n o E ,  L Appomattox C. H., Va., June 19,1898. f Notice is hereby given to the partiestotbis suit, that I have appointed July 22nd, 1868, as the time, ana tho law ofRoe of H. Ik Flood, at Appomattox C. H., Va., as the place for the execution of tho said order of referenoe, and if not concluded On that day it will bo contin ued from time to time until completed. R. B, P oore , Special Commissioner. H. D. F lood , p. q. June 22 4w."}, "highlight": {"text": {"matched_tokens": ["s", "r"], "snippet": "ordered therein. . . . C ommissioner  <mark>s</mark> O <mark>r</mark> n o E ,  L"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "r"], "snippet": "ordered therein. . . . C ommissioner  <mark>s</mark> O <mark>r</mark> n o E ,  L"}], "text_match": 2310390568099774585, "text_match_info": {"best_field_score": "2220487737344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568099774585", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [308.15, 462.52, 740.25, 536.12], "bbox_id": "99fa97d551", "file": "AppomattoxNewspapers_1974-1975a_0569.pdf", "page": 1, "text": "Officers for the new year were installed at the Monday evening meeting of Masonic Lodge 301 in Appomattox. Newly elected officers, shown above, front row left to right, are H. H. Chambers, Secretary C. M. Franklin, Worshipful Master R. G. Bob Holt, Senior Warden Wayne Garrett, Junior Warden and C. S. Booth, Treasurer and on the back row, left to right, are Lloyd Bryant, Tiler Berkley Cabaniss, Junior Steward W. D. Conner, Chaplain Samuel Doss, Senior Steward Warren Drinkard, Senior Deacon and Ray Hudson, Junior Deacon."}, "highlight": {"text": {"matched_tokens": ["S", "Treasurer"], "snippet": "Junior Warden and C. <mark>S</mark>. Booth, <mark>Treasurer</mark> and on the back"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Treasurer"], "snippet": "Junior Warden and C. <mark>S</mark>. Booth, <mark>Treasurer</mark> and on the back"}], "text_match": 2310390568099774585, "text_match_info": {"best_field_score": "2220487737344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568099774585", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1408.56, 708.39, 1704.92, 900.33], "bbox_id": "434cfbf8f4", "file": "AppomattoxNewspapers_1915-1918a_0285.pdf", "page": 1, "text": "Miss Bessie Bigger and neph ew, master Thomas Bigger Treasurer, James L. Anderson, Buck-1gput the Thanksgiving season Lewis Williams, Bucking-1 with Rev. and Mrs. Clarence E Taylor, at Pamplin. Butter 35c, eggs 36c, young chickens 16c, old hams 25c, tur key 20c, corn 90c, wheat 1.60 potatoes 1.00, turnips 75c, at Appomattox. Miss Bessie Franklin, who is a student gt the State Normal in Fredericksburg, s p a n Thanksgiving with her parents M l and Mrs. R. L. Franklin, at Pamplin."}, "highlight": {"text": {"matched_tokens": ["R", "Franklin"], "snippet": "M l and Mrs. <mark>R</mark>. L. <mark>Franklin</mark>, at Pamplin."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "Franklin"], "snippet": "M l and Mrs. <mark>R</mark>. L. <mark>Franklin</mark>, at Pamplin."}], "text_match": 2310390568099774585, "text_match_info": {"best_field_score": "2220487737344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568099774585", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [671.29, 492.77, 813.23, 808.25], "bbox_id": "068695b6e3", "file": "AppomattoxNewspapers_1971-1973a_0392.pdf", "page": 1, "text": "During the month of June, the Concord R e s c u e Squad answered a total of 28 emer gency calls, expending 82 man hours in answer to the calls and driving a total of 661 miles. A breakdown of the calls answered is as follows Gen eral illness, 9 Auto accidents, 4 Cuts, 7 Falls 2 Back Injury, 1 Convulsions, 1 Minibike Ac cidents, 1 Insect bite, 1 Lawn- mower accident, 1 and 1 Dead on arrival. The Concord Rescue Squad completed their first year of operation June 30, 1972. New officers elected for the year 1972-73 are Reggie Sprad lin, President Bob Burrill, Vice President Doug Franklin, Secretary Helen Gaulden, Treasurer Fred Roberts, Chaplain Lawrence Hamlett, Membership Chairman Bill Mann, Public Relations Chair man Wayne Lankford, Captain Bud Gaulden, First Lieutenant and Calvin Collins, 2nd Lieu tenant."}, "highlight": {"text": {"matched_tokens": ["R", "s"], "snippet": "of June, the Concord <mark>R</mark> e <mark>s</mark> c u e Squad"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "s"], "snippet": "of June, the Concord <mark>R</mark> e <mark>s</mark> c u e Squad"}], "text_match": 2310390568099774585, "text_match_info": {"best_field_score": "2220487737344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568099774585", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.37, 1254.18, 2266.22, 1801.52], "bbox_id": "9ac83af7fc", "file": "AppomattoxNewspapers_1912-1915a_0152.pdf", "page": 1, "text": "CHARTERS I38UED. Aml-Kijo Chemical Company Inc., Winchester, Va. Capital Maximum, 50,000 minimum, 5,000. J. N. W. Funk, president H. C. A. Funk, sec retary and treasurer G. H. Funkall of Winchester, Va. Wiley Feed, Fuel and Supply Cor poration, Salem, Va. Capital Max imum, 20,000 minimum, 10,000. F. C. Wiley, president Ivan V. Yonce, vice-president R. T. Hubard, secretary and treasurerall of Salem, stock from 5,000 to 10,000. Amendment was Issued to the char ter of the District Automobile Service Company Inc., of Rosslyn, changing name to G. R. Cowle Company Inc.. Fork Union Canning Company Inc., Front Royal. J. E. Henson, president T. M. Borke, vice-president N. B. Sea- lock, secretaryall of Front Royal. Amendment was Issued to the char ter of the Mutual Telephone Company of Franklin and Roanoke Counties, of Retreat, Va., increasing its maximum Fredericksburg Hotel Company Inc., Fredericksburg. Capital Maximum, 50,000 minimum, 25,000. R. Conroy Vance, president M. B. Rowe, vice- president A. L. Brulle, secretaryall of Frederickburg, Va. Ocean Amusement Corporation, Nor folk, Va. Capital Maximum, 25,000 minimum, 1,000. George B. Deeton, president L. M. Crocker, secretary and treasurer W. S. Crockerall of Norfolk. Auto Specialty Company Inc., Nor folk. Capital Maximum, 25,000 minimum 6,000. T. Gray Coburn, president F. D. Pelote, treasurer I. B. Pelote, secretaryall of Norfolk. Amendment was issued to the char ter of Lynhurst Lumber Corporation, of Richmond, changing Its principal office to Lipscomb. Amendment was Issued to the char ter of American Brokerage Company Inc., Roanoke, reducing its maximum I capital stock from 60,000 to 10,000,1 and Its minimum from 10,000 to  2.500. Amendment was issued to the char-1 ter of the Farmville Building and Trust Company, of Farmville, Va.. changing Its name to the FarmvUte Building and Loan Company Inc, reducing its capital stock from 400,000 to 200,000."}, "highlight": {"text": {"matched_tokens": ["treasurer", "S"], "snippet": "M. Crocker, secretary and <mark>treasurer</mark> W. <mark>S</mark>. Crockerall of Norfolk. Auto"}}, "highlights": [{"field": "text", "matched_tokens": ["treasurer", "S"], "snippet": "M. Crocker, secretary and <mark>treasurer</mark> W. <mark>S</mark>. Crockerall of Norfolk. Auto"}], "text_match": 2310390568099774585, "text_match_info": {"best_field_score": "2220487737344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568099774585", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1124.91, 420.95, 1283.23, 1584.8], "bbox_id": "bdfa85b589", "file": "AppomattoxNewspapers_1898-1902a_0192.pdf", "page": 1, "text": "Twenty-two members of tbe Olympias crew, who fought at Manilo and were dis charged from tbe Raleigh, are on their way to San Francisco to rc- 9 nlist and return to tbe Philippines. Wichita, Kan., is without street ear ser vice. In accordance with a decision by Judge Dalo, declaring the street ears pabilo nuisance the cars quit rnnnlng, tbe lease ot the present company having expired. It is announced tbat Admiral Dewey, President Dta, of Mexico, and Lord Minto, Governor-General of Canada, will attend tbe laying of the corner stone ot the new postoffloe in Chicago October 9 and will meet President McKinley. Tbe Methodist ministers of Atlanta, Ga., passed resolutions calling for tbe appoint ment of a committee to urge upon tbe forth coming annual conference a movement for an extra General Conference to reconsider tbe Publishing House matter, the disposi tion of whlob, it is alleged, is not satisfac tory. Students at Princeton attacked a parade of Pawnee Bills Wild West show and a pitched battle took place, in which many were injured. The Southern Baptist Convention, in ses sion at Louisville, Ky., selected Ex-Mayor Bobert C. Davidson, of Baltimore, to join a delegation ot English B iptists In a personal appeal to the Czar in behalf ot the persecut ed Russian Baptists. After this week no miner. In the Conr DAlene district of Idaho will be permitted to work there unless he renounces member ship in the union that is held responsible for tbe present strike. The steamer Dauntless, formerly famous as a filibuster, was released by tbe United States Court at Jacksonville, Fla. In the cáse of Rafael Ortiz, a native of Porto Rico, who was found guilty of the murder of Private John Burke, Company C, Forty-seventh New York Regiment, at Cag- uas, Porto Rico, on February 24 lost, and whose sentenco of death was commuted to Imprisonment for life, the President has directed that he be confined in the Minnesota State prison, at Stillwater. The organization ot the Paulding County Ga. Cotton Mills has been perfected. The officers are E. Davis, president B. T. Drake, vice-president W. Z. Spinks, secre tary R. P. Gann, treasurer. The company will erect a cotton factory and cottonseed oil mill. It is proposed to do the work en tirely with home capital. Citizens of the town and county aro subscribing liberally. The Berwind White Coal Mining Com pany,. which has mines in Centre, Clearfield,  Jefferson, Cambria and Somerset counties, Pa., and which is one ot the largest pro ducers of bituminous coal In the world, has notified its employes of an Increase In wages, to go into effect June L Miners will re ceive 50 cents a ton tor picking and 25 cents a ton for loading after machines. The Baltimore and Ohfo Railroad, at tbe request of numerous business organizations of Baltimore and Philadelphia, has arranged for a ten days stop-over at each of tboso cities under the usual procedure of the passenger depositing the ticket with tbe ticket agent upon his arrival. The Balti more and Ohio Railroad now grants ten days stop-overs at Washington, Baltimore and Philadelphia. William N. Boggs, the defaulting bank teller ot Dover, Del., was sentenced at Wi- mington to five years in the penitentiary and to pay a fine of 6,500. A movement is on foot in tbe Florida Legislature to provide for a revision of the State constitution. Stove manufacturers who are meeting in Cincinnati may form a consolidation of tbeir interests. A dispatch to tbe Navy Department from Captain Cogblan states that an examination of the Raleigh after she was floated shows that she sustained practically no damage in grounding off Charleston. George Ubler, a farmer, fifty years of age, ro-idlng n ar Mount Hope, Pa., killed bis wife with ah axo ..while she was milking a cow. Hs then banged himself. Tbe double tragedy was discovered by their son, aud is ascribed to religious insanity. Tbe saw-mill plant of tbe E. E. Jackson Company, at Reidsville, Ala., was destroyed by fire. Loss, 75,000. Tbe president ot tbe company is cx-Governor E. E. Jackson, of Maryland. Alex. Volllatb, of Sheboygan, and H. I. Elvers, of Baltimore, students of Mission House College, were drowned while boat- riding in a small lake near Franklin, Wis. Their bodies have not been recovered. A yonng man named Roderick, oi Cbnrler- toivn, W. Va., shot himself through tbe leg,- between the thigh and tbe knee, while handling a pistol in the dining parlor oi Jones confectionery at Berryviile, Va. The wound is a very painful one, and bml the ballet passed a little higher up, it would have severed an artery and death would have resulted. An equestrian statue of General Hartranfl was unveiled at Harrisburg, Pa. Three thousand persons attended a recep tion and banqnet in Washington, D. C., in honor of the National Society ot Mechanical Engineers. Alter experiments-with wireless telegraph by the United States Signal Corps, General Greely has conoluded that it will not sup plant tbe present system of wires. Secretary Keep, of tbe Merchants Ex change, Buffalo, N. I., telegraphed to tbe Confederate Veterans reunion at Charleston. S. C., an invitation to bold tho reunion in 1901the Pan-Ameriean Exposition year- in Buffalo. C. E. LittleflelJ, of Rockland, was nomi nated by acclamation by tbe Republicans ot tbe Second Maine Congressional District to succeed the late Nelson Dlngley. Juno 3 will be observed as Confederate Memorial Day at L-xington, Va. Tbe West Virginia Knights Templar Con clave, in session at Huntington, selected Fairmont as the next place of meeting."}, "highlight": {"text": {"matched_tokens": ["R", "treasurer"], "snippet": "Z. Spinks, secre tary <mark>R</mark>. P. Gann, <mark>treasurer</mark>. The company will erect"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "treasurer"], "snippet": "Z. Spinks, secre tary <mark>R</mark>. P. Gann, <mark>treasurer</mark>. The company will erect"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [209.51, 730.08, 1122.8, 1242.36], "bbox_id": "06310ea937", "file": "AppomattoxNewspapers_1908-1909a_0077.pdf", "page": 1, "text": "Moses Motor Co., grease gun, e t c . __ S ___ ____ __  __  __ J. 0. Hannah, work on tra o to r ____ . ____ __ ___ a  ________ L E. Smith, supplies ______ _____ ____ _____ _ _ __ _ ___ ______ A W. Paulette, la b o r __ ____ ____ _ ___ _________ _ W. R. Cheadle, la b o r _____ - _ ______ _ ___  ___________ ___ W. G. Forbes, labor ___ _J ________  _  ________ - ___ E. Lr Harvey ft Bro., gas, e tc l  __ Z -  _ ____ _ __ _ j Geo. F. Abbitt  Co,, supplies _ ___ ____ ___ __ ____ _ __ 1 __ H. C. Babcock, hay, etc. i __  _ _ ____ _ _ ________ ____ _ ______ Uula B. Drinkard, stable r e n t ___ -, __ ____ _ ____ ____ _______ Pamplin Street Committee, work on stre e ts ___ _ __  __ _ _ ____ P. A. OBrien, salary as member of Road B o ard ____ 1 ____ _ __ u Southside Road Board, expenses of going after and taking chre of C. H. Rd. equipment a t E. Mi D rlnkards ____ - ________ R. L. Burks, feeding and caring- for te a m ________________ __ E. F. Covington, labor, team hire, e t c . _________ ________ - __ C.E. Franklin, labor _ _ _ ___ ____ ___ __ _______ _ __________  ___ Hunter F. Martin, labor,  __ _ _ ____ __ J _ ___ ____ _ _ ___ 0. C. Paulette, cross-laying road ____  - ___________ _ __ _ Times-Virginian, advertising, handbjlls, etc. JLs ______ __ _____ Quid-Lawson .Hardware Co., balance of acco u n t ____ - _____ - J. A. Smith, dragging road _ __  ______ _ J. E. Sears ft Co., lumber - I  _ ______ _ __ _ W. S. Tweedy, dragging. roa0 _ _  __________ _ ___ _ ____ _____ J. Tipton Jennings, dragging r o a d __ i __ __  _____ ____ _ R. R. Davis, soil  J ___ __ ____ ____ _ ______ J. J. Moore, team and lftbor , - -  _ _ _______ - ____ _ _ __ -Ll-I J. D. Hamilton, scraping-roads i u   __ _ __ _ __ _ .. m The Gallon Iron W orks ft .Mfg. Cs., Supplies and repairs . J- L. Turnesj- dragging road  __ _ 2   __ __ _______ i-Zi. Berkley Mitchell, bringing road tru ck to C. H . __ E. T. Mitchell, bringing mules to C. H. ___ - Standard Oil Co., Oil    __ _______ _ _______ ZZ B. M. Ferguson, repairing bridge -4 -- i __ __ I IZZI Everett Waddy C.o., w arrant book  ____ __ _____ __ __  __ I W. H. Brown, scraping ro a d s __ _ ___ _ ___ __ _ __ZZ T. R. Richardson, la b o r - ____ _______ ZZZ. W. N. Morris, grading road _ _ ________ D. E, Turnes, dragging road ___  ____ _ __ZZZ- Ed Jones, dragging road ______ _ ___ _____ _ _____ _ __ Hanry Ferguson, labor Willie Conner, labor Evans Ferguson, labor E. A. Covingtog, labor and team ___ teaac Gobble, labor and team -Zi-- Henry Covington, labor and team _ Calvin Rosser, labor John Lewis, laboir W, F. Ranson, cutting shade off road J. D. Morris ft Bro., garage rent _ Ed McPhillips, labor. Willie Hix, labor __ Wilson Hix, lumber Appomattox Motor Co., Ford Truck, less Chevrolet __ __  . Burke, one-third insurance premium _ _____ ZZ  l ZI J. A. Scalps. . R W. Smith, Clerk, to pay bounty o n __   _ ____ R. L Burke, County Treasurer, to cover bounty certificates paid by bim _ _ ___ __ __ __ ____ ____ _ 50.00"}, "highlight": {"text": {"matched_tokens": ["s", "R"], "snippet": "scraping ro a d <mark>s</mark> __ _ ___ _ ___ __ _ __ZZ T. <mark>R</mark>. Richardson, la b o"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "R"], "snippet": "scraping ro a d <mark>s</mark> __ _ ___ _ ___ __ _ __ZZ T. <mark>R</mark>. Richardson, la b o"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1592.89, 694.67, 1755.07, 940.9], "bbox_id": "72cbfb2256", "file": "AppomattoxNewspapers_1912-1915a_0061.pdf", "page": 1, "text": "Fruit Growers Convention. The Virginia State Horticultural So ciety will meet in the City Audi torium, Lynchburg, on January 8, 9 and 10. A preliminary program was made public showing the chief attrac tions of thb seventeenth annual con vention. The officers of the associa tion for this year are President, William À. Pratt, Staunton vice-presi dents, W. W. Sproul, Augusta County Ballard P. Huff, Roanoke T. N. Thompson, Harrisonburg S. S. Guer- rant, Franklin County C. P. McCue, Albemarle County, and H. F Byrd, Winchester treasurer, T. W. Woolen, Crozet director of exhibits, R. H. Clemer, Middlebrook secretary, Wal ter Whitely, Crozet. Among the sub jects to be discussed during the meet ing will he Co-operation in Market ing Fruit, Renovation of Old Orch ards, Grading and Packing of Fruit, Some Diseases of Fruit and many similar topics. In connection with the convention there will be held an ex tensivefruit exhibit."}, "highlight": {"text": {"matched_tokens": ["S", "Franklin"], "snippet": "N. Thompson, Harrisonburg S. <mark>S</mark>. Guer- rant, <mark>Franklin</mark> County C. P. McCue,"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Franklin"], "snippet": "N. Thompson, Harrisonburg S. <mark>S</mark>. Guer- rant, <mark>Franklin</mark> County C. P. McCue,"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2125.44, 1120.6, 2291.58, 1314.89], "bbox_id": "cd38c904b2", "file": "AppomattoxNewspapers_1955-1957a_0394.pdf", "page": 1, "text": "A Ruritaji Club has been organ ized at Evergreen, under the spon sorship of the ftmplin Ruriten Club, it was learned this week. The new club will meet on Fri day, January 18, a t 7 P. M. at the Evergreen School. D. W. Murphy District Governor for Appomattox District of Ruritan National, will be present to present the charter and install the officers. Allen E. Franklin will be pered- dent of the Evergreen Club. Other officers to be installed include John K. Hamilton, vice-president Aubrey Rbnson, treasurer, and Stewart R. Paulette, secretory. The board of directors consists of H. C. Staples, Glenn S. Mar tin and Davidi Garrett."}, "highlight": {"text": {"matched_tokens": ["treasurer", "R"], "snippet": "Hamilton, vice-president Aubrey Rbnson, <mark>treasurer</mark>, and Stewart <mark>R</mark>. Paulette, secretory. The board"}}, "highlights": [{"field": "text", "matched_tokens": ["treasurer", "R"], "snippet": "Hamilton, vice-president Aubrey Rbnson, <mark>treasurer</mark>, and Stewart <mark>R</mark>. Paulette, secretory. The board"}], "text_match": 2310390567965556857, "text_match_info": {"best_field_score": "2220487671808", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567965556857", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2232.25, 752.19, 2391.46, 976.26], "bbox_id": "c8918b8497", "file": "AppomattoxNewspapers_1892-1898a_0063.pdf", "page": 1, "text": "uibginia . 1 in tbe Circuit court of Appo mattox oounty. The Board of Supervisor of Appomattox oounty. AGAINST H. o. Shearer, late Treasurer of Appomat tox oounty. J. H. Franklin, H. B. Gilliam, Martha J. Franklin and W. w. s tat ham, ms sureties, and D. Mott Robertson. EXTRACT FROM DECREE AT THE DEC. TERM HI. On consideration whereof the court doth adjudge, order and decree that this oausebe ref erred to one of the commissioners of this oourt with directions to take, state and settle the account of tbe defendant, H.C. Shearer, as late Treasurer of Appomattox oounty, in so far aa the plaintiff is concerned therein, from the beginning of his term of oflioe, July 1st, 1887, until his removal therefrom  and ft is ordered that the mid H. C, Shearer do lay before said commissioner a full statement of bis transactions as suob Treasurer during bis term of olBoo, including all books and papers pertaining to his said office. EXTRACT FRO It DECREE ATTHl-JuNS TERM, !iS And It is ordered that the cause be referred to R. B. Poore, as a special commissioner, to take the accounts herein ordered. com h iss to Bits O f f ic e , I A ppomattox G. H., V a ., June 19,1888, f Notice is hereby given to the parties to this suit, that I have appointed July 22d, 1886, as the time and tee law office of H. D, Flood, at Appomattox 0. H., Va., as the place foa tee execution of thh said order of referenoe, and"}, "highlight": {"text": {"matched_tokens": ["Franklin", "s"], "snippet": "B. Gilliam, Martha J. <mark>Franklin</mark> and W. w. <mark>s</mark> tat ham, ms sureties,"}}, "highlights": [{"field": "text", "matched_tokens": ["Franklin", "s"], "snippet": "B. Gilliam, Martha J. <mark>Franklin</mark> and W. w. <mark>s</mark> tat ham, ms sureties,"}], "text_match": 2310390567831339129, "text_match_info": {"best_field_score": "2220487606272", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567831339129", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2399.52, 1368.88, 2564.26, 1695.83], "bbox_id": "5f56b22c70", "file": "AppomattoxNewspapers_1892-1898a_0065.pdf", "page": 1, "text": "it not concluded on that day it will be contin ued from time to time until completed.  ______ R. B. P oor , Comr. . H. D. F lood , p. q. Ju n en 4w. VIRGINIA  In the Circuit Court of Appo mattox oounty. . The County School Board of Appomattox county AOAIKST H. C. Shearer, late Treasurer of Appomattox countyjJ.B . Franklin, H.E GUllum Martha J. Franklin and W. W. Statbam, his sureties, and D. M. Robertson. XTRAOT FROM DECREE AT TUB D M S M B IS TERM, 1861. On consideration whereof the court doth Uudge, order and decree that this u se be referred to one of the commissioners of m - court with directions to take, state and settle the aooqunta of the defendant, H. C. Sheerer as late Treasurer of Appomattox oounty, in so far se the plaintiff is conoemed therein, flimmi dd Bmi H office, July and It  fore said commissioner a fuUlrtatement ot hie transactions as such Treasurer during his term of office. Including all books and papers pertaining to U s said office. XTRAOT FROM DEGREE AT THB JUN E TERM 80. And it is ordered that this u se be referred to R. B. Poore as a special commissioner to take the accounts ordered therein. C o M misbionbr  b Orrioa, 1 Appomattox C. H., Va., June 1871888. f Notice Is hereby given to the parties to tide lit, that I have appointed July Z8nd. 1898, as Sue time, and the law office of H. D. Flood, at Appomattox C. H., Va., as the plaoe forthe execution of the said order of reference, and, if not concluded on that day it will be contin ued from time to time until completed. R. B. P oore , Special Commissioner, i H. D. F lood , p. q. June Z2 4w. HARDY  HANCOCK, MILLING ENGINEERS A MILLWRIGHTS."}, "highlight": {"text": {"matched_tokens": ["Treasurer", "Franklin"], "snippet": "H. C. Shearer, late <mark>Treasurer</mark> of Appomattox countyjJ.B . <mark>Franklin</mark>, H.E GUllum Martha J."}}, "highlights": [{"field": "text", "matched_tokens": ["Treasurer", "Franklin"], "snippet": "H. C. Shearer, late <mark>Treasurer</mark> of Appomattox countyjJ.B . <mark>Franklin</mark>, H.E GUllum Martha J."}], "text_match": 2310390567831339129, "text_match_info": {"best_field_score": "2220487606272", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567831339129", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1317.34, 744.08, 1622.98, 1111.87], "bbox_id": "2214fa1bd1", "file": "AppomattoxNewspapers_1952-1954a_0481.pdf", "page": 1, "text": "Prospects are bright for the newrtl T. C. Roberts and son, War- year, according to reports given bySol Shipman spent Tuesday with leaders of the Seventh-day Adventist sisjter, Mrs. Lottie Bledsoe. Church at a business meeting held- Wednesday evening Jan. 20 crs. ! Irvin Moses and daughter, ente visited Mr. and Mrs. Spen- Garrett, Sr., Sunday. Review of church growth and ac tivities for the year of 1953 showed gains in many lines. rs George R. Kruer and Rolfe During the year members havenJCarrett visited Mrs. L. M. carried on a strong welfare proeal over the week-end. gram, Mrs. J. I. Brown, Dorcas leadi. .  , er reported. With the aid oAhe Wel-r f nd R SP  le and fare Center of Washington, they !1 0 Burkley  nd daughter, Lm- have been able to give well over?f gusts Jof Mr a.nd Mrs L 1,000 pieces of clothing, along withjH 63 Tuesday evening. many baskets of food to the needygjjjffind Mrs. Braxton Garrett, of of this area. Bid were week-end guests of Mrs. Brown, who is also servingnts, Mr. and Mrs. S. H. Gar- as church treasurer, in her review, of stewardship, expressed gratifies- tion for the faithfulness of members Marshall Martin received in giving tithes and mission offer- the death of her cousin, tags. These have amounted to  f  Tatum, of Sanford, N. C., 5,739.58, she reported, which is anlWY increase of 1,087.91 over 1952. t t Rebecca Babcock, of the Vir- Pastor William Carey reportedmaptist Traini School for that an order had been placed --- a ,, vr. 108 panes of cathedral stained glass  Babcock Sunday, to replace the present plain glasslj in the windows of the church, and.! Ella Hatcher, of Baltimore that plans were drawn for a bulletinoiding some time here with board to be erected in the front o ft and daughter-in-law, Mr. the church. MN. Clarence Franklin. While material growth is neces-Ji,. . . T 1 . .. sary, Pastor Carey told the group,1  ard  anatka  ,tin We are more interested in ad - 4. M!? Ferguson Carey of vancement made by every member. ,M  arey 13 a Patient"}, "highlight": {"text": {"matched_tokens": ["S", "treasurer"], "snippet": "servingnts, Mr. and Mrs. <mark>S</mark>. H. Gar- as church <mark>treasurer</mark>, in her review, of"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "treasurer"], "snippet": "servingnts, Mr. and Mrs. <mark>S</mark>. H. Gar- as church <mark>treasurer</mark>, in her review, of"}], "text_match": 2310390567697121401, "text_match_info": {"best_field_score": "2220487540736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567697121401", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [820.09, 404.06, 995.57, 932.64], "bbox_id": "10e48b8779", "file": "AppomattoxNewspapers_1952-1954a_0467.pdf", "page": 1, "text": "resigns as pastor of Beale Memor ial Presbyterian Church, Pamplin. May 5.- Play under way in Patrick Henry baseball league. May 5.- Town acquires baseball park. May 14.- Lions Club holds Ladies Night banquet. May 19.- Third District Confer ence of United Daughters of Con federacy held here. May 21.-Appomattox Garment Co. announces plans for enlarging their plant here. May 23.- Poppy Day. May 23.- County clubs observe National Home Demonstration Club Week. May 28.- A. H. S. close baseball season. May 28.- Softball league organized here. May 30.- Holliday Lake opens for season. June 1.- Miss Kate Franklin to re tire as music teacher. June 4.- New displays on exhibit at local Park Museum. June 9.- Town election. June 11 County Republicans hold mass meeting. June 18.- Jack Stratton named as State Farmer. June 19.- Bloomdbile visits Appo mattox. June 21.- New Hope Baptists dedi cate improvements to church. June 25.- Lawson Driscoll installs new Lions Club officers. June 25.- Appomattox Garment Co. holds  mid-year celebration. June 26.- Local leaders announce support of Thomas B. Stanley for Governor. Ju ly 2 R. L. Burke resigns as county treasurer, due to health. Ju ly 4.- Methodist Church leads softball league. Ju ly 5.- Community cannery open. Ju ly 8.- G. B. Buchanan appointed as new county treasurer . Ju ly 9.- Bids are asked on new"}, "highlight": {"text": {"matched_tokens": ["R", "treasurer"], "snippet": "Governor. Ju ly 2 <mark>R</mark>. L. Burke resigns as county <mark>treasurer</mark>, due to health. Ju"}}, "highlights": [{"field": "text", "matched_tokens": ["R", "treasurer"], "snippet": "Governor. Ju ly 2 <mark>R</mark>. L. Burke resigns as county <mark>treasurer</mark>, due to health. Ju"}], "text_match": 2310390567562903673, "text_match_info": {"best_field_score": "2220487475200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567562903673", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.99, 376.57, 2220.59, 810.22], "bbox_id": "41fecf1358", "file": "AppomattoxNewspapers_1912-1915a_0585.pdf", "page": 1, "text": "burbs of this town. Sergeant Franklin has been I rounding up the orap shooters  of this, town for the past two weeks. They are arraigned be-1 fore Mayor Peterson, who gives the usual fines whioh are at once collected or the alterna- young  tive whioh is tbe lock up. Booster Chautauqua came to I this town pn last Thursday and gave performances in the Jim Megginson pitched s o m e afternoon and at night ball in the last gamp, but theU bree day consecutively Steadfast boys had been so tendance good eveiy day completely conquered in the  all seemed to be pleased with  first game they gave out in t b e I the show. fifth with the score 15 to 5 W ildcats at the big end. Following is the line-up. WILDWAY Len Childers,  Tom Christian Jim Megginson Jim Childers Pollard Kinney Jud K inney Perry Cum by John Megginson Mosee Treasurer, A. T. Inge Con-1 j i m Lucado Eductor, H. M. Burge Warden, R.  Mann Inside Sentinel, T. R.  Hancock Outside Sentinel, 1. R. Packet Trastees, E. E. Gills, S. L. Ferguson, B. F. Oden."}, "highlight": {"text": {"matched_tokens": ["R", "S"], "snippet": "Hancock Outside Sentinel, 1. <mark>R</mark>. Packet Trastees, E. E. Gills, <mark>S</mark>. L. Ferguson, B. F."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "S"], "snippet": "Hancock Outside Sentinel, 1. <mark>R</mark>. Packet Trastees, E. E. Gills, <mark>S</mark>. L. Ferguson, B. F."}], "text_match": 2310390567562903673, "text_match_info": {"best_field_score": "2220487475200", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567562903673", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [381.1, 238.88, 573.33, 1554.2], "bbox_id": "2a490cafd1", "file": "AppomattoxNewspapers_1915-1918a_0119.pdf", "page": 1, "text": "man backbone of winter was broken cun hardly boast of his prophetic kei. Yes it was cold in Farmville sever tl days in mid February, but wbon the no ceased to fall the su i shone oat be.ufifnl and v right. Fine weather for folks witb wirm hearth stones one of whom .  am, I hare heard of no particular suffer-! ing in town, though I fear we haJ our nil share of isQn one of the cold days the newlea cream parlor opened its doors and cold as it wai the devotees of the frozen foods an i cold drinks were there The rule in Farmville for Snndu sappers is to nave them cold, bn last Snndey I was guest in a bme v  for sapper where the rale doesnt hold good. 1 knew nothing of tl is until I went to the tsble, end in agiue my surpriee when I sat front of a faultless loaf of pipin hot aallylnnd and as ompa ions . there was a turkey hash also steam lug hot, beef tongue, crisp celery atrong coffee, w th milk and fre butter. Now let sohiC dyspeotic who oant ea a square meal accuse me again of bei  oo fond of table lmruree. Not o fond bnt jus fond enough. When dark tobacco sells to 22.60 as it dirlon this market one  . day last week it would indicate that  .y the weed was coming into its own   What  about bright? I simply  . dont know and no one tolls me. thought the brighrs were used prin- l cipally in this country and that the 4 foreign war would in no wise inter  rupt tbs demand for them.  The dispensary bill not yet passed bnt Farmville is ready for the ohange. in the meantime demand is made for change in the charter s that Commissioner of the Bevenue and Treasurer be chosen by popular i vote and not appointed by the Conn-   oil. Bov. Robertson must have been gratitiedon the seoo d Sunday in  the now pnlpit to hove bad a largt congregation thougn the day was  stormy and oold. Mr. B H Panlett has been cboBen to fill the vacancy ou the town Conn oil occasioned by the death f M j, Martin. A practical and successful business man who will make an . ideal cflhial.    Courtney Franklin was in town  today and boasted of a Pamplin dinner made up of jole, turnip salad mid poached egga, and said whih- tha dinner was being served, to the good housekeeper, If Bob Berkley was here to enjoy this dinner witb na,he would devote pages describ ing it. The  difference between .Courtney and me is that while 1 mignt have written three pape.- praising the diuner Courtney would have eaten three times as mnob. He has my congratulations, how tl aver, for I know hr.w they cook at Pamplinalmost as scientifically as .. they do at Farmville.  It is said that Mr. 6. M. Robeson, now obe of the leading and most successful business men in town, ibonbfterbeginning business bere lost all by fire eaoept a pilr of eorap iron, and looking at it, said  Wed, I came to Farmville with none of this worldll goods aud now have a pile of iron. Optimism of finest sort and such men reoognize to suob word as failure Bo far, Capt. Paulett has no op- , position ipr th Mayoralty aul I hope he will have nore. I am anx ious to see the  Old Jteb honored by a unanimous vote. My attention was called to a let . ter today written in 1787 by a man convicted to a Prtnde Edward court aud sentenced to die on the gallows, and addressed to hie family just bc- . fore hiB death hoar. I hope to get t a copy of the letter and make it public. I never knew that the death I r penalty was inflioted in this State for horse stealing, in Texas they hang for that crime and not for the murder of a human being. Farmville has been wonderfully blessed on health lines of late. A  few cases of grippe but fur from an epidemio and no pneumonia so far M l am advised. I dont know which I would pre fer to lay aspring hat or an icecream cone."}, "highlight": {"text": {"matched_tokens": ["s", "Treasurer"], "snippet": "change in the charter <mark>s</mark> that Commissioner of the Bevenue and <mark>Treasurer</mark> be chosen by popular"}}, "highlights": [{"field": "text", "matched_tokens": ["s", "Treasurer"], "snippet": "change in the charter <mark>s</mark> that Commissioner of the Bevenue and <mark>Treasurer</mark> be chosen by popular"}], "text_match": 2310390567428685945, "text_match_info": {"best_field_score": "2220487409664", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567428685945", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.1, 1008.25, 2058.12, 1305.08], "bbox_id": "89937b2560", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "County surveyor w ie A. S. Swan.  Chrbtian. the grandfather of local Treasurer for the county was J. F. dtissn, Chesley Christian and the W  rA im tj finwiintirfnnir e t father of the late Dr. David Christian, Revenue was George W. Abbitt, who Sr. H.T. Parish, R B . Poore and C. H. incidently, was the grandfather of Sackett. several Appomattox redden ts. Retired If you happened to be. livmg in the Congressman Watkins M. Abbitt, community of Evergreen in 1688 you H erbert M. A bbitt, pharm acist, had only a short walk to a law Retired Judge George F. Abbitt, Jr. office.....the attorney was J.P.L . and Mrs. Dora Abbitt Conner.  Fleshman located there in the village. In 1888 Appdlnattox County Pamplin City had not one, but two Commonwealths Attorney was W. C. law offices. One was that of W. C. Franklin. Franklin, also the County Common- As it is today, three, county wealth Attorney. The second Pamplin supervisors made up the governing attorney w asE .R Woodson. body for the county. They were William B. Tinsley wad an attorney Wflfiam A. White, Chairman D. R with an office in Mineral, community in Marshall and H. E. Gilliam. the area known today as Bent Creek. There was no shortage of attorneys If you lived in Tower HOI community in Appomattox bad in 1888. Attorney the lawyer to see was T. J. Thornhill. T.S.Bocoek had iris law office set up m There were no automobile dealer- the community of Tower Hfll which is ships back in 1888 but plenty of coach near what is today Routes 60 and864. and wagonmakers. Stephen Beasley Appomattox Court House had four was the man to see for a new coach or law offices. One attorney was D. A. wagon if you lived in Tower HilL E. E. Chism and W.W. Ragland were coach A a fi f  and wagon m ake in Evergreen. J.W.  Clark, Samud Davis and Z. Taylor in"}, "highlight": {"text": {"matched_tokens": ["S", "Treasurer"], "snippet": "surveyor w ie A. <mark>S</mark>. Swan.  Chrbtian. the grandfather of local <mark>Treasurer</mark> for the county was"}}, "highlights": [{"field": "text", "matched_tokens": ["S", "Treasurer"], "snippet": "surveyor w ie A. <mark>S</mark>. Swan.  Chrbtian. the grandfather of local <mark>Treasurer</mark> for the county was"}], "text_match": 2310390567428685945, "text_match_info": {"best_field_score": "2220487409664", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567428685945", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1760.13, 839.54, 1924.25, 1773.83], "bbox_id": "bc41b9a357", "file": "AppomattoxNewspapers_1902-1905a_0133.pdf", "page": 1, "text": "Mrs. Wiles, wife o f Bud Wiles, a former fireman, now employed as stevedore, lost her life in a disastrous fire at Norfolk. She was a seamstress of grain bags in the third floor of Jesse Jones  Sons hay and grain.warehouse, on Roanoke dock, which was burned at 2 oclock. There were two adjoining houses filled with hay. The fire caught and burned so quickly that the entire stock was in flames before the Fire De partment arrived. Mrs. Wiles appeared at a window and was ordered to jump into the arms of the men beneath. She hesitated, screamed and fell back into the hay and was suffocated and fatally burned before the firemen could put up their ladders to reach her. The Association of Surgeons of the Southern Railway closed its three-day convention at Old Point Comfort. There were 100 persons present, many of whom were accompanied by their wives and children, The following officers were elected President Dr. R. L. Payne. Norfolk, Va. Vice-Presidents Dr. J. S. Voyles, Cornith, Miss. -, Dr. C. P Martin, Russellville, Ala. Secretary and Treasurer Dr. J. J. Harrison, Lou doun, Tenn. Member of Executive Committee Dr. Rhett Goode, Mobile Ala. Honorary Members Dr. F. W. McRehy, Atlanta. Ga.  Dr. E. Franklin Smith, New York city. Mrs. Kate E. Blakemore, wife of J. H. Blakemore, died at her home in Roanoke, aged 67 years, after an illness of several months with dropsy. Besides her husband, she is survived by one son, C. H. Blakemore, of the Norfolk and Western offices three sisters Mrs. E. C. Haynes, Mrs. M. A. Staley, Mis? Mittie Pollard and one brother. R. A Pollard, all of Roanoke. John M. Pol lard, of Sedalia, Mo., is another brother James W. Doran, a prominent farm er of Clarke county, died from sun stroke while operating a binder in the harvest field. He was 65 years of age and leaves a widow and two children During the Civil War he served in the Confederate army in the Clarke Cav alry. and was captured and imprisoned at Washington. Vernon Nash, flagman for W. J Oliver  Co.,contractors for the double fracking of the Southern Railway, wai struck by a train and killed near Rapi dan Station. Mr. Nash resided at Elk- wood, Culpeper county. The cause o the accident is not explained. George Thompson, of Tye River, charged with illicit distilling, was sen on to the United States Court at Lynch burg by Commissioner Meredith, whe conducted the triât at Staunton. Capt. J. C. Featherston, mcr ber oi the House of Delegates from Campbel county, announced in Lynchburg that owing to pressure of private business he will not be a candidate for re-elcc tion. Leesburg school trustees have elected as teachers principal, Mr. Joseph Carr first assistant, Miss Virginia Taylor, second, Miss Mercy Crim third, Miss Lizzie Bennett fourth. Miss Elli Haupt  primary department, Miss Lizzie Lewis. A Blackstone business man,. Mr. J. S Robertson, who lays acquired consider able property will, it is stated, leave soon for Zion City, 111 ., where he will make his home, taking his family wilt him. He has leased his property ir Blackstone for a term of years. Mr Robertson is a follower of Dowie, who claims to be tbe second Elijah. Luther Taylor, a pudc-ler at the Belle Isle Iron Works, was shot and fatally wounded while attempting to cscapi after he had been placed under arrest by a soldier. He was carried from Manchester, where the shooting tool place, to a hospital and died soon afte A Boston expert, Mr. McLaughlin, is building stretches of model road a. Warrenton. At Ocean View new bathhouses have been put up and fresh paint and flow ers are everywhere in evidence. Warrenton amateurs have dramatized Mrs. W iggs of the Cabbage Patch, and will soon present the play at a ben efit performance for charity. Mr. John H. Rowell, of Richmond who has been studying music in Vienn? under Dr. Leschiisky all winter, has returned home. J Tom D r vis, colored, was drowned while bathing inthe Notooway river, near O ism n. J"}, "highlight": {"text": {"matched_tokens": ["R", "S"], "snippet": "were elected President Dr. <mark>R</mark>. L. Payne. Norfolk, Va. Vice-Presidents Dr. J. <mark>S</mark>. Voyles, Cornith, Miss. -, Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "S"], "snippet": "were elected President Dr. <mark>R</mark>. L. Payne. Norfolk, Va. Vice-Presidents Dr. J. <mark>S</mark>. Voyles, Cornith, Miss. -, Dr."}], "text_match": 2310390567294468217, "text_match_info": {"best_field_score": "2220487344128", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567294468217", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [166.78, 715.31, 597.6, 1231.24], "bbox_id": "d0606f6597", "file": "TimesVirginian_1978_0559.pdf", "page": 1, "text": "The Sanctuary Choir and Youth Fellowship of Memorial Unit- d Methodist Church will present Wonderous Love, a Moun- ain Choral Drama of the Nativity, on Sunday, December 17, at p.m. in the church sanctuary. fjd r. Roy Moon is narrator. The public is cordially invited to st and awards were given to those who excelled in Kit and Kakooda sales. Our top seller, with 372.00 was June Harris. She will receive a 50.00 savings The Ladies Aid of the Zion bond, a night at Pizza Hut, Baptist Church meet Sunday at FBLA Key Chain, seasonal 2 p.m. with Deacon and Mrs. basketball tickets or jewelry. Ross Edwards. Mrs. G. W. Each m e m b e r is to be Wiggin president, presiding Mrs. Magnolia Franklin recor- am o u nto dto 10,000 with a ding secretary, Mrs. E tta profit of 4,800. Juanita Patter- Edwards was charge of the on, treasurer of our chapter devotions. The minutes read, was selected as FBLA member received and adopted. Roll for the month of December, called. The offering was very Tentative plans are also being good. The president made a made fra the March of Dimes report our bus outing for our DMce-a-Thon on Feb. 24. The  U t T te U d h . Aid w o to - Ur ted Mra. B w tara fUddiff our chairman for our Christmas baskets for our sick and shut in. j _  Mrs. Jane Byrd, Mrs. Susie E p lS C tfg p a l L a d i e s Hunter, Mrs. Nannie Johnson y  Thanks on the same committees. The J Ladies Aid exchanged Christ mas gifts. Each members The Episcopal Church received nice gifts. Rev. L. E.  Women of St. Annes Church in Hankins was present and gave Appomattox Quads everyone some helpful remarks at the 0,1 1 Saturday, December 2. It was a  s e of the meeting. Mrs. huge success and lots of fun. Edward served a delicious The winners of the raizes fra Christmas dinner. Our meeting their rfnnaions were Doll adjourned to meet with Mrs. House won by Jim Seay, the Alma Robertson for January in quilt was won by H. W. Coleman our meeting. Mrs. G. W. and the train went to Mrs. Wiggins had a Bible Christmas Emily Brake, quiz which everyone enjoyed. Mrs. Mildred Wheeler con tinues sick in the Virginia Hospital. We are praying for our sick everywhere. You are cordially invited to attend regular preaching service at the Zion B aptist Church"}, "highlight": {"text": {"matched_tokens": ["r", "Franklin"], "snippet": "e m b e <mark>r</mark> is to be Wiggin president, presiding Mrs. Magnolia <mark>Franklin</mark> recor- am o u"}}, "highlights": [{"field": "text", "matched_tokens": ["r", "Franklin"], "snippet": "e m b e <mark>r</mark> is to be Wiggin president, presiding Mrs. Magnolia <mark>Franklin</mark> recor- am o u"}], "text_match": 2310390567160250489, "text_match_info": {"best_field_score": "2220487278592", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567160250489", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1512.4, 1478.49, 1678.5, 1765.24], "bbox_id": "374898b0b3", "file": "AppomattoxNewspapers_1939-1943a_0477.pdf", "page": 1, "text": "The drive of the United Service Organizations in Appomattox Coun ty has gone over the top, it was announced today by C. T. Moses, fund chairman and Barry Dahl, treasurer. The county qouta was 600. A list of contributors follows- Central church, 10.00 .Spout Spring Bapt. ch,. 30.14 Hebron Baptist ch., 36.00 . Pamplin Meth. ch., 37.10 Evergreen Meth. ch., 25.00 Piney Ridge Meth. ch., 8.6 6 Mt. Comfort Meth. ch., 3600 Appomattox Preshy. ch., 17.00 History Class, 1.07 Appomattox Hdwe. Co., 10.00 R. B. Haley, 5.00 J. C. Hudgins, 2.00 John Marshall, Reedy Spgs., 1.00 Mr. and Mrs. Walker Franklin 1.00 A friend, 1.00 Edna Chernault, 1.00 Eleanor Carson, 1.00 R. W. Stanley, 1.00 T. M. Trent, 1.00 Chas. S. Martin, 1.00 J. J. Morris, 1.00 Mr. and Mrs. John Taylor, 5.00 R. B. Bondurant, 1.00. R. M. Mann, 1.00"}, "highlight": {"text": {"matched_tokens": ["R", "S"], "snippet": "1.00 Eleanor Carson, 1.00 <mark>R</mark>. W. Stanley, 1.00 T. M. Trent, 1.00 Chas. <mark>S</mark>. Martin, 1.00 J. J."}}, "highlights": [{"field": "text", "matched_tokens": ["R", "S"], "snippet": "1.00 Eleanor Carson, 1.00 <mark>R</mark>. W. Stanley, 1.00 T. M. Trent, 1.00 Chas. <mark>S</mark>. Martin, 1.00 J. J."}], "text_match": 2310390567160250489, "text_match_info": {"best_field_score": "2220487278592", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567160250489", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2115.61, 303.85, 2279.5, 1793.6], "bbox_id": "1c3c1b2803", "file": "AppomattoxNewspapers_1905-1912a_0016.pdf", "page": 1, "text": "Unique plans for providing for James town Exposition visitors were presented at Norfolk. One calls for a hotel at Se wells Point that will be built like a large steamer with accommodations for upward of 500 persons. The other plan calls for a hotel to be erected over the water to be connected with the shore by a large j pier. The plan provides for a steamer I landing directly at the hotel pier. President Harry St. George Tucker, of Ihe Jamestown Exposition Company, is in Washington conferring with the Secre- lary of War, the Navy and the Treasury, who are to lact as the representatives of ihe Government in the arrangement of the exhibits and for the expenditure of the money. He is preparing passports and credentials also for a trip to Europe in the interest of the celebration. The Farmville and Powhatan railroad has been purchased by the Tidewater nd Western and the telegraph lines i thing the road have come undeT the con tri 1 of the Postal Company. The United States Leather Company, which recently purchased the tannery at Moorefield of Cover  Drayton, is ar ranging to spend 50,000 in improve ments. The company will install its own. lighting plant and will also light the town of Moorefield. Large sums will probably he spent on improvements at the tanner ies at Narrows, Giles County, Va., Lost City and Capon Bridge. Dr. William H. Taylor, State chemist ind coroner, stated that the deaths of doth the children of Mrs. Edward Per rins were caused by phosphorous poison ing. This statement was made after care ful and scientific analysis of the stomachs of the two children, William, aged 2, and Octavia, aged 5. The coroner did not itate his belief that the children were murdered, but those present drew their awn conclusions, and their belief is that the poison was administered by some one ret unknown. The -trial is before a jury Df six, and the coroners statement con- terning the case was intensely interesting. Levi T. F. Grim, 86 years old, died at bis home in Winchester. Mr. Grim was born in Washington County, Md., and came to Winchester with his father, the late Samuel Grim, when 16 years old. For many years he was hotel-keeper here, having been the proprietor of Grims tav ern, famed all over Virginia a decade ago. He served two terms as treasurer of Winchester, and was for several years a member of the city council. Mr. Grim leaves three daughters Mrs. George Haymaker and Mrs. A. M. Zirkle, of Winchester, and Mrs. John Shearer, of Philadelphia and four sons Lee R. Grim, cashier of the Union Bank William E., Thomas F. and Frank L. Grim, all of Winchester. James McCormick, a io-year-old boy, abtained a verdict in the Court of Law ind Chancery, Norfolk, against the Nor folk and Atlantic Terminal Railway Company for 10,000. He was thrown or fell from a car on July 4 coming from Pine Beach. His right leg and two fin gers of his right hand were cut off by the wheels of the car. He was picked up unconscious and supposed to be dead, but recovered at the hospital. He uses two crutches now. Attorneys for the railway moved for a new trial. The police of Manchester think they have in Bob Pusick, whom they have arrested, the Captain Kidd of the So ciety of Yachting Pirates, charged with looting summer estates, clubhouses, etc., an Long Island Sound. Pusick gives his occupation as automobile and1 motorboat repairer. The police believe he is Jack- son, leader of the gang, who is supposed to have fled South. The faculty and literary societies of the University of Virginia have invited Secretary Root to deliver an address at the universary on February 22. Presi dent Alderman has gone to Washington to carry the invitation. The Virginia Daughters of the Amer ican Revolution assembled at Roanoke in ninth annual convention, with 50 dele gates present, representing all sections of the state. Mrs. Eleanor S. Washing ton Howard, of Alexandria, state regent, presided, and read her annual report, which showed gratifying gains. There have been three new chapters organized during the last year and 97 new mem bers added. Mrs. Hartón, wife of William D. Har tón, of Richmond, surprised a burglar in her chamber on an upper floor of the house, and put him to fight. Mrs. Har tón was entertaining several lady friends in the sitting room, and hearing a stealthy tread overhead, went to inves tigate. The man declared that he had been sent upstairs by a gentleman to get a shirt. Knowing that there was no man in the house, Mrs. Hartón recog nized that she had to deal with a bur glar, and picking up a broom she hurled it -at the man and at the same time screamed for help. The burglar made his escape through the back door. Considerable interest was manifested in the annual meeting of the stockhold ers of the Chesapeake and Ohio Railway at Richmond under the belief that ac tion would be taken increasing divi dends. The question did not come up, however, and the only business trans acted was the re-election of the old board of directors. Chauncey M. Depew Is among -the number. J. C. Ctitchin, of Franklin, was ar rested there on the charge of swindling merchants of Norfolk to the extent of 1,100 by forged checks on the bank in Franklin in the name of his uncle, C. J. Cutchin. He bought jewelry and other articles, it is charged, and sent them to a confederate there. The first checks he gave were paid because the bank did not detect the supposed forgery. The Old Dominion Boat Club, of Alexandria, has arranged for the en largement and remodeling of its boat house. James Pruitt, the 14-year-old son. of John C. Pruitt, of Danville, fell beneath ihe wheels of a moving train in the vicinity of the Riverside Cotton Mills, ind was killed. Young Pruitt and some ither boys were riding on cars being moved from the yard hy a shifting en gine, when he struck a post at the gate o the cotton mill yards and was thrown under the wheels. The body was man gled and death was instantaneous. The ody was viewed by a coroners! jury, ju-t no verdict has yet been rendered.  Ground was broken at Lynchburg for he erection of a new 70.000 Young Mens Christian Association building. Rev. James W. Morris, of Leesburg, ías been called to the redórate of Christ Church, Norfolk, recently left by Rev. Carl C. Grammernow of Philadelphia, ind will likely accept. The salary is 3.000 and manse. The Alexandria Water Company has laid a 12-inch main from its works at Mount Cameron to the new depot to supply water for the railroads. Mr. Julian W. Robey, of Staffer! county, fell from the gable roof of  second-story dwelling, on which he wa working, but escaped serious injury. Hi was badly bruised, but no bones wen broken."}, "highlight": {"text": {"matched_tokens": ["treasurer"], "snippet": "served two terms as <mark>treasurer</mark> of Winchester, and was"}}, "highlights": [{"field": "text", "matched_tokens": ["treasurer"], "snippet": "served two terms as <mark>treasurer</mark> of Winchester, and was"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.6, 736.48, 1845.41, 1755.92], "bbox_id": "e14340e041", "file": "AppomattoxNewspapers_1939-1943a_0404.pdf", "page": 1, "text": "The War Fund Campaign of the American Red Cross in Appomattox county to reach a county quota of 1,500 and a goal of 2,000 entered the home stretch this week, with nearly vl,000 already turned in, and -ural stions of the county working o bri g in their reports of funds. As of ast night, the fund treasurer, Calvin H. Robinson, reported that 962.77 had been turned in and in- iic- tions were that when the rural ..ommunities and Junior Rel Cross funds in hand were reported, the otal would approach 1,200. The county quota, assigned by the Am erican National Red Cross in its stupendous effort to raise a special War Fund of no less chan fifty mil lion dollars. County Fund Chairman, the Rev. H. Frederick Jones, has expressed the urgent request that workers and solocitors press their campaign in an effort to reach the quota and the goal by the middle of this month. Chairman Jones has set an example for his co-workers by his nergetic management of the War Fund campaign, and equal work on he part of the other town workers and those sooliciting in the commun ities and rural areas of Appomaitcx will guaranttee success. The American Red Cross needs every penny of the fifty millons re quested of the American people, so lift it can purcahse needed supplies and stand in readiness to uphold its glorious tradition of service to suf fering humanity. Calls upon the Red Cross will inmrease with each pass ing hour in Americas greatest cri sis, and the plea of the organiza-  ion is that the American people, out if the greatness of their 30U i, give the necessary funds. If you have not already given your bit bring or send or mail ycur contribution today to Kev. H. Frederick Jones, Chairman, Appo mattox, Va., or to War Fund Treas urer Calvin H. Robinson, Appomat, tox, Va. Gifts to date Mrs. J . F . Harvey, 2.00 Mrs. L. H. Ould 1.00 Larrie Young, 5.00 Herbert C. Pulliam 25.00 Mrs. Olive McDearmon 2.00 W. J. LeGrand 3.00 Mary Jane Cole 1.00 Mrs. Pete Johnson 1.00 Mrs. W. J. LeGrand 1.00 Walter Hunter LeGrand 1.00 Central Baptist Church 20.75 Evergreen Baptist church 31.00 A Friend 5.02 Mrs. F . T . Cawthorn 1.00 Alfred Price 1.00 Constance Fulp 1.00 Mrs. Don Moses 1.00 Following from state highway workers O. R. Turnes 1.00 E. V. Hammersley 1.00 P. SI. Burton 2.50 Mrs W. D. Morris 1.00 Miss Rachel Harvey 1.00 M. A. Stanley 2.00 R. N. Ashworth 2.00 W. W. Carter 2.00 W.H. Conner 2.00 Wesley A. Martin 2.00 C. D. Carson 1.00 Walker Garrett 1.00 R. Lee Burks 2.00 Thomas A. Dos 1.00 Emmett Day 1.00 W.H. Stanley 2.00 Walker Mayberry 1.00 J . P . Harvey 2.00 Edward Ranson 2.00 Hunter Jamerson 1.00 E. T. Layne 2.00 J. S. Guill 2.00 B. S. Carter 1.00 Jim Reed 2.00 J . L . Pankey 2.00 Albert Ferguson 1.50 Wilson Almond 1.50 Russell Greshaw, 1.00 Ned Stanley 1.00 Twyman Baldwin 1.00 J. B. Ferguson 1.00 Richard Franklin 1.00 Homer Lucado 1.00 G. H . Ranson 1.00 W. E. Bradshaw 2.00 Total for local state highway- workers, 51.50"}, "highlight": {"text": {"matched_tokens": ["treasurer"], "snippet": "ast night, the fund <mark>treasurer</mark>, Calvin H. Robinson, reported"}}, "highlights": [{"field": "text", "matched_tokens": ["treasurer"], "snippet": "ast night, the fund <mark>treasurer</mark>, Calvin H. Robinson, reported"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [905.5, 258.03, 1055.22, 1091.04], "bbox_id": "1d2b11dc73", "file": "AppomattoxNewspapers_1971-1973a_0052.pdf", "page": 1, "text": "The Lynchburg Teachers A s-  sociation at its first meeting of the academic year announced plans for projects for the com ing year. The ten piano ensem ble concert at E . C. Glass on April 21 will be a highlight of the year. M rs. J . Franklin Vau ghan, president of the Associa tion announced that honored guest for the concert would be the State convention delegates of the Virginia Federation of mus ic clubs. D istrict IV will be hosting the convention and the Lynchburg Music Teachers As sociation will entertain the con vention delegates with a re  ception following the concert. Approximately 350 students will participate. The officers of the assoica- tion are P res. M rs. J . Frank lin Vaughan, Vice P res. Sister St. Ilene, Recording Sect. M rs. Joyce Creasy, Acting Sect. M rs. Peter L ascell, Corresponding Sect., M iss M argaret Cheath am, Treasurer, M rs. Paul Mun- ro, Keynote Club SponsorsM rs. J o a n Timmons, M rs. V i o l e t Teass, M rs. Betty M i l i n e r , Mrs. Shirley Wood, M rs. Gert rude Cooney, and M rs. Robert Bailey Young Musician Club sponsors M rs. Anne Johnson, Mrs. Archer Summerson, M rs. Paul Munro, M iss Margaret Cheatham. Selecting of music for the concert has been com pleted by the following com mittee, Mrs. C. Edward Vest, Mrs. Ann L ascell, M rs. Homer Widener, M rs. Paul Munro and M iss Margaret Cheatham. Members of the Keynote and Young Musician Clubs will be eligible to play in the Federa tion festival in the spring. Ly nchburg will also have a Nat ional Guild Audition center this year and students will be en couraged to participate and re  ceive a rating from an out of state judge. Program s for the c o m i n g I year will place emphsis on the Ensemble, the Festival, the au ditions and special Federation projects. Attending the board meeting of the VFMC this past week as representative of the Lynchburg Music Teachers A s s o c i a t i o n were M rs. Archer Summerson, M rs. C. E . Vest, and M rs. Anne Johnson. The Lynchburg Music Teach e rs present and ensemble pro gram for students every two years and this will be the sixth such concert. Appomattox Primary PTA Meets"}, "highlight": {"text": {"matched_tokens": ["s"], "snippet": "The Lynchburg Teachers A <mark>s</mark>-  sociation at its first"}}, "highlights": [{"field": "text", "matched_tokens": ["s"], "snippet": "The Lynchburg Teachers A <mark>s</mark>-  sociation at its first"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [139.88, 291.03, 272.03, 1297.48], "bbox_id": "0f61c317af", "file": "TimesVirginian_1980a_0102.pdf", "page": 1, "text": "spring is here. The Pastors Aid met March 19 .at T.p.m. in the hoihe of Mr. and Mrs. Bernard Wesley. The meeting was called to .rider by Mrs. Susie Hunter. Mr. Frank John son recorded the minutes. .Mrs. Nannie Johnson, our chaplain, was in charge of devotion. Tim secre tary and treasurer made their report. Mr. Robert Jennings is treasurer. The Pastors ASÉfa giving the pystor a special gift for his jM d iy . The Men of the club were appointed for 6ur entertainment commit tee for fund raising.The pasto r Aid Club was Tnvifed to Mt. Pleasants Pastors Aid Clubs second auiivérsary. The other business was well taken ,o  p of. Our meeting aranirned to meet in June.  S pie Senior Usher Board rtjiet Sunday at 11 a.m. The vice president, Miss Bar- bàia Hunter, called the meMing to order. Mrs. Nannie. Johnson recorded tbé minutes. Mr. Waverly Gray was in charge of the devotion. The minutes weft read, received and adwted. The roll was calfed and dues were jtkRdn. Mrs. Barbara Wes ley was appointed as our chairman for the entertain- ment committee to raise money. Mrs. Susie Hunter was appointed our chair man for otir anniversary far the Usher Board. The other old business was taken care of until the next meeting. The secretary rtteived several letters from other usher boards. Afterwards, we adjourned to meet next month. Mrs. Magnolia Franklin is so pleased that she can now walk with two canes. She has been wondering what would have been the results if God. wasnt near. I want everyone to know heis not dead.. 1 The Franklins received news that Mrs. Eunice Franklin Jones has lost her husband. His funeral will ba ea MsaiByil6iiVbungs- -town, GHdfgfrr Y sbii i teAf The FrairtdtAs gufek In the homes were Rev. and Mrs. Johnny Paige, Madi son Heights Mr. and Mrs. Lèidy Gray, of Brookyln, . N.Y. Mrs. Detiene Colmali Chisolm, of Brooklyn, N.Y. and Mrs. Mary Scout Mrs. Franklin was so happy that D ca Charles M. Franklin spent a few days with them recently. Mrs. Susie Hunter and Barbara and Mr. Frank Johnson attended thè second anniversary of the Pastors Aid at .the Mt. Pleasant Church in Hix- burg Sunday at 3 p.m. Rev. Mack Johnson was guest speaker. We are praying for the sick and shut-in.  Qur sympathy goes out to the Rich a dson family in the loss oi their loved one, Mr. Bernard Richardson Mr. Leonard Jennings, of North Carolina, visited his parents, Mr. and Mrs. Harry Jennings, over the week end."}, "highlight": {"text": {"matched_tokens": ["treasurer"], "snippet": "Tim secre tary and <mark>treasurer</mark> made their report. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["treasurer"], "snippet": "Tim secre tary and <mark>treasurer</mark> made their report. Mr."}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1323.11, 742.11, 1622.76, 1139.7], "bbox_id": "866f79c2b6", "file": "AppomattoxNewspapers_1952-1954a_0482.pdf", "page": 1, "text": "Prospects are bright for the neJRl C. Roberts and son, War- year, according to reports given lnOShipman spent Tuesday with leaders of the Seventh-day Adventisllllfe1 Mrs. Lottie Bledsoe. Church at a business meeting helR, .  . . , - Wednesday evening Jan. 20 . B  rvm. and n,daU??lter Review of church growth and ,1 V  T MrS Spen sho jlarrett, Sr., Sunday. tivities for the year of 1953 gains in many lines. iGeorge R. Kruer and Rolfe During the year members havi-i Garrett visited Mrs. L. M. carried on a strong welfare proJver the week-end. gram, Mrs. J. I. Brown, Dorcas lead s ,  . , er reported. With the aid ofthe Weli f nd  rs Spiggle and fare Center of Washington thews urey and daughter, Lin- have been able to give well oveB guest3 of Mr a.nd Mrs- L- 1,000 pieces of clothing, along wit Tuesday evening. mdny baskets of food to the needBnd Mrs. Braxton Garrett, of kis area. send were week-end guests of Mrs. Brown who is also sorvfysBnfc m - m . c ix n , w  v    e H   i l b O y l U l t a l i U i U l o ,  J . A A , as church treasurer, in her reviesH of stewardship,- expressed gratificafl tion for the faithfulness of member Marshall Martin received in giving tithes and mission offer-ftt the death of her cousin, ings. These have amounted t w Tatum, of Sanford, N. C., 5,739.58, she reported, which is arS- increase of 187.91 over 152. Miebecca Babcock, of the Vir- Pastor William Carey reporteM, tist Training School for that an order had been placed fo rJ  sited her t Mr. and 108 panes of cathedral stained g a s  A. Babcock Sunday, to replace the present plain glass in the windows of the church, anddjElla Hatcher, of Baltimore that plans were drawn for a bulletiianding some time here with board to be erected in the front oto and daughter-in-law, Mr. the church. Hs. Clarence Franklin. While material growth is neces sary, Pastor Carey told the group, We are more interested in ad vancement made by every membei in personal spiritual growth and fail in God. It is believed that there ii evidence of such progress, he said."}, "highlight": {"text": {"matched_tokens": ["R"], "snippet": "in many lines. iGeorge <mark>R</mark>. Kruer and Rolfe During"}}, "highlights": [{"field": "text", "matched_tokens": ["R"], "snippet": "in many lines. iGeorge <mark>R</mark>. Kruer and Rolfe During"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1406.39, 1051.72, 1785.97, 1358.62], "bbox_id": "d9926f2be0", "file": "AppomattoxNewspapers_1912-1915a_0323.pdf", "page": 1, "text": "postotfioe I Considerable une sineftS was oc-1 b . G. Anderson, Chairnaan. postothoeCft8jonej J,ere agt wee by thd ap - Department E. Domestifc Science and I tb-K. w. arince Of a mad dog, hailing Art-Mrs. D. E. CaJdwelU Mbs Emma i atari at vnl i t a    I Smith Mrs M. C. Smith Mrs Anna I - from the Pmey Monntain h Feath ton Mrs. S. L. Ferguson, Mrs. triet ijiu. I borbood. The dog bit a calf on 1 Robert Irby, Mrs. H. C. Babcock, Mix. I 9 ial I the farm of Mr. Danins and several j . jj . Robertson, Mrs. G. E. Peterson, poitofliot I 0gg a that seo ion and some in  alias Kate Franklin, Mis Clam Ford, I BAifre. I this town. Finally the dog was I Miss Eliza Anderson, Mrs. C. J., I kUled and his head shipped to Paa- tear Institute, Richmond, from which no report has ever been I Department F. S ch o o ls M iss Alice I made. In the meantime tbe calf Hubbard, Chairman Misses Fennel had rabbies and was killed, and ex-1Crawley. May Walton, Mattie MoefoNan-1 poKd dogs are tied oK od close U  FW , Sdlj. H oM s-dch otter, w.tob iskept on oil strsoge doH.    1 i ------  t ------ ------------   F a ir A ssociation R ep o rt. Car bright clover bay cheap a t he Appomattox Fair Aaaocia- L E. 8miths 318 3t adv.  tjon held a meeting on Friday Pnrdnm Jaldwell are offering  uight, March 20th, 1914 for tbe a special disconnt on dry goods and j prpoae of reporting on last year, I shoes for cash. adv-2t  worjj ftnd discussing plans fo r an- I Floor 1 Floor 1 Floor L Over- other Fair in 1914. Tbe Presi-  stocked, will sell for 4.60 to 6.00.  Uent caned the meeting to order L. E. Smith. adv land called on tbe Secretary and I Get yonr Early Rose and Irish Treasurer for a report which was as"}, "highlight": {"text": {"matched_tokens": ["S"], "snippet": "h Feath ton Mrs. <mark>S</mark>. L. Ferguson, Mrs. triet"}}, "highlights": [{"field": "text", "matched_tokens": ["S"], "snippet": "h Feath ton Mrs. <mark>S</mark>. L. Ferguson, Mrs. triet"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.39, 524.18, 2348.77, 1060.32], "bbox_id": "51d0c533ed", "file": "AppomattoxNewspapers_1905-1912a_0429.pdf", "page": 1, "text": "H o lly w o o d . We are having a good meet ing a t Hollywood, oonduoted by our pastor. Rev. Mr. Hioks, _ .  . . , , .emd we hope great good may Personal property belonging   accomplished by it. to 0. Jones Rixey, head of the Mr 0 a Wooton, of old defunct Virginia Safe Deposit Buckingham, was to see his A Trust Corporation, w hichlgiteTf M n R H Franklinj on Mrs. C. A. Spenoeri qqite ill 1 was surrendered to th at institu-1 s UQjay last, a t her home in tie village. Itltion by Rixoy, following itI w  ar6 to say Mr. Geo. is thought th at she will haveloollapso, was sold at Culpeper I expects to go to Wisoon- to undergo an operation ere I last Wednesday by Receivers I gln we hope he wiU oome she is relieved. J . K. M. Horton and Howard I back Rain BOon Quite an interesting and well! W. Smith and brought between I Ernest Franklin will vouched for story comes to us J 5,000 and 6,000. This money Imove to Mr. George Clarks as to the terrestrial formations I will be turned over to the re -farm n  new. future of certain parts of Backing-1 ceivers and will swell the He not work?turkey hon n M,r d nj ham. There is said to bo a J amount shortly to be divided I Why is it we hear so muoh more Dey dont know nothing bout it cam dey I farm consisting of about 1401 among the depositors. Thslof the brotherhood uf a man than oneLutieteetfy tuHmyhengotmotedtwasI ceres of ground, situated on property consisted of forty-tw oef the eieterhood of a woman? a shame I and about a mountain in thelheadof horses, mules, oolts,  hebto.eaturieLm!.cul1 ot 1611 he I western part of the county I farm wagons, machinery, carri-1 The King of Spam is another of case when he sopped his wing eu hop her I known as Spears Mountain, I agos, farming tools, oats andf ihe politiciaut who find itexpidi- sense ooze from her-but haltairine ta a, irentleman bv hay. lent to keep an ear to the ground. Twas Jls a mighty circus fer to see dat gob-1 D O IO nging SO a g e n t le m a n U J I   J 1 V bier strut.   _ I the name of W illie Bryant on I Judge Louis C. Barley, in tpe Dar was a little turkey, jis a nttie-turk7y Fwhich the-sott is so remarkably  Alexandria Corporation Court,! DUsoiring the True ie much lihi Hewu his daddys Dutchman en his mam- 4eep. and frtilo as to produce Friday appointed John G. I ttinsnp thatmytical snake, each mys prjde en joy _  the finest corn upon ground Hiden, of Culpeper, Va., guar Bs good a little turkey esyou ever care t eultiyated amidst the growing dian ad litem for 0 . Jones IP He aint never baji nor fussy es some uttieltrees, with only the underbrush I Rixey, president and treasurer FerCseriurk he called de school to lectuJ cuti  d w ith cultivationof th ed efu n ct V irglnlaS afe dem about I gave b j ft coulter and grab hoe I Deposit oc trust Uorporatious, De way a tara mushave his seif whenThe writer wgg shown two ears I who was recently adjudged in- of cornone white the other I sane and sent to the Western yellowsaid to have been I State Hospital at Staunton, grown on this farm, amidst the! The trust corporation is now in trees as mentioned and oulti-lthe hands of receivers. It is ated only by the hoe. They I understood th at Mr. Hidens were good specimens. It is  appointment meets w ith the said that on this farm there full approval of all the attor- are growing peach trees that neys interested in the case, were known to be in bearing in  The Division Superintendent the year 1832. And the soil is of Schools, Mr. Plnmmer F. said to be from four to ten feet! Jones has been taking advant"}, "highlight": {"text": {"matched_tokens": ["R"], "snippet": "w hichlgiteTf M n <mark>R</mark> H Franklinj on Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["R"], "snippet": "w hichlgiteTf M n <mark>R</mark> H Franklinj on Mrs."}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [2250.86, 475.3, 2422.22, 1408.66], "bbox_id": "f96008dbdc", "file": "AppomattoxNewspapers_1955-1957a_0360.pdf", "page": 1, "text": "AlteT serving as local Postmaster tor twenty-two and one-half years E. LeRoy Smith will retire on Jan uary 1, 1.957, after reaching the re quired age for retirement on De cember 26k On. June 1, 1934, Mr, Smith was appointed Acting Postmaster by the late President Franklin D. Roose velt, who later made the permanent appointment. Mr. Smith succeeded- ed J, E. Dinwiddle. A t that time Appomattox was a third class office with annual postal receipts totalling 7,411.19. In 1936 the office was advanced to second class. As a result of large parcel post shipments made by local Garment Companies, the postal re ceipt mounted to 41,504.94 in 1950, which advanced the office fur ther to first class. Postal receipts in 1955 were -53,946.00. In 1947 toe Post Office building was enlarged and remodeled to adequately take care of the grow ing business. Mrs. Rachel F. Lawson came in the Post Office as clerk at the time of Mr. Smdfths appointment, and still holds this position. Other dorks now are John T. Hall and H W. Billy Conner. The R. F. D. carriers serving at the time o f Mx. Smdithi appointment were Judson S. Kinney and Luther J. Morris, and toe Date J. Kline Pulliam, Thomas E. LeGrand. The present carriers are W. E. Han cock, William C. Hubbard, Reggie W. Stanley and S. A. Lawaon. Mr. Smith has been an untiring worker during has term of office, being one of the first to report to work at 6 oclock Af M., seven days A week, and the last to leave in the evening. During hie tenure of office he possibly breaks a national re cord, having used only 10 days annual leave and pat a single day of sick leave.. His record shows 2,454 bourn of unused annual leave! Mr. .Smith came to Appomattox County in 1907 when hie late par ents, Mr. and Mrs. M. C. Smito, bought Mammoth Oak Farm and moved here with their family from Washington County, feferyiand. Mr. Snuthe find pim tioi after moving here wae that of a teach er in the LeGrand School. He walked four miles daily to and from school, and received a salary of 20.00 per month. He wae later interested in a number of enter prises in the county, among them toe mercantile busineas. He served as a member of the Appomattox County School Board for 15 years. He is affiliated with toe Monroe Mia- eonic Lodge and has been active in the Appomattox Memorial ,Metho dist Church. He is at present church treasurer and a member of the Board of Stewards. He married the former Miss Adjie Pace, o f Haikfex County, and they are the parents of one son, L. Pace Smith, of JWls Church three daughters, Mm E. N. Brown, of Rockville, Md., and Mrs. Charlie J. Hunter and Mm Jhrnee R. Red ding, of this place, The personnel of toe local Post Office plans a dinner honoring Mr. and Mm Smith on December 28. The dimmer will be held at the Ap pomattox Hotel, and will be attend ed by representative of the Post Office Department from the Roanoke and Lynchburg offices. By M m J. R, Lawson."}, "highlight": {"text": {"matched_tokens": ["Franklin"], "snippet": "by the late President <mark>Franklin</mark> D. Roose velt, who"}}, "highlights": [{"field": "text", "matched_tokens": ["Franklin"], "snippet": "by the late President <mark>Franklin</mark> D. Roose velt, who"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [927.59, 561.78, 1083.26, 1997.97], "bbox_id": "fbc06c6ef5", "file": "AppomattoxNewspapers_1898-1902a_0453.pdf", "page": 1, "text": "After several years of litigation the noted Suit of W alter Bird, of London, England, vs. Major StepHen P. Halsey, a prominent tobacconist of Lynchburg, was finally disposed of. In the original trial in the United States Circuit Court the jurys decision was in favor of Mr. Bird. The lower court, however, was reversed by the Circuit Court of A p peals, and when the case was taken up in the United States District Court,M r. Birds counsel stated that he did not de sire to prosecute the case further, as he was unable to give the security. Judge Paul accordingly dismissed the suit, or dering that the plaintiff pay defend ants costs. Floyd Eaton, the young-son of Mr. William Eaton, of Capon Bridge, was shot, and perhaps fatally, by Lap John son. The latter was riding along the road, and he saw some object running along beneath some trees a considerable distance, ahead of him. He thought the object was a dog and fired with a dou ble-barreled shotgun. The object prov ed to be young Eaton, and the entire load struck him in the back. The wounded lad was carried by Johnson to his fathers home and a physician sum moned. His injuries are serious and perhaps fatal. Johnson was not arrest ed, as the affair was clearly an accident. A special term of the Circuit Court of Clarke County has been called to convene on March 27. This term will be presided over by Judge C. E. Nicol, of the Eleventh Judicial Circuit. It is called to hear the boom cases of the Berryville Land and Improvement Co. against delinquent stockholders, who are resisting payment of assessment on the stock of that company, which went into the hands of a receiver some years back. There are no cases now pending on the docket of this court in which so much feeling has been engendered and which are as hotly contested as these cases. The farmers institute of Shenandoah county was held in the court house at W oodstock and was the most success ful and interesting one ever held there. The program included addresses by Hon. Martin Dodge, of the United States Road Commission Professor A 1 vord, of the Dairy Division, Depart ment of Agriculture Prof. Frank F. Rogers, of Port Huron, Mich., and Mr. John W . Copp, of Fishers HilL Va. Essays were read by Messrs. Ernest Funk, Frank Richards and others. A large nnmber of farmers attended the institute and pronounce it the best ever held. The annuaL stockholders meeting of the Newport News Shipbuilding and Drydock Company was held in the of fice of General Superintendent W . A. Post, at the shipyard, with about all of the shares represented. C. B. Orcutt was unanimously re-elected president of the company for the ensuing year, and I. E. Gates was unanimously re elected treasurer. The following di rectors were elected C. B. Orcutt, New Y ork Charles H. Tweed, New York H. E. Huntington, New York I. E. Gates, New Y ork F. H. Davis, New York. A charter has been granted in the CircuitCourt at Lexington by Judge S. H. Letcher to the Rockbridge White Sulphur Springs Company for the pur pose of operating arid improving the property known as the McCIuers Springs property, situated about eight miles southwest of Lexington. The capital stock is not to be less than 1000 and the shares 100 each. The land limi tations are 100 acres. The property is expected to be improved and made a summer resort. Peter Light, a well-known farmer of L og Marsh district, Clarke County, died suddenly from heart trouble. Mr. Light retired as usual after eating a very hearty meal, and some time during the night he awakened his wife and told her he was very unwell. Mrs. Light left the room to rouse her soil, rind when she returned her husband was unconscious, and death ensued in ten minutes. The deceased was 76 years old and leaves a widow and nine grown children. Mr. A . de Costa, of New York, for merly of Spain, with other capitalists, has leased the Rappahannock gold mine in Stafford county, about ten miles above Fredericksburg,and after intro ducing improved machinery will begin active mining operation. The mine has been leased for three years, with the privilege of purchasing. Mr. de Costa, with his family, will reside at the mine. The Board of Supervisors of Rock bridge has appointed a committee to look into the affairs of the Valley Rail road to examine the books so far as practicable and all other matters per tinent to the road relative to the county and report to the board, making such suggestions as deemed advisable. The county holds stock in the road to the face value of 420,000 hence this move. The suit which Hugh Gordon Milier, United States District Attorney, insti tuted recently against Sylvanus Stokes, proprietor of the Monticello Hotel, has been adjusted in a manner satisfactory to both parties. Mr. Miller claimed damages to the extent of 25,000 be cause of remarks and allegations which Mr. Stokes is alleged to have made. Samuel Maness, aged 23, was shot and killed near Fairview, Scott county, by E. Garland. Maness was out with a hunting party. For same cause Gar land fired upon the party as they were passing by his home. Gen. Scott Shipp, superintendent ot the Virginia Military Institute, has as his guest Capt. Louis B. Lawton, of the Ninth United States Infgntry, who was wounded severely at the battle of Tientsin, China, last summer and later promoted tor his great gallantry during that action. Boland Holmes and Martha Beach were convicted at Williamsburg of the joint murder of James Beach and given 18 years each. They murdered Beach, the womans husband, and carried his body several miles up a creek and placed it on the railroad track, to indi cate accidental death. Mr. John S. Bethel, Collector of Cus toms at Richmond, is dead. The de ceased was a staunch Republican and had figured prominently in public af fairs. H e was a self-made man. In ac cordance with his dying reauest the Amreican flag will be placed on his coffin. A house owned by Mr. Jonas Barrett, at Cedar Grove, was -destroyed _ by a fire believed to be the work of incen diaries. Until recently the house had been tenanted, but was unoccupied at the time of the fire. Coal oil was sprinkled over the entire honse when the fire was discovered by neighboro. it is estimated that 500 people have left Franklin county within the past xear in search of homes in Hie West."}, "highlight": {"text": {"matched_tokens": ["r"], "snippet": "United States District Court,M <mark>r</mark>. Birds counsel stated that"}}, "highlights": [{"field": "text", "matched_tokens": ["r"], "snippet": "United States District Court,M <mark>r</mark>. Birds counsel stated that"}], "text_match": 2308138768554524793, "text_match_info": {"best_field_score": "1120976240640", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2308138768554524793", "tokens_matched": 4, "typo_prefix_score": 0}}
