{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["William", "H", "Gills"], "snippet": "Watkins, Geo. T. Peers, <mark>William</mark> Paris, Wilson Hix, W. T. Johnson, Wm. <mark>H</mark>. <mark>Gills</mark>, Cooch Plunkett, T. B."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Gills"], "snippet": "Watkins, Geo. T. Peers, <mark>William</mark> Paris, Wilson Hix, W. T. Johnson, Wm. <mark>H</mark>. <mark>Gills</mark>, Cooch Plunkett, T. B."}], "text_match": 2312642366973935737, "text_match_info": {"best_field_score": "3319998906368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2312642366973935737", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1861.47, 572.54, 2037.78, 986.69], "bbox_id": "814883d18d", "file": "AppomattoxNewspapers_1943-1947a_0110.pdf", "page": 1, "text": "The regular monthly business meeting of the W. M. S. of Liberty Baptist Churcn was held at r.ho chinch on Wednesday, November l 7, at 230 P. M., when Mrs. Lucy Furney beautifully presented a most interesting program with  Pa ganism as the topic, using a collec tion of idolitrous oojects from Afri ca, exemplifying heathenism, and displaying a hand-made poster de monstrating The way, the truth and the light from  Darkness to Downing. A very impressive Bible Study, subject Friend of Paul, Epistle to Philemon, by Ella Broad- us Robertson, was taught by the societys president, Mrs. H. Freder ick Jones. The following  officers were elected for the coming year President, Mrs. A. I. Caudle 1st vice-presilent, Mrs. W. J. Le Grand 2nd vice-president, Mrs. W. W. Scott 3rd vice-president, Mrs. Lucy Furney Recording secretary, Mrs. George Purdum Assistant recording secretary,Mrs Luther Morris Corresponding secretary, Mrs. W. P. Gills Treasurer, Mrs. Don Moses Assistant treasurer, Mrs. Harry Davis Pianist, Mrs. L. E. Smith Assistant pianist, Mrs. Don Moses Sunbeam leader, Miss Carolyn Smith G. A. leaders, Mrs. William Burke and Mrs. Larry Young R. A. leader, George Abbitt Y. W. A. leader,Miss Louise Gills."}, "highlight": {"text": {"matched_tokens": ["Gills", "Treasurer"], "snippet": "secretary, Mrs. W. P. <mark>Gills</mark> <mark>Treasurer</mark>, Mrs. Don Moses Assistant"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "Treasurer"], "snippet": "secretary, Mrs. W. P. <mark>Gills</mark> <mark>Treasurer</mark>, Mrs. Don Moses Assistant"}], "text_match": 2310390568233992313, "text_match_info": {"best_field_score": "2220487802880", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568233992313", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "<mark>William</mark> Pitzer <mark>Gills</mark>, who died at his"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "<mark>William</mark> Pitzer <mark>Gills</mark>, who died at his"}], "text_match": 2310390568099774585, "text_match_info": {"best_field_score": "2220487737344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390568099774585", "tokens_matched": 4, "typo_prefix_score": 0}}
{"document": {"bbox": [913.35, 990.83, 1075.63, 1777.92], "bbox_id": "aa285c9c73", "file": "AppomattoxNewspapers_1905-1912a_0417.pdf", "page": 1, "text": "formulate plans for the constructio of the road, following the tour of a party of automobile scouts across the State to Washington early in Octo ber. Roanoke.J. Hoge Tyler, of Rad ford, former Governor of Virginia, was operated on here at the Jeffer son Hospital. He stood the opera tion well, in spite of his 66 years. Governor Tyler was accompanied here by several members of his fam ily. His condition is serious and the physicians say it. is too early to say whether he will survive the ef fects of the operation. Fredericksburg.The Daughters of the Confederacy, of this city, have conferred crosses of honor on B. F. Price, A. A. Cannady, A. D. Jett and L. A. Weaver, Confederate veterans, and W. Key Howard, son of a vet eran. The chapter elected Miss Etta Barney and Mrs. G. R. Swift dele gates to the annual convention of the United Daughters of the Con federacy, which convenes in Roa noke. Lynchburg. A new lodge of Re- bekahs has been formed at Fairview Heights, to be known as Oak Leaf Lodge, No. 15. The officers are Noble grand, Mrs. J. W. Gills vice grand, Mrs. B. H. Goding, recording secretary, Miss Hattie Patterson ebr- responding secretary, Miss Pearl Bu- comb treasurer, Miss Arrah Fergu son warden, Miss Edna Ferguson conductor, Mrs. H. F. Watts inside guardian, Mrs. R. W. Callahan, ana chaplain, Miss Edna Callahan. Fredericksburg.The street com mittee of the fcity Council has award ed J. H. Davis the contract for ma cadamizing the roadway on the west side of Washington avenue and the circles at Mercer Monument. The contract price is 1,200. Newport News. Judge Beverly Randolph Wellford, aged 83 years, who for 40 years served as judge of the Circuit Court at Richmond, and who had been prominent in the Masonic affairs of the State, died at the home of his son here. Fredericksburg. The Wright-La- tane Camp of Confederate Veterans of Essex County has elected John M. Lewis, Dr. Warner Lewis, R. B. Whitlock, William Campbell, J. W. Phillips and Muscoe Garnett, Jr., delegates to the Grand Camp of Con federate Veterans, which convenes at Newport News October 17. Fredericksburg.  Rev. A. Jy Reamy and his son, who Is also a minister, have accepted calls to Fair- port, Fairfield, Smithfleld and Coan Baptist churches, in the Northern Neck. Harrisonburg.In the woods near Burketown Charles Ragner shot at a squirrel in a tree. The shot missed the squirrel and struck the breast and arms of Joseph Shaffer, who was in the tree gathering wild grapes. Neither man knew the other was In the woods. Shaffer is badly hurt, but will recover. Leesburg.The residence belong ing to Dr. John Cline, near Bluemont, was totally destroyed by fire Thurs day night. The origin is unknown. The loss was about 5.000. T. C. HsllM fir, deputy sheriff, and his .mil were occupying the house."}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "grand, Mrs. J. W. <mark>Gills</mark> vice grand, Mrs. B. <mark>H</mark>. Goding, recording secretary, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "grand, Mrs. J. W. <mark>Gills</mark> vice grand, Mrs. B. <mark>H</mark>. Goding, recording secretary, Miss"}], "text_match": 2310390567697121401, "text_match_info": {"best_field_score": "2220487540736", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "2310390567697121401", "tokens_matched": 4, "typo_prefix_score": 0}}
