{"document": {"bbox": [1399.44, 497.72, 1562.03, 568.97], "bbox_id": "53f61d75d5", "file": "AppomattoxNewspapers_1908-1909a_0033.pdf", "page": 1, "text": "Young Dr. Fred Twyman went up to a Lynchburg hospital yes terday for an operation for ap pendicitisHe is doing nicely and will be home in a short while."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Young Dr. Fred <mark>Twyman</mark> went up to a Lynchburg hospital yes terday for an operation for ap pendicitisHe is doing nicely and will be home in a short while."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Young Dr. Fred <mark>Twyman</mark> went up to a Lynchburg hospital yes terday for an operation for ap pendicitisHe is doing nicely and will be home in a short while."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2099.32, 1130.13, 2420.78, 1141.14], "bbox_id": "19bb06a846", "file": "AppomattoxNewspapers_1915-1918a_0581.pdf", "page": 1, "text": "y  Z Z  Nicol Twyman, I Spotlit hpriog U m el   H"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "y  Z Z  Nicol <mark>Twyman</mark>, I Spotlit hpriog U m el   H"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "y  Z Z  Nicol <mark>Twyman</mark>, I Spotlit hpriog U m el   H"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2280.93, 1682.75, 2451.8, 1804.65], "bbox_id": "e3fd9a284a", "file": "AppomattoxNewspapers_1947-1949a_0459.pdf", "page": 1, "text": "xr W a s a s o n o f t h e l a t e H r- D . N. Twyman, of Appomattox. He diejl in New York City, after a brief illness. He is survived by his sister, Mrs. Richard Greenlee, of Scarsdale, New York his brother, Fred W. Twyman, of Camp Lee and his step-mother, Mrs. Annie H. Twyman, of Williamsburg. Active pallbearers were Henry Pack, R. D. Marks, Paul Drinkard, Robert Hubbard, S. A. Lawson and John Harvey."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "H r- D . N. <mark>Twyman</mark>, of Appomattox. He diejl"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "H r- D . N. <mark>Twyman</mark>, of Appomattox. He diejl"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2213.28, 833.52, 2387.26, 1806.39], "bbox_id": "dd7202fdca", "file": "AppomattoxNewspapers_1954-1955a_0223.pdf", "page": 1, "text": "Wounded in the gun battle and charged with the crime is Frank Mayberry, 47 of Evergreen. It appears that Tucker was slain on the back porch of the residence in Evergreen in which he and his wife, her mother, and her brother, May berry lived. This shooting apparently occurred sometime after 10 oclock Friday night. Called to the scene from his home in Appomattox, Dr. Christian was on an errand of mercy. From a re construction of the events, it appears that the popular young doctor was shot as he approached the door of the -house. Christians body was found on the walk to the house, and removed only after a terriffic gun battle between the posse and Mayberry. Nearly two hours passed between the shooting of Tucker and the flni arrest, of May- berry- Mayberry was Yelled by a shotgun blast near a garage hide out from which he had fired from 30 to 50 shots from a pistol and a shotgun at the surrounding officers. Mayberry was given medical treat ment here and sent to Rlctnond Saturday morning. His wounds are said not to be serious. The midnight sounding of sirens and the use oi flares to light up the scene attracted the attention of a sizeable gathering of spectators and details of the tragedy have been the topic of interest here since. Funeral services for the victims were held Monday. Serviced for Mr. Tucker were conducted from the Evergreen Baptist Chunch, by the pastor, the Rev. D. L. Bailey. Mili tary services were conducted by the grave by American Legion Post 104. Burial was in the Evergreen Ceme tery. Funeral services for Dr.Christlan were held here Monday at 11 A. M., from Appomattox Court House Pres byterian Church, conducted by his pastor, Dr. Twyman Williams, as sisted by Dr. C. A. Collins, Jr., and the Rev. B. T. Price. A great concourse of friends gath ered for the services. An outpour ing of floral tributes and messages of condolence bore testimony to the esteem in which th1 young physician and his family are held. Son of Dr. D. A. Christian, Jr. the physician began his practice here following service in the Navy during World War II. He occupied the office his father had used for a generation of service to the people of this area. Affectionay known as Young Doctor David, he endeared himself to the public by his skill as a physician and the charm of his personality. He was serving as a member of the Appo mattox Town Council and recently organized a group here to further the cause of physical education at the Appomattox school. As a mark of respect, local busi ness places closed during the funeral hour. A movement has begun to have an appropriate memorial in his hon or. A meeting of friends was held this week to organize a memorial movement, and another meeting will be held Monday night. Dr. Christian is survived .by his wife, the former Louise Campbell of Staunton three children, Mary, 6 Pamela, 4, and David A. Christ ian, IV, 7 months his father, Dr. David A. Christian, Jr and the fol lowing sisters and brother Mrs. George L. Koos, of Tangent, Ore- - gon Mrs. Worth Harris, La Crosse, Florida Mrs. Harold E. Thompson, Jr. Staten Island, New York Mrs. W. J. Byerly, of El Paso, Texas . Mrs. John E. Cox, Jr., Fall Rive  I  Continued on .Page r .-"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "by his pastor, Dr. <mark>Twyman</mark> Williams, as sisted by"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "by his pastor, Dr. <mark>Twyman</mark> Williams, as sisted by"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [421.91, 203.42, 566.9, 1161.13], "bbox_id": "1aa6b80fc7", "file": "TimesVirginian_1976_0245.pdf", "page": 1, "text": "Worship services will be at Hollywood Baptist Church Sunday morning July 4 at 9 a.m. Sunday School will follow at 10 oclock. Rev. Paid Balthaaer deliver ed a good message at Hollywood Sunday morning. Friends were deeply grieved to hear of the death of Rev. and Mrs. Clarence Davis infant son. We extend to them our love and deepest sympathy. Deepest sympathy is extend ed the families of Mr. John Ferguson and Mr. Curtis Blackwell. Mrs. Kenneth Deaner and daughters, Delorious Ann and Dawn spent the week end in Newport News with Mrs. loan Mayberry, Mr. and Mrs. Ryland Mayberry and Mrs. Lucy Deaner. Mrs. loan Mayberry accompanied them home for a visit. Mrs. David Austin and Janet were visitors Wednesday mor ning of Mrs. Thomas Woodall and Lisa. Mr. Frank Covington visited Mrs. M. L. Covington and Mrs. W. T. Covington Friday afternoon. Mr. and Mrs. L. L. Webb and Miss Odell Webb called in the W. H. Wingfield home Satur day afternoon. Mr. and Mrs. Twyman Baldwin visited in this home of Mrs. Mary Bagby Saturday night. Visting Mrs. C. R. Ban ton Sunday night were Mr. and Mrs. R. G. Austin and Tom. Mr. and Mrs. H. D. Webb, of Richmond, were guests Sunday of Mr. and Mrs. K. M. Webb and family. Among others visiting Mr. and Mrs. Thomas Woodall and family Sunday were Mr. and Mrs. L. H. Watson, Mr. and Mrs. Scott Sheets and Mr. and Mrs. Alfred Almond. Mr. and Mrs. J. L. Torrence had their children and grand children with them for Fathers Day. Relatives and friends are so glad to hear Mrs. Frank Woodall is home from the hospital. We pray she may soon be well. Miss Joyce Webb spent a few days last week in Lynchburg with Mr. and Mrs. Lawrence Woodson. Visting Mr. and Mrs. L. H. Watson Saturday were Mrs. Lee Smith and Mr. and Mrs. Larry Sexton and son. We are very sorry to hear Mr. Bennett Gilliam is back in the Lynchburg Hospital. Rev. and Mrs. Otis Sndtb and Mrs W. T. Covington visited him Sunday afternoon. We wish for him a speedy recovery. Mrs. Ruby Woodson, Lisa and Mrs. M. L. Covington visited Mrs. W. T. Covington last week. Visiting Mr. Frank Coving ton and Mrs. Mary Bagby last week were Mr. and Mrs. James Bartlett, of Texas, Mrs. E. T. Ponton of Roanoke, Rev. Paul Balthaser, David Daniel and Andy Balthaser, Mr. H. W."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "afternoon. Mr. and Mrs. <mark>Twyman</mark> Baldwin visited in this"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "afternoon. Mr. and Mrs. <mark>Twyman</mark> Baldwin visited in this"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [691.69, 636.9, 837.57, 1048.15], "bbox_id": "2cff324d4e", "file": "AppomattoxNewspapers_1962-1965a_0202.pdf", "page": 1, "text": "Worship Service  1100 oclock Mid week Prayer Service  730 The Public is invited. Old Concord Presbyterian Church Spout spring, Va. Rev. W. Twyman Williams, Act ing Pastor. Sunday, July 14 10 a.m.  Church School 11 a.m.  Worshippreaching by pastor Sacrament of the Lords Supper C30 Youth Fellowship    New Hope Baptist Church Marvin E. Jacobs, Pastor 10 a.m.  Sunday School 11 a.m.  Morning Worship Message  Christians Paving The Way For Revival 7 p.m.  Training Union 8 p.m.  Evening Worship Message  The Challenge of Christian Conduct The public is cordially invited to worship with us . Bible Baptist Church Sunday School will convene at 10 a.m. with the study being in the second Chapter of Romans. The topic for the morning wor ship service will be entitled When You Have Sepnt All. The Young People will meet at 630 and the study will be Manners and Customs in Bible Lands. The Evening message will be entitled, The Church of Brother- ly Love. This will be the sixth  in a series of messages a on the Seven Churches in the book of Revelation."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "spring, Va. Rev. W. <mark>Twyman</mark> Williams, Act ing Pastor."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "spring, Va. Rev. W. <mark>Twyman</mark> Williams, Act ing Pastor."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [299.04, 823.35, 460.68, 1356.77], "bbox_id": "7f2d9a0b06", "file": "TimesVirginian_1978_0118.pdf", "page": 1, "text": "Wooldridge, Mr. and Mrs. Robert Muffins and daughter, Mr. andy Muffins and Miss Holly Franklin visited Mr. and Mrs. Emery Muffins Sunday night. Mr. and Mrs. Henry Mann j visited Mr. W alter Jordan Sunday night. ! Mr. and Mrs. Emery Mullins visited Mr. and Mrs. Paul Saver Sunday afternoon. Mr. and Mrs. Emery Mullins visited Mr. and Mrs. Paul Saver Sunday afternoon. H Mif nntfMr. leneeWhite sft Mff.indMrè? Cferiï Steffi IwïwHdaÿ- Mr. Loyd Nash and Mrs.  Jimmy Howard and children visited Mr. and Mrs. Elliott  Nash and Dawn Sunday. Mr. and Mrs. Gordan Tucker I and family visited Mr. and Mrs.  Edd Collins and Eric of j Lynchburg, Sunday. j Mr. and Mrs. Shelby Tucker ! visited Mr. and Mrs. Courtney Mann Sunday afternoon.  Mrs. Helen McDaniel have ! been visiting in thé neighbor- ! hood this week. Always glad to  have her come back. ! M rs. Lowell Owens and daughter and grandaughter j visited Mrs. Laura Ferguson on Monday. ,  , Mr. and Mrs. Richard Nash  visited Mr. and Mrs. Clarence Gobble and-Mr. Herman Guill , Sunday night. Mr. and Mrs. Twyman Nash visited Mr. and Mrs. Lacy Sharp Sunday.  Attending the capping cere mony for Karen Lively Sunday at the Lynchburg General Hospital School of Nursing were Mr. and Mrs. Frank and M arcella and"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "night. Mr. and Mrs. <mark>Twyman</mark> Nash visited Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "night. Mr. and Mrs. <mark>Twyman</mark> Nash visited Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [410.89, 775.89, 901.32, 1252.3], "bbox_id": "1d5037eb6f", "file": "AppomattoxNewspapers_1926-1933a_0289.pdf", "page": 1, "text": "WOODLAND PELLAGRA ! service The standard maintained in Mr Josh Harvey and family! Last week while administer- our modem homes, requite a and Mr and M rs. Bob Carey, mg toxin-antitoxin, I saw a gener0us supply of hot water of Lynchburg, Mr. and Mrs. Uttle boy only five years old Bathing, shaving, dish-wash- Will Harvey and baby of Mad- with what appeared to be a ing laundering, house-clean- iEonville, were dinner guests of bad case of sunburn on his ing all demand hot water in Mr. and Mrs. Sam Harvey, Sun- face and back of the neck and varying amounts at various , i hands. This condition had temperatures and at different Mr Will Marshall and Mr. lasted for many days. Hia times during the day. and Mrs Ben Newman of parents attributed it to the ef- Millions of houses wired for Lynchburg, were dinner guests feet of the sun, but it was a electric service evidence the of Mrs. E. G. Cheatman, Sun- well developed case of Pella-1 general desire for more con- . gria. Pellagra is known as J vnience and comfort in the Mr. Wert Woodson, Messers, one of the deficiency diseases Paul and Sammie Woodson, because it is due to lack of cer- Misses Mernice and Virginia tain substances in the diet. Woodson spent Sunday in the This little boy was well nour- home of Mr. and Mrs. Berkley ished, probably quite up to Nash of Lynchburg. normal weight, but he had for Miss Mildred Marshall was many months been eating a dinner guest of Miss Beatrice diet which lacked one of the Woodson, Sunday. all-important vitamins. In Miss Katherine Caldwell his particular case there was spent the week-end with her at the time no symptoms other parents, Mr. and Mrs. M. C. than the sunburn, but if left Caldwell. alone he would be apt to suffer Mr Walter Coleman and colicky pains in the abdomen, daughters Misses Geraldine, slight diarrhea, sore mouth Helen, Lucy and Mary and son and tongue, great loss of Twyman, all saw Sunny Side strength and in more advanced i Up in Lynchburg last week. cases there are usually mental I ____ I o ______ _ symptoms. BENT CREEK i The Prevention and cure of ____ the disease may be affected by The death Angel visited the a diet rich in milk, eggs and home of Mr. and Mrs. W. J. fresh es- Fruits snd green"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "tongue, great loss of <mark>Twyman</mark>, all saw Sunny Side"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "tongue, great loss of <mark>Twyman</mark>, all saw Sunny Side"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.09, 1135.85, 1860.77, 1355.4], "bbox_id": "6d8fd9c68d", "file": "AppomattoxNewspapers_1943-1947a_0003.pdf", "page": 1, "text": "Woodland, Aug. 25.- Mrs. Odell Howe .ton has returned home after visiting her sister, Mrs. J. P. Mar shall. Mr. and Mrs. Twyman Coleman  and sons and Mr. and Mrs. W. L. oleman visited Mr. and Mrs. B. D. Stratton at Boonsboro Sunday. Miss Jean Cheatham is visiting i relatives in Williamsburg. Mrs. Hus on Reams and daugh ters from Green Village, N. J.,were recent visitors of Mr. and Mrs. Russell Woodson. Mrs. Bertha Austin is visiting her sister, Mrs. W. L. Coleman. Miss Mary Ellen Coleman and Mr. and Mrs. Lewis Carroll and Boiby spent the week-end with Mr. and Mrs. W. L. Coleman. Mr. and Mrs. H. C Thomas and son, from Richlands, Va., were re cent visi ors in the home of Mr. and Mrs. J. P. Marshall."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "shall. Mr. and Mrs. <mark>Twyman</mark> Coleman  and sons and"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "shall. Mr. and Mrs. <mark>Twyman</mark> Coleman  and sons and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [293.05, 815.85, 440.37, 1112.43], "bbox_id": "a664228883", "file": "TimesVirginian_1978_0008.pdf", "page": 1, "text": "Woodalls parents, Mr. anl Mrs. Clarence Coffey, of Covington. Mr. Woodall was a patient in the Emmett Memor ial Hospital in Clifton Forge for several days for examinations and test. We pray he may soon be feeling better. Mrs. loan Mayberry, Mrs. Kenneth D eaner, Delorious Ann, Dawn and Stuart Deaner, Mr. and Mra. Bill Watson, William and April Watson, Kenqeth Wingfield were sup per guests of Mrs. Mary Bagby Monday night. Calling in this bongo. Monday w ereM r. fgd Mrs Twyman Ba0pjtau8A Mrs.Itfgrkm Arth M r. and Mrs. w . H. Wingfield and family had as their dinner geusts Monday night Mr. and Mrs. Billy Inge. -R ev. and Mrs. W. H- Elder and Miss Patrick Elder visited in the homes of Mrs. Mary Bagby and Mr. and Mrs. W. H. Wingfield and family last week."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "ereM r. fgd Mrs <mark>Twyman</mark> Ba0pjtau8A Mrs.Itfgrkm Arth M"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "ereM r. fgd Mrs <mark>Twyman</mark> Ba0pjtau8A Mrs.Itfgrkm Arth M"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1634.68, 617.67, 1778.76, 954.27], "bbox_id": "a617b2d2c6", "file": "AppomattoxNewspapers_1962-1965a_0254.pdf", "page": 1, "text": "Women of the Church of Ap pomattox Court House Presby terian Church were hostessess Sunday afternoon at an informal reception honoring Dr. and Mrs. W. Twyman Williams. Dr. Wil liams, former pastor of the church, and Mrs. Williams were married this summer. In the receiving line were Rev erend Millard G. Stimpson, pre sent pastor of the church, and Mrs. Stimpson, plus the honor- ees. Mrs. D. E. Caldwell, Sr. presided over the guest book. Mrs. Williams wore an after noon dress of cerulean blue with cocktail hat and bag in black. Her corsage was of white carna tions. The social hall of the church was decorated in green and white with magnolia and oriental holly forming the background for soft candlelight. The refreshment ta ble was set with a hand made cutwork cloth of white. White zinnias, snapdragons, and other fall flowers were used as the centerpiece arrangement. Fruit punch and individual cakes de corated with a bridal motif plus varicolored mints and nuts were served by the ladies of the church."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Dr. and Mrs. W. <mark>Twyman</mark> Williams. Dr. Wil liams,"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Dr. and Mrs. W. <mark>Twyman</mark> Williams. Dr. Wil liams,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1720.83, 655.55, 1878.98, 799.0], "bbox_id": "4171cbb2de", "file": "AppomattoxNewspapers_1905-1912a_0410.pdf", "page": 1, "text": "Wm. Davidson 50 39 Dr Abbitt 50 30 Bledsoe Clement 50 14 Trap Martin 60 12 J. A. Stanley 50 12 A. B. Harwood 50 9 Oscar Cole 25 19 Don Moses 25 16 R. F. Bnrke 25 15 S. Martin 25 8 Dr. Twyman 25 7 Russel Abbitt 24 3"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Martin 25 8 Dr. <mark>Twyman</mark> 25 7 Russel Abbitt"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Martin 25 8 Dr. <mark>Twyman</mark> 25 7 Russel Abbitt"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1719.23, 667.39, 1879.76, 832.63], "bbox_id": "cc404db521", "file": "AppomattoxNewspapers_1905-1912a_0393.pdf", "page": 1, "text": "Wm. Davidson 30 17 W. M. Hancock 30 16 Wm. Steele 30 7 iev. Leppa 30 6 Dr. Twyman 30 6 Alfred Hardwood 30 4 Geo. Coleman 11 4 The next shoot will take place at 4 oclock p. m on Friday, the 18th. Mr. Scholl, of DnPont Powder Oo will be present with several friends and some expert Bhooiting may be expected. All members and friends are urged to come."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Leppa 30 6 Dr. <mark>Twyman</mark> 30 6 Alfred Hardwood"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Leppa 30 6 Dr. <mark>Twyman</mark> 30 6 Alfred Hardwood"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [778.29, 1173.54, 1062.9, 1267.54], "bbox_id": "1097d78919", "file": "AppomattoxNewspapers_1962-1965a_0320.pdf", "page": 1, "text": "with Mrs. Twyman Coleman. Tuesday, Jan. 7   Lee- burg. Also, Mr. and Mrs. Lloyd Vaughan and son. Bill Mr. and Club will meet at 130 p.m. at M rs. Jacob Lewis, Katherine, the Home Agents office. Ray, John, Bill, and Nancy, all Thursday, Jan. 9  Stonewall I of Appomattox. Also, Luther Club will meet at 2 p.m. with  Lewis, of Lynchburg. Also, Mr. Mrs. Kelly Stratton. j and Mrs. James Vaughan, Jr. Thursday. Jan. 9  Clover Hill Jimmy, Lynn, and Miss Ann Club will meet at 730 p.m. with Vaughan and Mr. Ronnie Vaug- Mrs. Verna Conner. 1 han, all of Richmond."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "with Mrs. <mark>Twyman</mark> Coleman. Tuesday, Jan. 7"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "with Mrs. <mark>Twyman</mark> Coleman. Tuesday, Jan. 7"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1440.23, 1096.05, 1925.2, 1123.9], "bbox_id": "c011deac83", "file": "AppomattoxNewspapers_1926-1933a_0258.pdf", "page": 1, "text": "with Miss Margaret Robertson Brown. Twyman, of Kinston, N. C., on A 1 Ail  J Í 1 . Editor Ginther and Luthorl Misses  ucy Smlth apd Party a t"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "with Miss Margaret Robertson Brown. <mark>Twyman</mark>, of Kinston, N. C., on A 1 Ail  J Í 1 . Editor Ginther and Luthorl Misses  ucy Smlth apd Party a t"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "with Miss Margaret Robertson Brown. <mark>Twyman</mark>, of Kinston, N. C., on A 1 Ail  J Í 1 . Editor Ginther and Luthorl Misses  ucy Smlth apd Party a t"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1689.78, 234.39, 1837.64, 855.16], "bbox_id": "ea3fc85d50", "file": "AppomattoxNewspapers_1962-1965a_0613.pdf", "page": 1, "text": "williams grandmother M rs Phebe Heath of Buckingham. Mr. and Mrs. Carlton Garrett and Chris visited in the home of her parents. Mr. and Mrs. i Wade Ferguson Sunday. Visiting in the same home were Mr. and Mrs. Marie Ferguson, Judy and Jane, of Lynchburg, and Mr. and11 Mrs. Evans Ferguson and Kathy of Appomattox. Mrs. Eddie Carter left Friday to spend a while with her daugh ters, Mrs. Emile Venezio, of Du mont, N.J., and Mrs. Jules DAnna of Fairlawn N.J. Friends are glad to see Mis. Russell Bryant out after being hospitalized for a while. Mrs. Annie H. Garrett and La- Verne visited in the home of Mr. and Mrs. T e r r y Garrett of Lynchburg Sunday night. Mrs. Frank Nuckols visited in the home of Mrs. A. W. Coving ton last Sunday afternoon. Mi. Lewis Twyman, of Miami Florida, visited in the home of Mr. and Mrs. W. L. Amos last Monday night. Mr and Mrs W T Paulette, of Richmond, Mr. Michael Pau lette, of Hampden-Sydney Col lege, and M ss Julie Glass, of Longwood College, visited in the home of Mrs. A. W. Covington last Sunday. Mr. and Mrs. Alton Lucado visited in the home of Mr. and Mrs. Carlton Garrett Saturday. Mr. Walker Webb visited in the home of Mr. and Mrs. T. C. Harvey Sunday. Mrs. Ada Gibson and Mrs. Mildred visited in the home of Mr. and Mrs. T. C. Harvey Mon day. We are sorry to hear that Syl via Carson has the mumps. We hope for her a speedy recovery. Mrs. L. B. IJarvey visited in the home of Mr. and Mrs. T. C. Harvey Monday. Week end guests in the home of Mr. and Mrs. T. C. Harvey were Mr. Allen OBrien, Mrs. Mildred Alvis, Mr. and Mrs. Da vid Repass and Sherry, Mr. and Mrs. Charlie Harvey, Debbie, Becky and Chuck, Mr. and Mrs. Ralph Robinson and Robby. Mr. and Mrs. T. C. Harvey visited in the home of Mr. and Mrs. L. H. Watson on Sunday."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Sunday afternoon. Mi. Lewis <mark>Twyman</mark>, of Miami Florida, visited"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Sunday afternoon. Mi. Lewis <mark>Twyman</mark>, of Miami Florida, visited"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2095.9, 754.25, 2238.1, 1603.29], "bbox_id": "e887c139dc", "file": "AppomattoxNewspapers_1943-1947a_0267.pdf", "page": 1, "text": "William Irving Ayers Albert C. Baldwin Edward H. Baldwin Norman K. Baldwin Walter M. Bates William C. Bell William T. Bowling Clarence W. Brooks Walter B. Brown Willie W. Brown Curtis H. Bucknam Richard F. Burke, III Richard L. Burke, Jr. Robert T. Burks Robert li. Bryant David C. Carter Hubert H. Caldwell, Jr. Carlton D. Canada Charlie B. Carson Frank Chandler William C. Childers Richard C. Childress Andrew B. Chocklett Walter S. Conner Kelly Crum Twyman E. Curaby Marcus H. Cuneo John R. Crawley, Jr. Harry 0. Cyrus Chap L. Davidson Ernest -Davidson -----  Edward R. Doss Paul S. Drinkard Russell H. Eagle Joseph W. Eddins Joseph E. Ferrell Harry D. Ferguson David M. Franklin Kermit Garrett Tyler Garrett Russell T. Gilbert Theodore R. Gilbert Harry B. Giles Lewellyn Giles, Jr. Lewis H. Gobble Herbert L. Godsey Andrew M. Goin Emmett H. Goin Robert E. Gowin Fred W. Grishaw Harry W. Guill Willie E. Guill Charlie Gunter Howard W. Hancock Richard M. Harris Garland Harding Edward W. Harvey William C. Hollins Richard D. Inge Jesse H. Johnson Herman K. Kirkpatrick Arthur C. Layne _ Robert F. Lynch John R. Lawson Asa T. Martin Glenn 5. Martin Clarence J. Mays Carrington A. McCormick Lewis S. McCormick, Jr. Ivanhoe W. McCormick Thomas A. McCormick Garland J- Morris Lyle E. Moses Jerry B. Myers Samuel L. Nuckols Clem O. OBrien Jesse T. Paulette Havilah E. Phelps Lenwood E. PKelps Garland G. Plunkett Jas. W. Ranson Samuel E. Richardson David T. Robertson James G. Robertson Oscar L. Robertson Paul W. Sarver Russell M. Shelton Ira J. Southall Clarence H. Stanley Samuel L. Stanley Dillard Reed"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "S. Conner Kelly Crum <mark>Twyman</mark> E. Curaby Marcus H."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "S. Conner Kelly Crum <mark>Twyman</mark> E. Curaby Marcus H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [559.21, 1036.05, 703.06, 1129.75], "bbox_id": "d5a17cfe5b", "file": "AppomattoxNewspapers_1962-1965a_0234.pdf", "page": 1, "text": "William Hubbard Sunbeam Coun selors, Mrs. Twyman Coleman, M rs. Woodrow Fitzgerald, M rs. W. C . Hubbard, Mrs. Steve Boll ing. This report was submitted by the nominating committee com posed of Mrs. William Chenault, Chairman, Mrs. Edwin Carter and Mrs. J . M . McAden."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Sunbeam Coun selors, Mrs. <mark>Twyman</mark> Coleman, M rs. Woodrow"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Sunbeam Coun selors, Mrs. <mark>Twyman</mark> Coleman, M rs. Woodrow"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [525.8, 230.06, 667.44, 356.46], "bbox_id": "b8b397b056", "file": "AppomattoxNewspapers_1962-1965a_0119.pdf", "page": 1, "text": "William E. Carpenter, Pastor Sabbath School 930 Worship Service  1100 oclock Mid-Week Prayer Service730    Old Concord Presbyterian Church! Rev. W. Twyman Williams, Sup-1 ply Pastor Church School  10 a.m. Morning Worship  Sermon To- pic You May Know What - But Do You Know How? John I If. Yoth Fellowship  7 p.m."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Presbyterian Church! Rev. W. <mark>Twyman</mark> Williams, Sup-1 ply Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Presbyterian Church! Rev. W. <mark>Twyman</mark> Williams, Sup-1 ply Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [562.56, 899.89, 710.62, 1309.97], "bbox_id": "71b6795705", "file": "AppomattoxNewspapers_1971-1973a_0575.pdf", "page": 1, "text": "Where is he that is born I King of the Jews? For we have seen his star in the east, and are come to worship him.  Matthew 22 Last Sunday Dr. Tom Jennings of Bedford visited his mother also Mr. and Mrs. George Jennings of N. C. spent the week end. i Mrs. Elsie Thornhill left this week for Michigan to spend the winter with her daughter and her family, Mr. and Mrs. Tom McVetty. We will really miss her at church. Everybody is busy getting ready for the holidays. Soon Christmas will be here. Mrs. Nina Caldwell and Mrs. Elsie Caldwell spent Saturday with Mrs. Bob Harris at Pamplin. Mrs. Wilson Garrett, Mr. and Mrs. John Ferguson, Sr., Mr. and Mrs. Twyman Cole man, Mr and Mrs. Ben Wheeler, Mr. and Mrs. H. B. Jones, Irby and Richard were visitors over the week end of Mr. and Mrs. I. B. Wheeler. Mr. and Mrs. I. B. Wheeler visited Mr. and Mrs. Ben Wheeler Saturday afternoon. Mr. and Mrs . C. T. Roach spent Sunday with her father, Mr. Osborne Davidson."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Sr., Mr. and Mrs. <mark>Twyman</mark> Cole man, Mr and"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Sr., Mr. and Mrs. <mark>Twyman</mark> Cole man, Mr and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2329.7, 337.34, 2500.55, 597.19], "bbox_id": "6f45992edf", "file": "AppomattoxNewspapers_1949-1952a_0596.pdf", "page": 1, "text": "Wheeler and daughter, Louise, and Mrs. E. E. Perdum visited Mr. and Mrs. G. H. Jones, of Concord Sun day afternoon. Mr. and Mrs. Milton Martin were dinner guests Monday of Mrs. J. P. Johnson. Mr. and Mrs. J. P. Johnson visited Mrs. J. H. Evans and niece, Mrs. Hugh Bolton, of Lynchburg Sunday. Mr. and Mrs. Ben Wheeler and daughter, Louise and Mr. and Mrs. Jack Caldwell and daughter, Cath erine were sight-seeing at Buggs Island recently. Mrs. J. A. Conner, Mrs. Sam Fer guson and Mrs. W. H. Conner spent Sunday afternoon with Mr. and Mrs. Twyman Conner in Lynchburg. Mr. and Mrs. R. A. Gowin had as their guests for the week-end Mr. and Mrs. R. S. Franklin and daughter, Catherine, Lynchburg. Earl Gowin, of Crewe is visiting his mother, Mrs. R. A. Gowin this week."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "with Mr. and Mrs. <mark>Twyman</mark> Conner in Lynchburg. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "with Mr. and Mrs. <mark>Twyman</mark> Conner in Lynchburg. Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [544.09, 464.09, 879.91, 762.43], "bbox_id": "7f1fd20510", "file": "AppomattoxNewspapers_1939-1943a_0058.pdf", "page": 1, "text": "Whe haVe Maycr C. S. McDearmon return accepted poeitkms. ed Monday night after a trip to Cadet George Cale, of Fork Un- Jacksonville, Florida ion. spent the week-end here. Jfc,. W. M. Morris and Mrs. Word has been received that Mrs. Collins will return home to- 8.W . Seers, who is in New York, J?10n0W after an extended visit to will undergo an operation there be fore returning to Appomattox. Miss Sadie Reynolds and Lloyd Mrs. E.A. Scott., of Suffolk,and Brdley, of Richmond spent Sunday Mias Eleanor Scott, of S. T C., ere with her parents, Mr. end FarmviUe, spent the week-end with Mrs. W .R. Reynolds. Mrs. J A. Burke - . , _ _ _ Captain P. J. Petterseon, of Camp L. W. Bryant has returned from Holebird, Baltimore, spent the week- th Veterens Facility at Roanoke. end in the home of Mr.and Mrs. w , ... C. F . Langran. Mrs. Pettersen J m I W Coleman is reported lU d daughter, Peggy, of Oklahoma, at the Virginia Baptist hospital. are spending some time in the home Friends ere sorry to bear that f M rand MrSl U n n - Jhr. B.NTwyman is sick.We wish Misa LeFern Doss accompanied for him a speedy recovery. His Miss Barbara Ann Johnson to Lynch- da ugh ter, Miss Virginia Twyman, of burg for the week-end. New, York, has been visiting Dr.  d Mrs. Twyman,  Mrs. Ola Patteson Mr. and Mrs. u . W. S. Bryant, of Cullen and Mrs. , h w. M. T.Shipman, of Williams- L. D. Puckett, of Roxboro, were burg and Miss Zeffner Hobson, of visitors in the home of Mr.and Mrs. Lyuahburg, visited in the homes of Leslie Turnes, of Prospect, Sunday.  D.N. Twyman and Mrs. M. j . H.Lawson over the week-end.  No contract bridge club will w . . meet Friday evening with Mrs.Cal- vaiUoUn Moore, who has accented I vin PAkinaA"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "ugh ter, Miss Virginia <mark>Twyman</mark>, of burg for the"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "ugh ter, Miss Virginia <mark>Twyman</mark>, of burg for the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1131.6, 491.57, 1300.9, 723.56], "bbox_id": "9e06b17c16", "file": "AppomattoxNewspapers_1954-1955a_0093.pdf", "page": 1, "text": "Western Railway at their general offices in Roanoke. Mr. Burke was a veteran of the Spanish-American War and World War I. He is survived by a daughter Mrs. Burke Bowers, and a son, Rich ard F. Burke, both of Salem, Vir ginia two sisters, Mrs. James B. Abbitt, Mrs. William T. Steele and two brothers, Richard L. and Jerry A., all of Appomattox, Virginia. Graveside services were conduct ed at 400 P. M. Saturday in Lib erty Cemetery, by Dr. Carl A. Coll ins, Jr. and Dr. Twyman Williams. Military services were participated in by American Legion Post 104 of Appomattox. Pallbearers included Gibson Max well, William T. Steele, Jr. Jerry A. Burke, Jr. William W. Burke Richard L. Burke, Jr., and R. F. Burke Steele."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "ins, Jr. and Dr. <mark>Twyman</mark> Williams. Military services were"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "ins, Jr. and Dr. <mark>Twyman</mark> Williams. Military services were"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1187.04, 442.14, 1349.59, 489.34], "bbox_id": "406f80d5b7", "file": "AppomattoxNewspapers_1933-1936a_0477.pdf", "page": 1, "text": "were W . Flood Sunday. o Miss Virginia Twyman left this week for New York."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "were W . Flood Sunday. o Miss Virginia <mark>Twyman</mark> left this week for New York."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "were W . Flood Sunday. o Miss Virginia <mark>Twyman</mark> left this week for New York."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1700.68, 857.42, 1850.64, 1005.91], "bbox_id": "32fc62f3f1", "file": "TimesVirginian_1978_0009.pdf", "page": 1, "text": "were Mr. and Mrs Richard Nash, Mr. and Mrs. Twyman Nash, Mr. and Mrs. David Carson and Susan. . Mr. and Mrs. Frank Lively and family and Mr. wyJ Mrs. Zimmreiman and faiMfy spent Christmas visiting rmatives in West Virginia. Wendy Nash, daughter of Mr. and Mrs. Winifred Nash is l on the sick list. We hope shell I soon be well again, i Mrs. Laura Ferguson had all"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Nash, Mr. and Mrs. <mark>Twyman</mark> Nash, Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Nash, Mr. and Mrs. <mark>Twyman</mark> Nash, Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [111.66, 481.31, 256.83, 834.29], "bbox_id": "cd40f6668a", "file": "TimesVirginian_1978_0287.pdf", "page": 1, "text": "Wendy Nadi, daughter of Mr. and Mrs. Winifred Nash, have returned home from the hospital after having a tonsil lectomy operation on Tuesday. We wish her the best of lock and a speedy recovery. Mrs. Richard Nash and Mrs. Twyman Nash spent Saturday at Holy Land U.S.A. near Bedford. Mr. and Mrs. Richard Nash visited Mr. and. Mrs. David Carson and Susan Sunday afternoon. Mr. Troy Tucker of Welling ton, Delaware spent the week end here visiting relatives. Mr. Shelbys Tuckers sister has moved here and is living in Appomattox. Mr. and Mrs. Shelby Tucker had lunch with Mr. and Mrs. Edd Collins and Eric of Lynchburg on Sunday. Mrs. Dennis Arnold and children visited Mr. and Mrs. Shelby Tucker Sunday after noon. Chiquita Tucker is celebra ting her sixth birthday today. Congratulations to Chiquita. Shes the daughter of Mr. and"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Richard Nash and Mrs. <mark>Twyman</mark> Nash spent Saturday at"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Richard Nash and Mrs. <mark>Twyman</mark> Nash spent Saturday at"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1841.28, 1547.42, 2471.33, 1751.14], "bbox_id": "13b3daeb08", "file": "AppomattoxNewspapers_1947-1949a_0478.pdf", "page": 1, "text": "Well, we can! The 11th graders re ----- ae Welch Boney, diec and  at her home here Tuesday night Neal following an illness of three months, .,..j was the widow of Robert Bruce Boney. She was born in Butler, Ind May 1, 1881, and moved to Appo mattox County seven years ago from Blackstone. She taught in the county schools since makng her residence here. She is survived by one son, and Anne daughter-in-law, Mr. and Mrs. R, B J. E.  Boney, Jr., and a granddaughter, Virginia Miss Nancy Carol Boney.  Mrs. Jennie Funeral services will be held a F. Trent and the home on Church Street Friday A. M. Interment will be in and Mrs.  Liberty Cemetery. Dr. W. Twyman of Rich-. Williams will officiate."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Liberty Cemetery. Dr. W. <mark>Twyman</mark> of Rich-. Williams will"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Liberty Cemetery. Dr. W. <mark>Twyman</mark> of Rich-. Williams will"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1750.55, 237.04, 1914.92, 403.54], "bbox_id": "a60a4b2e5d", "file": "AppomattoxNewspapers_1905-1912a_0418.pdf", "page": 1, "text": "Weekly Gun Shoot. The report of the Gun Club at their ahoot here on Friday, Sept 22nd, is as follows 8hot at Broke L. L. Shannon 60 ar W. M. Hancock 50 Dr. Twyman 6N Dr Abbitt 60 Mr. Campbell 60 Trap Martin 60 T. W. Moses It. C. Mann 35 G. A. Banner 10"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "M. Hancock 50 Dr. <mark>Twyman</mark> 6N Dr Abbitt 60"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "M. Hancock 50 Dr. <mark>Twyman</mark> 6N Dr Abbitt 60"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.54, 1418.08, 1787.72, 1525.53], "bbox_id": "5e0057c086", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "Wednesday, Ocober 15, the Fresh man Class elected officers for 1941- 42, as follows President, Walter Dresser Vice-president, Jack Burkey Secretary and treasurer, Alice Clapp Reporter, Dorothy Ould For student council, Joe Sites and Twyman Almond. Reporter, Dorothy Ould."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "council, Joe Sites and <mark>Twyman</mark> Almond. Reporter, Dorothy Ould."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "council, Joe Sites and <mark>Twyman</mark> Almond. Reporter, Dorothy Ould."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1968.24, 719.82, 2135.97, 759.87], "bbox_id": "4eed5fe2bf", "file": "AppomattoxNewspapers_1947-1949a_0440.pdf", "page": 1, "text": "Wednesday in the Baptist Church with sermon on Christ in Jerusa lem by Dr. Twyman Williams, pas tor of the Presbyterian Church."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Wednesday in the Baptist Church with sermon on Christ in Jerusa lem by Dr. <mark>Twyman</mark> Williams, pas tor of the Presbyterian Church."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Wednesday in the Baptist Church with sermon on Christ in Jerusa lem by Dr. <mark>Twyman</mark> Williams, pas tor of the Presbyterian Church."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1826.19, 217.56, 2121.79, 511.94], "bbox_id": "d4e2805f4e", "file": "TimesVirginian_1980a_0055.pdf", "page": 1, "text": "We wish all the sick in pur and Mrs. Henry Mann on community a speedy recovery. Saturday. Phillip Benton have returned Mr. and Mrs. Armon Thoina home from the hospital after and boys were supper guests of having his tonsils removed. Mr. Mr. and Mrs. Winifred Nash and Mrs. Clarence Jones and and Wendy Saturday night, son Bruce and Rev. Dan Mr. and Mrs. Ray Layne and Menser visited in this home last Missy, Mr. and Mrs. David week. Carson and Susan and Wendy Mrs. Richard Nash is on the Nash visited Mr. and Mrs. rick list. Richard Nash Sunday. . Mrs. Carroll Mann and Mrs. Twyman Nash and son children visited Mr. and Mrs. Todd attended a birthday party Henry Mann Saturday. Sunday afternoon for Jermey Robin and Stewart Mann Waddell in the home of Mr. and were supper guest of Mike Mrs. Bobby Waddell. Mann Saturday night. Mr. and Mrs. Shelby Tucker Mr. Henry Mann and Mr. visited in the home of Mr. and Clarence Jones spent Saturday Mrs. Frank Lively and granny in Richmond. Sunday afternoon. Visitors of Mr. and Mrs.  Elliott Nash and Dawn Sunday Mrs. Shelby Tucker is having were Mrs. Nelson Mann, Keith, some ear trouble, hopeshell Tony, and Mike, Mr. and Mrs. soon be be better. George D. Nash, Cheryl and Mr. Waymon Lively of Jeff, Mrs. UndS Howard and Edgewater, Md. is spending Stacy, Jennifer Nash and Mr. sometime in the home of Mr. Richard Nash. and Mrs. Frank Lively and . Mr. Ryland Mann visited Mr. Granny lively."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Carroll Mann and Mrs. <mark>Twyman</mark> Nash and son children"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Carroll Mann and Mrs. <mark>Twyman</mark> Nash and son children"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1696.94, 424.77, 1848.19, 1208.53], "bbox_id": "f9dea7c628", "file": "TimesVirginian_1978_0479.pdf", "page": 1, "text": "We welcome our new pastor and family to Central Baptist Church. Rev. Menser preached his first sermon on Sunday night. Our deepest sympathy goes out to the family and love ones of Mrs. Hungate and also to the family of Mr. Rush. Stewart and Robin Mann spent Saturday night with their grandparents Mr. and Mrs. Henry Mann. Mr. and Mrs. Roy Layne and Missy of Lynchburg visited Mr. and Mrs. Richard Nash over the week end. Mr. Ray Layne and Mrs. Twyman Nash spent Saturday in North Carolina. Mrs. Lulu Mann is in the hospital. We wish her the best of luck and a speedy recovery. Mr. and Mrs. Skinney Wooldridge visited Mr. and Mrs. Emery Mullins on Sunday. Mr. and Mrs. Cecil Nash and girls visited Mr. and Mrs. Nelson Mann and boys Sunday evening. Randy St. John spent the week end-in the home of Mr. and Mrs. Pete Banton and Phillip. Keith, Tony and Mike Mann visited in this home on Sunday afternoon. Mr. and Mrs. George D. Nash and children were supper guest of Mr. and Mrs. EUiott Nash and Dawn on Saturday. Sunday visitors in this home were Mr. and Mrs. Nelson Mann and Mr. Loyd Nash. Mrs. Nelson Mann visited Mr. Jimmy Howard in the hospital on Thursday. Jimmy came home on Monday. Mrs. Richard Nash and Mrs. Clarence Jones are on the sick Ifyt. Glad they are feeling JdvV.n oJ Mrs. Cedi Nash and Cecila Nash visited her parents Mr. and Mrs. A. B. Evans Jr. on Sunday. Jennifer Nash ate lunch with Dawn Kerr on Sunday. Cecil Nash visited Mrs. Jimmy Howard and family on Sunday. Mrs. Vernie Jones is not feeling well at this time. We hope shell soon be better. Mr. and Mrs. Shelby Tucker motored to Peaks of Otter and Parkway on Sunday and also visited Mr. and Mrs. Edd Collins and Eric Sunday. Mrs. Jordan Tucker and girls visited Mr. and Mrs. Shelby Tucker and Mr. James Tucker and Mr. James Tucker and Clara Sunday evening."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Ray Layne and Mrs. <mark>Twyman</mark> Nash spent Saturday in"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Ray Layne and Mrs. <mark>Twyman</mark> Nash spent Saturday in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1005.57, 765.15, 2532.64, 939.3], "bbox_id": "38552ab054", "file": "AppomattoxNewspapers_1974-1975a_0310.pdf", "page": 1, "text": "WE USE ONLY THE BEST MATERIALS AND LABOR. M il We invite friends and relatives to come and lets honor aU fathers. Mrs. Richard Nash, Windy Nash and Mr. and Mrs. Ray Layne and Missy were supper guest of Mr. and Mrs. David Carson Sunday night. Jackie Dale Kerr, Keith, Tony and Mike Mann spent Saturday with their grand mother, Mrs. Elliott Nash and Dawn Kerr. Mr. E. R. Ferguson continues about the same. Mrs. Twyman"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "about the same. Mrs. <mark>Twyman</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "about the same. Mrs. <mark>Twyman</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [600.94, 369.52, 762.83, 1004.57], "bbox_id": "6bb0eefdce", "file": "AppomattoxNewspapers_1918-1922a_0093.pdf", "page": 1, "text": "We Presbyterians are glad to welcome the Home Mission Messenger again, commencing with the October number we expect to get it all winter. Mr. E W. Hubard and Mr otan A Twyman went to Rich raond last week on business connected with the schools. Abraham Davis and Richard Taylor have been serving out a jail sentence on the charge of having set fire to some proper ty near Bethlehem church Mr Ashley Grigg, jr., has come home from France and Ir. Mark Teeter, who has been at Panama for some time, has also come home, on furlough. Sow in dust, reap we must is an old saying, aud if there is anything in it the wheat and oat crop nhould be a record breaker. I passed through parts of Campbell, Nelson, Amherst and Buckingham and found that the rain was a general one so far a-, these places were con cerned and now the farmers will resume the sowing of grass and grain with the hope that these crops will get a start be fore winter sets in Some new corn has changed hands at prices varying from 6 to 8 Old corn sold on the local market for 10. Smoked sides of bacon and shoulders sold at 35j, but there has been a sharp decline in the prices of bulk meat. I offered 50c a barrel to gath er apples and couldnt get one mothers son to gather them. They will buy the apples, all right, and pay the cash for them. I offered one party to give them a lot if they would gather them, but everyone is too busy now to do anything, so a few just sit by and do nothing."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "and Mr otan A <mark>Twyman</mark> went to Rich raond"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "and Mr otan A <mark>Twyman</mark> went to Rich raond"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1550.64, 1641.98, 1795.22, 1786.18], "bbox_id": "f38f29652f", "file": "TimesVirginian_1976_0399.pdf", "page": 1, "text": "WE NEED NEW LISTINGS FARMS- HOUSES or INDUSTRIAL PROPERTY COME m OR CA LL . . . . J. A. Williams Real Éstate I Located in the Branch A Bryant Building Route 460 West  Appomattox, Va. W. Twyman Coleman, Salesman, 352-8289"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "West  Appomattox, Va. W. <mark>Twyman</mark> Coleman, Salesman, 352-8289"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "West  Appomattox, Va. W. <mark>Twyman</mark> Coleman, Salesman, 352-8289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1841.26, 1644.01, 2085.57, 1787.96], "bbox_id": "e268f8918b", "file": "TimesVirginian_1976_0428.pdf", "page": 1, "text": "WE NEED NEW LISTINGS FARMS- HOUSES or INDUSTRIAL PROPERTY COME IN OR CALI,  . . J. A. Williams Real Estate Located in the Branch 6 Bryant Building Route 460 West - Appomattox, Va. W. Twyman Coleman, Salesman, 352-8289"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "West - Appomattox, Va. W. <mark>Twyman</mark> Coleman, Salesman, 352-8289"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "West - Appomattox, Va. W. <mark>Twyman</mark> Coleman, Salesman, 352-8289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.91, 1618.49, 2075.09, 1762.19], "bbox_id": "f7d5a05398", "file": "TimesVirginian_1976_0388.pdf", "page": 1, "text": "WE NEED NEW LISTINGS FARMS HOUSES or INDUSTRIAL PROPERTY COM E IN OR CALL . . . . J. A. Williams Real Estate Located in the Branch A Bryant Building Route 460 West - Appomattox, Va. W. Twyman Coleman, Salesman, 352-8289"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "West - Appomattox, Va. W. <mark>Twyman</mark> Coleman, Salesman, 352-8289"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "West - Appomattox, Va. W. <mark>Twyman</mark> Coleman, Salesman, 352-8289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1914.71, 237.56, 2061.96, 922.14], "bbox_id": "44214ad94e", "file": "AppomattoxNewspapers_1971-1973a_0625.pdf", "page": 1, "text": "We are very sorry Mr. H. W. Jenkins is on our sick list but we pray he may soon be well. Mr. and Mrs. Twyman Baldwin and Mr. and Mrs. Robert Jenkins visited Mr. and Mrs. Jenkins Sunday. Mr. and Mrs. Bennett Gilliam of Farmville are visiting Mrs. W. T. Covington and other relatives. A good many were at church Saturday night for the special prayer service for peace. Mr. Raymond Franklin was operated on Monday at Vir ginia Baptist Hospital. His many friends wish for him a very speedy recovery. We were very sorry to hear of the death last week of Mr. Willis Inge. Deepest sympathy is extended his love ones. Supper guest Friday night of Mr. and Mrs. Bennett Gilliam of Farmville were Mrs. J. L. Torrence, Mrs. W. T. Coving ton, Mrs. Otis Smith and Mrs. James Conner. Mr. and Mrs. Thomas Wood- all and daughter, Lisa of Covington spent the week end with Mrs. C. J. Bagby. Mr. and Mrs. Dallas Mangus of Lynch burg spent Saturday in this home. Others calling were Mr. and Mrs. W. H. Wingfield, Miss Julia Wingfield and Mrs. Bill Watson and son, William. Mrs. Thomas Woodall, Lisa, and Mrs. Dallas Mangus visited Mr. and Mrs. W. H. Wingfield and family Saturday afternoon. Mr. and Mrs. Bill Watson and William were visitors Tuesday night of Mr. and Mrs. W. F. Woodall in Lynchburg. Mr. Woodall isnt feeling well but we hope he may soon be well. We are very sorry to learn Mrs. F. O. Covington of Lynchburg is sick, but we pray she may soon be better. She has a sister is very ill in S. C. We wish for her a very speedy recovery. We were very sorry to hear of the death last week of Mr. and Mrs. Watt Morriss son. Much sympathy is extended the family."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "well. Mr. and Mrs. <mark>Twyman</mark> Baldwin and Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "well. Mr. and Mrs. <mark>Twyman</mark> Baldwin and Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1682.16, 736.7, 2195.73, 776.24], "bbox_id": "b4aac03367", "file": "AppomattoxNewspapers_1943-1947a_0107.pdf", "page": 1, "text": "We are informed that two cars j Sgt Herbert Abbitt, For . j Seymour Johnson Field, N C.-Pvt. struck Mr Gowin, who was walking,  Washington, Md. spent several days Frederick W . Twyman, son of the and hat a preliminary hearing on  last week w.h his parent. Mr. and late Dr. D N. Twyman, of Appo- the tragedy has been set. Mrs. G.F.Abbitt, Sr., at Vera."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "several days Frederick W . <mark>Twyman</mark>, son of the and"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "several days Frederick W . <mark>Twyman</mark>, son of the and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1492.55, 551.19, 1679.02, 1168.88], "bbox_id": "7cabb4600e", "file": "AppomattoxNewspapers_1939-1943a_0515.pdf", "page": 1, "text": "Watt Stanley, of Clifton Forge was home last week-end. Mrs. T. B. Collins spent the week- - nd in Portsmouth. Mrs. C. F. James spent the week end in Richmond. Miss Rachel Harvey, who is em-  loyed by the State Highway De partment at Chatham, has been trans ..erred to Fincastle. Lewis McDearmon spent- yester day in Richmond. Mr. and Mrs. C. M. Harvey and Mrs. H. A. Mitchell spent Friday in the -home of Mrs. H. A. Torrence. Mrs. W. D. Patterson spent Sun day in Lynchburg. Miss Eula Mae Carter, of Lynch- .-org spent the week-end at her home here. Miss Catherine Torrenae spent the week-end in Lynchburg. Mr. and Mrs. H. A. Torrence, liss Annie Torrence, Jim Lucado J, H.  Torrence and Misses Helen  nd Catherine Torrence spent Sun day in the home of Mrs. David Har- _ l s  in Lynchburg. Mrs. Emma Nowlin spent some imerlast week with Mrs. R. W. Morris. Capt. and Mrs. Charles F. James, Jr., of Fortess Monroe, have an nounced the birth of a daughter, Barbara Scott, born at the Medical Hospital of .Virginia, Richmond, on Friday September 11. Mr. and Mrs. F. C. Dresser ac- ompanied their son, Frankie, to V. M. , Lexington, Monday where be matriculated as a cadet. Mrs. James Carson and son, of Lynchburg were visitors in Appo mattox Saturday. Robert Allen Sears, who has been visiting his roommate in New York, hab returned to his home here nd will remain for -a few days be- ore leaving for V. P. I., Blacks burg. Emmett Dinkins, of Portsmouth, and Twyman Conner, of Lynchburg pent Friday night in the home of Mrs. T. U. Conner. Mr. and Mrs. R. B. Hudgins and Miss Patty Featherston spent sever al days this week in Richmond."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Dinkins, of Portsmouth, and <mark>Twyman</mark> Conner, of Lynchburg pent"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Dinkins, of Portsmouth, and <mark>Twyman</mark> Conner, of Lynchburg pent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [419.5, 466.04, 579.0, 700.74], "bbox_id": "efa961a406", "file": "AppomattoxNewspapers_1908-1909a_0582.pdf", "page": 1, "text": "Watt Abbitt attended court at Buckingham Tuesday.  t  Mr. and Mrs. Burke Steele, f Washington, D. C., and WB- .Lam Steele, spent the week-end with Mrs. W. T. Steele.  O  Carlton and Wilber Ferguson of Cullen, visited in the home of Mrs. H. Conner during the weelr-eod.   Mrs W. F. Woolfork a n d son, Billy, of Petersburg are visiting in the home of W. M. Hancock this week,    Miss Virginia Twyman, of Roanoke, was called home due to the Bines of her mother, Mrs. D. N. Twyman."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "this week,    Miss Virginia <mark>Twyman</mark>, of Roanoke, was called"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "this week,    Miss Virginia <mark>Twyman</mark>, of Roanoke, was called"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [401.05, 381.53, 585.27, 1849.37], "bbox_id": "b336891eb0", "file": "AppomattoxNewspapers_1926-1933a_0129.pdf", "page": 1, "text": "Washington.Weather maps to eight layers, showing wlint conditions the aviator may expect when he lies hath low and high, are now being made regularly as a part of the official government weather report. Ground weufher observations alone have been found to be Inadequate for dying use. and the hlgh-altltude ob servations have also been found use ful in making the regular weather forecasts. In fact, the wenther seems to brew at the higher levels, and the observations, obtained by small bal loons and kites, often give Informa tion unobtainable nt the level of the earths surface. 43 Balloon Stations Send Data. The data used In the npper-atr weather maps come to the weather bureau from forty-three halloon sta tions throughout the country. The army has eighteen, while the navy tins ten balloon stations and one air- nlane observer. The wenther burenu also receives alr-aloft reports of temperature and humidity from five stations where kites are sent up with raeteorollglcal In struments. As kites are dependent upon wind, the wenther bureau Is about to try out a small captive bal loon. lust large enough to carry the oecessury Instruments, at Due West, S. C for use when Fhe air Is light. Helicopters will replace balloons and kites In the future. In the opinion ot Mr. Mitchell. Slvew Bumpy Air. Bumpy air, which makes rough rid ing for flyers. Is dearly shown by these kite reports. One recent re- laid from Orosheck, Texas, showed three strata of air-In an altitude of 1,800 meters. A meter Is a little more than three feet. The complete aero- logical observation map gives wind direction, velocity, kind and direction of clouds, and visibility as at surface. 250 meters above, 500 meters. 1,000 meters, 1,500 meters, 2,000 meters, 3,000 meters and 4,000 meters above. The balloons sometimes achieve much higher altitudes. The origin of the wind, whether polar or tropical. Is also known to the weather bureau and aids In weather txrar its entirely jvblcHif the bittsr outburst of feeling which was so character istic four years ago. It is alleged that such proceedings as were carried on four years ago were very distasteful to many of the citizens of the county and for that reason the rank and file of voters are slow to express their choice for fear of the recurrence of hostile feeling. While no doubt man j have de cided views a to whom they will vote for, but little or no pub lic demonstrations have taken place throughout the county and while a few public gatherings have been held, the attendance at these meetings have been small and little interest in such meetings have been manifested. For the house of delegates, Col. A. J. Terrell is opposed by D- N. Gannaway, both of Buck ingham. Colonel Terrell being a candidate for what is called the organizations forces and Mr, Gannaway representing t h e antis. In this, like other county contests, there has been no issue and the fight hangs chiefly on personalities. In some quarters, the question of the short ballot issue has been in jected in which Mr. Gannaway ias declared himself as opposed to the short ballot, while no such statement has come from Mr. Terrell other than he is for the administration policies. As the short ballot, is an administra tion policy, however, it is regard ed that Mr. Terrell is for it, and su far, that is about the main is sue involved between the two candidates for that office. With but four more days be fore election more activity is teen on every hand and the poli tical pot is warming up to a con siderable degree in some of the local fights. For treasurer R. L. Burke is opposed by Dr. D. N. r wyman for commissioner of revenue Richard OBrien is op posed by George Purdum for supervisor Don Moses and C. S McDearmon are both candidates for Southside district to be made vacant by D. N. Twyman, the ncumbent, who is running for treasurer in Cloverhill district F. A- OBrien, the incumbent, is opposed by E. M. Drinkard, ant n Stonewall district Sam Ander on, the incumbent, is being op- tost d by A. B. Thornhill. During the past few days quite i contention has arisen over an ict of the registrars who have either by error of ignorantly sent rat two different kinds of in- structions to voters who wish to I vote by mail, this vote will  be heavy. Every available voter a being solicited for his or her vote whether they are in the"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "vacant by D. N. <mark>Twyman</mark>, the ncumbent, who is"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "vacant by D. N. <mark>Twyman</mark>, the ncumbent, who is"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [852.49, 384.47, 1033.01, 1157.77], "bbox_id": "a8e9eb5f44", "file": "AppomattoxNewspapers_1915-1918a_0502.pdf", "page": 1, "text": "War Stamp Campaign Corn mitt Chairm an, L. Crawlay. Each m inister in county. Row. L. F. Gallaham, Appo m attox. Rev C. W. McElroy, Appo m attox. Rev. J . C. Lops, Appomattox. Rev. O. W. Taylor, Pamplin Rev. A. K. Lambdiu, Pam  plin. Rev. A. J . Ponton, Pamplin Rev. G.A. Chocolate, Phenix Rev. J . H. Gordon, Vera. Rev. O. R. James, Concord. Hon. 8. L. Ferguson, Appo m attox. Claude 8m ith, Appomattox. A. T. Inge, Appomattox. Don Moses, Appomattox. Prof. Bigley, Pamplin. Misa Jennie Godwin, Appo m attox. Hon. J . W. Cawthorn, Appo m attox.  P itser Gills, Appomattox. Hon. R. L. Burke, Appomat tox. 8. Pieree Loving, Pamplin. L.N. Ligon, postmaster,Pam plin. Hon. Willia Ligon, Pamplin. B. G. Anderson, Appomattox. Fenton Harvey, Pamplin. Boy ScoutsJ C. Leps, Ap pom attox. A. H. Clement, Appomattox Dr. D. A. Christian, Vera. Dr. H. 8. H art, Pamplin. Dr. Chap Jonee, Appomattox Dr. D. N. Twyman, Appo m attox. N. R. Feathereton, Vera. E. LeRoy Smith, Appomat tox. Robert Irby, Appomattox. Publicity CommitteeMinis ters of oonnty, A H. Clement L. Crawley. Committee On SchoolsEach teacher in county, and Super intendent of Schools N. R Feathereton. Personal Canvass  To be done by Scouts and sohool ohil dren. Womans OrganizationMrs R. O. W agner, Mrs. Pitzer Gills Mrs. 8. L. Ferguson, Miss Anna Jones, Miss Kate Franklin,Mrs. S. D. Cheatham, Miss Jacque line Atwood, Miss Enla May Burke, Miss M attie Sears, Mrs. John Sears. Mrs. W. T. Steele, 8pout"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "Appomattox Dr. D. N. <mark>Twyman</mark>, Appo m attox. N."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "Appomattox Dr. D. N. <mark>Twyman</mark>, Appo m attox. N."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [427.71, 642.26, 571.3, 1021.9], "bbox_id": "55e0ba4ee2", "file": "AppomattoxNewspapers_1922-1923a_0154.pdf", "page": 1, "text": "Wanted 2 colored hands for yeai 3, must be single. 14 Biss Hilda Owen spent the pidays with her sister, Mrs. Tfl. Byrne, here. Mies Charlotte Shipman, of illiamaburg, is spending a idays in the home of Dr. D. I Twyman. Alias Florence E. Caldwell, no is teaching in Roanoke eat the holidays with her Ime folke. Misslva Ferguson will leave Jiureday for her school at dian Valley in Floyd county, here she is teaching. . C. Smith reports a swarm bees at his house during oas. Perfect Virginia spring ys bring out the bees. jr. and Mrs. Ottie Davidson Ive a dance Friday night in nor of her brother, Larkin jillianis, of Lynchburg. Annual Stock Holders jeting of the Farmers Nation Bank will be held in the ok Tuesday, January 9 tl, at"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "of Dr. D. I <mark>Twyman</mark>. Alias Florence E. Caldwell,"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "of Dr. D. I <mark>Twyman</mark>. Alias Florence E. Caldwell,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [441.85, 481.34, 609.42, 521.59], "bbox_id": "ab5d262d70", "file": "AppomattoxNewspapers_1954-1955a_0426.pdf", "page": 1, "text": "W. Twyman Williams, Pastor Sunday School, 10 A. M. Worship, preaching by the pas tor, 11 A. M."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor Sunday School, 10 A. M. Worship, preaching by the pas tor, 11 A. M."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor Sunday School, 10 A. M. Worship, preaching by the pas tor, 11 A. M."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1599.57, 504.82, 1766.0, 577.22], "bbox_id": "6751eaab59", "file": "AppomattoxNewspapers_1952-1954a_0289.pdf", "page": 1, "text": "W. Twyman Williams, Pastor Sunday School, 10 A. M. H. B. Pack, Supt. 1100 A. M., Worship, preaching by pastor. . 630 P. M. Youth Fellowship, pro gram meeting."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor Sunday School, 10 A. M. H. B. Pack, Supt. 1100 A. M., Worship, preaching by pastor. . 630 P. M. Youth Fellowship, pro gram meeting."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor Sunday School, 10 A. M. H. B. Pack, Supt. 1100 A. M., Worship, preaching by pastor. . 630 P. M. Youth Fellowship, pro gram meeting."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1267.74, 844.4, 1393.13, 853.4], "bbox_id": "f4bd810cef", "file": "AppomattoxNewspapers_1952-1954a_0433.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [510.95, 1290.88, 644.4, 1299.88], "bbox_id": "69ac215807", "file": "AppomattoxNewspapers_1952-1954a_0397.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1531.44, 408.65, 1664.26, 419.15], "bbox_id": "4e93396a9c", "file": "AppomattoxNewspapers_1952-1954a_0313.pdf", "page": 1, "text": "W Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1611.87, 399.96, 1745.25, 410.46], "bbox_id": "cdd3b6cfb8", "file": "AppomattoxNewspapers_1952-1954a_0283.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2133.59, 848.88, 2267.82, 858.88], "bbox_id": "96027b7de1", "file": "AppomattoxNewspapers_1952-1954a_0273.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1204.3, 606.89, 1336.68, 616.39], "bbox_id": "78594e3125", "file": "AppomattoxNewspapers_1952-1954a_0269.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1199.06, 521.25, 1334.48, 530.75], "bbox_id": "2edca0a3f2", "file": "AppomattoxNewspapers_1952-1954a_0269.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1196.67, 399.52, 1332.65, 409.02], "bbox_id": "e3659ece2c", "file": "AppomattoxNewspapers_1952-1954a_0269.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1909.9, 773.71, 2041.96, 783.21], "bbox_id": "d31df8c633", "file": "AppomattoxNewspapers_1952-1954a_0104.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1073.54, 792.85, 1211.52, 803.35], "bbox_id": "f2e70d9fc2", "file": "AppomattoxNewspapers_1960-1962b_0299.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [412.8, 355.09, 556.79, 365.59], "bbox_id": "b345ccbccd", "file": "AppomattoxNewspapers_1947-1949a_0541.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.24, 383.73, 2124.22, 393.23], "bbox_id": "32044d6a9f", "file": "AppomattoxNewspapers_1947-1949a_0441.pdf", "page": 1, "text": "W. Twyman Williams, Pastor"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Pastor"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2173.52, 547.0, 2345.22, 596.64], "bbox_id": "35467aaae4", "file": "AppomattoxNewspapers_1960-1962b_0448.pdf", "page": 1, "text": "W. Twyman Williams, Minister Church School, W A. M. Worship, 11 A. M, Preaching by Mr. Charter Wells, on invitation of Pulpit Committee."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister Church School, W A. M. Worship, 11 A. M, Preaching by Mr. Charter Wells, on invitation of Pulpit Committee."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister Church School, W A. M. Worship, 11 A. M, Preaching by Mr. Charter Wells, on invitation of Pulpit Committee."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2170.62, 447.16, 2340.17, 516.3], "bbox_id": "7a76876872", "file": "AppomattoxNewspapers_1960-1962b_0448.pdf", "page": 1, "text": "W. Twyman Williams, Minister 945 A. M. Worship. Special Centennial Service. 1045 A. M. Church School. Mr W. M. Routon, Supt. N ote change in hours o f serv ice."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister 945 A. M. Worship. Special Centennial Service. 1045 A. M. Church School. Mr W. M. Routon, Supt. N ote change in hours o f serv ice."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister 945 A. M. Worship. Special Centennial Service. 1045 A. M. Church School. Mr W. M. Routon, Supt. N ote change in hours o f serv ice."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1563.36, 1641.23, 1837.41, 1701.13], "bbox_id": "9a15e77e13", "file": "AppomattoxNewspapers_1960-1962b_0454.pdf", "page": 1, "text": "W. Twyman Williams, Minister 10 A. M. Church School, Mr. C L. McDeatgpon, Supt. Worship, 11 A. M. Preaching Ilanford Hmtourv lav I P tor. Oommitment Sunday.  y I Youth Grous at 630 P. M."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister 10 A."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister 10 A."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [880.81, 349.09, 1015.31, 359.59], "bbox_id": "05cdfdbe24", "file": "AppomattoxNewspapers_1952-1954a_0262.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2145.04, 668.79, 2279.82, 679.29], "bbox_id": "a19a009f1e", "file": "AppomattoxNewspapers_1952-1954a_0257.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1812.71, 787.97, 1948.34, 797.97], "bbox_id": "8d85d759de", "file": "AppomattoxNewspapers_1952-1954a_0249.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1975.71, 407.67, 2109.84, 418.17], "bbox_id": "003d2a8a04", "file": "AppomattoxNewspapers_1952-1954a_0244.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1037.03, 413.87, 1169.39, 424.37], "bbox_id": "b4cf2971c6", "file": "AppomattoxNewspapers_1952-1954a_0230.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2084.81, 483.12, 2187.31, 503.22], "bbox_id": "45b9c46769", "file": "AppomattoxNewspapers_1952-1954a_0049.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2179.24, 331.06, 2333.68, 341.06], "bbox_id": "65373211ee", "file": "AppomattoxNewspapers_1960-1962b_0448.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2179.21, 278.77, 2336.9, 289.27], "bbox_id": "a5b42a177f", "file": "AppomattoxNewspapers_1960-1962b_0425.pdf", "page": 1, "text": "W. Twyman Williams, Minister."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister."}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [452.9, 570.89, 598.68, 581.39], "bbox_id": "22ddab88d0", "file": "AppomattoxNewspapers_1954-1955a_0426.pdf", "page": 1, "text": "W. Twyman Williams, Minister"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams, Minister"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2123.82, 871.91, 2376.86, 987.8], "bbox_id": "cb00cb8a6b", "file": "AppomattoxNewspapers_1947-1949a_0319.pdf", "page": 1, "text": "W. Twyman Williams as pastor of the Appomattox group of Presby terian Churches will meet at Appo mattox Court House Church Sun day, September 26th, at 11 A. M. Rev. H. W. Shannon will preach the sermon and moderate the meet ing. Dr. Massie, of Hampden-Syd- . ney will deliver the charge to the n, 42, local bus- pastor. Elder R. B. Lynchburg hos- Farmville will deliver months illness."}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams as pastor of"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Williams as pastor of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [996.25, 1586.26, 1179.22, 1596.76], "bbox_id": "5abcf6aee8", "file": "TimesVirginian_1976_0143.pdf", "page": 1, "text": "W. Twyman Cqleman, Salesman, 352-8289"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Cqleman, Salesman, 352-8289"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Cqleman, Salesman, 352-8289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1919.23, 1743.11, 2110.05, 1753.11], "bbox_id": "9216c78695", "file": "TimesVirginian_1978_0386.pdf", "page": 1, "text": "W Twyman Cplwnan, Saiesman. 3524289"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W <mark>Twyman</mark> Cplwnan, Saiesman. 3524289"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W <mark>Twyman</mark> Cplwnan, Saiesman. 3524289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1380.5, 1357.65, 1465.55, 1377.25], "bbox_id": "c4ddc29e75", "file": "AppomattoxNewspapers_1974-1975a_0112.pdf", "page": 1, "text": "W. TWYMAN COLI 352-8289"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLI 352-8289"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLI 352-8289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2215.69, 586.87, 2347.89, 607.42], "bbox_id": "582924e1d6", "file": "AppomattoxNewspapers_1974-1975a_0403.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With 1"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With 1"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With 1"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [900.94, 1485.54, 1018.05, 1505.14], "bbox_id": "05f1fc1796", "file": "AppomattoxNewspapers_1974-1975a_0471.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2378.39, 1303.34, 2494.77, 1324.19], "bbox_id": "5b10e8c931", "file": "AppomattoxNewspapers_1974-1975a_0438.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [301.71, 1460.22, 417.21, 1480.52], "bbox_id": "d2fe7246cc", "file": "AppomattoxNewspapers_1974-1975a_0432.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [299.74, 1473.79, 414.21, 1493.34], "bbox_id": "9de0648e2a", "file": "AppomattoxNewspapers_1974-1975a_0395.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.32, 1464.51, 1890.37, 1485.31], "bbox_id": "cdefa5d2a7", "file": "AppomattoxNewspapers_1974-1975a_0389.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1162.12, 1467.32, 1279.57, 1488.57], "bbox_id": "1d33c1a257", "file": "AppomattoxNewspapers_1974-1975a_0378.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1026.23, 992.22, 1141.27, 1012.52], "bbox_id": "f8c442253a", "file": "AppomattoxNewspapers_1974-1975a_0372.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.55, 1479.53, 1589.97, 1499.33], "bbox_id": "dd841706a1", "file": "AppomattoxNewspapers_1974-1975a_0363.pdf", "page": 1, "text": "W. TWYMAN COLEMAN With"}, "highlight": {"text": {"matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}}, "highlights": [{"field": "text", "matched_tokens": ["TWYMAN"], "snippet": "W. <mark>TWYMAN</mark> COLEMAN With"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1804.04, 1588.54, 1986.15, 1599.04], "bbox_id": "5fd640ac90", "file": "TimesVirginian_1976_0125.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 3p2-8289"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 3p2-8289"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 3p2-8289"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.84, 1744.65, 1833.3, 1771.8], "bbox_id": "828680a8e4", "file": "TimesVirginian_1978_0528.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 3529289 DAY 352-7020 NIGHTS 24S-5704"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 3529289 DAY 352-7020 NIGHTS 24S-5704"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 3529289 DAY 352-7020 NIGHTS 24S-5704"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1378.52, 1615.79, 1806.45, 1647.58], "bbox_id": "400d8e498d", "file": "TimesVirginian_1976_0183.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 v Office 352-7020 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 v Office 352-7020 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 v Office 352-7020 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1677.83, 908.04, 2104.77, 939.18], "bbox_id": "589075facf", "file": "TimesVirginian_1976_0226.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [879.87, 1605.29, 1310.65, 1636.58], "bbox_id": "5d086ad521", "file": "TimesVirginian_1976_0172.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.24, 1495.26, 2110.9, 1523.8], "bbox_id": "160df6bb8e", "file": "TimesVirginian_1976_0092.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1656.7, 1414.24, 2084.92, 1443.63], "bbox_id": "48d01eea9f", "file": "TimesVirginian_1976_0043.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [448.1, 1613.22, 879.91, 1645.01], "bbox_id": "33672daec4", "file": "TimesVirginian_1976_0188.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Office 352-7020  Home 248-57fti"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020  Home 248-57fti"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Office 352-7020  Home 248-57fti"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1373.71, 1480.67, 1794.24, 1508.74], "bbox_id": "3736ff91b1", "file": "TimesVirginian_1976_0101.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 office 352-7020 - Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 office 352-7020 - Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 office 352-7020 - Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1895.71, 1154.37, 2139.2, 1164.37], "bbox_id": "440359fd5d", "file": "TimesVirginian_1978_0289.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 i"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 i"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 i"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1474.55, 1379.56, 1773.2, 1404.85], "bbox_id": "dbee317539", "file": "AppomattoxNewspapers_1974-1975a_0575.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1481.5, 1327.71, 1779.93, 1353.62], "bbox_id": "8e57a24ece", "file": "AppomattoxNewspapers_1974-1975a_0554.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [264.0, 1509.49, 564.53, 1538.06], "bbox_id": "93f930bd83", "file": "TimesVirginian_1976_0084.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 Home 248-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Home 248-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 Home 248-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1869.85, 1722.82, 2133.83, 1750.8], "bbox_id": "92970f566d", "file": "TimesVirginian_1978_0444.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 DAY 352-7020 NIGHTS 24S-3794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 DAY 352-7020 NIGHTS 24S-3794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 DAY 352-7020 NIGHTS 24S-3794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.91, 1740.36, 2115.59, 1769.19], "bbox_id": "b1f47cdfbc", "file": "TimesVirginian_1978_0461.pdf", "page": 1, "text": "W. Twyman Coleman Salesman 3528289 DAY 352-7020 NIGHTS 243-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman Salesman 3528289 DAY 352-7020 NIGHTS 243-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman Salesman 3528289 DAY 352-7020 NIGHTS 243-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1873.39, 1751.58, 2135.46, 1780.2], "bbox_id": "ea09136f8b", "file": "TimesVirginian_1978_0518.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 3528289 DAY 352-7020 NIGHTS 241-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 3528289 DAY 352-7020 NIGHTS 241-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 3528289 DAY 352-7020 NIGHTS 241-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1877.09, 1748.22, 2139.41, 1775.88], "bbox_id": "f4bd0baab4", "file": "TimesVirginian_1978_0429.pdf", "page": 1, "text": "W. Twyman Coleman, Salesman, 352-8289 DAY 352-7020 NIGHTS 240-5794"}, "highlight": {"text": {"matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 DAY 352-7020 NIGHTS 240-5794"}}, "highlights": [{"field": "text", "matched_tokens": ["Twyman"], "snippet": "W. <mark>Twyman</mark> Coleman, Salesman, 352-8289 DAY 352-7020 NIGHTS 240-5794"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
