{"document": {"bbox": [1827.33, 1313.26, 1987.65, 1489.3], "bbox_id": "63bfa5eaf7", "file": "AppomattoxNewspapers_1892-1898a_0246.pdf", "page": 1, "text": "wealth vs Wm. Vawter, were con tinued to the next term of the court. The following officers-elect quali fied in open court H. D. Flood, Attorney for the commonwealth, L. E. Smith, Commissioner of the Rev enue F. W. Mckinney, constable for Clovef Hill district P.H. Fore and Jos._Button, Justices of the Peace for Clover Hill district Judge Crate, of Prince Edward County, Was present on Saturday to sit in a case in which Judge Chris- was a witness."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "wealth vs Wm. <mark>Vawter</mark>, were con tinued to"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "wealth vs Wm. <mark>Vawter</mark>, were con tinued to"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1123.7, 843.95, 1233.92, 852.95], "bbox_id": "bcb4d1b54a", "file": "AppomattoxNewspapers_1915-1918a_0377.pdf", "page": 1, "text": "VAWTER IS ACQUITTED."}, "highlight": {"text": {"matched_tokens": ["VAWTER"], "snippet": "<mark>VAWTER</mark> IS ACQUITTED."}}, "highlights": [{"field": "text", "matched_tokens": ["VAWTER"], "snippet": "<mark>VAWTER</mark> IS ACQUITTED."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1704.5, 829.7, 2018.52, 1576.14], "bbox_id": "fe7f3c8f1f", "file": "AppomattoxNewspapers_1915-1918a_0370.pdf", "page": 1, "text": "turned home last Sunday, after donef g womn- spending two weeks with her 0methi J 6 done for nionoa Mva Pall U11 I tflUID. rltll ftll dU0 rUipOCty some of the girls and women of nieces, Mrs. Beil Francis, and Mrs. Ammie Car wile, near Ev- ol. Mrs. Ammie Carwile and our oounty are very extrava gant. In many instances they son, Lacy, spent last Sunday! d no kat they are.  ieh  -  U u u ___ _ xxrni I Some are wasteful in the prep night with Mrs iamson. Maggie Will- aration and cooking some do not understand canning, dry ing or storing of food stuffs iÍÉr two actually dont know how to sew or cook. Long Creek Big fires, and overcoats, and.w _ _ _____ ____ _____ _ overhanging clouds tell us we I By all means, we should have are having the long wet spellla helper to aid the girls and in May. women in their work this sum- There was a small congrega-lmer. tion at Concord Sunday. The I The Oounoil of Safety is ex- Re v. Ponton gave a good talkI peoting every girl and woman he said he wouldnt preach a I in Appomattox to do her duty, sermon. I This means to raise a garden, Mr. and Mrs. R. J. Paulettlcan, preserve, dry, or store have a very sick baby with I some artiole of food. If you pneumonia. I havent the money to buy the Mr. R. S. Simmons is visiting I cans the banks will furnish the his old home in Botetourt. I money to buy them. The Baok Mr. and Mrs. Leslie Moore I of Appomattox, and the banks have gone to their new home I of Lynohburg are at your ser in West Virginia. I vice. Mr. 0. T. Taylor has return-1 The following has just been ed from a visit to his sons in I received from Mr. D. B. Ry- West Virginia. , lland, business manager of the News is very scaroe nowa-1 Lynchburg Chamber of Corn- days. Imerce. Mr. Ryland says I Give us some more of Bus-1 have gotten our banks here to ters diary, Charlotte Line. lagree to finanoe the purchase All one hears now is wa, I of cans that may be needed by and the Vawter case. I the Appomattox County Can- It seems like our people havelning Clubs, up to ten to fifteen tbe automobile fever around I thousand cans. here, as there are five or six ini To get this money, of oourse our neighborhood. I it would be necessary to send a Well, I will give room for I formal application from the some ons else who has moreldub the notes to run to No- news. Ivember 1 st if necessary the  . , .time can be extended.  The Chamber of Commerce There was a pie party given 10f Lynchburg has favored us at the home of Mr. and Mrs. 8 .with many courtesies. They . Ragland on Saturday night,! were kind enough to send us May 5, but owing to the inclem- jnr. George Caskie, who made ent weather tbe crowd was I a very able address last Satur- small. But quite a nice little L ay night. We wish it oould sum was raised. There was a have been so all our people large cake for the prettiest j oould have heard him. Anoth- girl and Miss Clara Caldwell, 10r favor they have agreed to -receiving the most votes, won I pay one fourth of tho cost of the cake. Also had two boxes the first four pure bred bulls of candy to guess off. Mr. H. I brought into the oounty be-  Anderson won one and Mr.  tween April 15,1917, and Janu- . C. Hall won the other bothlary   9 g. seem to be lucky at guessing. j wiH write more definitely of Everybody seemed to enjoy I this proposition in the near fu- themselves very much until a ture. B. G. AU drbson , ___ County Agent"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "needed by and the <mark>Vawter</mark> case. I the Appomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "needed by and the <mark>Vawter</mark> case. I the Appomattox"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [852.7, 495.74, 1011.47, 729.09], "bbox_id": "dfdd7a5183", "file": "AppomattoxNewspapers_1898-1902a_0142.pdf", "page": 1, "text": "The Miller Manual School, In Albemarle oonntT, on of the largest and most prosper ous institutions of tha kind in tbe South, baa recently accomplished on of the moat in teresting engineering feats that has been at tempted in Virginia for some time. This sobool, which was provided for In tko will of the late Samuel Miller, of Albemarle, is located near Greenwood depot, at the foot of tbe mountains in that county. Until re cently nil of the machinery used in the var ious shops la the institution was driven by earn engines, Mr. Vawter, the principal of tho sobool, ooncelved the idea of convert ing the old atream on the top of the moun tains Into a motive power to take the place of steam. A reservoir was constructed with a capacity o f 10,0 0,000 gallons, and Into this tbe stream was diverted. Tbe water Is brought down from tbo reservoir to the work shops In heavy Iron pipes. Tbe ele vation gives a fall of 250 teat, the highest fall used for manufacturing purposes, prob ably, in Virginia. The tnrbine wheel, which la propelled by this steam, furnishes motive power for generating eleotrlclty, which fur nishes the motive power for driving all the machinery."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "by earn engines, Mr. <mark>Vawter</mark>, the principal of tho"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "by earn engines, Mr. <mark>Vawter</mark>, the principal of tho"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [889.18, 465.24, 1048.16, 696.69], "bbox_id": "d7dad9c85e", "file": "AppomattoxNewspapers_1898-1902a_0140.pdf", "page": 1, "text": "The Miller Manual School, In Albemarle county, one of tbo largest and most prosper ous Institutions of the kind In the South, has recently accomplished one of the most in teresting snglnesrlng feats that has been at tempted In Virginia for some time. This sehool, which was provided for In the will of the late Samuel Miller, of Albemarle, Is located near Greenwood depot, at the foot of the mountains la that eounty. Until re cently til of tbs maehinery used in the var ious shops In the Institution was driven by steam anginas. Mr. Vawter, the principal of tho school, oonoelved tho idea of convert ing the old stream on tho top of tho moun tains Into a motive power to take ths place of steam. A reservoir was constructed with a capacity of 10,0 0,000 gallons, and into this tbs stream was diverted. The water Is brought down from tho reservoir to the work shops In heavy Iron pipes. The ele vation gives a fall of 250 feet, the highest fall used for manufacturing pnrposes, prob ably, in Virginia. The tnrbine wheel, wbloh is propelled by this steam, furnishes motive power for generstlng eleotriolty, which fur nishes the motive power for driving til the machinery."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "by steam anginas. Mr. <mark>Vawter</mark>, the principal of tho"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "by steam anginas. Mr. <mark>Vawter</mark>, the principal of tho"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1387.88, 304.56, 1554.39, 1198.16], "bbox_id": "65188fbfdd", "file": "AppomattoxNewspapers_1902-1905a_0310.pdf", "page": 1, "text": "The fourteenth annual confercncf of the Home Mission Society of tin Virginia Conference of the Methodise Episcopal Church South, adjourner at Lynchburg to meet next year a Central church, Portsmouth. The fol lowing officers were elected for tin ensuing year Mrs. W. J. Young, o1 Richmond, president Mrs. J. T. Mas tin, of Richmond, first vice-president her assistant to bp appointed Mrs L. B. Betty, of Richmond, second vice president Mrs. W. W. Lear, of Char iottesville, third vice-president Mrs M. N. Moorman, of Lyqchburg, cor responding secretary Mrs. R. I. Ow- ens, of Lynchburg, assistant Mrs. C V. Winfree, of Lynchburg, treasur er Mrs. H. E. Wall, of Farmville, re cording secretary Mrs. Minetrec Folkes, of Richmond, superintendent of literary and press work. J. Scott Moore, clerk of the Rock- oridge county trustee electoral school Doard, has been notified by Frank P. Brent, secretary of the state board of education, that Superintendent Southall has appointed G. Willis Ef- liuger, of Natural Bridge distret, acting superintendent of schools of Rockbridge county, vice Dr. A. Nash Johnston, deceased, until the edu cational board of Virginia can ap point a successor. Under a decision rendered by the state corporation commission the Dis mal Swamp Canal Company must pay taxes to tbe state just as other orporations do. The company was also fined ioo and costs for fail ure to make returns of its property for taxation. The company will prob ably take an appeal. Contract for fuel for use in the pub lic building at Norfolk, Va., for the next fiscal year has been awarded to the Norfolk Coal and Ice Company. The Norfolk and Southern Rail road, recently indicted by the Prin cess Anne county grand jury, was fined 300 for violating the Jim Crow car law, which provides for separate coaches fqr the races. This is the first conviction of its kind in the state. Jilted by the man to whom she came to Richmond from Norfolk to wed two months ago, Mrs. Lula B. Harper, formerly of Ohio, committed suicide sometime during the night by drowning herself in the reservoir lake near Richmond. Her body was found floating in three and a half feet of water, showing that she had lain down and determinedly kept her head un der the surface until death came. Het hat, pocketbook and comb were found on a bench near the edge of the water. At the concluding session of the Virginia Conferences of Charities and Corrections at Norfolk the following officers were elected C. E. Vawter, of Albemarle county, president Rev. C. S. Blackwell, Norfolk John M Higgins, Richmond Coi. S. W . Lane. Williamsburg, Prof. C. W. Kent. Charlottesville, and Thomas H. D Lafferty, Roanoke, vice-presidents. A heavy freight train crashed inte the rear ot a passenger train neat Penóla, on the Richmond, Fredericks burg and Potomac Railroad. The last oach was split open and Engineer Harry Perdue, of Richmond, was pain fully bruised. Failure to display sig nals is said to have been the cause. The stockholders of the Krise Bank- ing Company have decided to con vert that institution into a national bank, to he known as the Americar National Bank of Lynchburg, with a paid up capital of 150,000. J. Thompson Baird was nominated for the mayoralty of Portsmouth Bairds nomination is equivalent tc election. He has been mayor o Portsmouth for twenty-eight years Mayor Baird had two opponents, and it required a two-days contest to de cide the election. George Hansborough, a driver fo the Bèlle Pre Bottle Works of Alexan dria, was killed by an engine on th Southern Railroad at the crossing ir front of the office of the bottle works the horse he was driving being als killed. Mr. Hansborough was abou 35 years old, and is survived by i widow and two children. David Hook, a prisoner at the Win chester jail, escaped from a police man by a clever ruse. He apparenti"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "were elected C. E. <mark>Vawter</mark>, of Albemarle county, president"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "were elected C. E. <mark>Vawter</mark>, of Albemarle county, president"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [133.9, 693.47, 293.12, 747.23], "bbox_id": "fb7dfdc461", "file": "AppomattoxNewspapers_1912-1915a_0107.pdf", "page": 1, "text": "The debate between the Poe and Jef ferson Literary Societies of Massanut- ten Academy on the recall of judges was won by the former. R. G. Vawter, of Greenville, won the medal as the best debater."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "the former. R. G. <mark>Vawter</mark>, of Greenville, won the"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "the former. R. G. <mark>Vawter</mark>, of Greenville, won the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [623.53, 238.95, 781.08, 309.28], "bbox_id": "e3a218c941", "file": "AppomattoxNewspapers_1915-1918a_0396.pdf", "page": 1, "text": "son, William John, Lewis, Claude Nelson, Lewis, Mace I Robert, Morgan, Samuel Hen- Iry, Pankey, Eugene, Scruggs, Charlie Rock, Vawter, Ander son, Vawter, Thomas."}, "highlight": {"text": {"matched_tokens": ["Vawter", "Vawter"], "snippet": "son, William John, Lewis, Claude Nelson, Lewis, Mace I Robert, Morgan, Samuel Hen- Iry, Pankey, Eugene, Scruggs, Charlie Rock, <mark>Vawter</mark>, Ander son, <mark>Vawter</mark>, Thomas."}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter", "Vawter"], "snippet": "son, William John, Lewis, Claude Nelson, Lewis, Mace I Robert, Morgan, Samuel Hen- Iry, Pankey, Eugene, Scruggs, Charlie Rock, <mark>Vawter</mark>, Ander son, <mark>Vawter</mark>, Thomas."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.77, 1131.35, 1519.62, 1836.37], "bbox_id": "af0a4d246f", "file": "AppomattoxNewspapers_1918-1922a_0262.pdf", "page": 1, "text": "Roanoke.The amendments carried In Roanoke City by a vote of 6,097 to 411. Pulaski county gave majorities for tbe amendments ranging from 300 to 500. Bristol City gave majorities for the amendments averaging 544 for to 9 against. Tazewell epunty gave majorities Of 1,000 for the amend ments. Floyd county voted down tho rmo-idments. the vote ranging from 813 for to 823 against. Wythe county voted against tbe amendments by ma jorities ranging from 300 to 575. Roanoke county voted .for com pulsory education amendment 1,339 for to 362 against. Bond issue 1,341 for to 342 against. Amendment 32 carried 1,240 for to 310 against. Amendment 117 for 1,190 against 324. Amendment 133 for 1,320 against 332. Louisa.The tobacco growers of Louisa county organized at Louisa, and took steps to co-operate with sim ilar organizations in other counties of the sun-cured tobacco belt, with the view of advancing the price of tobac. co. The organization will be known as the Louisa branch of the Virginia Sun-cured Tobacco Growers Associa tion. The meeting was well attended by representative farmers from every section of the county and they seemed determined to fully co-operate with the mother organization and to make it cover the entire sun-cured belt. The main point at issues was the present low prices of sun-cured tobacco and the move to protect growers from the result of having tobacco sold for less than cost of production. A committee appointed to confer with similar committees from other counties in the sun-cured belt S. W Shelton, Thevilian C. V. Vawter, Louisa J. S. Wills, county agent, Louisa. Officers elected were as follows S. W. Shelton, president R. S. Dick inson, secretary-treasurer. Kenbridge.The Peoples Bank, a colored institution of this place, was entered by yeggmen, the vault door blown open by explosives and an at tempt made to force the safe. Nearby parties heard the noise and summoned assistance. A few shots fired into the building prevented the robbers from completing the job, they taking fright and running away. Bloodhounds placed upon the trail failed of results and it is thought that their escape was made in an automobile. In the absence of the cashier the full extent of the ioss is not known. Newport News.Thieves entered the plant of Langley Bottling Works here, removed a 1,600-pound safe, loaded it on an automobile truck and transported it to the outskirts of the city, where the strong box was blown open and about 500 in cash and valu able papers removed."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Shelton, Thevilian C. V. <mark>Vawter</mark>, Louisa J. S. Wills,"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Shelton, Thevilian C. V. <mark>Vawter</mark>, Louisa J. S. Wills,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2058.0, 970.34, 2225.42, 1561.87], "bbox_id": "7f004641c0", "file": "AppomattoxNewspapers_1912-1915a_0570.pdf", "page": 1, "text": "P ayne-W alton. One of the mosi interesting weddings of the early sum mer season was that, of- Miss Bessie Vawter Walton, daugh ter of Mr. and Mrs E. A. Wal ton, of Appomattox, to Mr. Francis M. P,ayne, of Gladstone, in the presence of friends and relatives on the evening of June 2nd. The parlor in which thè ceremony took place had been prettily decorated for the occasion w ith ferns and other greens w ith the tw ilight effect produoed by lamps made a oharntlng setting for the as sembling of the bridal party. Promptly a t the hoar appoint ed, Miss A nna Smith of R. M. W. College, Lynchburg, touch ed the piano and pealed forth the inspiring strains of Mendel ssohns wedding m arch the bridal party entered. Rev. Mr. H. H. .Farris was best man Miss M artha Smith, Maid of Honor. Rev. Mr. Wingfield, pastor of the bride being the celebrant in plighting their troth. The bride was becoming ly attired in a faw n colored suit w ith hat and gloves to m atch. The groom wore the conventional black. Mrs. Payne is an accomplish ed young lady of sweet dispo sition endowed by nature with a bright mind and attractive personality. The groom is a native, of Nelson county with the exception of a few years in business spent in North Carol ina and since has been exten sively engaged in the lumber business. The popularity was attested by the many and use fui presents."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "that, of- Miss Bessie <mark>Vawter</mark> Walton, daugh ter of"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "that, of- Miss Bessie <mark>Vawter</mark> Walton, daugh ter of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1458.0, 1003.7, 1781.88, 1336.04], "bbox_id": "3d0b2d1040", "file": "AppomattoxNewspapers_1926-1933a_0549.pdf", "page": 1, "text": "ons indicted for felony, who vere either discharged or sent in to the circuit court for trial. new county were at the courts The whole body of the justices house, Walkers Church, Pake- mef once each year, usually in ville and Spout Spring. At that June, to examine and pass upon 4ime any eligible voter could ajj claims l0n the county, make vo e at any precinct in the allowances to the officers and to county where he happened to be iay the county levy. This was on election day. done by laying a per capita tax The county coulrt was com- on all males over twenty-one posed of the justices of the eoun- years of age and not exempt, ty and was self-perpetuating, in and not by levying a tax on prop- that f rdm time to time it named erty. new juistices. Soon iafteir the formation of the county the fol lowing new justices were named Dr. William D. Christian, Dr. David C. Jones, Dr. Joel W. Flood, Silas P. Vawter, Janies G. Patterson, E. O. Robertson, D. H. Marshall, Samuel J. Walker At time of going to press to- and William H. Hannah. Five bacco sales were only slightly in- of the justices constituted a i creased over last week, while court for all ordinary purposes, prices were steady at a level the senior member presiding. SOmewhath higher than last They had! Jurisdiction over all year. According to county agent police and road matters, and of b _ Hudgins, the association probate and fiduciary matters, prices are slightly higher than the trial of slaves for all offens- open floor prices, although on es, the trial of misdemeanors and exact comparative figures were the examination of white per- availaible."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "W. Flood, Silas P. <mark>Vawter</mark>, Janies G. Patterson, E."}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "W. Flood, Silas P. <mark>Vawter</mark>, Janies G. Patterson, E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1550.15, 882.05, 1716.06, 941.45], "bbox_id": "f26bb5cc08", "file": "AppomattoxNewspapers_1912-1915a_0559.pdf", "page": 1, "text": "Licenses were issued this morn ing to Mr. Frances Marion Payne, of Gladstone, to m arry Miss Bessie Vawter Walton, daughter of Mr. A. Walton, of Bent Creek."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Licenses were issued this morn ing to Mr. Frances Marion Payne, of Gladstone, to m arry Miss Bessie <mark>Vawter</mark> Walton, daughter of Mr. A. Walton, of Bent Creek."}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Licenses were issued this morn ing to Mr. Frances Marion Payne, of Gladstone, to m arry Miss Bessie <mark>Vawter</mark> Walton, daughter of Mr. A. Walton, of Bent Creek."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1549.68, 883.89, 1715.79, 943.37], "bbox_id": "4fac36f4dc", "file": "AppomattoxNewspapers_1912-1915a_0560.pdf", "page": 1, "text": "Licenses were issned this morn ing to Mr. Frances Marion Payne, of Gladstone, to m arry Miss Bessie Vawter Walton, daughter of Mr. . A. Walton, of B ent Greek."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Licenses were issned this morn ing to Mr. Frances Marion Payne, of Gladstone, to m arry Miss Bessie <mark>Vawter</mark> Walton, daughter of Mr. . A. Walton, of B ent Greek."}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Licenses were issned this morn ing to Mr. Frances Marion Payne, of Gladstone, to m arry Miss Bessie <mark>Vawter</mark> Walton, daughter of Mr. . A. Walton, of B ent Greek."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1101.57, 865.32, 1256.71, 1056.47], "bbox_id": "cd8de779e6", "file": "AppomattoxNewspapers_1915-1918a_0377.pdf", "page": 1, "text": "Jury At Christiansburg, Va., Require But One Ballot. Christiansburg, Va.  Charles E. Vawter, former professor at Virginia Polytechnic Institute, was acquitted by a Jury in the Montgomery County Circuit Court of the murder of Stock- ton Heth, Jr. The scene that followed the an nouncement of the verdict was an af fecting one. Deputy Clerk Trig Wal ters had not finished repeating the Jurys decision when Professor Vawter jumped from his chair and clasped his mother in his arms. The aged woman shouted, Oh, glory! Attorney R. L. Jordan, of Radford, one of Vawters counsel and the only lawyer in the room, with a fervent Thank God! sank into his chair and wept"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Christiansburg, Va.  Charles E. <mark>Vawter</mark>, former professor at Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Christiansburg, Va.  Charles E. <mark>Vawter</mark>, former professor at Virginia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.49, 613.84, 1564.07, 634.64], "bbox_id": "6a6ccf0be9", "file": "AppomattoxNewspapers_1974-1975a_0287.pdf", "page": 1, "text": "JOSEPH BENJAMIN TERRY. JR. the former Miss Delores Ann Vawter"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "JOSEPH BENJAMIN TERRY. JR. the former Miss Delores Ann <mark>Vawter</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "JOSEPH BENJAMIN TERRY. JR. the former Miss Delores Ann <mark>Vawter</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [485.49, 1022.23, 640.42, 1127.73], "bbox_id": "7fe24ceb62", "file": "AppomattoxNewspapers_1915-1918a_0347.pdf", "page": 1, "text": "John L. Lee, of Lynchburg, was re tained by members of the family of Stockton Heth, Jr., to assist in the prosecution of Professor Charles E, Vawter, of Blacksburg, charged with the murder of young Heth, who was mortally wounded on the morning of March 13 while a guest In the Vawter hpme. Mr. Lee has participated on one side or the other in most of the famous murder trials in Virginia dur ing the past twenty years."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "of Professor Charles E, <mark>Vawter</mark>, of Blacksburg, charged with"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "of Professor Charles E, <mark>Vawter</mark>, of Blacksburg, charged with"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1140.01, 186.56, 1302.38, 952.14], "bbox_id": "f9f29344f7", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "j Serial No. Name j 416, Floyd Custis Gordon  617, George Wiley Harding  526, Lewis L Doss  613, Cleveland Eagle 609, Harry S. Drinkard 316, Russel Jenkins 274, James Burton 546, Hunter Milton Moore 511, Thomas Vawter 206, Shelton Herry Hudson 342, Sam Henry Goin 293, Charles Willie Orange 460, Charlie W. Soruggs 427, Joel Thomas Morris 666, Geo. Washington Green 241, Ed Reed 40, Kenneth W Furbush 100 , Samuel Arlington Per dieu 572, Harry Tucker Woodson 167, Benjamin Patterson 214, Lawrence Mann 236, Floyd Wyatt Harvey 647, Willie A. Weakley 629, Oolonel Thomas Mays 29, Walter Emerson Durham 533, Robert Thomas Kyle 61, Eugene Watson Harris 114, Easel LeRoy Smith 151, James Leonard Moss 618, Wm. Edward Harris 603, Joseph Owen Carson 33, Arthur Fleshman 209, Walter Clifton Lee 32, Ernest Ferguson  63, Odell Howerton I 362, William Lee Goode I 371, William Henry Marshall j 529, John Samuel Guill j 64, O. Kendall Hunter 382, Robert Odie Abbitt  224, Ernest Reid 449, Geokge Wesley Wright 41, Lawrence E. Furbush 38, Marshall Hubert Franklin j 48, Wiley W Godsey 640, Stratton Marvin Ander- son  668, Luther Johtr-Hubbard 88, David P Moon 127, Samuel D Whitaker j 287, Herbert H u d s o n Jen- niugs  260, Joseph P Panlett ! 473, Freeman Thomas Tinsley 586, Samuel Johnson 527, William Herman Guill 254, Daniel W Dinkins 446, Alfred Berkley Turnes 89, Wm. Archer Moon 358, Wiley Young 573, George Washington Aus tin 451, R Childress Wright"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Milton Moore 511, Thomas <mark>Vawter</mark> 206, Shelton Herry Hudson"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Milton Moore 511, Thomas <mark>Vawter</mark> 206, Shelton Herry Hudson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Robert son, B. S. <mark>Vawter</mark> and William Wliite. Three"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Robert son, B. S. <mark>Vawter</mark> and William Wliite. Three"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2218.27, 664.94, 2479.97, 1739.36], "bbox_id": "96d21c9db4", "file": "AppomattoxNewspapers_1933-1936a_0041.pdf", "page": 1, "text": "I Flood, Jas. M. Watson, Gus 1.86 1  STONEWALL DISTRICTWHITE 5.191 Vdams Bros. Paynes Co. .92 I lvis, R. H. 16.741 Vnderson, E. L. Eat. 9.921 Bell, E. W. 2S.221 Bell, R. E. 13.051 Bell, R. E. 1.64 I Blackwell, B. M. 20. 4 I Burge, Wm. F. 13.571 Carson, E. H. 18.821 Carson, Susie B. 2.87 I Chick, E. L. 17.42 ! Childers, M. P. 8.07 I Coleman, C. Lewis I Cooper, Wm. Heirs 27.651 Drinkard, Clarence D. 7.611 Eagle, Mary C.  J. B. 14.261 Eagle, Mary C.  J. B ._ 2.301 Eagle, Richard G.  J. B. g., 94 1 Eagle, Richard G.  J- B. 20.511 Fracker, N. K. 15.09 I Hawes, H. B. 25.68 I Hale, L. J.  23.03 I Hamilton, R. A. , 7 1 1 Hamilton, R. A. 20.481 Hamilton, R. A. 6,04 I Harvey, Thomas 5.62 I Hockhart, W. J. 4 77 I Tamerson, D. W. 2 , 01 1 Laughon, J. H. A G. Olive 20.361 Marsh, E. J. 6,72 I Martin, T . Raymond 13.88 I Martin, H. O. 19.35 I Martin, H. O. 13.28 I Martin, H. O. 24.29 I Megginson, S. T. I Moore, R. W. Et. I Moore, Mrs. Minnie M. 10 98 I Moore, Mfrs. Minnie M. 93 I McCormick, jNorcissus 9 Ì 00 I Nutall, J. S., L. G. Kapler A J. . 68 1 Oscar Loraine 7,07 I Phelps, Thomas 19.83 I Phelps, Thurrto 285 I Powell, Martha E 7 , 4 g I Robertson, J. H. 18.611 Robertson, Mrs. Neola 2 34 I Robertson, The Co. Inc. to be 2.401 paid by B. H. Wood 13.021 Scruggs, Lily A. 1.36 I Scruggs, William M. 5.971 Shelton, J. Thomas 13 hr I Stephenson, Iverson W. 6.18 Taylor, Geo., W. 5 . 87 1 Thomas, D. T. 13.88 Beasley, Stephen Est. 2.11 Beasley, Stephen Est. 2.50 Beasley, Stephen Est. 2 63 Beasley, Stephen Jr. Beasley, Demosthenes Beasley, Demosthenes 23.24 Callaham, P. W. A Lougenia 8.52 Cousin, Hattie 13.02 Craigway, Nancy 23.67 Daniel, ÎW. T. 1.53 Daniel, Elijah 27.50 Davidson, William 17.30 Doss, Thos. A Agnes .68 Echols, Docia Ferguson, Charles - 07 Ferguson, Mary  Ferguson, O. K. Ferguson, Winston .93 Flood, Gabriel 7.07 Flowers, Henry 22.18 Flowers, Annie 19.34 Goff, Dabney .76 Hancock, Julia 14.63 Hancock, Scott 11.36 Humbles, William 15.35 Humbles, William 9.67 Johnson, Ella M. 9.67 Johnson, J. H 13.10 Johnson, Napoleon 18.31 Johnson, Alice 5.36 Johnson, Abingdon 20.95 Johnson, William 10 22 Johnson, Calvin 5.02 Jones,, Alex 10.25 Jones, Charles 2.64 Lewis, Claude 10.11 Morgan, James 4.76 Morgan, Edd 21.54 Morgan, Philip Jr., A Co. 3.32 McCoy, Jno. W. A Josie 30.20 Moore, Leslie Y. 10.33 Moore, S. W A S. G. 10.13 Myers, John H. 8.31 page, Ida and Sarah J. Flowers 4.01 Pankey, Nelson C. 7.14 Pankey, Hubert 25.49 pankey, Hubert 7.07 pankey, Eugene 8.86 Preston, Emma Wyatt 12.18 Reveley, Dorothy 19.58 Robertson, James 19.72 Robertson, Lucy 7.88 Scott, Early - .32 Scruggs, Edd A Mary J. 2.04 Scruggs, Éllison 24.43 Scruggs, Frank Ponkey Smith, Peter S. A J. M. FanJcey 55.19 Stratton, Ned Est. Turner, Henry Turner, Henry , ___ _ Vaughter, Pleas Anderson Vawter, Anderson Vswter, Thos. A Others Woodson, Isaac Wright, John A. A N. M."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Henry , ___ _ Vaughter, Pleas Anderson <mark>Vawter</mark>, Anderson Vswter, Thos. A"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Henry , ___ _ Vaughter, Pleas Anderson <mark>Vawter</mark>, Anderson Vswter, Thos. A"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1807.46, 243.83, 1968.88, 1263.71], "bbox_id": "b531343034", "file": "AppomattoxNewspapers_1892-1898a_0362.pdf", "page": 1, "text": "Goiu,Saml H , est ....... 703 12.9 Goin, Jas M ................ 10 3 Haycock, Maggie W... 125 1.3! Harvey, Jno F ............ 249 2.61 Hollovan, Mary E ....... 60 1.81 Gull, Otho .................... 60 1.51 Hix, Williams est ..... town 21 4af lot Johnson, Richard est..-store  4.2 house Jones, L D ...... . .......... 300 6.3C  Jennings, Phoebe...... 214 5.63 JoDes. W D ....... ?. ........ 239 3.76 Kyle, Ro R .................. 403 6.39 Lewis, Shedruks est.. 188 3.11 LeGrand, A A e s t ...... 233 3.68 Meadows, Ro P ............ 12 51 Mitchell, B W and 10 2 2.17 Jane. Phelps, Wms est ....... 1 1 1 28 Pauktt, Sarah ............. . 54 2.00 Paris Elijah., ............. 34 57 Riuison, Elizabeth T.. 27 86 Raymond, Sarah J..... 75 2.75 Scruggs, Edward ....... 23 80 Thornhill, Mildred est 10 0 2.63 Thornhill, Eliz ............ 146 3.87 Walker, Wms est ....... 124 2.07 Woodson, Abadiah est 117 1.87 Wingfield, Wm AT.... 55 1.16 Webb, Nancy M ...... 50 1.58 Webb, Merry and H. 200 3.15 Goins est. COLORED. Abbitt, John and 17 38 Elijah Clark. Diuguid, Ch H ............ 2  3.03 Durphey, Dennis...... town 63 lot Elam, Nelsons est ..... 8 78 STONEW ALL DISTRICT. Abbitt, Lucy O ............ 1 2 1  2.06 Barrick, J W T r for 115 4.87 Geo Barncks. Evans, Dr D R ............ 10 28 Foster,M A, C J, M R, 1 Ò 2 1 Eliza and E. A. Pear man. Foster, H J heirs ..... 1 2  28 Harris, Jno est ............ 1  8 Harrison, Wm D ....... 175 5.55 Hundley, Eliza A ..... 1 1  51 Moore, Sampson .......... 801 2.52 Neister, Willis W ....... 60 3.16 Phelps, J C aud wife 6 38 PearmaiijC Rand wife 1 2  28 Reid, Wm. .................  2 10 Shearer, Henry B ....... i 2 1  30 Walton, J C and J W  9 aud S P Vawter, - COLORED. Coleman, Geo ........... . 33 1.05 Moore, Henry .............. 4 63 SOUTHSIDE DISTRICT. Clark fc Collins .......... town 1.58 lot Clayton, Lucy A ....... 125 2.63 Davis, Temple T r for 33 74 S Baldwin. Elliott, Andrew A ..... 149 1.58 Elliott, Jas W .............. 528 5.54 Farrar, M aryW . ........ 30 63 Farrar, Southeys est 1 1 0 1.75 Fore, Reuben est ....... 148 3.89 Farrar, Chas. H ......... 28 49 Farrar, O W ................ 84 1.25 Giles, Josiahs est ..... 12 0 1.58 Jones, Tho J, Ann O 15 59 and G S. Lee, Catherine G ....... 39 1.24 Martin, Chas ................ 69 91 Marshall, J M est ....... 503 13.21 Marshall, Jno W est.. 26 70 McKinney, John ....... 6501 13.70 Meadows, Fannie A... 104 2.75 Morris, Mary R. ....... .  28 Paulett, Presley B est 126 3.99 Ragsdale, Mary E and 460 12.08 children. Smith, Maria B and 108 2.55 others. Stewart, Duncan ....... 124 3.43 Toney, Jno M est ....... 200 2 .10 COLORED. Bakers, Jno est ............ 107 3.40 Cheatham, Lewis ....... 6 31 RECAPITULATION. T otal Southside District.. 81.95 Clover Hill-District 108.03 Stonewall District.. 22.35"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "9 aud S P <mark>Vawter</mark>, - COLORED. Coleman, Geo ........... . 33"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "9 aud S P <mark>Vawter</mark>, - COLORED. Coleman, Geo ........... . 33"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2108.17, 1328.35, 2443.62, 1492.53], "bbox_id": "043a9ad56d", "file": "AppomattoxNewspapers_1905-1912a_0227.pdf", "page": 1, "text": "Famers S bb A  3nply Go. W holesale and retail deal ers in all kinds of Field and Garden Seed, Floor, Mill Feed Mr. and M s. 0. W. Phelps have jCornf Oats, Hay, Litne, Salt pu chased th- old Vawter place of  anj Fertilizers of all kinds. Mr. E a . Walton and are now I We are prepared to furnish build ng where the old dwelling w a s U  W h eat from burned about twelve months ago. . _ . . ... . Krom tb. you c . , i . . tb . oouo.  a a an d f P11  a810W  try lor a considerable distance, it can be sold. Come to S,.  This cn be made an ideal home, US or write for samples."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "pu chased th- old <mark>Vawter</mark> place of  anj Fertilizers"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "pu chased th- old <mark>Vawter</mark> place of  anj Fertilizers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1450.3, 1161.66, 1608.6, 1311.06], "bbox_id": "29530857db", "file": "AppomattoxNewspapers_1908-1909a_0549.pdf", "page": 1, "text": "Dr. William D. Christian, Dr. David C. Jones, Dr. Joel W. Flood, Silas P. Vawter, Jam es G. Patterson, É. O. Robertson, D. H. Marshall, Samuel J. Walker and William H. Hannah. Five of the justices constituted a court for all o rd in a  purposes, the, senior member presiding. They had jurisdiction over all police and road m atters, and of pirobate and fiduciary m atters, the trial of slaves for all offens es, the trial of misdemeanors and the examination of white- per-"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "W. Flood, Silas P. <mark>Vawter</mark>, Jam es G. Patterson,"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "W. Flood, Silas P. <mark>Vawter</mark>, Jam es G. Patterson,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1730.42, 294.92, 2585.16, 886.47], "bbox_id": "585e33301b", "file": "AppomattoxNewspapers_1915-1918a_0581.pdf", "page": 1, "text": "DhVOTED TO THE LOCAL AND INDUSTRIAL INTERESTS OF APPOMATTOX AND BUCKINGHAM COUNTIES, JOB WORK A Si lClALTV APPOMATTOX, VIRGINIA. SEPTEMBER 25, 1918  1 .0 0 P E R A N N U M 60 Albert Jackson Lewis Vera 61 Stephen Beasley, jr., Vers 62 Thomas Crag way, Bent Creek 68 Luther 8oott Vawter, Vera 64 Simon Pankey.Bent Creek 66 Thomas Pankey, B e n t Greek 66 Robert McKimby Vawter, Vera 67 Puglas McCoy, Vera 68 Robert Edward Forbes. Vera 69 John William Lewis, Vera 70 William Halsey Moore, Bent Creek 71 John William MoOoy.Bent Creek 1 . 72 Luther Earnest Nowlin, Vera T 73 William Alfred Pankey Tower Hill 74 James Henry Irving, Vera 76 William Preston Seay,Bent j Creek 1 76 David Hfiwkjine Humbles, j Vera 77 James Vera 78 J 0 h n William Morgan, Vera 79 Braxton Wright, Vera 80 Elijah DabieL Vera 81 John Anderson Day, Bent Creek  f 82 William Hunter, Vera I 83 John Thornhill, Vera 84 Major Wesley Daniel, Vera 85 William Mergan, Vera 86 Robert Edward Evans Vera -1  I 87 Otis Orange, Pamplin 88 Rosser A l l e n Baldwin, I Pamplin , P"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Creek 68 Luther 8oott <mark>Vawter</mark>, Vera 64 Simon Pankey.Bent"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Creek 68 Luther 8oott <mark>Vawter</mark>, Vera 64 Simon Pankey.Bent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [467.71, 789.22, 621.94, 942.67], "bbox_id": "c55072e6b9", "file": "AppomattoxNewspapers_1915-1918a_0345.pdf", "page": 1, "text": "Counsel For V. P. I. Profossor Issues Statement. Blacksburg, Va.Counsel for Prof. Charles E. Vawter, accused of killing Stockton Heth, Jr., issued a statement saying that after a thorough investi gation of the facts surrounding the tragedy, the evidence will disclose a betrayal of friendship and confidence reposed. This is the first statement from any member or representative of the Vaw ter family since young Heth was fatally shot in the Vawter home. Heth died at Roanoke and Professor Vaw ter gave new bond after waiving a preliminary hearing."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "for Prof. Charles E. <mark>Vawter</mark>, accused of killing Stockton"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "for Prof. Charles E. <mark>Vawter</mark>, accused of killing Stockton"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [479.3, 983.32, 649.55, 1227.07], "bbox_id": "9a436ce19b", "file": "AppomattoxNewspapers_1955-1957a_0416.pdf", "page": 1, "text": "Commissioners Office Appomattox, Va. Feby. 4th, 1957 NANNIE HUMBLES AND JOE Sometimes called JOB HUMBLES VS EDWARD HUMBLES  OTHERS. TO Nannie Humbles, Joe some times called JOB Humbles, Ed ward Humbles, Peyton Humblese, Job Humbles, John W. Humbles, George Humbles, Virginia Maw Humbles Pennix, Emma Humbles Pennix, Annie Clara Humbles Swain, Dorothy Humbles Flesh- man, Willie Hortense Humbles, Boyd Humbles, Massie Humbles, tGarison Humbles, Rebecca Humb les Berry, Alfred Humbles, Henry Humbles, Harry Humbles, Dave Humbles, Masai e Humbles and Rosa Humbles Vawter, Plaintiffs and Defendants in the above Styled suit."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Humbles and Rosa Humbles <mark>Vawter</mark>, Plaintiffs and Defendants in"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Humbles and Rosa Humbles <mark>Vawter</mark>, Plaintiffs and Defendants in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [487.89, 970.12, 655.79, 1212.47], "bbox_id": "9003fba1bc", "file": "AppomattoxNewspapers_1955-1957a_0421.pdf", "page": 1, "text": "Commissioners Office, Appomattox, Va., Fby. 4th, 1957 NANNIE HUMBLES AND JOE Sometimes called JOB HUMBLES VIS EDWARD HUMBLES  OTHERS. TO Nannie Humbles, Joe some times called JOB Humbles, Ed ward Humbles, Peyton Humfolese, Job Humbles, John W. Humbles, George Humbles, Virginia Maw Humbles Pennix, Emma Humbles Pennix, Annie Clara Humbles Swain, Dorothy Humbles Flesh- man, Willie Hontense Humbles, Boyd Humbles, Massie Humbles, KSarison Humbles, Rebecca Humb les Berry, Alfred Humbles, Henry Humbles, Harry Humbles, Dave Humbles, Massde Humbles and Rosa Humbles Vawter, Plaintiffs and Defendants in the above Styled suit."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Humbles and Rosa Humbles <mark>Vawter</mark>, Plaintiffs and Defendants in"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Humbles and Rosa Humbles <mark>Vawter</mark>, Plaintiffs and Defendants in"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [651.04, 621.07, 806.49, 1138.9], "bbox_id": "f6cbc32df6", "file": "AppomattoxNewspapers_1915-1918a_0374.pdf", "page": 1, "text": "be done. Vawter, defending himself on tbe witness stand, wrote sin aid shame all over his life bistory of recent years Dr. Winston was conscript officer daring Confederate days and is ready to serve agan, thongh be ia no longer a young man. Mr. John Young is on the sick list. Mrs. J .  Martiu is rallying from a severe spell. Madames Irving, Walton and 8. W. Watkins attended the West Han over Presbyterial, which met last ween at Orange. Professor Royall, who tanght in the Dillwyn school the pas, session of seven months, is with ns for hi vacation and is boarding in tbe home of Mr. W. J. Hillsmu. The sweet girl graduates will toon appear before the footlights, but not in tbe usual costly dresses. Not jnst becoming, in these war times, when floor is 16 a barrel. Bat a small minority of the human family me wheat floor bread and we may do with much less. Those of ns who lived during Civil War days know all about substitutes and, feeding upon them, we didnt starve. A small boy parsed me this morn ing on his way to school dad tn a thin summer suit, wheu the air was crisp and coo. I sometimes won der of what stuff smalt biys are made, anyhow But they will soon be men and I hope better men than those who have gone beore them. I love to hear oid-tims farmyis disoacs farming. They differ, nt agree as to essentia. And the world will never look upon their like again."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "be done. <mark>Vawter</mark>, defending himself on tbe"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "be done. <mark>Vawter</mark>, defending himself on tbe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [447.87, 1517.01, 613.29, 1790.91], "bbox_id": "52a07f7603", "file": "AppomattoxNewspapers_1892-1898a_0486.pdf", "page": 1, "text": "B ent Creek. It almost seems that our village is lost to the literary world, but such is not the ca.e. Our people are so busy they dont have time to write. Mr. Wash McCormick has a very sick child, attended by Drs. Mundy, Vawter arid Cabell. A mothers anxiety is very great, but God al ways knows the best. Miss Nannie Woods school near ! led Oak closed on the 15 inst. We are glad to welcome her in onr midst again, but she speaks so favorably of the children up there we fear there is a tendency to draw her back. Miss Bettie Dixons school near Jowardsville closed on 18th inst. From the size of the bucket of candy sent from.our village sljjp left some  her scholars sweet"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "attended by Drs. Mundy, <mark>Vawter</mark> arid Cabell. A mothers"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "attended by Drs. Mundy, <mark>Vawter</mark> arid Cabell. A mothers"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [662.63, 594.22, 815.82, 664.07], "bbox_id": "bec21cd520", "file": "AppomattoxNewspapers_1918-1922a_0323.pdf", "page": 1, "text": "At a sale of the Miltimore place last Saturday, Cailders, Ferguson  Carter became purchasers. Since the sale we are informed that Vawter bought the home tract."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "At a sale of the Miltimore place last Saturday, Cailders, Ferguson  Carter became purchasers. Since the sale we are informed that <mark>Vawter</mark> bought the home tract."}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "At a sale of the Miltimore place last Saturday, Cailders, Ferguson  Carter became purchasers. Since the sale we are informed that <mark>Vawter</mark> bought the home tract."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1398.49, 642.64, 1469.08, 799.53], "bbox_id": "926d5d0d6c", "file": "AppomattoxNewspapers_1974-1975a_0287.pdf", "page": 1, "text": "Ann Vawter Benjamin of Richmond, marriage on 10, at one afternoon in an on the east House at Court House Park. daughter of Franklin Allen and the of Mr. and Terry,"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Ann <mark>Vawter</mark> Benjamin of Richmond, marriage"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Ann <mark>Vawter</mark> Benjamin of Richmond, marriage"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [779.73, 599.07, 932.73, 669.32], "bbox_id": "e47241faa8", "file": "AppomattoxNewspapers_1918-1922a_0199.pdf", "page": 1, "text": "A t a sale of the Miltimore place last Saturday, Guilders, Ferguson  C arter became purchasers. Since the sale we are informed th at Vawter bought the home tract."}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "A t a sale of the Miltimore place last Saturday, Guilders, Ferguson  C arter became purchasers. Since the sale we are informed th at <mark>Vawter</mark> bought the home tract."}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "A t a sale of the Miltimore place last Saturday, Guilders, Ferguson  C arter became purchasers. Since the sale we are informed th at <mark>Vawter</mark> bought the home tract."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1530.73, 1654.84, 1695.07, 1786.04], "bbox_id": "3a0d30c7af", "file": "AppomattoxNewspapers_1902-1905a_0157.pdf", "page": 1, "text": "A negro who gave in bis name as Frank Vawter, and said to be from Walkeis Ford, was arrested on last Thursday night in Lynchburg for robbing a C.  O. freightcar. When hotly chased by two policemen, he jumped into the river. As he cant swim, he tried to wade across. On reaching water up to his month, he stopped, threw back his head, and , gazed at the sky till a policeman in"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "bis name as Frank <mark>Vawter</mark>, and said to be"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "bis name as Frank <mark>Vawter</mark>, and said to be"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [825.61, 256.73, 984.62, 1166.32], "bbox_id": "a31d6616c6", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "536, Thomas Rosche vlaxey 548, Herbert Lee Moubry 126, Roy all A Brown 786, James Nicholas Wright 755, Cornelius Benj train Taylor 107, George Ernest Booker 616, Hubard Patterson 373, Roy Dew Heckler 775, James Vawter 486, Alfred Lee 692, Emmet Norwood Shores 600, Henry Perkins 810, Robert Washington 507, Guy Mc.Craw 309, El wood Gary 437, Arthur Preston Johnson 604, William Miller Payne 43, orris Andrews 420, Earty Warren Jamerson 514, George Washington Moss 433, Booker Johnson 10, Charlie Agee 487, Gordon Lewis 797, Charles Woodson 140, Edward Booker 432, William Henry Jones 18, Nick Allen 652, Arthur Edw id Rush 739, Gilliam Coy Smith 601, Luther W Patteson 606, William Horsley Perkins 182, Garrett Elwood Catlett 513, George William Moss 46, Alfred Austin 223, Enis Cunningham 117, Bee Brown 602, Willie Oscar Parson 390, Joseph Stuart Hughes 75, Augustine Lee Brooks 772, William Malcolm Trent 721, Frederick vpencer, jr. 786, Richard J White 280, Forrest Richard Etling 757, Thomas Tyree 333, Oscar Gough 379, James Walter Harris 542, James E Miller 194, Harsball Henning Coleman 552, Alexander Cobb Motley 298, Phillip Ford 675, Thearon fceay 343, Roy Willard Gary 726, Waverly Francis Snoddy 15, Furman Hill Agee 452, John Jackson 355, Thomas Ray Guthrie 530, Robert Lee McFadden 609, Gjorge William Wise 645, Massie Lee Ragland 218, French Call 620, William Leak Putney 550, Carson Jefferson Martin 574, John Weetley Newton 31, John Price Anderson 770, Preston Taylor 677, Edward Miller Sheppard 749, Tyler Turner 525, Hubard Mosley 760, Stewart Everett Thomas 183, John Alfred Call 56, William Madison Andrews 792, John Pierce Word Sidney Adcock ..50, Marion Agee Glover 54, David Edward Ayres 549, W ashington Muny 440, Albert Jones, jr. 741, Frank Shoemaker"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Dew Heckler 775, James <mark>Vawter</mark> 486, Alfred Lee 692,"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Dew Heckler 775, James <mark>Vawter</mark> 486, Alfred Lee 692,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [222.26, 468.2, 545.99, 589.99], "bbox_id": "299a97d7f5", "file": "AppomattoxNewspapers_1926-1933a_0329.pdf", "page": 1, "text": "27,674 68 DISBURSEMENTS Poor House and Paupeya J. H. ReynoldsOn coffin for Va. Nowlin ...... .. .......... T. A. Smith and Co.On coffin for Lucinda Johnson and Grace Fulton  ............ .. .. .............. .. ........ Mrs. W. T. ChildersCare and attention to Palmer Pâttcrson Wm. VawterCare and attention to Palmer Patterson Lynchburg HospitalTreatment of W. C. Brown and Daisy Thornhill ............ .................................. 125 00"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "to Palmer Pâttcrson Wm. <mark>Vawter</mark>Care and attention to Palmer"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "to Palmer Pâttcrson Wm. <mark>Vawter</mark>Care and attention to Palmer"}], "text_match": 578730089005449337, "text_match_info": {"best_field_score": "1108074561536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730089005449337", "tokens_matched": 1, "typo_prefix_score": 1}}
{"document": {"bbox": [219.61, 445.15, 544.46, 566.46], "bbox_id": "b79f28c93d", "file": "AppomattoxNewspapers_1908-1909a_0329.pdf", "page": 1, "text": "27,674 68 DISBURSEMENTS Poor House and Paupers J. H. ReynoldsOn coffin for Va. Nowlin... . . . . . . . 12,50 T. A. Smith and Co. On coffin for Lucinda Johnson and Grace Fulton --------- --- - - ------- - 21 up Mrs. W. T. ChildersCare and attention to Palmer Patterson ........ ..............10 uu Wm. VawterCare and attention to Pialmer Patterson 20 00 Lynchburg HospitalTreatment of W. C. Brown and Daisy Thornhill --------- . . . . . . . . . . . . . . . . . 125 00"}, "highlight": {"text": {"matched_tokens": ["Vawter"], "snippet": "Patterson ........ ..............10 uu Wm. <mark>Vawter</mark>Care and attention to Pialmer"}}, "highlights": [{"field": "text", "matched_tokens": ["Vawter"], "snippet": "Patterson ........ ..............10 uu Wm. <mark>Vawter</mark>Care and attention to Pialmer"}], "text_match": 578730089005449337, "text_match_info": {"best_field_score": "1108074561536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730089005449337", "tokens_matched": 1, "typo_prefix_score": 1}}
