{"document": {"bbox": [1651.19, 1422.54, 1816.64, 1489.19], "bbox_id": "2d96c522bb", "file": "AppomattoxNewspapers_1912-1915a_0390.pdf", "page": 1, "text": "William H. Beasley, a car Inspector, thirty-eight years old, was run over and instantly killed at the Virginian Railway coal pier at Sewalls Point Five cars passed over him, terribly mangling the body. The accident oc curred some time after midnight."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "instantly killed at the <mark>Virginian</mark> <mark>Railway</mark> coal pier at Sewalls"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "instantly killed at the <mark>Virginian</mark> <mark>Railway</mark> coal pier at Sewalls"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2376.93, 221.04, 2567.22, 831.78], "bbox_id": "a6f6ef3b02", "file": "AppomattoxNewspapers_1912-1915a_0483.pdf", "page": 1, "text": "Virgtnta Road Seek Higher Rates.    - Th-  railroads, traversing f Virginia territory will make a fight before toe State Corporation Commission to ob tain the advantages given to railroads of the country recently by toe Ihteirrtat Commeroe Commission. They will ask a horizontal adVanco S per cenL in freight rates for tetr- state-business, such as became effect- - ire under toe order of toe Interstate ,  Commerce Commission December 16, . for railroads in toe Eastern classift  cation on interstate business. During toe last week several repre- 86 Ultttvua of tne Virginia railroads -  have conferred informally with Clerk  Richard T. Wilson, of toe State Oor---v poration Commission, On the subjeeL  The following railroads have joined  in toe petition, which will be presented to toe commission this week Atlantic Coast Line Railroad Coin- paay. The Baltimore and Ohio Railroad Company  The Chesapeake and Ohio Railway  Company. S v Sfisjt Chesapeake Steamship Company Yorv tuver Line. Chesapeake iyeetem Railway Com pany. Cumberland Valley Railroad Com- pany. S.  New Yorl, Philadelphia and NorfoBt, Railroad Company.  V Norfolk Western Railway .Company, . Norfolk Southern Railroad Company. Old Dominion Steamship Richmond, Fredericksburg and Po tomac Railroad Company.  Seaboard. M r Line- Railway. Southern Railway Company. , fyfM The Virginian Railway Company.  Washington and Old Dominion Raff- j tray.aahington Southern Railway Com pany. The petition asks tost the oarrteip be permitted to publish and put late ef fect on ten dayd notion tariffs covering a 6 per ceaL avance in all intrastate freight rates in Virginia with tt following exceptions Coal and coke, iron, ore and lime stone, when shipped to furnaces for toe manufacture of pig iron. Tlte  commission will be asked merely , to determine wbether toe advance asked in justified by toe business condition , to be met by the railroads and wheth er or not the Increase will redound to the best commercialand Industrial im I terests of the State, 1"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "Railway Company. , fyfM The <mark>Virginian</mark> <mark>Railway</mark> Company.  Washington and Old"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "Railway Company. , fyfM The <mark>Virginian</mark> <mark>Railway</mark> Company.  Washington and Old"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1568.86, 1302.87, 1729.38, 1487.11], "bbox_id": "732a1a7db5", "file": "AppomattoxNewspapers_1905-1912a_0548.pdf", "page": 1, "text": "Virginian Railway Plans. Norfolk.An ambitious plan for the development of the Virginian Railway is foreshadowed by the action of the stockholders at their meeting here in authorizing the issuance of a coupon bond mortgage not to exceed 75,000,- 000. Of the proceeds of the issue about two-thirds, it is said, will be used for improvements and extensions. The Virginian Railway was built by the late H. H. Rogers and is still con trolled by his estate. It? eastern terminus is at Norfolk and its westd n terminus at Deepwater, W. Va where it connects with the Chesapeake and Ohio. It is believed to be the present plan of the company to extend the line to Cincinnati in order to obtain a. Western outlet."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "<mark>Virginian</mark> <mark>Railway</mark> Plans. Norfolk.An ambitious plan"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "<mark>Virginian</mark> <mark>Railway</mark> Plans. Norfolk.An ambitious plan"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1720.55, 1789.2, 1849.22, 1921.75], "bbox_id": "4397b73117", "file": "AppomattoxNewspapers_1922-1923a_0032.pdf", "page": 1, "text": "Virginian Railway- and West Virginia stations. Some of the railroads hav nounced special reduced rates, basis of one fare for the round return limit day after date of tickets to be sold only rom cities taking a special part  pageant, and to be sold on y I these cities on their respective  of participation as outlined in tb ond paragraph of this story."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "<mark>Virginian</mark> <mark>Railway</mark>- and West Virginia stations."}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "<mark>Virginian</mark> <mark>Railway</mark>- and West Virginia stations."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1476.59, 1557.6, 1759.39, 1740.35], "bbox_id": "5b479ac94a", "file": "AppomattoxNewspapers_1918-1922a_0280.pdf", "page": 1, "text": "U. S. Chemist Seek To Stop Industrial Permit Fraud. New York.To prevent illegal use of alcohol issues on permits for manu facturing purposes the government is experimenting to determine whether per Office Romance Staged Ini mercury or other poisonous Norfolk I cann1 be introduced,  OConnor, prohibition director, told tho Ik, Va.Louis J. Jaffe, editor  Aroma Club of New York, perfumers, Virginian Pilot, and Miss Mar-, toilet goods dealers and barber supply avis were married at the home makers. He declared chemists In the  8 W. Wheelright, president technical division of the federal pro- Virginian Railway and Power hibltion office in Washington were con ducting the experiments He added that hundreds of applicants for alcohol for nonbeverage use have claimed falsely to be manufactures of per fumery and toilet preparations."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "of the federal pro- <mark>Virginian</mark> <mark>Railway</mark> and Power hibltion office"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "of the federal pro- <mark>Virginian</mark> <mark>Railway</mark> and Power hibltion office"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1804.52, 1698.51, 2137.15, 1749.51], "bbox_id": "2791915de1", "file": "AppomattoxNewspapers_1905-1912a_0082.pdf", "page": 1, "text": "To Build Repair Shops. Roanoke.The Virginian Railway has purchased a plot of ground in the southern section of the city, upon died at St. Andrews Hospital after which it will erect repair shops that an operation.  will give employment to 300 men."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "Build Repair Shops. Roanoke.The <mark>Virginian</mark> <mark>Railway</mark> has purchased a plot"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "Build Repair Shops. Roanoke.The <mark>Virginian</mark> <mark>Railway</mark> has purchased a plot"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [140.62, 1339.37, 300.66, 1481.57], "bbox_id": "7e53ecd2a2", "file": "AppomattoxNewspapers_1912-1915a_0087.pdf", "page": 1, "text": "The Virginian Railway Company will reduce its capital stock by 3,- 678,500. This will occur at the an nual meeting of the company to be held at Norfolk, February 1. It has been recommended by resolution of the board of directors, and will in all probability be adopted by the stock holders. The proposition is to reduce the capital stock of the company from 62,805,000 to 59,226,500 and divided Into shares of 100 each this to be ac complished by reducing the common stock now issued and outstanding from 34,850,000 to not less than 31,271,- 600 divided into shares of 100 each."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "The <mark>Virginian</mark> <mark>Railway</mark> Company will reduce its"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "The <mark>Virginian</mark> <mark>Railway</mark> Company will reduce its"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [371.5, 597.43, 532.44, 760.32], "bbox_id": "58d9368443", "file": "AppomattoxNewspapers_1915-1918a_0174.pdf", "page": 1, "text": "The jury rendered a verdict of 7,000 in favor of the plaintiff in the case of O. C. Bel I vs. Virginian Railway Com pany. The case had been on trial since May 19, and was the third time it was tried at Christiansburg, both former verdicts having been revoked by the Supreme Court of Appeals. Bell was a mail clerk on the Virginian and claims to have suffered a fracture of the small bones of the neck, as a re sult of the sliding door of the car striking him when a train he was on  came to a sudden stop at I ronton, on j October 26, 1911. He claimed the com- ! pany was liable because it had pro-  vided no hook to the door. The case  probably will go to the Supreme Court, j"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "C. Bel I vs. <mark>Virginian</mark> <mark>Railway</mark> Com pany. The case"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "C. Bel I vs. <mark>Virginian</mark> <mark>Railway</mark> Com pany. The case"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [293.49, 666.19, 470.09, 1475.34], "bbox_id": "cd34831a38", "file": "AppomattoxNewspapers_1905-1912a_0564.pdf", "page": 1, "text": "Suffolk.A mortgage for 76,000,000  on the Virginian Railway Company I  was recorded in the office of the clerk i of Nansemond county by the Farm ers LOan and Trust Company, of New York. The document contained 100 papers and 34,160 words. The State taxes on It amounted to 52,660 and the fee to Clerk Bunting was 34.16. The mortgage was signed by Urban H. Broughton and Joseph Clark, presi dent and secretary,-respectively, of the I railway company, and E. Settarston and A. V. Heely, president and secre tary, respectively, of the Farmers Loan and Trust Company. Bristol.A marriage of wide Interest In Southwest Virginia was solemnized In Texarkana, Texas, when Miss Eliza beth Purmer, of a Texas family, be came the bride of Mr. A. Kyle Morl- son, of the law firm of Irvine  Mori- on, of Big Stone Gap, Va. The bride groom Is a son of the late Judge H. S. K. Morison and a nephew of Gen. R. A. Ayers, present Democratic nominee for Congress In the Ninth Virginia dis trict. The bride and groom will maky their home at Big Stone Gap. Among the relatives who attended the wed ding were Mr. and Mrs. J. Speers Webster, of Bristol, and Mr. and Mrs. Hugh G. Morison, of Johnson City, Tenn. Harrisonburg.Leaving a note say ing that she.would rather be dead than alive, Miss Lillie Moore, 23 years old, went out to the wash house at her haoM near Woodstock, Shenandoah County, placed the muzzle of a shot gun at her breast and pushed the trigger with a stick. The load went through her heart. Her mother, Mrs. Amos Moore, and her sister, Fannie, rushed from the house, 100 yards distant, and found the lifeless body lying on the floor, the blood gushing from an awful wound in the breast. Miss Moore leaves a brother and five sisters, including Miss Annie Moore, of Baltimore, and Mrs. Susie Schultz, of Cumberland, Md. Miss Moore had suffered from a nervous breakdown and was despondent. Charlottesville.At a faculty meet ing at the University of Virginia Dr. Wilton Wylie Humphreys, Prof. Ormond Stone and Isaac Kimber Moran tendered their resignations to President Alderman. They are all over 66 years of age and have served the university for 25 years or more. There fore, under the provisions of the Car negie fund for retired teachers yearly payments equal to a certain percentage o! their aalarles will be made to them. Dr. Humphreys has been professor of Gieek at the university since 1887, and has filled professorships at Washing ton and Lee, Vanderbilt and Uni versity of Texas. He holds a Ph. D. from Leipsic and the only LL. D. that Vanderbilt has yet given. Professor Stone has been professor of practical astronomy and director of the Leander McCormick Observatory at the uni versity since 1882. For seven years he was professor of astronomy in the University of Cincinnati and director of the Cincinnati Observatory. Mr. Moran has been husar of the uni versity for many years. Dr. Graham Edgar was advanced to professor of chemistry Hunley, of Baltimore, to adjunct professor of political economy, and J. Sugars McLemore to adjunct professor of Latin and Grsek."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "for 76,000,000  on the <mark>Virginian</mark> <mark>Railway</mark> Company I  was recorded"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "for 76,000,000  on the <mark>Virginian</mark> <mark>Railway</mark> Company I  was recorded"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [938.66, 1071.92, 1101.46, 1494.66], "bbox_id": "047e2ab676", "file": "AppomattoxNewspapers_1905-1912a_0168.pdf", "page": 1, "text": "Roanoke. In the Criminal Court at Welch the jury in tLe case of Robert Fulcher, charged with the murder of Joseph Barear, brought in a verdict of munder in the second degree and Fuloher was given 17 years in the penitentiary. Fulcher killed Berear in the latters home and in the presence of Berears wife a month ago. Jealousy was the cause. , Norfolk. Mrs. Bettie Martin, 72 years old, mother of Alva H. Martin, Republican national committeeman from Virginia, died suddenly at the summer home of her son at Wil loughby Beach. Mr. Martin was in Abingdon, attending the Ninth Dis trict Republican Congressional Con vention. Harrisonburg.William Slougher, 35 years old, an unmarried man of Woodstofck, was struck by a train at Paw Paw, W. Va., and instantly kill ed. Slougher, who was a tannery laborer, was walking on the track and stepped out of the way of one train directly in front of another. Richmond. Following the death of Mrs. John J. Cairns the first vic tim of hydrophobia, the city officials began a war on dogs, five of which showing symptoms of the black tongue, were killed. Mrs. Cairns had been bitten by a pet cat. which had previous been attacked by a dog. Roanoke. The remains of Henry Zachary, the recluse found dead in his barn, having been murdered were sent to relatives at Statesville. , C J e police have unearthed a clue which will probable lead to the identification of the murderer. ,, Roanoke. A permit was granted the Virginian Railway by City En gineer Gibboney to erect a 30.000 repair shop in Roanoke, j p Petty John and Company, of Lynchburg are the contractors. 6"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "permit was granted the <mark>Virginian</mark> <mark>Railway</mark> by City En gineer"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "permit was granted the <mark>Virginian</mark> <mark>Railway</mark> by City En gineer"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1170.01, 1269.56, 1323.59, 1402.15], "bbox_id": "d3cd864c97", "file": "AppomattoxNewspapers_1918-1922a_0507.pdf", "page": 1, "text": "Reduced Rates On Road Material. Joining the other railroads which have put in effect greatly reduced freight rates in Virginia on sand gravel, stone, slag and other mate- rials used, for constructing buildings and highways, in accordance with au thority of the State Corporation Com. mission, the Virginian Railway filed its tariffs carrying the reduced rates The change is effective immediately, the commission having set aside all red tape and permitted the reductions to be effective on one days notice."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "Corporation Com. mission, the <mark>Virginian</mark> <mark>Railway</mark> filed its tariffs carrying"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "Corporation Com. mission, the <mark>Virginian</mark> <mark>Railway</mark> filed its tariffs carrying"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [425.69, 1617.88, 558.27, 1735.13], "bbox_id": "0988a78994", "file": "AppomattoxNewspapers_1918-1922a_0281.pdf", "page": 1, "text": "paper Office Romance Staged In Norfolk. folk, Va.Louis J. Jaffa, editor Virginian Pilot, and Miss Mar- Davis were married at the home omas W. Wheelright, president Virginian Railway and Power pay, at Buckhead Springs, Va. pffe has been with the Virginian about a year. His bride has writing feature stories for the lien Pilot for some time."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "omas W. Wheelright, president <mark>Virginian</mark> <mark>Railway</mark> and Power pay, at"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "omas W. Wheelright, president <mark>Virginian</mark> <mark>Railway</mark> and Power pay, at"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [883.13, 684.08, 1049.19, 938.68], "bbox_id": "cc521c6485", "file": "AppomattoxNewspapers_1955-1957a_0139.pdf", "page": 1, "text": "Norman Hill Bates, retired rail road conductor for the Virginian Railway, died yesterday at 100 P. M. at Virginia Baptist Hospital. Born in Spout Spring, he was the son of Mrs. Edmonia Jones Bates and the late Rufus Hill Bates. A veteran of World War I, Mr. Bates was a member of the Order of Railroad Conductors, the Broth erhood of Railroad Trainman, the American Legion Post 102, and the Masonic Lodge 304. In addition to his mother, he is survived by one daughter, Miss Joanne Bates, Sebrell five sisters, Mrs. F. O. Jones, Mrs. C. R. Mor ton, Mrs. C. W. Adams, Mrs. E. T. Sours and Lucille Bates, all of Spout Spring three brothers, Ar thur D Bates and W. Rufus Rates, Spout Spring, and Edward L. Bates, Brookneal. Funeral services will be held at 3 P. M. Friday in Lynchburg, with burial in Spring Hill Cemetery."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "road conductor for the <mark>Virginian</mark> <mark>Railway</mark>, died yesterday at 100"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "road conductor for the <mark>Virginian</mark> <mark>Railway</mark>, died yesterday at 100"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [969.08, 296.07, 1138.61, 1481.11], "bbox_id": "89ccd0bd55", "file": "AppomattoxNewspapers_1905-1912a_0345.pdf", "page": 1, "text": "Norfolk.Frank Gould, the new factor in the Norfolk and Ports mouth Traction -Company and the man who brought about the merger of its properties with those of the Virginian Railway and Power Com pany, of Richmond and vicinity, has acquired valuable water-power rights at Weldon, on the Roanoke river, just 70 miles from Norfolk and 50 miles his side of Petersburg. It is understood that Mr. Gould acquired this site as the second step in the construction of his pet project of an electric line to Richmond from Nor folk, ultimately extending into Washington. Mr. Goulds latest in vestment cost him more than 100,- 000, and that the New York million aire intends furnishing Norfolk with light and power much cheaper than the -city is paying at present. Mr. Gould has also secured options od water powers on the James and Ap- pomatox rivers. Petersburg.At a Joint caucus oi both branches of the City Council a resolution was unanimously adopted recommending that the city cede tc the Brltlsh-Amerlcan Tobacco Com pany that portion of what Is known as the poorhouse tract of land front ing 600 feet on West street in this city and running back 100 feet, being 18 acres, for 200 an acre, the land to be used for the purpose of erect ing buildings for the storage of to bacco. The company proposes to build 9 or 10 large storage ware- houses which will hold 1,000 hogs heads of tobacco each and in course of time expects to have 2,000,000 of taxable values here, which would mean a tax revenue of 28,000 per annum to the city. Harrisonburg.  In the Briery Branch section, 10 miles west of Harrisonburg, G. P. Fairchild, a farmer, 50 years old, fired a bullet into the brain of his wife and then shot himself through the head. Both died instantly. Domestic troubles are said to have been the cause of the tragedy. The two had been in volved in court litigation for the last year, Mrs. Frirchild having sued for alimony. Two of their children were in the house at the time, and one of the boys ran a quarter of a mile to the nearest store, spreading the story of the double tragedy. The woman was Fairchilds second wife. Norfolk.C. E. Fearing, a well- known contractor, is dead and W. H. Drew has both arms broken and a severe scalp wound as the result of a collision between a heavily loaded wagon and a buggy in which Messrs. Fearing and Drew were driving. They were returning home from Pine Beach after they had spent the day there fishing. The heavy wagon, It Is asserted, ran into the buggy, throwing both occupants out. The driver of the wagon proceeded to Pine Beach, but the police are said to know him. Norfolk.True to his promise, President Taft sent the name of Clin ton L. Wright to the Senate to be confirmed as Postmaster for Norfolk. The President told Republican Nat ional Committeeman Alvah Martin that he could not reappoint S. B. Carney, but if he would nominate another he would be glad to name him. Mr. Martin serft In the. name af Mr. Wright, who was assistant under Mr. Carney. Mr. Wright is a native of Baltimore, but has been a resident of Norfolk for many years. Lynchburg.J. R. Iddlngs, 19 years old, a book agent from Cum berland, presented himself at the lo cal health office with the request that he be examined. He was found to have a well-defined case of small pox and was Immediately taken to the pesthouse. The boarding house where he spent the night was fumi gated. Iddlngs thinks he was ex posed to the malady In Amelia county. Luray.Richard Hill was almost instantly killed by lightning on the farm of Dr. J. B. Brumbaeh, In Springfield district, Luray county. Mr. Hill was In the field plowing corn. The two horses he was driv ing were also killed. He was about 55 years of age and Is survived by a large family. The storm came up suddenly and for some time hovered along the base of the Blue Ridge. Harrisonburg.1Announcement is made of the approaching marriage in Songdo, Korea, of Miss Arrena Car- roll, of Mount Crawford, Rocking ham county, and Rev. Charles Thom as Cbllyer, a missionary from Eng land. Miss Carroll is a missionary sent out by the Baltimore Methodist Conference. Warsaw.A large barn belonging to N. Z. Oakley, on Moratico Farm, near Simmonson, together with a large quantity of hay and corn, was set afire by lightning. The loss is about"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "with those of the <mark>Virginian</mark> <mark>Railway</mark> and Power Com pany,"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "with those of the <mark>Virginian</mark> <mark>Railway</mark> and Power Com pany,"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2043.3, 340.45, 2290.31, 409.25], "bbox_id": "6b3194e0ec", "file": "AppomattoxNewspapers_1947-1949a_0099.pdf", "page": 1, "text": "Mr. William Penn Ayers, 60, i l general agent for the Virginian Railway for the past 14 years, died Spout Spring Tuesday morning of last week at Roberts, of Chi his home in Roanoke, Va. Death I cent visitor in was attributed to coronary throm- ter Mrs. W. E. bosis."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "general agent for the <mark>Virginian</mark> <mark>Railway</mark> for the past 14"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "general agent for the <mark>Virginian</mark> <mark>Railway</mark> for the past 14"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1531.0, 1652.27, 1693.38, 1759.97], "bbox_id": "179843ed69", "file": "AppomattoxNewspapers_1905-1912a_0362.pdf", "page": 1, "text": "Mr. Grover Wooldridge and Mias Mittie Dickerson, daughter of Mr Tom Dickerson, were married last Tuesday at 9 oclock a. m. at tbe home of the bride. The happy pair left on No. 5 for West Vir ginia, a here the groom holds a re sponsible position with the Virginian Railway."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "sponsible position with the <mark>Virginian</mark> <mark>Railway</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "sponsible position with the <mark>Virginian</mark> <mark>Railway</mark>."}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [823.46, 437.82, 987.01, 503.97], "bbox_id": "fc5ba37fe1", "file": "AppomattoxNewspapers_1912-1915a_0411.pdf", "page": 1, "text": "J. I. Hazelwood, day car inspector for the Virginian Railway, was found dead at Victoria under a car in the yards. It is believed he was caught between two cars of a shifting train. His right hip was. badly mashed. He leaves a wife and eight children."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "car inspector for the <mark>Virginian</mark> <mark>Railway</mark>, was found dead at"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "car inspector for the <mark>Virginian</mark> <mark>Railway</mark>, was found dead at"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2265.09, 1088.32, 2419.8, 1365.76], "bbox_id": "081c4b938e", "file": "AppomattoxNewspapers_1915-1918a_0252.pdf", "page": 1, "text": "ing,  Who cau paiut like Na ture? can imagination boast amidst her varied soenes of hues like these? The mine near here, operated by the Gulf Smokeless Gompa ny, employ a large number of men. The opening is in full view, but the mine has been opened at least four miles. It is interesting to watch the busy motors as they come from the mine loaded with this val uable fuel, to be dumped and later loaded on trains on the Virginian Railway. The coa vein is so extensive it is thought that it can be mined for fifty years or longer. In a few days we will turn our steps homeward and live over this pleasant visit to our dear relatives in West Virginia I. J."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "on trains on the <mark>Virginian</mark> <mark>Railway</mark>. The coa vein is"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "on trains on the <mark>Virginian</mark> <mark>Railway</mark>. The coa vein is"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [524.9, 1238.84, 681.08, 1364.94], "bbox_id": "a381d50f91", "file": "AppomattoxNewspapers_1915-1918a_0118.pdf", "page": 1, "text": "Following a report that the Cbesu- peake and Ohio Railway and the Nor folk and Western Railway had handi capped the Virginian Railway in the Buchanan coal fields, preventing it from making the projection into Ken tucky, where it would have big South ern and Western traffic connections, it is now learned from a trustworthy source that the Virginian extension plan has been abandoned. Virginian officials are quoted as authority for the statement that the project has been given up."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "had handi capped the <mark>Virginian</mark> <mark>Railway</mark> in the Buchanan coal"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "had handi capped the <mark>Virginian</mark> <mark>Railway</mark> in the Buchanan coal"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [701.96, 1315.05, 1050.81, 1376.75], "bbox_id": "ae074a41d6", "file": "AppomattoxNewspapers_1960-1962b_0290.pdf", "page": 1, "text": "During 1960  our first full year of merged operations with the former Virginian Railway  the NW has become a stronger, more efficient and more productive transportation system, providing better service for communities along its lines. Here are some highlights of last years operation and service."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "operations with the former <mark>Virginian</mark> <mark>Railway</mark>  the NW has become"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "operations with the former <mark>Virginian</mark> <mark>Railway</mark>  the NW has become"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [529.88, 583.97, 693.18, 867.31], "bbox_id": "6f312bfb58", "file": "AppomattoxNewspapers_1922-1923a_0501.pdf", "page": 1, "text": "Denial Made Of Purchase By Phila delphia Syndicate. Portsmouth Special.Raymond Dupuy, vice president and general manager of the Virginian Railway Company, who has returned to Nor folk from New York, where he went to confer with Henry II. Rogers, for whom he is constructing the Virginian road, says that there is no foundation whatever for the report recently sent out from Richmond that the road has been sold to a Philadelphia syndicate or to other persons. The rumor that the road had been sold came through the fact that the Tidewtaer and Western, a narrow guage line from Farmville toward Richmond, was sold or to be sold to a cate. The contracts for practically all the appurtenances to the great pier which the Virginian is construct ing at Swells Point, on Norfolk Harbor, have been let. These in clude ten sixty-ton steel conveyor cars, which will run upon the pier with electricity as motive power, is now expected by the builders that the road will be putting coal over this pier by May, 1908"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "general manager of the <mark>Virginian</mark> <mark>Railway</mark> Company, who has returned"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "general manager of the <mark>Virginian</mark> <mark>Railway</mark> Company, who has returned"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [517.42, 577.26, 683.57, 860.86], "bbox_id": "244f2cb019", "file": "AppomattoxNewspapers_1922-1923a_0497.pdf", "page": 1, "text": "Denial Made Of Purchase By Phila delphia Syndicate. Portsmouth Special.Raymond Dupuy, vice president and general manager of the Virginian Railway Company, who has returned to Nor folk from New York, where he went to confer with Henry II. Rogers, for whom he is constructing the  irginian road, says that there is no foundation whatever for the report recently sent out from Richmond that the road has been sold to a Philadelphia syndicate or to other persons. The rumor that the road had been sold came through the fact that the Tidewtaer and Western, a narrow guage line from Farmville toward Richmond, was sold or was to be sold to a Philadelphia syndi cate. The contracts for practically all the appurtenances to the great pier which the Virginian is construct ing at Swells Point, on Norfolk Harbor, have been let. These in clude ten sixty-ton steel conveyor cars, which will run upon the pier with electricity as motive power. It is now expected by the builders that the road will be putting coal over this pier by May, 1908."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "general manager of the <mark>Virginian</mark> <mark>Railway</mark> Company, who has returned"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "general manager of the <mark>Virginian</mark> <mark>Railway</mark> Company, who has returned"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2219.04, 536.09, 2558.78, 1256.69], "bbox_id": "77d45298de", "file": "AppomattoxNewspapers_1912-1915a_0482.pdf", "page": 1, "text": "Cumberland Valley Rfiliroad Co-  withdraw from hia protection. a i - j  y ttougta Joshua had burned Haror  Philadelphia and Norfolk . Joshua 111-11, yet because of Ia Rallroad c mpany.  reels backsliding It 1 _n0 _ .  Norfolk Western Railway Company, . Norfolk Southern Railroad Company.  Old Dominion SteimsbtP Company. Richmond, Fredericksburg and Po tomac Railroad Company.  . -  Seaboard Air Lin- Railway.    , Southern Railway Company. . The Virginian Railway Company. v  Washington and Old Dominion Rail way. asbington Southern Railway Cane  pany. , i I m B I The petition asks that, the carrier be permitted to publiah and put Into ef fect on ten days notice tariffs covering a 6 per cent avanoe in all intrastate freight1 rates In Virginia with the following exceptions . Coal and coke, iron ore Sad lime stone, when shipped to furnaces for the manufacture of pig Iron. Th commission will be asked merely to determine whether the advance askod in Justified by the business condition  to be met by the railroads and wheth er or not the increase will redound to the best commercialand Industrial!-  Lterests of the State.   In this chapter ----- - jlniy the two tribes most Interested Studying T tien . are mentioned 617, It . . J  committee representing the Ih- Bold, Sagacious Leader.  tereats of the States Federation of La- J . uraka Conquest of 8ieera, w . j bor and the Farmers Cooperative and 10-16. B u sk was a bold, sagacious I Educational Union, the latter being - ad chose one of the worlds affiliated with the State Federating, best and most famous .battlefields, Be-1 will have a hearing before the General draelon. B an k led his men to ML Assembly, when the special session is Tabor, from which could be seen the.l y0t young. This committee w ill P whole region where Slaeras armies I gent the views of the farmers regard were spread out upon the plain. From I mg revision of the tax code. -Pfprer 5 it appears that some came w ith a view to arriving at an in to the battle from the tribes of I telUgant understanding of tbe ideas o f Manasseh and Isseehar 614, 16 and I fast other were, expected who failed I to obey the summons 616,17. From the slope of ML Tabor. Deborah, and Barak saw Siaera and his iron char- L lota advancing across the plain., Ons of the descendants of Hobab, Moses I brother-in-law Num. 6422 R- Y . m., I find Judges 1U6 hud jevaated the place of Baraks camp  t . lD - . Heper should have been in the land of Judah and Simeon and not In such dose proximity to the enemies of Israel. Josephus says that when Barak saw Slseras army drawn up, and attempt ing to surround the mountain of bts encampment bis heart failed him, and be determined to retire, to S Place of greater safety. Deborah, however, urged Barak to attempt the battle, for ttala la the day In which the Lord hath delivered Steers Into thto hand. The think was as Sqre to be, done as if It wore done already. , As we read verses 11 and 12,- together with 617-19, It would look as though Slsera seemed to have the advantage against Barak and his ten thousand men. Slsera did not, however, count upon Baraks powerful allyGod. Is not Jehovah gone out before them?"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "Southern Railway Company. . The <mark>Virginian</mark> <mark>Railway</mark> Company. v  Washington and"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "Southern Railway Company. . The <mark>Virginian</mark> <mark>Railway</mark> Company. v  Washington and"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [162.14, 984.89, 333.22, 1248.13], "bbox_id": "22efc9dc09", "file": "AppomattoxNewspapers_1912-1915a_0424.pdf", "page": 1, "text": "buildings are neuded, a science hall, literary home for the I societies, gymuasium and still an-1 other. When I remember the plant! of 26 years ago 1 wonder at the I wonderful changes that have takeu I place. Virginia has done her duty I to the young girlhood and boyhood of the Commonwealth and expects fine work in return on part of teach ers and soholars. And this they will give. Tne Virginian Railway Company has bnilt a pond near Abilene in this county and stocked it with chnb. Now and tnen Farmviiiu fishermen get permission to cast hooks in those waters and return home boasting of tue time of their lives. 1 have often wondered that of oar land owners havent fish Fresh fish for"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "they will give. Tne <mark>Virginian</mark> <mark>Railway</mark> Company has bnilt a"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "they will give. Tne <mark>Virginian</mark> <mark>Railway</mark> Company has bnilt a"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [951.28, 535.58, 1106.18, 632.76], "bbox_id": "f989e480b5", "file": "AppomattoxNewspapers_1915-1918a_0389.pdf", "page": 1, "text": "Announcement has been made that the Virginian Railway Company had let contracts for concrete and steel work in connection with improvements to provide for additional dumping facilities for its coal pier at Norfolk, to the Virginia Bridge and Iron Com pany, of Roanoke, and J. P. Pettyjohn  Co., of Lynchburg. The cost of the work will be about 673,000, it was stated."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "been made that the <mark>Virginian</mark> <mark>Railway</mark> Company had let contracts"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "been made that the <mark>Virginian</mark> <mark>Railway</mark> Company had let contracts"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [544.28, 1714.06, 700.98, 1802.02], "bbox_id": "bc242bc90c", "file": "AppomattoxNewspapers_1922-1923a_0033.pdf", "page": 1, "text": "and Intermediate PintB- Vl inl, 1 southern Railway-from Vlrgni and North Carolina up to Asheville, but not west of Asheville. _ v ,__inia Virginian Railway from and West Virginia stations. gome of the railroads have  nounced special reduced rates, on the basis of one fare for the round trip,"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "of Asheville. _ v ,__inia <mark>Virginian</mark> <mark>Railway</mark> from and West Virginia"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "of Asheville. _ v ,__inia <mark>Virginian</mark> <mark>Railway</mark> from and West Virginia"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1670.16, 1166.09, 2015.56, 1396.89], "bbox_id": "9dc595aa1a", "file": "AppomattoxNewspapers_1943-1947a_0137.pdf", "page": 1, "text": "An Eighth Air Force Bomber Sta tion, England Special to tbz Times- Virginian.- Corporal James A.Rob- rtson, 25, ball turret gunner on ar. lo--th Air Force B-17 Flying For tress, entered the aerial offensive against Germany recently in a eavy bombing attack on the mar shalling yards at Mainz, one of the concentration points for enemy shipping behind the lines. He is a member of tiie 385th ombardment Group, commanded by Colonel George Y. Jumper, Na- toma, California. Son of Mr. and 6 ______ Mrs. D. L. Robertson, Victoria Va., Mr and Mrs j A McCann, of he attended the Victoria , High g  Spring, have received word School and was employed by the tat their son Frank M. McCann, Virginian Railway Co., at Vir.ona, F 2_c is in Boston. Another son, orior to entering the Army Air pvt Archie McCann is at Camp Forces in December, 1943. IDs wife, Reynolds Penn., and a daughter, the former Miss Lillian Earl Gunl, Louise M. Cooke. H. A. 1-C, Wave, and their two children, live at Ap- ig home on a vigit she will be sta- pomattox, Va. He received his aer- tioned in Portsmouth, Va. ial gunnery wings at Kingman"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "son Frank M. McCann, <mark>Virginian</mark> <mark>Railway</mark> Co., at Vir.ona, F"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "son Frank M. McCann, <mark>Virginian</mark> <mark>Railway</mark> Co., at Vir.ona, F"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [859.22, 1627.14, 1016.63, 1763.13], "bbox_id": "02c038fda9", "file": "AppomattoxNewspapers_1905-1912a_0488.pdf", "page": 1, "text": "65,000,000 Capital Voted. Norfolk, Va.The stockholders of the Virginian Railway Company au thorized an incredle in the capital stock of that company from 36,000, 000 to 65,000,000, of which 29,000, 000 is to be 5 per cent, cumulative preferred stock and 36,000,000 com mon stock. The minimum capital stock vwas made 50,000,000. The board of directors was increased from seven to nine members, h the elec tion cf directors was deferred until a subsequent meeting."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "Va.The stockholders of the <mark>Virginian</mark> <mark>Railway</mark> Company au thorized an"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "Va.The stockholders of the <mark>Virginian</mark> <mark>Railway</mark> Company au thorized an"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2033.96, 1124.66, 2196.55, 1314.9], "bbox_id": "42d6c88a1f", "file": "AppomattoxNewspapers_1922-1923a_0611.pdf", "page": 1, "text": "Caught By Saw And Killed. Fredericksburg Special.-James Blackwell, employed at the saw mill of Jacobs  Humphreys, in Stafford County, while taking lumbetr from the saw was caught between the head block of the carriage and the revolv ing saw, severing his right leg and his right arm. He lived only a few minutes. Construction Company Assigns. Norfolk Special. The Atlantic Engineering and Construction Cor poration, A. C. Freeman, r presi dent, and Burruss Corprew, secre tary, assigned to tlio latter as trustee The company is engaged in viaduct construction work for the Virginian Tidewater Railway at its Pine Beach terminals. Liabilities and as sets are not made public."}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "construction work for the <mark>Virginian</mark> Tidewater <mark>Railway</mark> at its Pine Beach"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "construction work for the <mark>Virginian</mark> Tidewater <mark>Railway</mark> at its Pine Beach"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2262.25, 406.76, 2418.62, 1088.84], "bbox_id": "255a2c5faf", "file": "AppomattoxNewspapers_1915-1918a_0252.pdf", "page": 1, "text": "On The H oad Dear T im es  Three weeks ago we left, our historic county of Appomattox for a visit to loved ones in Blue- field, W. Va. The weather has been perfeotdear skies, little rain, and no frost. Vegetation has not been killed and flowers are blooming prettily in the yard of every home. Bluefleld is a progressive oity, with its handsome homes, wide, olean streets and pretty churohes of various denominations. Wher ever one travels through the country one finds nicely graded roads, suitable for automobiles especially, of whioh one sees a large number, though one sees many horses, large and fat. While there we were fortu nate in seeing The Birth of a Nation, a moving pioture that oannot be desoribed even by one gifted in pen pictures. Holston Methodist confer ence was in session and many ministers availed themselves of the rare opportunity of attend ing this wonderful portrayal of that reconstruction period, so fresh in the memory of some and which will now be indelli- bly impressed upon the minds of those a ho have lived since that dreadful and eventful pe riod. After a oharming visit to Bluefleld we have oome to Tams, in Raleigh county, W. Va , a mining town containing a number of neat homes, all lighted by electricity. It con- taine two churobeB, a graded school, hotel and opera house. It is built on the Virginian Railway,and oars heavily load ed with- coal are constantly passing, some of the engines drawiog ninety oars, oarrying this valuable mineral to our eastern oities. The scenery 1 Irom here is entrancing, the mountains are clothed in their gorgeous tints, vieing with the colors of the rainbow. When we look upon this scene we cannot refrain from exolaim"}, "highlight": {"text": {"matched_tokens": ["Virginian", "Railway"], "snippet": "is built on the <mark>Virginian</mark> <mark>Railway</mark>,and oars heavily load ed"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "Railway"], "snippet": "is built on the <mark>Virginian</mark> <mark>Railway</mark>,and oars heavily load ed"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1568.88, 1091.78, 1901.35, 1407.56], "bbox_id": "edd35eb94d", "file": "AppomattoxNewspapers_1912-1915a_0510.pdf", "page": 1, "text": "main line of the Norfok  Western will be double track. It will leave only fourteen miles between Roa noke and Norfolk, this being be tween Ford and Jack, and fonr miles of this is expected to be under contract in a short time. The Pamplin-Bnrkevilie oat off, will be a single track, similar to the Mr. Eckland will sell his personal I Forest-Concord line around Lynoh- Vera on March 6th, I bnrg and a similar out off around and. will enter hospital for tieat- Petersburg. These are intended ment. He owns a part of thefor east-bound freight traffic, and estate knowfi at the John H. Flood I all-of them eliminate heavy grades farm near Vera.  I for east-bound trains, though the The Second Grads of A. A. H. s.Jre8uar P8Menget .service is main- wili give an entertainment-Patrio- tolned over p r e s e n t ls,  will tic Exeroises-on Thursday, March F 5 the   w,th the one now Pro 4th, 230 p. m. Admission 5c. for  jeoted. children, 10c. for others. Proceeds to go for a juvenile library . ................. .  I will parallel the tracks of the Pare bred White and Fawn g 0uthern and Virginian railways Indian Rnner Dncke, 8ingle comb I for qUte a igtance. White Leghorn Cockerels. Eggs I The report that the new cat off is f?r hatching from ohoice fowls.  to be a double track line seems to"}, "highlight": {"text": {"matched_tokens": ["Virginian", "railway"], "snippet": "Fawn g 0uthern and <mark>Virginian</mark> <mark>railway</mark>s Indian Rnner Dncke, 8ingle"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "railway"], "snippet": "Fawn g 0uthern and <mark>Virginian</mark> <mark>railway</mark>s Indian Rnner Dncke, 8ingle"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [875.22, 1218.9, 1027.1, 1520.24], "bbox_id": "74462c8fb2", "file": "AppomattoxNewspapers_1915-1918a_0517.pdf", "page": 1, "text": "For purposes of operation railroads if the United States have been placed n three divisions, as follows Eustern Railroads.The railroads In hat portion of the United States north if the Ohio and Potomac rivers and ast of Lake Michigan and the In- llana-llltnols state line also those railroads In Illinois extending Into it rom points east of the Indlana-IUi- ools state line also the Chesapeake c Ohio, the Norfolk  Western, and he Virginian railways. Southern Railroads.All railroads n that portion of the United States south of the Ohio and Potomac rivers ind east of the Mississippi river, ex- ept the Chesapeake  Ohio, Norfolk  Western, and the Virginian railways, ind also those railroads in Illinois and Indiana extending Into those states rom points south of the Ohio river. Western Railroads.All railroads not Included In the above definitions and, broadly speaking, all railroads In the territory west of Lake Michigan and of the Indlana-UUnols state line to the Ohio river and west of the Mls- dsslppl river from the Ohio river to the Gulf of Mexico, excepting those railroads In Illinois Included In east ern territory and those railroads in Illinois and Indiana Included in south ern territory, as above stated."}, "highlight": {"text": {"matched_tokens": ["Virginian", "railway"], "snippet": "Norfolk  Western, and he <mark>Virginian</mark> <mark>railway</mark>s. Southern Railroads.All railroads n"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian", "railway"], "snippet": "Norfolk  Western, and he <mark>Virginian</mark> <mark>railway</mark>s. Southern Railroads.All railroads n"}], "text_match": 1157451437081362553, "text_match_info": {"best_field_score": "2211881091072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451437081362553", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [1808.13, 684.79, 1970.74, 1158.66], "bbox_id": "5f70e8d36d", "file": "AppomattoxNewspapers_1902-1905a_0025.pdf", "page": 1, "text": "There 8 eem te Be Something Wrong With the System. Not long ago the state railway au thorities in Melbourne, Australia, had to Investigate a caae of a guards leav ing his van, walking alongtfle foot plates, clambering up the engine, and making a furious assault upon the driver, the train going at full speed all the while. They are now inquiring into another curious Incident. In this case somebody forgot to fix the coup lings between the engine and the train. When the signal was given the engine steamed out ot the atatlon by itself, leaving carriagas and passen gers in the lurch. Guard, atatlonmos- ter, porters and spectators yelled, but without effect. The engine ran tor sis miles before it was discovered that it had nothing behind it. The most dis quieting feature of the incident was that it passed several signal boxes without receiving any warning to stop.  __________ Garfields Nomination. At the Republican national conven tion In 1880 the Blaine Half-Breeds to use the nomenclature of the day and the Grant Stalwarts, 300 in number, hugged each other in death grapple. They crushed each other and Garfield scampered off with the nomination for. president. When leaving Wash ington ,to attend the convention as leader of the Sherman delegates, Gar field was asked by John Randolph Tucker of Virginia Whom are you going to dominate? Garfield is said to have loved Ran. Tucker. They were far. asunder in politics, but there were love and affection and intellectual kinship . between the Virginian and the Ohioan. Garfield put his arm around, Tuckers shoulders and whis pered. Keep your eyes on me. And so it was. Garfield became President and Blaine took the secretaryship of state, to keep his hand on the helm, his friends said. To watch the Peru vian guano beds, his enemies re plied.Washington Letter toRich mond Va. Times."}, "highlight": {"text": {"matched_tokens": ["railway"], "snippet": "long ago the state <mark>railway</mark> au thorities in Melbourne,"}}, "highlights": [{"field": "text", "matched_tokens": ["railway"], "snippet": "long ago the state <mark>railway</mark> au thorities in Melbourne,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [304.29, 317.18, 475.44, 1726.62], "bbox_id": "c23c50bb10", "file": "AppomattoxNewspapers_1912-1915a_0181.pdf", "page": 1, "text": "Some farm ers are delighted with their yield of w heat and the quality is better th a n usual a g re t p art of the crop in Buck ingham has been threshed. No sales of new w heat have been m ade on the local m ai ket th at I know of. Mr. Ludwell Gilmer, who was a native of Albemarle County is living in Pennsylvania and has succeeded in business, and during the reunion at G ettys burg be cam e there in his auto mile and took a party of rela tives nd friends to a near-by tow n where he entertained them a t a hotel. Among his guests were h s father, Mr W alker Gi mer, and Mr. Geo W. Patteson. The old veterans, who at tended the reunion a t G ettys burg, are loud in th eir praise of tbe N orthern people for their cordial hospitality. Mr. Jo h n Hill Moss, after spending some days a t his ole home here last week, left for trip to Cincinnati and other places of interest. Mr. Moss is a valued employee of the A t lantic Coast Line Railway and is located a t Richmond. Miss Louise McCraw, of An- dersonville, has been spending some tim e with the Misses Pat- ceson a t  Mount Pleasant  Miss Leslie Teeter is suffer ing from a bruised hand she got hurt in an accident. The survey of the road th a t is to be made by the State and County has been completed and Mr. Howard, who was sent here to do tbe work, will now m ake his report. Congressman Flood has been selected as one of the A m erican delegates to the Inter ariimen- tary Conference on W orlds Peace to be held a t The H ague on Sept. 3rd, 4th and 5th. He ndicated a desire to accept if his duties in Congress will per m it If he goes he will doubt- lesB do credit to him self as a delegate, and add fresh laurels to his ser.ice as a representa tive Virginian, for he is an Am erican worthy to be honor ed in this international as sembly. There was a ball gam e played in Mr. H. T. A ntrim s field Saturday evening between the burnt woods team and the team from W arm inster, and Miss Mabel Swoope was very painfully hurt by a ball strik  ing hei on the nose, fortunately Dr- M orriss was near by and motored to the place in a few m om ents Miss Mabel was ta k  en to Mr. A ntrim s house and lqter cam e home. The Commission composed of Doctors Priddy, Drury and Tucker, who were appointed to inquire into the m ental condi ion of Mr. Mott R. Glover, have fixed upQn the 15th and 16th of Ju ly to be here to hold the ex anim ation. It is hoped th a t Judge Hundley m ay be well enough to preside a t the special term of Court to be held here on A ugust 6 th. On W ednesday of this week the ladies bave planned to have a basket picnic a t  W heat land for the children. Senator Gayle had a relapse tow ards the weeks end and on Sunday he was not feeling m uch better. The little chiid of Mr. and Mrs. F. R. Moon is reported as m uch improved. Mr. and Mrs. Jo h n B. Boat w right have moved to Dillwyn muob to the regret of their friends here. Mrs B oatw right has won a place in the hearts of the young girls near here th a t it will be difficulty for a n  other to fill she is so sociable an d companionable th a t they dislike for her to go even as far as D illw yn. Mrs. Roberts w ith her son and daughter are staying w ith Dr. and Mrs. Morriss, and add greatly to the social life here. Mr. an d Mrs. H inderlite are expected to arrive th is week"}, "highlight": {"text": {"matched_tokens": ["Railway"], "snippet": "t lantic Coast Line <mark>Railway</mark> and is located a"}}, "highlights": [{"field": "text", "matched_tokens": ["Railway"], "snippet": "t lantic Coast Line <mark>Railway</mark> and is located a"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1749.59, 263.01, 1955.74, 1712.5], "bbox_id": "e848166257", "file": "AppomattoxNewspapers_1905-1912a_0270.pdf", "page": 1, "text": "Roanoke. The recent opening of the W inston-Salem Southbound Rail- way was observed here F riday even ing with a reception and a banquet at the Hotel Roanoke under the auspices of the Cham ber of Commerce. Offi cials of m any railroads and leading business and professional men of Vir ginia, N orth Carolina and South Carolina were am ong the guests President L. E. Johnson, of the Nor folk and W estern R ailroad, acted as toastm astpr. Among the speakers were Rev. A rthur Rowbotham, pas tor of the Second Presbyterian Church Mr. R. H. Angell, president f the R oanoke Cham ber of Com merce Capt. F. C. Robbins, of Lex ington, N. C. Mayor Joel H. Cutchin, af Roanoke President H. E. Fries, ol the Southbound Railw ay Mayoi Goodwin Rheet, of Charleston, S. C., President T. M. Em erson, of the At lantic Coast Line Railw ay Judge W alter R. Staples G. A. W indtield, of Norfolk, general attorney of the Virginian Railw ay Lucian H Cocke general attorney of the Nor folk and W estern Railway, and Rev J W. Cantey Johnson, rector of St Johns P rotestant Episcopal Church. Petersburg. General Lees b irth  day anniversary was observed bj Petersburg. The day being a State holiday the banks and different pub lie offices were closed, ln the after noon there was a parade of A. P Hill Camp of Confederate V eterans Company G, Petersburg Grays Sec ond Battalion, Second Regim ent Vir ginia Volunteers, and the Petersburg M ilitary Academy cadets. The col umn was headed by the drum corps I of A. P. H ill Camp. Gen. Stith Bol- I ling was chief m arshal. Among those who m arched in the parade w ith-the veterans was Jam es Auderson, com mander of Wilcox Post, Grand Arms of the Republic, of Springfield, Mass Mr. Anderson is an honorary membvii of the camp and has been for some years. Lynchburg.  An interesting and unique m arriage took place at the Lome of the Rev. J. Mack Franklin, the officiating m inister, who lives on Virginia ayenue, when Miss Alma Mi nerva Fitzgerald, a native of Nelson county, w as m arried to Robert W al ter Mayberry, a prosperous farm er ol Appomattox county. The principals to the m arriage are both deaf mutes and, in the absence of an interpreter, lie m inister was compelled to permit the bride and groom to read the ques tions from the service of the Baptist Church and afterw ard perm it them lo mod their assent. The bride has been livipg with her sister on Ken yon avenue. Mr, and Mrs. Mayberry ill m ak eth eir home at the farm ef the bridegroom in Appomattox ounty. Suffolk. Failing in their plans tc i kve a board o f-a rb itra tio n decide .at lh i3 clPbpty is entitled to the next wStior ti u th e  T hirtieth district, ana Tor hoV long, owing to the re-  a sal of th e ebunty chairm an to fur ther tbeTfeffeme by appointing them .3 meiubers of the commission, two ji the signei s of the arbitration agreem ent announced their candidacy .,ciore the people. They are Assem- ty Delegate J. E. W est, of Suffolk, and Attorney E rnest H. W illiams, of ... ithfield. The position of Dr. E. V. Turner, the third advocate of arbitra- ion, was not learned. Fqllowing ..hs announcem ent for the Senate i ol. R. L. Brewer, Jr., a m ember oi uovernor M anns staff, declared that ne would run for the House of D eb ates from Nausemond. Lynchburg. At a m eeting of the oaid of trustees of the E lks Na tional Home, held at the home in Je aio rd county, it was decided to make an appeal to the next meeting jf the Grand Lodge at A tlantic City, i-o be held, probably, in July, for an ppropiiation cf at least 250,061 ,ith which to construct a modern ind fireproof building for the 80 vei- tia n Elks who have become charges upon the order. Last year the Grand Lodge refused to change the location yf the national home, and it is be- deved by trustees th at piovision will oe made readily to protect the vet- ran E lk  fro m fire hazard th a t ex- .sts in the present home. Roanoke. Raymond C. G aist, 17 yeais oid, son of Mrs. Millie E. G ars, postm istress at Boones Mills, was ar rested by Postoffice inspector Hal. J. Mosby on a w arrant charging him with rifling the mails. For some time reports have been made concerning .he lose of various pieces of mail at ihe office. The Iasi case of import- ince reported w as a registered lettei ontainirig 61. The postal authori se s went to work on the case and nffer gathering evidence decided that suspicion was strong against young Ja rst. He was arrested and is now n ball pending a hearing before United States Commissioner English, at Rocky Mount. Luray. Mrs. Lester Ruffner, wife et a form er m otorm an bn a street ,a r in W ashington, who moved tc Lhis county about two m onths ago ncountered a rattlesnake near he? Pome ln the M assanutton M ountain, Jvo miles n orth of Luray, a few day. ago. Though alm ost dorm ant an dazed by being inteirupted while tah ing its sun bath, the rattler, coiiiu itself gave a couple of its danger sig nals, then attem pted to glide beneatl i rock, when the plucky woman, wit. in unerring aim, soon put an end to t with a stone. Lynchburg. Dr. S. T. W illis, who cas charge of the Bible departm ent it the V irginia C hristian College and was for 21 years pastor of the Om i u n d r e d and Slxty-nintli Stieot Church in- New York, was electee president of the college by the boar M trustees to fill the place oi D . Hopwood. Dr. Hop wood has bee resident s in e the founding of th oliesre. in 19 0 3. ar.d n o r r s . s i"}, "highlight": {"text": {"matched_tokens": ["Virginian"], "snippet": "general attorney of the <mark>Virginian</mark> Railw ay Lucian H"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian"], "snippet": "general attorney of the <mark>Virginian</mark> Railw ay Lucian H"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [136.53, 297.87, 304.88, 1781.44], "bbox_id": "e84bf9143f", "file": "AppomattoxNewspapers_1905-1912a_0557.pdf", "page": 1, "text": "PARSI V H j LK. Delegates from Prince Edward have been chosen to attend the Nor folk convention and all go nnin strncted. Rev. Dadmun, presiding elder of this circnit, attended the mass-meeting held in Fatmville when delegates were chosen and made earnest plea for instructions favoring Wilson, Virginias son, but the resolution was voted down. He followed it with another embody ing expression of preference foi Wilson and this too suffered like fate. I have no doubt the mar o God thinks of these Farmville De mr crate as a strange people, not  peculiar people as Gods people are, since they are nnwilling even to suggest a Virginian fer the high office. If he knows more of politics, however, he will learn that they not only make strange bedfellows but give birth to many strange things, Speaking of politics reminds me of a forecast made by a farmer of Cumberland recently. He said Harry Tucker would be next Gov ernor of Virginia and Teddy Roose velt next President of the U. S. and that the same Harry Tucker would be tbe successor of Roose velt as President And the prophet is a loyal Democrat, a constant reader of the papers and a dear thinker. And he wanted It dis tinctly understood that he was in dead earnest and no joking about it. Wind and water have been again doing serious damage in the county. Mrs. Meadow, who lives in the east ern section of the eonnty, lost two barns, her stable and dwelliug greatly damaged. Mr. B. H. Wal ton lost a barn. A concrete bridge is being built over Bailors Creek and tbe water swept away the ce ment which was thought to have been removed far above high water mark. Crops on the Appomattox suffered too and will have to be re  planted. Lettuce shipment has gone beyond. the highest point reached last. sea son when we thought all records had been broken. And they had been, but now another record has been made. On one day of last week 242 orates were expressed from thir point to different cities against 221 for the best day of last season. And the cry is, still they come. Miss Julia Hundley, ouly daugh ter of Judge Hundley, wbo has been teaching in Wilmin ton, N. C., is now in Richmond under charge of a specialist. Mrs. Howell Richard son, of this place, is also in the city, having recently undergone a surgi cal operation. Her friends are re joicing that she is doing well. Three venerable ladies of Frm- ville have been seriously sick, Mrs. Proctor, Mrs. Hart and Mrs. Bugg. Mr. T. W, Vaughan has aMd his residence on east 2nd street and is now looking for another. Contractor R. S. Rice will bnild the new high school building at the price of 121,000. The work will be pushed vigorously with the hope or having it ready for the opening of another session. Ex-Governor Montague has been asked to address the Confed -rate veterans cn the 31st when they are entertained by the Daughters of the Confederacy. Here is a good one on one of our farmers or one of our merchants and just whose shoe pinches I won venture to say. Tbe farmer foil in to something of a swoon ia a certain store and fora time there was con slernation. A brother farmer en tered just then and seeing an ac count.lying by his side, said,  Doui be alarmed, he will soon recover, thi shock of seeing that account was little too much for him. And. he did rally, settled up and left for home saying though not aing.ug,  Its easy to buy and have things oharged but the d1 ia to pay when pay-day comes. And yet the great railway magnate oared nothing for cash bnt all for credit. So long as that gifted preacher Rev. W, E. Hill, was in Farmville. he wasnt known as much of a finan cier but now that he is in Atlanta be has gone to work, paid off a debt he found- resting on his congrega tiom andis moving to build a 40 000 church. It shows that all he needed was the field in which to display his powers. Here he found no church debt and no need of better building. Rev. Andrew Allan, D. D., wh was expected to begin his work here ao pastor of the Presbyterian church on last Sunday has been detained and now expects to occupy the pul pit for tbe first time as pastor on tbe 26th. The papers published at Brantford, Ontario, the city froir which be comes, make pleesai1"}, "highlight": {"text": {"matched_tokens": ["Virginian"], "snippet": "even to suggest a <mark>Virginian</mark> fer the high office."}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian"], "snippet": "even to suggest a <mark>Virginian</mark> fer the high office."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [229.92, 1722.9, 1338.23, 1770.75], "bbox_id": "9dba6dd1d1", "file": "AppomattoxNewspapers_1926-1933a_0266.pdf", "page": 1, "text": "Norfolk and Western  Railway No farmer can plow a field by turning it over in his mind. Take the HOME PAPER Times  Virginian"}, "highlight": {"text": {"matched_tokens": ["Railway", "Virginian"], "snippet": "Norfolk and Western  <mark>Railway</mark> No farmer can plow a field by turning it over in his mind. Take the HOME PAPER Times  <mark>Virginian</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Railway", "Virginian"], "snippet": "Norfolk and Western  <mark>Railway</mark> No farmer can plow a field by turning it over in his mind. Take the HOME PAPER Times  <mark>Virginian</mark>"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1881.34, 953.05, 2050.89, 1271.69], "bbox_id": "68a9cc6587", "file": "AppomattoxNewspapers_1952-1954a_0343.pdf", "page": 1, "text": "intendent, in the fabulous surren der room  a print of the restored McLean House itself and then a photo of Main Street of the present town a shot of former mayor G. B. Buchanan discussing past and pre sent of Appomattox with Mrs. E. Carroll Smith, Park Service secre tary a photo of Robert E. England er and C. D. Doss exhibiting Pa tricia Ann dresses to J. Wilbur Mc- Dearmon, Railway employee, at Ap pomattox Garment Co., Inc. a panel photo of local N.  W. representa tives C. S. McDearmon, retired, and J. Wilbur McDearmon, J. D. Me Dearmon and R. J. Doss a photo of Bank of Appomattox executive vice president W. W. Burke and Times Virginian editor Calvin Robinson a shot of activity at the railroad yards with Twyman Coleman , and Hunter Lumber Co. and J. E. Sears Co., Inc., personnel The article has, commentary on both historic and modern Appomat tox and concludes with the state ment that . . . .From both an his torieal and industrial standpoint the progressive town of Appomattox is making important contributions to the state and the nation."}, "highlight": {"text": {"matched_tokens": ["Railway"], "snippet": "J. Wilbur Mc- Dearmon, <mark>Railway</mark> employee, at Ap pomattox"}}, "highlights": [{"field": "text", "matched_tokens": ["Railway"], "snippet": "J. Wilbur Mc- Dearmon, <mark>Railway</mark> employee, at Ap pomattox"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1084.12, 588.71, 1245.97, 664.96], "bbox_id": "7781b45a23", "file": "AppomattoxNewspapers_1912-1915a_0536.pdf", "page": 1, "text": "Huddleston, a small town on the Virginia. Railway, in Bedford county, is to have a new State bank, the capi tal of 12,000 having already been sub scribed. The bank is expected to open May 1. This is the sixth bank to be opened in new towns on the Virginian in the past few years."}, "highlight": {"text": {"matched_tokens": ["Railway"], "snippet": "town on the Virginia. <mark>Railway</mark>, in Bedford county, is"}}, "highlights": [{"field": "text", "matched_tokens": ["Railway"], "snippet": "town on the Virginia. <mark>Railway</mark>, in Bedford county, is"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [208.11, 1662.7, 1350.45, 1747.0], "bbox_id": "e3687037ba", "file": "AppomattoxNewspapers_1908-1909a_0266.pdf", "page": 1, "text": "Forco of Choroetor Nocouory ,  The most DriUlaBt qnallttea become useless when they are not sustained by force of character.Segur. Norfolk and W I X1 Railway i j each tr im County Clerk Buren No farmer can plow a field by turning it over in his mind. Takeíthé HOME FÁPER Times Virginian 3"}, "highlight": {"text": {"matched_tokens": ["Railway"], "snippet": "and W I X1 <mark>Railway</mark> i j each tr"}}, "highlights": [{"field": "text", "matched_tokens": ["Railway"], "snippet": "and W I X1 <mark>Railway</mark> i j each tr"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1366.29, 510.32, 1526.5, 1230.21], "bbox_id": "c4df256f78", "file": "AppomattoxNewspapers_1918-1922a_0421.pdf", "page": 1, "text": "Danville.Edwin Kettle, secretary Of the Danville Y. M. C. A. received word that M. W. Lee, of Alabama, has been appointed to take the place of S. A. Ackley, State secretary of the organization, now in Little Rock, Ark. Mr. Lee is a Virginian and was once student secretary for Virginia. Pulaski.In the one-day campaign Pulaski citizens pledged- 40,000 to secure the preparatory school which Emory and Henry College of the Meth odist Church is to establish. Action is to be reported to the committee on location. If accepted the town has several sites in view. Lynchburg.The Southern Railway system has restored section men who were cut off some weeks ago to their Jobs. The section forces recently were given double sections to work with re duced forces. These have now been restored, but it is understood there has been a cut of 5 cents an hour in the pay of the section men. Winchester.Bobbie Forney, four- year-old son of Robert Forney, was run over and killed by a bakery truck driven by Julian Rogers. Witnesses said the accident appeared unavoid able. The boys father was the ser geant who planted the American col ors on the wall of Peking during the Boxer uprising in China. Norfolk.Heavy damage to early potatoes was done by tbe recent frost in Norfolk, Princess Anne and Nanse- mond counties, according to reports received from all parts of this section at the office of the Southern Produce Exchange. Other crops damaged by the extreme cold were strawberries, which were in full bloom and other early truck. Winchester.Representative Thos. W. Harrison, Democrat, Winchester, member of tbe House from the Seventh Virginia District, is reported to have the backing of the Virginia delegation In Congress for a place on the appropriations committee, and he also may be assigned a place on the rivers and harbors sub-committee. He has been a member of the committee on military affairs since succeeding James Hay, about five years ago. Winchester.Two nights of freez ing temperature and heavy frost all but wiped out that portion of the com mercial apple crop of the Winchester district not already killed or seriously damaged by similar weather the last of March. Expert examination of orchards was followed by a statement that probably 50 per cent, of the ap ples escaped, and that York Imperials would form 90 per cent, of this re duced crop. Norfolk.The finding of the watch and money of Albert N. Jacobs, Berk ley merchant, who was murdered Tues day, deepens the mystery surrounding his death. Revenge now is believed the motive for the crime and the po lice are following a clue which Is ex-"}, "highlight": {"text": {"matched_tokens": ["Virginian"], "snippet": "Mr. Lee is a <mark>Virginian</mark> and was once student"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian"], "snippet": "Mr. Lee is a <mark>Virginian</mark> and was once student"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1515.23, 1581.35, 1666.3, 1713.25], "bbox_id": "e636570714", "file": "AppomattoxNewspapers_1918-1922a_0449.pdf", "page": 1, "text": "Cordwood By Pound. A new schedule of rates on cord wood, effective on the- Virginian Rail way at stations between Norfolk and Suffolk, is now In effect, J t .was an nounced by the State Corporation Commission. The new rates, of spe cial interest to manufacturers of ex ceisior, are In nearly all instances low er than the tariff formerly employed In the future, under the commissions new ruling, the railway will charge by the pound for all cord wood carried between the points mentioned."}, "highlight": {"text": {"matched_tokens": ["Virginian"], "snippet": "wood, effective on the- <mark>Virginian</mark> Rail way at stations"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian"], "snippet": "wood, effective on the- <mark>Virginian</mark> Rail way at stations"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1561.46, 586.39, 2285.32, 942.2], "bbox_id": "ac1ff13cdb", "file": "TimesVirginian_1980a_0291.pdf", "page": 1, "text": "By FRANCES H. PAULETTE With so much thought and energy going into the Historic Appomattox Railroad Festival, a backward glance at the Depot seems in order. It was n the year of 1852 that the first railroad was built through the county of Appomattox. It was called the Atlantic, Mississippi and Ohio Railroad. The first passenger train went through Appomattox enroute tp Roanoke in November of 1852. At that time the engine was fired with wood the wood was cut, hauled, and stacked along side the tracks. Some time later the railroad was renamed The Virginian and Tennessee Railroad. Today it is the Norfolk and Western Railway System. In notes- belonging to Miss Nola Burkey, a- retired elementary school teacher, we find  the following. According to the late Nathaniel Gregory,-the first railroad station was just a boxcar. Some time later a station proper was built. The Depot, as the station was called, was burned by Grants army on School enrollment down slightly"}, "highlight": {"text": {"matched_tokens": ["Virginian"], "snippet": "railroad was renamed The <mark>Virginian</mark> and Tennessee Railroad. Today"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian"], "snippet": "railroad was renamed The <mark>Virginian</mark> and Tennessee Railroad. Today"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1016.9, 199.16, 1185.29, 1586.5], "bbox_id": "3f55b1b799", "file": "AppomattoxNewspapers_1915-1918a_0011.pdf", "page": 1, "text": "age com production. No Virginia far mer should be satisfied with less than six barrels per acre. Looking out over the fields of the Valley and the Pied mont country across the mountains at this season of the year it la hard to conceive that any- Virginia farmer houses so small a crop as thatand yet If the average of the state .shall be brought up to six barrels, on the basis of,last years acreage and the ten-year average farm price, approxi mately 96,900,000 a year would be add ed tt the Income of Virginia farmers- More Wheat Per Acre. Again An average production of 124 bushels of wheat per acre is not a record with which we can he satis fied when compared with 19 bushels for the United States, 29 bushels for Nevada, 26.5 for Washington and 25 for Maine. I know of an average Virginia farm on which a yield of 47 bushels per acre was made last year under normal conditions and treat ment and wherever that Is possible by the use-of Intelligence certainly we should not be satisfied with anything leas than an average of 20 bushels throughout the State. On the basis of last years acreage end the average farm price for ten years, a twenty bushel crop throughout the State would add nearly six million dollara to the value of the wheat crop of Vir ginia. More than half a million dollars would be added to the annual value of the oat crop by Increasing the aver age yield from 19.5 to 26 bushels per acre and the annual value of the po tato crop would he increased by more than 8700,000 by raising the average production per acre from 81 to 90 bushels. Are these figures to make any Vir ginian comfortably content with ex isting conditions? Manufacturing In Virginia- Turning now to our record of manufactures. In common with oth er leading Southern States Virginia has demonstrated her ability to com pete with the North In mannfao- tuririy. The last census of manufac tures shows that, as measured by the percentage of Increase in the value of products, the South, aa a whole, had gona forward in the five years from 1904 to 1909 faster than any other sec tion except some of the far Western States where the volume of business done was so small that a relatively slight growth In the value of products showed a large percentage of la- crease. The census of manufactures of 1909 showed that the total value of the products of Virginia factories In that year was 9219,794,000, an In crease in the five years of 47.7 per cent, as compared with an Increase for the United States ef 89.7 per cent Kentucky, with 8223,754,000, was the only State south of the Ohio and Poto mac Rivers that surpassed Virginia in the value of Its manufactured pro ducts. North Carolina, with 52 per cent, was the only Southern State with a higher rate of Increase. Yet, encouraging as these comparative fig ures may be, If we look Into details we can find a basis for that dissatis faction with things as they are which should spur us forward to larger ac complishments. Opportunities Are Abundant. The geographical location of Vir ginia is most favorable for a large de velopment of manufacturing. Among the factors that are potent in deter mining the location of industries are the sources of supply of raw mate rials, an available supply of compe tent labor, markets for finished pro ducts, and transportation facilities for concentrating raw materials and dis tributing finished products- Within the State of Virginia and In the states to the Southward are sources of sup ply of raw materials for a wide diver sity of manufacturing. To the north ward, across the Potomac -River, are the markets of the most densely popu lated region In the United States and outside of the Virginia Capes are the markets of the world- The railway lines of the State are admirably locat ed for the concentration of raw mate rials and for the distribution of manu factured commodities to all parts of the United States and we have direct water transportation not only to all tho oceans of the world, but also by way of the Atlantic Ocean and Chesa peake Bay to the seacoast elttes of the United States. For certain kinds of manufacturing we have a supply of white labor which has not yet been fully availed of. These are reasons why Virginia should play even a larg er part than she does In the manufac turing Industries of the South. Cotton Mills In Virginia. Chief among these Industries is one which every Southern man, and not least every Virginian, should regard with a thrill of pridefor the fact that supremacy in cotton manufactur ing In the United States has passed from the North to theSouth. For sev eral years Southern mills have con sumed more cotton than those In all the other States. In the eleven months ended June 30, 1915, Southern mills consumed 421,714 more bales than were used In all the other States and consumption in Southern mills increased 31,000 bales while In all oth er States It decreased 108,432 bales, With the Northern limit of the cot ton belt within her borders, Virginia lies In the direct line from the cotton fields to the domestic and foreign mar kets for cotton goods. Virginia has flourishing cotton manufacturing in dustry, which, in 1909, turned out pro ducts to the value of 37,933,000, an in crease in five years of 67 per cent. While this rate of Increase was large, the total volume of business done shows that this State has not yet made the most of her advantages for cotton manufacturing. Indeed, by"}, "highlight": {"text": {"matched_tokens": ["railway"], "snippet": "of the world- The <mark>railway</mark> lines of the State"}}, "highlights": [{"field": "text", "matched_tokens": ["railway"], "snippet": "of the world- The <mark>railway</mark> lines of the State"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.61, 1204.9, 1636.61, 1478.44], "bbox_id": "ca0753bed4", "file": "AppomattoxNewspapers_1955-1957a_0574.pdf", "page": 1, "text": "A large number of people who glory in the sight and sound of trains will converge on Roanoke over Labor Day week-end for three intensive days of riding their hob by- It will be the annual convention of the National Railway Historical Society, Inc., and s-ome 400 mem bers from thirty-odd chapters all over the country will attend. There will be no business sessions, resolu tions or long-winded speeches for these railfans. They will just look, ride and take pictures. Plans for Saturday, August 31 are for tours of Norfolk and West erns shops and Shaffers Crossing engine facilities, the Virginian Rail ways yard and engine house and optional trips on an NW branch or to the nearby summit of the Blue Ridge where heavy main line steam trains surmount the grade. The only formal gathering will be a Saturday night banquet in the Hotel Roanake ballroom."}, "highlight": {"text": {"matched_tokens": ["Railway"], "snippet": "convention of the National <mark>Railway</mark> Historical Society, Inc., and"}}, "highlights": [{"field": "text", "matched_tokens": ["Railway"], "snippet": "convention of the National <mark>Railway</mark> Historical Society, Inc., and"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1636.1, 1205.63, 1799.35, 1282.03], "bbox_id": "0108323084", "file": "AppomattoxNewspapers_1905-1912a_0070.pdf", "page": 1, "text": "Xexv Union Depot. Norfolk. A new union depot to be erected by the Virginian, the Nor folk and Southern and Norfolk and W estern Railways jointly, will cost  1 , 000,000 and will be eight Stories high. It will be erected by the Nor folk Terminal Company as a holding concern for the joint owners."}, "highlight": {"text": {"matched_tokens": ["Virginian"], "snippet": "be erected by the <mark>Virginian</mark>, the Nor folk and"}}, "highlights": [{"field": "text", "matched_tokens": ["Virginian"], "snippet": "be erected by the <mark>Virginian</mark>, the Nor folk and"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
{"document": {"bbox": [402.33, 560.6, 551.63, 1060.68], "bbox_id": "8e92f526b1", "file": "AppomattoxNewspapers_1922-1923a_0077.pdf", "page": 1, "text": "jfashinKton-  Government plans for Uution of coal during the exist- I emergency wore announced by bi Distributor Spencer after a con- nce with Secretary Hoover and central committee appointed by Ljdent Harding. The Federal or- Lation in Washington, he said, , cover the distribution of avail- le supplies among the railways, Fed- 1 institutions and States, while the Irernors of the States will handle ! lojat supply- Pith the completion of the Federal lanization. Mr. Spencer said, three fcnnediate stages will ensuefirst, j continuation of their normal busi- L by the operators then priority yers under the Interstate Commerce Immission service order No. 23 will pdually encroach upon operators tiness, and finally, coal orders Teed through the Federal Fuel Dis- ibutor will absorb the entire output Tthe mines. Provision has been made for tne Tablishment of district committees  represent the Federal Distribution ministration in the producing fields, th special arrangements for supply-  the Great Lakes section. Detailed btructions were drawn up for the gates, which included the fixing of e responsibility for the payment foi 1 coal shipped into a State upon the fevernors committee. District committtees set up in the al fields are to consist of a naval Tcer, representing the Federal Fuel stributor, a represntative of the In- Irstate Commerce Commission, a rep- feentative of the railroads and rep- Centativcs of the coal operators. District headquarters have been es- Ibllshed as follows Norton. Va., for all Virginia mines fccept the Pocahontas district Blue- Bid, W Va., for the Pocahontas, finding Gulf, New river, Tug river y Virginian district Huntington, Kanawha, Logan, Williamson Sandy districts Knoxville, In Southeastern Ken- of Harlan and Hazard"}, "highlight": {"text": {"matched_tokens": ["railway"], "snippet": "le supplies among the <mark>railway</mark>s, Fed- 1 institutions and"}}, "highlights": [{"field": "text", "matched_tokens": ["railway"], "snippet": "le supplies among the <mark>railway</mark>s, Fed- 1 institutions and"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
