{"document": {"bbox": [370.57, 1453.63, 537.3, 1754.32], "bbox_id": "431b4dd69d", "file": "AppomattoxNewspapers_1908-1909a_0497.pdf", "page": 1, "text": "Pamplin June 8.The Rev-1 erends H. L. Reeves and J. E. White conducted a daily vaca-l tipn Bible school at Madison- f ville. last week. Mrs. W. M. Gilliam and I daughter of North Carolina, have been guests of Mrs. J. W.! Gilliam. Mr. and Mrs. E. D. Carwilel have ad as their guests Mrs. George Blake and daughter, Ann Berkley. Miss Jane Paulette left Mon day for Virginia Intermont Col lege, Bristol, where she will I take a special course in music. At a .recent, meeting ofl Southside Lodge, No. 191, A.F. A.M. a special George Wash- ington program was observed  with the following speakers Dr. Chas. F. James of Appo- j mattox on his business life j Willard E. Brown, of Norfolk, on his home and boyhood J. V. Lewis, on his politcal life, I and H. L. Reeves on his GhrifJ tian life.  1"}, "highlight": {"text": {"matched_tokens": ["Willard", "E", "Brown"], "snippet": "his business life j <mark>Willard</mark> <mark>E</mark>. <mark>Brown</mark>, of Norfolk, on his"}}, "highlights": [{"field": "text", "matched_tokens": ["Willard", "E", "Brown"], "snippet": "his business life j <mark>Willard</mark> <mark>E</mark>. <mark>Brown</mark>, of Norfolk, on his"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [372.71, 1473.55, 539.42, 1774.29], "bbox_id": "7d1f827edd", "file": "AppomattoxNewspapers_1926-1933a_0497.pdf", "page": 1, "text": "Pamplin June 8.The Rev erends H. L. Reeves and J. E. White conducted a daily vaca tion Bible school at Madison- ville last week. Mrs. W. M. Gilliam and daughter of North Carolina, lave been guests of Mrs. J. W. Gilliam. Mr. and Mrs. E. D. Carwile lave had as their guests Mrs.  George Blake and daughter,  Ann Berkley. Miss Jane Paulette left Mon day for Virginia Intermont Col lege, Bristol, where she will take a special course in music. At a recent meeting of  Southside Lodge, No. 191, A.F. A.M. a special George Wash- j ington program was observed! with the following speakers! Dr. Chas. F. James of Appo- mattox on his business life J Willard E. Brown, of Norfolk, on his home and boyhood J. V. Lewis, on his politcal life, and H. L. Reeves on his Chris-I tian life."}, "highlight": {"text": {"matched_tokens": ["Willard", "E", "Brown"], "snippet": "his business life J <mark>Willard</mark> <mark>E</mark>. <mark>Brown</mark>, of Norfolk, on his"}}, "highlights": [{"field": "text", "matched_tokens": ["Willard", "E", "Brown"], "snippet": "his business life J <mark>Willard</mark> <mark>E</mark>. <mark>Brown</mark>, of Norfolk, on his"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1959.81, 201.23, 2144.53, 1395.58], "bbox_id": "71f1d8bcab", "file": "AppomattoxNewspapers_1905-1912a_0032.pdf", "page": 1, "text": "Peyser Abraham, a bankrupt merchant of Portsmouth, was sent to jail by Judge E. Waddill, of the United States Court, for concealing his assets. He testified that he had lost 3.500 while drunk and gambling in New York in one night that he returned home, and in six weeks went to New York again and lost 2.500 more in the same way in the.same house. Judge W ad Jill pronounced the story im possible. and said. If what this hank- nipt has declared be sanctioned, the bank rupt court would be the greatest harbor for fraud and rascality tlie world has ever known and creditors would have no protection whatever, front people of this class. He held Solomon Green- stein, who came from New York to cor roborate the story, in 1000 bail to ap pear before the grand jury for perjury. Tlie charge against Abraham is con tempt of court, and lie is to stay in jail till he pays tlie 6,000. David Lowenberg, the general direc tor of the Jamestown Exposition and a capitalist of Norfolk, was stricken with paralysis in his rooms at the .Monticello Hotel. Physicians found that only part of the right side was affected and they declare that no serious consequences arc of age and the attack is regarded with of age and the attach is regarded with anxiety by his friends.  Rev. J. 11 . Slraughn, pastor of the Methodist Protestant Church in Lynch burg, who was elected financial secre tary of the Christian Endeavorers of the denomination in the United States, has decided to remain- in his present pas torate and decline the offer. 11 is wife, who was made superintendent of the junior work of the church, will also decline the position. The children of J. Samuel McCue, ex ecuted for the murder of his wife, Fannie M. McCue, have petitioned for relief from the payment of the expenses incurred in the ease of the Common wealth against their father. Judge Mor ris retrered a written opinion recom mending the relief asked for, and cer tified the petition to the Governor for his action. The amount paid by the Stale must, under the statute, be re turned by his estate unless the Governor intervenes. The amount is about 3,000. The convention of the Commissioner of Agriculture of the Southern States elected the following officers W.W. Ogilvie, Nashville, Tenn., president E. J. Watson, Columbia, S. C., first vice president T. G. lLudson, Atlanta, sec ond vice president B. W. Kilgore, Raleigh, N. C.,. secretary and treasurer, ind E. W. Magruder, Richmond, Va., assistant secretary and treasurer. J. W. Wilkinson, of Bristol, has closed 1 deal for 17,000,000 feet of lumber and timber in North Carolina. The land lies along the Southern railroad, near Asheville.. The amount reported to be involved in the deal is half a million dollars. In the City Circuit Court at Lynch burg the case of John W. Harvey vs he J. R- Milliter Company for 15,000 for loss of services of his wife, etc., on account of an elevator accident ijt the store of the company here three years ago was compromised for  75 -  I be plaintiff is a prominent Lynchburg at torney. In a former case instituted by Mrs. Harvey a judgment was secured for 2,500. Benjamin Watkins Lee, manager of the Henry Clav Inn, at Ashland, died suddenly in the hotel.  He formerly kept the hotel at Ocean View, at Jefferson Park. Charlottesville, and con ducted hotels in Florida, lie was about 65 years old. He leaves a widow and several grown children. Frank Crumley and James Morrell were arrested and placed in jail at Jones boro, Tenn., charged with the burglary of half a dozen business houses in that town. They were captured in the streets of the town at an early hour by a posse of armed citizens, who had been aroused by the report that the town was being plundered by a band of thieve. The dts overy was made by a man who had been aroused by a cow wandering in his yard, and whiledriving her out he noticed lights in a store across the street. The homes of the men under arrest were searched and much valuable  property was found, alleged to have been stolen from business houses iu Jonesboro. The news has been received that Prince Louis of Battenberg while in New York at a dinner given in his honor by Vernon H. Brown, vice-president of the Cunard Steamship Company, declared that Mr. Browns daughter-in-law, Mrs. Gardiner Willard Brown, was the most beautiful woman lie had seen in America. Mri Brown was Miss Mary Eliza Russell daughter-of James B. Russell, of Win Chester, and was married to Mr. Brown in Winchester last June. Mrs. Brown is the most beautiful woman I have sec during my visit to America, the land of fair women, said Prince Louis before the evening was over. You say she is a Virginia girl? asked his Serene High ness. Then Virginia should be proud of Iter as a daughter. She is indeed fair to look upon. Hon. Henry C. Stuart, of Russell coun ty, was elected temporary chairman of the Virginia State Fair Association. The ather officers arc John Stewart Bryan, vice-chairman II. Lee Lorraine, secreta ry, and Capt. John G. Ellctt, treasurer. The fine country residence of John I.. Vaughan, of the firm of L. H. Vaughan 4 Sons, railroad contractors, was burned o the ground in Montgomery county, in cluding the water tank and the fine stable juilding, near the home. Most of the urniturc was saved, hut the loss of build- will he about 8.000, ouc-fourth co-"}, "highlight": {"text": {"matched_tokens": ["Willard", "Brown"], "snippet": "Browns daughter-in-law, Mrs. Gardiner <mark>Willard</mark> <mark>Brown</mark>, was the most beautiful"}}, "highlights": [{"field": "text", "matched_tokens": ["Willard", "Brown"], "snippet": "Browns daughter-in-law, Mrs. Gardiner <mark>Willard</mark> <mark>Brown</mark>, was the most beautiful"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2261.28, 291.89, 2441.76, 1781.88], "bbox_id": "469b96664d", "file": "AppomattoxNewspapers_1902-1905a_0585.pdf", "page": 1, "text": "Dr. E. R. Baughon was sentenced, to a year in the penitentiary for stealing a gold watch and chain. He was once a prominent dentist of Newport News. Drink caused his downfall. The mangled body of C. W. Glover, an aged ex-Confederate who came to Bris tol to attend the annual reunion of vet erans, was found beside the Virginia and Southwestern Railroad, near Ben- hams Station, to mites from Bristol. While on his way home he had been run down by a night train. Glovers head and one arm were severed from his body. Miss Tennie Scott, daughter of a prom inent family in Scott county, is a fugi tive from justice, having fled across the Tennessee line to escape a warrant charging her with criminally beating a little girl who was a scholar in the pub lic school in which Miss Scott was teach er at Gale City. Miss Scott was tried during her absence and found guilty of the charge. She was fined 50 and sen tenced to 90 days in the county jaiL She has been summoned to trial, which law yers say makes the proceedings regular. Miss Hattie Leath, who, with her fa ther, Mr. Lawrence Leath, was thrown from a buggy a week ago near Unison, died of her injuries. Mr. Laeth was se verely bruised, but is considered out of danger. William B. Meroney, 37 years old, a well-known sporting man of Norfolk, committed suicide on the beach in front of the pavilion between the Princess Anne and Arlington Hotels, at Virginia Beach. His body was found by a coast life-saver. Meroney walked out into the surf up to his knees and shot himself while standing in the water. The re- reding tide left his body on the beach. A revolver was still tightly clasped in his hand. W. Lane Edwards, 76 years old, has filed suit in the Court of Law and Chan cery against his son, Benjamin Franklin Edwards, for the recovery of certain land in Norfolk county. He says he gave bis son land on which to build a house and money to build it. .The son brought him a deed to sign, telling him that it was only for the land on which the house was builL He signed it, and after doing so found the deed was for the entire tract The old man now prays the court that the deed be declared void and the property restored to him. Capt. Joseph E. Willard is expected to tender his resignation as lieutenant governor this week, in order to accept a position on the corporation commission. His successor will be Henry T. Wick- am, president pro tern, of the Senate. The State Senate, which assembles in January, will be presided over by J. Taylor Ellyson, provided, of course, the Democrats elect their State ticket m No- ember. Charles Brown was run over by a train at Freemans, in Brunswick county. He was attempting to jump on the train while it was in motion, and fell under one of the cars and was crushed to death. Azeale Thaxton, two years old, daugh ter of Mrs. Z. G. Thaxton, of Newport News, died from the effects of sucking the heads of matches. The child is said to have been in the habit of putting all the matches she could obtain in ber mouth. On the Cottage farm, belonging to Mr. L. N. Hoge, in King George county, is a pear tree loaded with fruit on one side, while the other side is full of whit blossoms, such as bloom in the spring. Mr. Frank P. Souder and Miss Fan nie Faulconer, both of Orange county, were married a few days ago hy Rev. A . Harlow at the brides residence, in Orange. Mr. W. G. Kemper, cashier of the Peoples Bank, Point Lick, Ky., is pro moting a bank at Herndon, in Fairfax county. Herndon has a population of more than 1,000 persons and is a pros perous business center. Arrangements for tbe reception to be given President Roosevelt on his arrival in Richmond October 18 have been com pleted by the Council committee appoint ed some weeks ago. Members of the City Council and a military escort, com posed of Blues, Howitzers and the Sev enth Regiment, will meet the President at Byrd Street Station. Luncheon will be served in the Masonic Temple, after which the President and his party will be shown the points of interest in tbe city. Mr. Roosevelt will speak from a stand in the Capitol Square in the after noon. He will receive citizens infor mally at the Jefferson Hotel, which will be headquarters for the Presidential par ty until 6 oclock in the afternoon. Mr. Roosevelt will proceed on his Southern tour at 7 P. M. The party will arrive about noon from Washington, remain ing seven hours in Richmond. Admitting insolvency and practically without assets, the Jefferson Fire and Marine Insurance Company of Rich mond, was placed in the hands of a re ceiver by Judge Ingram. The end of the company was precipitated, it is said, by a judgment obtained in Judge In grams Court by the Arkansas Democrat Company, of Little Rock, Ark., a pub lishing concern, which holds a 2,000 pol icy in the company and which is unable to collect a fire-loss claim of 1,250. The receiver is Roscoe C. Nelson, who will give bond in the sum of 5,000. Under the auspices of the S. V . Ful kerson Camp the Confederate Veterans of Southwest Virginia and East Ten nessee held their annual reunion at Bris tol. There were about 400 veterans in attendance. The address of welcome was relivered by Dr. J. F. Howell, of Bristol. Gov. John Isaac Cox, of Ten nessee, was the principal speaker. The veterans enjoyed a basket dinner in the grove. Prince Louis of Battenberg probably will be entertained by the officers of the Jamestown Exposition Company. In command of the British North Atlantic Squadron, he will arrive in Hampton Roads about October 26, and his arrival will be followed by an invitation from the Exposition company to accept of its hospitality. It is desired that the Prince may become thoroughly acquainted with the scope and design of . the Exposition. Mr. George S. Hamiltons place on Charles street, Fredericksburg, known as Scotia, has been purchased by Mr. G. Helmig for 2,100. Miss Kate Henson is dead at her home in Berryville, Clarke county, aged 24 years. She was a life-long member of the Baptist Church and of an old Vir ginian family. . The new Methodist Episcopal Church, South, at Romney, W. Va., will be dedi cated on October 1. Rev. J. Forrest Pret- tyman, of Baltimore, will preach the sermon. The West Virginia property at Capon Springs, Hampshire county, was sold at public sale to Charles F. Nelson, pro prietor of the hotel and summer resort there, for 5,000. The States interest there included the main spring, the batb- ses and the swimming pool"}, "highlight": {"text": {"matched_tokens": ["E", "Willard"], "snippet": "to him. Capt. Joseph <mark>E</mark>. <mark>Willard</mark> is expected to tender"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "Willard"], "snippet": "to him. Capt. Joseph <mark>E</mark>. <mark>Willard</mark> is expected to tender"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [840.68, 199.62, 970.5, 543.4], "bbox_id": "abd34a9cca", "file": "TimesVirginian_1980a_0368.pdf", "page": 1, "text": "6 m. Monday at her home. er husband is Wesley T. Brown. Born in Campbell County, Sept. 3, 1937, she was a daughter of Elizabeth. J. Johnson of Lynchburg and the late James T. Johnson. She was an employee of the Lynchburg Training School and Hospital and was a member of Rivermont Ave nue Baptist Church. In addition to her husband and mother, she is survived by four sons, Wealey T. Brown Jr. of Concord, Uonald Ray Brown, Michael Wayne Brown arid Douglas Scott Brown, ail of Lynch burg two brothers, Willard T. Johnson and Raymond E. Johnson, both of Lynchburg five sisters, Mrs. Ernest Thelma Wright of Mont- vale, Mrs. Ivan Christine Layne of Miami, Fla., Mrs. Harold Ruby Campbell of Rustburg, Mrs. James Bes sie. Whitehead and Mrs, Charles Janie Anderson, both of Lynchburg and one grandson, Jason Terrell Brown of Concord."}, "highlight": {"text": {"matched_tokens": ["Willard", "E"], "snippet": "Lynch burg two brothers, <mark>Willard</mark> T. Johnson and Raymond <mark>E</mark>. Johnson, both of Lynchburg"}}, "highlights": [{"field": "text", "matched_tokens": ["Willard", "E"], "snippet": "Lynch burg two brothers, <mark>Willard</mark> T. Johnson and Raymond <mark>E</mark>. Johnson, both of Lynchburg"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1307.52, 689.34, 1451.53, 860.13], "bbox_id": "4bdb7dd3c2", "file": "AppomattoxNewspapers_1912-1915a_0336.pdf", "page": 1, "text": "K  e iee r  V iove  tahIea a S W i S Eboilcrwho married Max W Blard. The lfjvJL.pr married a m an nam ed wlnaujtBonner and W illard w ere in lirremaux. tímate friends, A search is started for ,WfflardmYan Vechten enters th e House 1 Mystery by the back door in tim e to taufchnCallis threaten a girt. H e in- ! Meres and helps the girl escape, bu t is IMdered unconscious in th e struggle tKh Callis. Tom Phinney gets a Job KnaSer of Brownlows yacht K ohlnur. 1 ?  has been chartered for some m ys- ffis mission. The charterer. M ax W il- toi ana his friends board the yacht a t Sit and Tom hears the voice of th e un- fc!?,rn eirl Willard assures Tom th a t Ift mlsSon is honorable and intim ates Ittit a great wrong is about to be righted. iHe gives orders that no one is to- leave fir board the yacht w ithout his perm is-  slon. BOOK 111."}, "highlight": {"text": {"matched_tokens": ["e", "Willard"], "snippet": "the voice of th <mark>e</mark> un- fc!?,rn eirl <mark>Willard</mark> assures Tom th a"}}, "highlights": [{"field": "text", "matched_tokens": ["e", "Willard"], "snippet": "the voice of th <mark>e</mark> un- fc!?,rn eirl <mark>Willard</mark> assures Tom th a"}], "text_match": 1733920985075155065, "text_match_info": {"best_field_score": "2216175861760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733920985075155065", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [2111.03, 281.53, 2275.66, 1559.13], "bbox_id": "6c63179918", "file": "AppomattoxNewspapers_1905-1912a_0028.pdf", "page": 1, "text": "The annual meeting of the Virginia and North Carolina Association was held in Petersburg, with the following mem bers in attendance Messrs. Janies I. Pritchett, Danville R. C. Scott and L. G. Acree, Lynchburg R. A. Justice, Manchester R. P. Waller, Norfolk Tihomois L. Moore, Richmond O. O. Young, Henderson, N. C . G. D. Mayo, Richmond C. T. Meacham, H. F. Hum, Augustus Wright and W. E. Poole, Pe tersburg. The following officers were elected President T. C. Acree, Lynch burg executive conimitte, Thomas L. Moore, Richmond chairman  Janies I. Pritchett, Danville R. F. Walker, Nor folk G. J. Boney, Wilmington, N. C. J H. F. Hunt and W. E. Poole, Peters burg. Imposing ceremonies attended the un- veilling at Princess Anne Courthouse of the monument to tlie memory of Prin cess Annes Confederate dead. Mrs. Grace Prince, daughter of Maj. J. P. Woodhouse, acting as sponsor, unveiled the monument. Rev. Dr. William M. Vines, pastor of the Freemason .Street Baptist Church, of Norfolk, was orator of the day. Rev. Dr. B, D. Tucker, of St. Pauls Episcopal Church, offered the dedicatory prayer and read a poem. Oth er speeches Vere delivered by Judge J. M. Keeling, Capt. J. J. Burroughs and Col. George C. Cabell. The monument is a substantial pedestal of graite and marble, surmounted by the marble figure of a soldier as a sentinel. W. M. Simmons, a mailing clerk in the postoffice at Norfolk, was arrested charged with secreting articles taken from the United States mails. The arti cles were four samples of wine, which, he said, were not posltpai-d and which the sender said he might have. The wine is of little value. Simmons has .borne a good reputation heretofore. The Newport News and Old Point Railway Company took charge of the property of the Hampton Roads Railway Company built in 1901 to compete with its prcsknlb owners. After a stormy existence the road went into the hands of a receiver a year ago and was recent ly sold at auction to a committee of the bondholders. The sale was confirmed Saturday and the property was turned over to the purchasers. This was pre liminary to turning it over again to the Newport News atid Old Point Comfort Company, whose officers today took for mal charge of the property. In connection with the election of all five Judges of the Virginia Supreme Court of Appeals by the General Assem bly in January the name of Judge Thom as W. Harrison, of Winchester, judge of the Seventeenth Circuit, composed of the counties of Frederick, Clarke, W ar ren and Page, is conspicuously mention ed as a candidate to succeed Judge, Geo. M. Harrison, of Staunton. Judge Har rison is said to have a strong fallowing among leading lawyers of his circuit. He was an able member of the consti tutional convention. In the Virginia Baptist General A s sociation the treasurers report was read showing receipts of more than 130,000 and disbursements reaching to within 7,000 of that sum. More than 20 min isters who had joined .the association were introduced. President Edwin A. Alderman, of the University of Virginia, addressed the association and invited the members to visit that institution. Gov. A. J. Montague and a numlier of other distinguished Virginians went to Lexington to use their efforts to induce the students to comply with the demand of the board of visitors. After a ses sion of several days, during which the entire trouble was investigated, the board decided to require each member of ithe class to apologize for the action of the class in notifying the superinten dent, General Shipp, that unless better tood was provided the class would leave the institution. The penally for failure to apologize was expulsion. The Gover nor succeeded in getting all the mem bers of the third class, including the oath-bound 13, to sign a paper, whose contents were not made public, but the paper is said lo be of such a character as to meet the requirements of the board of visitors. Accompanying the Gover nor were former Lieutenant-Governor Joseph Willard, State Senator H. T. Wickham, of Richmond, and Col. Taze well Ellett, of Richmond and New Yirk. Judge E. Waddill, of the United States Court, Norfolk, issued an order for the transfer of the property of the Hampton Roads Railway and Electric Company to the purchaser, Horace A. Doan, president of the Hampton Roads Traction Company, who has bought the property for 250,000. This is the trol ley road which has been built as a rival lo the road between Newport News and Old Point Comfort, the trolley con trolled by W. J. Payne, of Richmond, and purported to he owned by Alexan der Brown and Sons, of Baltimore. A f ter undergoing the- fiercest sort of oppo sition from the old road, culminating in the receivership, the road has been finished by the court and placed on a paying basis. Many desertions are occurring among the enlisted sailors on the warships at ithe Norfolk navy yard. Every day from four to sjx deserters and strag glers arc picked up by the police and re turned to the ships. Others elude the local authorities and make their escape from these parts. When this happens the authorities of Ithe home towns of the deserters arc notified to keep watch, and when tlie men are apprehended they are returned for punishment. Accused of being the assailants of Virgie Johnson, near Franklin, two m- groes were arrested near the Delaware line -and carried back to Franklin. The girl failed to identify them. She was held up on the road and outraged by two range negroes at the point of a pistol. Prof. J. M. Brerdton- sued the Staun ton Horse Show Association for 50 for music furnished at the german in Colum bian Hall the last night of the horse show. The case was tried in the Corpor ation Court aud resulted in a hung jury."}, "highlight": {"text": {"matched_tokens": ["E"], "snippet": "Augustus Wright and W. <mark>E</mark>. Poole, Pe tersburg. The"}}, "highlights": [{"field": "text", "matched_tokens": ["E"], "snippet": "Augustus Wright and W. <mark>E</mark>. Poole, Pe tersburg. The"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [423.35, 1293.35, 905.26, 1445.47], "bbox_id": "f4922fbac7", "file": "AppomattoxNewspapers_1908-1909a_0399.pdf", "page": 1, "text": "T R U S T E E S  S A L E tera in connection with the disposal  r- of city sewage. Sometimes this part Mrs. T. T. Evans and daugh-1 -------  0f the bureau serves the useful pirn tor, Miss Louise, visited Mr. 1 By authority vested in us by po warning would-be real estate Lawreuce Brown . Baptist H ob -deed of.tr.at ,d ated , t o pital In Lynchburg, and ort d a  o  v  r l  b , WBw . him as getting along nicely. X c h deed is of record in the Grand Dukes W idow Misses Ruby and Edna Wool- clerks Oflice o f Appomattox Seeks to SeDCUfai dridge and Messrs. Willard and County in Book 2H fcpge 316,     . The nn msr sava that Jack Paulett were guests of Missdefault having been made in thé two famous Jewels from the imperial Rachel Paulett --------  payment of the debt therein se- Buaslan treasury are being offered for mr d T ka.. ,v, Vioo I cured and having been reguired  -  Mrs. W. B Thomaii_who has to do g0 by the holder of said heen visiting here, has returned I deht. we wilL offer for sale at They are tee property of the widow -r . ......... i  ... .  i G C T ike Ntelinliii.a"}, "highlight": {"text": {"matched_tokens": ["E", "E"], "snippet": "R U S T <mark>E</mark> <mark>E</mark> S  S A"}}, "highlights": [{"field": "text", "matched_tokens": ["E", "E"], "snippet": "R U S T <mark>E</mark> <mark>E</mark> S  S A"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1711.91, 271.85, 2004.13, 746.75], "bbox_id": "c0217909c0", "file": "AppomattoxNewspapers_1962-1965a_0064.pdf", "page": 1, "text": "last Sunday Mrs. Ragland S t a p l e s and Children. Barbara. Kay and Wil son and Mrs. D. C. Paulette visited Mrs. L. M. Southall and Mrs. H. M. Robinson, Supday afternoon. Mrs Ernest F arrar visited Mr. and Mrs. W. C. Garertt, recently. A number from here attended M. night of Training Union at Liberty Church, Monday night. Mrs. C. J. Paulette is visiting Mrs Mary Southall, and Mrs. Elizabeth P. Robinson this week at Pamplin. Mr. and Mrs. W. G. Garrett visited Mr. and Mrs. Thomas week. Mi, and Mrs. Alvin Shaner, o f. -------- ---- Portsmouth, spent Monday and Paulette and fapuly at Phenix. Tuesday with Mr. and Mrs. Joe Sunday p.m.  Slough and family. Mrs. .Shaver Mr. Beverly Couch and som of is Mr. Sloughs sister. Mr. W. W. Richmond, visited Mr. and Mrs. Rowels, of Riversville, also visit ed in this same home last week. Mrs. Florry White and David Franklin visited their mother, Mrs. C. E. Franklin during the week end. Visitors in the home of Mrs. Bur Abbitt and Mrs. Addie Jen kins last week were Rev. Mar vin Jacobs, Mrs. Jessie Staples, Mrs. Mildred Alvis, Mr. and Mrs. North Robinson and T. E. Wood- son. Mrs. C. E. Franklin, Howard and Elmo Smith visited Mr. and Mrs. Roy Franklin and family, Sunday afternoon. Friends are sorry to hear of the death of Mr. Willard Woodall of Lynchburg. His wife is the former Miss Josephine Brown. We extend sympathy to the fami ly. We were gladto hear Mrs. Shatter Drinkard is home from the hospital. We hope she may soon be real well."}, "highlight": {"text": {"matched_tokens": ["e"], "snippet": "t a p l <mark>e</mark> s and Children. Barbara."}}, "highlights": [{"field": "text", "matched_tokens": ["e"], "snippet": "t a p l <mark>e</mark> s and Children. Barbara."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [425.51, 1342.79, 751.82, 1603.91], "bbox_id": "58329c7400", "file": "AppomattoxNewspapers_1926-1933a_0399.pdf", "page": 1, "text": "By authority vested in us by ! _,awrence Brown at Baptist Hos-1 deed of trust dated on the 28th pital in Lynchburg, and report day of November, 192?,,by Wiley f. ... ,  _   Mann and his wife, Verdie Mann, him as getting along nicely. JJfch deed is of record in the Misses Ruby and Edna Wool- clerks Office o f Appomattox dridge and Messrs. Willard and County in Book 27 at page 316, Jack Paulett were guests of Miss I default having been made in the Rachel Paulett. payment of the debt therein se tt mu . , _  cured and having been required Mrs. W. B. Thomas, who has I tQ  80 the holder of sai been visiting here, has returned debt we wjn offer for sale at to Lovingston, where her hus-1 public auction in front of Appo- band is a guard at the convict I mattox Court House, Va , on camp. Saturday, M arch 30th, 1929, Miss Elvira Martin of Lynch-1 at 11 A. M., the following de burg, was week-end guest of scribed real estate mentioned in her parents, Mr. and Mrs. L. B. of trust. , . , Martin All that certain tract of land raarun.  jyjng tw0 miles south of Appo mattox Court House, Va., in epw o rth league ISouthside District, adjoining J. Program for Sunday night led T. Cole, E. B. Thompson, and . T t m  others containing 34 acres, more by J. J. Tarrar. or less, together with the privi- Opening hymn  When the eges and appurtenances tnere-"}, "highlight": {"text": {"matched_tokens": ["Brown"], "snippet": "in us by ! _,awrence <mark>Brown</mark> at Baptist Hos-1 deed"}}, "highlights": [{"field": "text", "matched_tokens": ["Brown"], "snippet": "in us by ! _,awrence <mark>Brown</mark> at Baptist Hos-1 deed"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [825.61, 256.73, 984.62, 1166.32], "bbox_id": "a31d6616c6", "file": "AppomattoxNewspapers_1915-1918a_0425.pdf", "page": 1, "text": "536, Thomas Rosche vlaxey 548, Herbert Lee Moubry 126, Roy all A Brown 786, James Nicholas Wright 755, Cornelius Benj train Taylor 107, George Ernest Booker 616, Hubard Patterson 373, Roy Dew Heckler 775, James Vawter 486, Alfred Lee 692, Emmet Norwood Shores 600, Henry Perkins 810, Robert Washington 507, Guy Mc.Craw 309, El wood Gary 437, Arthur Preston Johnson 604, William Miller Payne 43, orris Andrews 420, Earty Warren Jamerson 514, George Washington Moss 433, Booker Johnson 10, Charlie Agee 487, Gordon Lewis 797, Charles Woodson 140, Edward Booker 432, William Henry Jones 18, Nick Allen 652, Arthur Edw id Rush 739, Gilliam Coy Smith 601, Luther W Patteson 606, William Horsley Perkins 182, Garrett Elwood Catlett 513, George William Moss 46, Alfred Austin 223, Enis Cunningham 117, Bee Brown 602, Willie Oscar Parson 390, Joseph Stuart Hughes 75, Augustine Lee Brooks 772, William Malcolm Trent 721, Frederick vpencer, jr. 786, Richard J White 280, Forrest Richard Etling 757, Thomas Tyree 333, Oscar Gough 379, James Walter Harris 542, James E Miller 194, Harsball Henning Coleman 552, Alexander Cobb Motley 298, Phillip Ford 675, Thearon fceay 343, Roy Willard Gary 726, Waverly Francis Snoddy 15, Furman Hill Agee 452, John Jackson 355, Thomas Ray Guthrie 530, Robert Lee McFadden 609, Gjorge William Wise 645, Massie Lee Ragland 218, French Call 620, William Leak Putney 550, Carson Jefferson Martin 574, John Weetley Newton 31, John Price Anderson 770, Preston Taylor 677, Edward Miller Sheppard 749, Tyler Turner 525, Hubard Mosley 760, Stewart Everett Thomas 183, John Alfred Call 56, William Madison Andrews 792, John Pierce Word Sidney Adcock ..50, Marion Agee Glover 54, David Edward Ayres 549, W ashington Muny 440, Albert Jones, jr. 741, Frank Shoemaker"}, "highlight": {"text": {"matched_tokens": ["Brown"], "snippet": "126, Roy all A <mark>Brown</mark> 786, James Nicholas Wright"}}, "highlights": [{"field": "text", "matched_tokens": ["Brown"], "snippet": "126, Roy all A <mark>Brown</mark> 786, James Nicholas Wright"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1306.29, 391.03, 1449.69, 806.37], "bbox_id": "913cb04198", "file": "AppomattoxNewspapers_1912-1915a_0338.pdf", "page": 1, "text": "vechten. a yourfs J oalph Van , .  to see a man enter I ouse across the street from  13Ain club, long unopcupied and  Pia.ae House of My.tejT. Sev- -W of  regular Intervals enter person vechten expresses concern fflj Tom Phlnney, regarding, the big friend.  t.jg COusin and fiancee. abouts of forcibly ejected n Caret. A yan Vechten and Tom  V bouse. vannecta dead l w the mW hten is attracted by the t. Vl, fS the crowd of onlookers , it a  ? boy Detective Flint onnd vL vVhten to get his version on VJLV Tom Phlnney goes alone e tragedy. H recognles among yachting trip-  e motor boat two ienonhJnhadseen enter the House a whom hLiiasees one of them, a Mr. I Xystery. later and follows him. Us. on, 5 blindfolded and taken to a 1 1 eldP.volced girl later protests ,je. irirtnei of his captors, imrt  S on his uncle. Theodore man In Wall street. , Vechten, n g ..jjan of Iron, In r r , information regarding the Jcbvf. Paige Carew. Detective bouts Sf   chten a gold mesh nt A m the House of Mystery. 5 ,t as belonging to Paige  sweet-voiced girl helps Tom rw. cane  A message from Lon- luney e two adles resembling - SKIS Ind her companion. Mrs.  c!w -ailed for New York some Jfoudy. 14 develops that the  the English home of -Tem- Jiownerofthe House of Mys- .it is recalled that Temple Bormer lAv, with a daughter of Compton married Max Willard. The toTehte? married a man named er daught r r and wlItarj were jn. rtSUJ. , A search Is started for Van Vechten enters the House rifratery by the back door In time to t John Callti threaten a girl. He ln- and helps the girl escape but Is -iSd unconscious in th struggle am Tom Phlnney gets a Job mMter of Brownlows yacht Kohinur, Sfhu been chartered for some mvs- J. mission The charterer. Max Wll it lnd Ws frtends board the yacht at -t Mi Tom hears the voice of the un- ii glrl. Willard assures Tom that ilsston is honorable, and .Intimates t a Seat wrong is about to be righted. . Ives orders that no one Is to leave i5ard the vacht without his permls- . With Willards consent Della goes jre to telephone, and returns to the ht In great agitation."}, "highlight": {"text": {"matched_tokens": ["e"], "snippet": "Tom Phlnney goes alone <mark>e</mark> tragedy. H recognles among"}}, "highlights": [{"field": "text", "matched_tokens": ["e"], "snippet": "Tom Phlnney goes alone <mark>e</mark> tragedy. H recognles among"}], "text_match": 1731669185798340729, "text_match_info": {"best_field_score": "1116664496128", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669185798340729", "tokens_matched": 3, "typo_prefix_score": 1}}
{"document": {"bbox": [1311.1, 448.05, 1462.75, 875.01], "bbox_id": "a7feb02556", "file": "AppomattoxNewspapers_1912-1915a_0342.pdf", "page": 1, "text": ", , van Vechten. a young m an of Ralph.astonished to see a man enter lagure. Is across the street from l0- 1313,hatanUclub. long unoccupied and fie H iu a e o f M ystery. Sev- gpoken of as tne ar ,ntervals enter 5  van Vechten expresses concern Jio. ?13- jr -rom Phlnney, regarding the to bta friend  m hlg cousn and fiancee, ighereabots of ,s torclbiy ejected palge Van Vechten and Tom from th h,Uo8nand find him dead in the toU  van Vchten is attracted by the gtreet. van  crowd o f onlookers to th eto d y . D etective F lin t rou1dly in Vechten to get his version calh on ___ of the tragedy- Tom Phlnney goes alone He recognizes am ong oi trin. He recognizes am ong on a yawing m p. motor boat two he h td s n enter the House Ben who h e jf e T o n e o f them , a M r. of Mystery- ater anj follow s him . Sized blindfolded and taken to a Toms i aweet-voieed girl later protests ?. h5 roughness of his captors.  vL.h ten calls on his uncle. Theodore W W S , ble man in W all street. S , is the  Man o f Iron. in o? Information regarding the wh iwSfta of Paige Carew . D etective  Van Vechten a , gold mesh I flint show  e House of Mystery   J S t e i it as belonging to Paige  r t , sweet-voiced girl helps Tom Soane. A m essage from Lon- ITreporte that two ladies resem bling S e w and her com panion. M rs. sailed for New York some ffw O Tioiw ly. It develops th at the visited the English home o f Tem - ff1 Bner, owner of the House o f M ys- S , It is recalled that Tem ple Bonner ISIn love with a daughter Of Compton K w h o married M ax W illard. The x y daughter married a. man nam ed. t S S mux Bonner and W llliard were ln- E rfrle n d s. A search is started for S r i Van Vechten enters the House Suvstery by the back door in tim e to hiar John Callls threaten a , girl. H e in- ftT S ld lh e lp s the  1 escape but is rendered unconscious in the struggle IritS Callls. Tom Phlnney gets a Job M master of Brownlows yacht K ohlnur, ihteh has been chartered for some m ys- ffius mission. The charterer. M ax W il- ETand his friends board the yacht at S t and Tom hears the voice of the un known girl. W illard assures Tom th at mission is honorable, and intim ates that a great wrong is about to be righted. H, elves orders that no one is to leave w lwari the yacht without his perm ls- iton. With W illards consent D elia goes uhore to telephone, and. returns to the raebt In great agitation. It develops th at Willard has recently invented a pow erful plosive. ____________"}, "highlight": {"text": {"matched_tokens": ["e"], "snippet": "fie H iu a <mark>e</mark> o f M ystery."}}, "highlights": [{"field": "text", "matched_tokens": ["e"], "snippet": "fie H iu a <mark>e</mark> o f M ystery."}], "text_match": 1731669185798340729, "text_match_info": {"best_field_score": "1116664496128", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669185798340729", "tokens_matched": 3, "typo_prefix_score": 1}}
