{"document": {"bbox": [626.4, 1119.32, 830.52, 1718.1], "bbox_id": "b6520467c7", "file": "AppomattoxNewspapers_1915-1918a_0189.pdf", "page": 1, "text": "Womens Missionary Society of liberty Baptist Church The Women Missionary Society of Liberty Baptist Church, or rather known first as the Ladie  Aid Society, was organized by Rev. Dr Henry W. Tribble in the year of his pastorate of this church, in 18 85. It was a small and feeble beginning but an earnest Christian spirit and effort tup ported the movement of this struggling band of Christian workers. Dr. Tribble even in vited the men to join the society so as to encourage and help the ladies in their Christian work Miss Sue Sears was elected president for several years, and she was active and efficient in the society, as in all other church work, wherever her consecrated life found work for the Heavenly Father Miss Sears best endeavors for His cause were always given I remember a few of the orig inal members Mrs. William H Gills, Mrs. William H. Abbitt Mrs. Joel Oawthorn, Mrs. T. A Caldwell, Mrs. C. W. Hancock Misses Sis OConner, Sis Ab bitt, and Lula Jones. This society met in the Amen corn er of the chnrch for years, after the regular monthly service on the 3rd Sunday of each month This society did much church work in individual ways, but rarely ever had any money, ex cept a few cents in the treasury. We tried lawn parties, lectures, oyster suppers, tableaux, etc. But rains, illness, or something seemed to break us up, minus of finances. If we raised fire or ten dollars a year for our society we thought we had done well, aa in those days ladies Ad minis- were not supposed to have any"}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "William H Gills, Mrs. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> Mrs. Joel Oawthorn, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "William H Gills, Mrs. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> Mrs. Joel Oawthorn, Mrs."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [612.23, 1346.36, 773.62, 1667.2], "bbox_id": "e9f2d138bb", "file": "AppomattoxNewspapers_1926-1933a_0186.pdf", "page": 1, "text": "Thomas Butler Pretlow born in Southampton Co. 63 years ago, Mother, Ann Elizabeth Butler, of Dinwiddie Co. Father, Hon, Joshua Pretlow, of Southampton Co. Mr. Pretlows father serve in congress before and during Civil War. Mr. Pretlow served during the Spanish American War. He came to this county 16 years ago. He married Miss Annie Abbitt daughter of the late Dr. William H. Abbitt and Sarah Frances Plunkett Abbitt. Survived by wife and two children, Sarah Frances Pretlow age 12,and Joshua Pretlow age9. Relatives who attended funeral from a distance were Miss Mary Denson Pretlow and Mrs. John D. Abbitt of Norfolk, Va., Mrs. C. W. Darden of Franklin, Va., and Mrs. William Woodley of New Ben, N. C. all sisters of the deceased. Mrs. Thomas N. White, Miss Fannie Pretlow, Messrs. J. A., R. J. and Barclay Pretlow all of Franklin, Va., Mrs. G. A. Coleman, Dr. and Mrs. J. B. Abbitt and Miss Edith Abbitt, Norfolk, Va."}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "of the late Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> and Sarah Frances Plunkett"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "of the late Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> and Sarah Frances Plunkett"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1561.91, 218.47, 1764.6, 325.67], "bbox_id": "22495206b7", "file": "AppomattoxNewspapers_1912-1915a_0245.pdf", "page": 1, "text": "P retlo w -A b b itt. A pretty wedding look place on town j Tuesday afternoon at 430 oclook at  8pring View, when Mias An- , nie- daughter of the late Dr. an  c h -l Mrs. William H. Abbitt, became the bride of Mr. Thomas Butler visiting I Pretlow, formerly of Southampton County. The house was beautifully"}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "c h -l Mrs. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark>, became the bride of"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "c h -l Mrs. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark>, became the bride of"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [521.75, 1340.22, 690.1, 1783.2], "bbox_id": "0aa1c0bc6f", "file": "AppomattoxNewspapers_1892-1898a_0415.pdf", "page": 1, "text": "monies, Miss Sarah Taylor raised the Confederate flag and Miss Emma Sniith the Union flag. The assem bly sung a hymn, prayer was of fered by Rev. Geo. B. Taylor, D. D, then came a recitation by Miss Alice Burke, during which the other lit tie girls strewed flowers on the graves of their honored dead. Then in patriotic and complimentary speech Senator Flood introduced the speaker of the day, Mr. W. A. WatsoD of- Nottaway, whose cultured and his torical oration was full of gems of thought. Closing the exercises was a recita tion by Master Charles Evant Hun ter, Appomattox the Ninth of April 1865. Mrs. M. L. Harvey, Mrs. Hubert Watts, Mrs. Author Lang- horue Powell and Mrs. Alexander Anderson were the guests of Mrs. J. R. Atwood and Mrs. C. W. Hunter invited a few of the Appomattox Daughters of the U. D. C. to meet the visiting ladies from Lynchburg in iier home that evening from 830 o clock until 11. Those present were Senators H. D. Flood aud W. A. Watson, Messrs. W. J. aud C. A. Trent, Madames J. O. Jones, J. R. Atwood, T. A. Smith, Mrs. M. L. Harvey, Alex. Anderson, Hubert Watts, A. T. Powell aud Miss Nina Jones and Sallie Burke, Light re freshments were served aud the guests entertained in a quiet, unos tentatious way by the hospitable hostess hi deference to the sad death of her friend aud neighbor, Mrs. Dr. William H. Abbitt."}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "aud neighbor, Mrs. Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "aud neighbor, Mrs. Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark>."}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [609.61, 1445.05, 770.54, 1645.15], "bbox_id": "5ed7585c75", "file": "AppomattoxNewspapers_1908-1909a_0186.pdf", "page": 1, "text": "daughter of the late Dr. William H. Abbitt and Sarah Frances Plunkett Abbitt --   Survived by wife and two children, Sarah Frances Pretlow age 12 ,and Joshua Pretlow age9 Relatives who attended funeral from a distance were Miss Mary Denson Pretlow and Mrs, John D. Abbitt of Norfolk, Va., Mrs. C. W. Darden of Franklin, Va., and Mrs. William Woodley of New Ben, N. C. all sisters of the deceased. Mrs. Thomas N. White, Miss Fannie Pretlow, Messrs. J. A., R. J. and Barclay Pretlow all of Franklin, Va. Mrs. G. A. Coleman, Dr. and Mrs. J.  A b b itt and Miss Edith Abbitt, Norfolk, Va,"}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "of the late Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> and Sarah Frances Plunkett"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "of the late Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> and Sarah Frances Plunkett"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1516.09, 1165.53, 1680.21, 1690.15], "bbox_id": "82bfd498a8", "file": "AppomattoxNewspapers_1922-1923a_0526.pdf", "page": 1, "text": "D r. W . H . A b b itt Dead. On Tuesday morning, September 10th, Dr. William H. Abbitt passed uwey at his home near here, in the presence of the members of his fam- v. The deceased had been in fe ble heal h for many months and his family could only hope for a day at a time. He was in the 76h ear of his age and his busy life hud been ent among the people of this county, who loved and admired birri. He vas a good physician, kind andsympatheic, .did much sorrow is carried to onr homes by the sad announcement if his death. He is survived by a large family of children who have the sympathy of our people in their bereavement. The children have been watching his condition closely for months, and were fully prepared for the fi nal -summons. His funeral took place from his residence and the interment was made at Liberty cemetery Wednes day evening. Revs. Hnbard, Mur phy and Winn conducting the ser vice. A very large crowd of his old friends and relatives a sembled arouud his grave and the tear- stained eyes and bowed heads told the story of a departed friend. Dr Abbitt was a consistent member of the Baptist church, and gave much of his time to the service of his Master. He was a man of strong convictions, with all be possessed a kind, charitable heart and loved the clean and despised the unclean things of life. We .hall cherish his memory and a life o well spent will not soop be forgotten."}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "morning, September 10th, Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> passed uwey at his"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "morning, September 10th, Dr. <mark>William</mark> <mark>H</mark>. <mark>Abbitt</mark> passed uwey at his"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [922.81, 193.2, 1067.64, 255.3], "bbox_id": "3bd440da6e", "file": "TimesVirginian_1981a_0198.pdf", "page": 1, "text": "below, they are Hon. George F. Abbitt, Jr., Appomattox Watkins. M. Abbitt,. Appomat tox William H. Baker, Jr., Richmond Hon. W. Francis Binford, Prince George Char"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "Abbitt", "William", "H"], "snippet": "below, they are Hon. George F. <mark>Abbitt</mark>, Jr., Appomattox Watkins. M. <mark>Abbitt</mark>,. Appomat tox <mark>William</mark> <mark>H</mark>. Baker, Jr., Richmond Hon. W. Francis Binford, Prince George Char"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "Abbitt", "William", "H"], "snippet": "below, they are Hon. George F. <mark>Abbitt</mark>, Jr., Appomattox Watkins. M. <mark>Abbitt</mark>,. Appomat tox <mark>William</mark> <mark>H</mark>. Baker, Jr., Richmond Hon. W. Francis Binford, Prince George Char"}], "text_match": 1736172819248578681, "text_match_info": {"best_field_score": "3315704266752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819248578681", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [657.33, 1097.94, 2533.68, 1314.43], "bbox_id": "be40caab0e", "file": "AppomattoxNewspapers_1908-1909a_0540.pdf", "page": 1, "text": "WE CLOTHE THE FEET COMPLETE Parker  Horsley of Bent Creek, died July 21. Burial services were conducted by V. S. Reed of the Y. M- C. A. There will be a big circus-in town Saturday. Dr. W. H- Abbitt improves. His son, Rev. William Abbitt, of Kentucky, is visiting him Master Braxton Hancock enr tertained a number of his lit- friends in the celebration of his birthday last Tuesday. Mrs- Sallie Blackwell, wife of Allen O. Blackwell, died at her home yesterday afternoon. The deceased was formerly Miss Godsey, of Appomattox County.  Graham"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt", "William", "Abbitt"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- <mark>Abbitt</mark> improves. His son, Rev. <mark>William</mark> <mark>Abbitt</mark>, of Kentucky, is"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt", "William", "Abbitt"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- <mark>Abbitt</mark> improves. His son, Rev. <mark>William</mark> <mark>Abbitt</mark>, of Kentucky, is"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.44, 1079.55, 821.18, 1673.27], "bbox_id": "f1bd1656d8", "file": "AppomattoxNewspapers_1926-1933a_0540.pdf", "page": 1, "text": "IN THE APPOMATTOX  BUCKINGHAM TIMES August 1, 1906 Parker, Horsley of Bent Creek, died July 21. Buria services were conducted by V S. Reed of the Y. M. C. A. There will be a big circus-in town Saturday. Dr. W. H- Abbitt improves His son, Rev. William Abbitt of Kentucky, is visiting him. Master Braxton Hancock en tertained a number of his lit friends in the celebration of his birthday last Tuesday. Mrs. Sallie Blackwell, wife of Allen O. Blackwell, died at her home yesterday afternoon The deceased was formerly Miss Godsey, of Appomattox County. Sam Thornton of Graham was the guest of his sister, Mrs B- T. Gunter, of Evergreen, last week. Miss Bessie Thornhill of Lynchburg is a guest of Miss Fannie Clement. Lightning struck an old oak tree about forty years old in the yard of Mrs. Hubbard Mar tin and tore it to pieces last Friday evening.  Bob Davis, Squire Womack, and Wells Chittenden of Pamp- lin were in the village Monday on business. I Robert Oder has been visit ing in the county for several days. He haspurchased a nice farm here and will, we hope, again make his home among us. A concert will be given in Smiths Hall next Friday night for the benefit of the Metho dist sidwalk fund. Misses Ethel Calhoun a n d Lucy Gills are visiting in Lynch burg. mss Brown, of Crewe is a guest ot Miss Rosa Paris. --------------- 0 ---------------"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt", "William", "Abbitt"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- <mark>Abbitt</mark> improves His son, Rev. <mark>William</mark> <mark>Abbitt</mark> of Kentucky, is"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt", "William", "Abbitt"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- <mark>Abbitt</mark> improves His son, Rev. <mark>William</mark> <mark>Abbitt</mark> of Kentucky, is"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2284.81, 690.64, 2452.54, 779.84], "bbox_id": "ef448ec110", "file": "AppomattoxNewspapers_1952-1954a_0504.pdf", "page": 1, "text": "Friday night, Feib. 19, at 730. Speakers will include Dr. F. H. Lukin, Dr. William Pugh, Georg Abbitt and others. Everyone is invited to come an4 get acquainted with the new doctor and welcome him to the commun ity. The occasion is being sponsor ed by the Ruritan Club of Pamplin."}, "highlight": {"text": {"matched_tokens": ["H", "William", "Abbitt"], "snippet": "will include Dr. F. <mark>H</mark>. Lukin, Dr. <mark>William</mark> Pugh, Georg <mark>Abbitt</mark> and others. Everyone is"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William", "Abbitt"], "snippet": "will include Dr. F. <mark>H</mark>. Lukin, Dr. <mark>William</mark> Pugh, Georg <mark>Abbitt</mark> and others. Everyone is"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [792.23, 795.93, 953.59, 891.83], "bbox_id": "d2616af33b", "file": "AppomattoxNewspapers_1892-1898a_0030.pdf", "page": 1, "text": "Mr. C. H. Sackett, of Lynchburg, wa in attendance at court yesterday. Mr. E. C. Wooldridige, of Buckingham, attended court yesterday, Drs. Abbitt performed an operation on Mr. William H. Williamson Saturday night. He is said to be improving. Mr. R. H. Bell has moved to Lynch burg. Mr. George Singleton was married to Miss Laura Gilliam Wednesday, Dec."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William", "H"], "snippet": "attended court yesterday, Drs. <mark>Abbitt</mark> performed an operation on Mr. <mark>William</mark> <mark>H</mark>. Williamson Saturday night. He"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William", "H"], "snippet": "attended court yesterday, Drs. <mark>Abbitt</mark> performed an operation on Mr. <mark>William</mark> <mark>H</mark>. Williamson Saturday night. He"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [474.7, 492.89, 647.32, 628.89], "bbox_id": "4e92ec8dd3", "file": "AppomattoxNewspapers_1939-1943a_0527.pdf", "page": 1, "text": "Mr. and Mrs. C. D. Staples and I daughter. Priscilla Ann. of Rich mond were guests of Mrs. James B. Abbit over the week-end. I O. R. Rutledge, who is working j in Newport News was home Sunday. Judge J. W. Flood spent last week sora hunting in King William Coun- 1 ty. W. M. Abbitt and C. H. Swing j spent several days last week there. Miss Colyer Smith spent Monday with her parents, Mr. and Mrs. J. A. Smith."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt", "H"], "snippet": "sora hunting in King <mark>William</mark> Coun- 1 ty. W. M. <mark>Abbitt</mark> and C. <mark>H</mark>. Swing j spent several"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt", "H"], "snippet": "sora hunting in King <mark>William</mark> Coun- 1 ty. W. M. <mark>Abbitt</mark> and C. <mark>H</mark>. Swing j spent several"}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1840.31, 500.69, 2011.06, 900.23], "bbox_id": "955eee7e4e", "file": "AppomattoxNewspapers_1952-1954a_0203.pdf", "page": 1, "text": "Funeral services for Miss May Burke, for many years a puty treasurer of Appomattox County, were held at 2 30 P. M. Tuesday afternoon at the Liberty- Baptist Church, with interment in the Church Cemetery. Services were conducted by the Rev. W. M. Thompson and the Rev. Edgar S. Price. Miss Burke died Sunday in a Lynchburg Hospital. For a number of years, she had been chairman of the Appomattox Chapter, American Red Cross. She was past president of the County Chapter of the Daughters of the Confederacy, member of the D. A R., organizer of the Young DemO cratic Club of Appomattox Coun ty, organizer of the first Girl Scout Troop in the county, instrumental In organizing and conducting health clinics, including T. B. and Crippled Childrens clinics. Surviving are three brothers, K L. and J. A. Burke, both of Appo mattox and William H. Burke, of Floyd two sisters, Mrs. James B Abbitt and Mrs. W. T. Steele, both of Appomattox, and a number of neiees and nephews. _ Active pallbearers were Dr. C. U OBrien, Dr. C. F. James, C. K Hunter, Dr.. H. Y. Spencer, H. C, Pulliam, Judge Joel W. Flood, C W. Smith and R. B. Hudgins."}, "highlight": {"text": {"matched_tokens": ["William", "H", "Abbitt"], "snippet": "of Appo mattox and <mark>William</mark> <mark>H</mark>. Burke, of Floyd two sisters, Mrs. James B <mark>Abbitt</mark> and Mrs. W. T."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Abbitt"], "snippet": "of Appo mattox and <mark>William</mark> <mark>H</mark>. Burke, of Floyd two sisters, Mrs. James B <mark>Abbitt</mark> and Mrs. W. T."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1056.0, 993.73, 2503.69, 1362.28], "bbox_id": "b3f3a3be31", "file": "AppomattoxNewspapers_1933-1936a_0373.pdf", "page": 1, "text": "coraatithe Miss Clarifie Evan has returned to her work i-n Lynchburg read rhe 23rd. Psalm, ft par of the 14th. chapter of St. John and Tennysons  Crossing The Bftr. The choir sang softly Safe in tkft arms of Jesus and Jesus, Lovey of my Soul. Also there was a epeelal Masonic service, which was held In 4he fehdrch on aeeountt! pi ! the rain. .This service waa jeeitdneted by the Reedy Springs and Lynch burg Masonic lodges. Burial was h the Hunger cemetery. I Active pallbearers weia 1  e nephews J.W. Hunter, Colesnaa Hunter, Abbitt  Marehall, Glover Joneh, John .Marshall, WHHam Marshall, Ben Harvey and William Abbiti Coleman. Honorary pallbopr ers, als0 serving os flower hear were Howard Marehall, . m . Marshall, INathan Marshall, Travis Cardwell, D .T . Thompeen, F. Chick Jllliott Cheatham, Oma Jones, O. F. Chea.ham, Jesaia Dickerson, A. H. Howerten, B .J t Cheatham, Odell Howerten, B .M . Harris and Dr. T . B . Hunter. Relatives attending from a dist ance were Mrs, I .D . Hunter, J W Hunter, Coleman Hunter. Misses Willie, Malrie and Mary Hunter, Mrs. D. H. Marshall, 4bbt Marshall, Misses Elizabeth _and Bettie Marshall, William Abbitt Coleman, of Richmond Mr. and Mrs William Marshall, of Roanoke and Mr. and Mrs, Elliq.t Cheatham of Crewe. The floral designs wera many and beautiful."}, "highlight": {"text": {"matched_tokens": ["H", "William", "Abbitt"], "snippet": "Mary Hunter, Mrs. D. <mark>H</mark>. Marshall, 4bbt Marshall, Misses Elizabeth _and Bettie Marshall, <mark>William</mark> <mark>Abbitt</mark> Coleman, of Richmond Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William", "Abbitt"], "snippet": "Mary Hunter, Mrs. D. <mark>H</mark>. Marshall, 4bbt Marshall, Misses Elizabeth _and Bettie Marshall, <mark>William</mark> <mark>Abbitt</mark> Coleman, of Richmond Mr."}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1598.16, 1110.5, 1927.06, 1507.16], "bbox_id": "62826a3807", "file": "AppomattoxNewspapers_1905-1912a_0577.pdf", "page": 1, "text": "to for .u  .c n ly feMher.rf ib. tat. Dr. William Abbitt, of this county. o Bix r o o m g , two tobacco Ool. Abbitt bore his snffering nobly, I barns, corn house, 126 fruit and as was his enstom in charge of I trees. The timber on the place the Brigade to exercise bravery and I wor 1200. EaBy terms. true manhood, so he met death in 1 Uo. 211 240 acres  1500 similar manner. He was a trnel This tract of land lies in Boldier, splendid citizen and a chris-1 Buckingham county twelve tian gentl man. Intermeut Thurs-1 miles from railroad depot. It day afternoon at his home when all I8  very good farm. 100 acres v,,.  t , w w. I of it in pasture and cultivation his fam.ly 18 exPected. Rev. M r . l j acre8 in timber from Hicks will conduct the service. I the size of railroad ties down, .........  , principally oak. The farm is Lawn Party at Red Oak I not rough, though gently roll- Red Oak Baptist Ghuich will give! ing. 150 fruit trees in bearing, -a lawn party at Oakville on the!AH of the orchard is under a afternoon and evening of Saturday, fnce Vaxm iB fairly well r  , , , .Ifen ced , l i miles to good mill, June 29th, for the benefit of the L  to chutch a d 8chool new chureh building. The public I Farm machinery may be used is cordially invited.  on all of the farm except about 25 acres. Buildings consist of TRUSSESDuring the monthrsien of June we will sell all high grade Btonp elastic and spring trasses at a reduc- Porches There are tw otabac- ------ - - -enir nrice I co barns in good condition. e 6-5-3t I Stable with good shed. A frame granary weatherboarded and ceiled 18x20 shingle roof, Buster Black, the well-known I Smoke house and corn crib, handsome Hackney Stallion, will I Also one two-room tenant make the season at Oakleigh Farms, I Rouse. Fine spring 100 yards in chargs of D. H. Littell. Phone fFOm house. Numerous springs Appomattox 8-B. 5-15-8t and branches run through this farm. This is regarded as a"}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "feMher.rf ib. tat. Dr. <mark>William</mark> <mark>Abbitt</mark>, of this county. o"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "feMher.rf ib. tat. Dr. <mark>William</mark> <mark>Abbitt</mark>, of this county. o"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2013.06, 461.47, 2182.16, 1646.76], "bbox_id": "c5f051c19a", "file": "AppomattoxNewspapers_1898-1902a_0718.pdf", "page": 1, "text": "The luvel Indian summer weath er continues, aud some are growing skeptical as to whether we are going to have auy winter, but it wjll swoop down upon us before long, aud will catch tome of us napping, especially as regards onr woodpiles. The sound of the sportsmans gun is heard on all sides, and we fear there will not be even an old rabbit left. Ur. Nathan Woohidge killed this week, near Forest church, a line wild turkey.- It is reported that a large bear has been doing considerable dumage in the Chapel neighborhood tlmi it killed five of Mr. Willie Hurvejs sheep, ate 27 ears of Mr. J. T. Caw thorns corn, aud committed Hunter- our other depredations. The prayer meeting at Forest on Wednesday night was well attended, Dr. Win. H. Abbitt conducting the services. There Was a large crowd at Wes ley Chapel on Bund,av to hear Mr. Dunkley preach what was feared IQ be his furewell sermon. The ser mon was very tin,-, and much regti-i is expressed at toe probability of I.is not returning to this circuit, as lie is much beloved in this neighbor hood. Mr. and Mrs. Clias. Goilsey have gone to ttoanoke to be with tlnir son, who was injured in the miiway yard. They lisd-a sou killed on the railroad a few years ago, and much sympathy is expressed for them iu their pres tit sorrow. Mr. Chap Simms ha a serious look on his usually smiling face. It is uot very hard to guess the cause. Messrs. George, Sam. and little Fat. Golem mo had a jolly time on Tuesday evening last as the guests of Mr. Ellis Oder. Mr. Robt. Woolrjds moved with lis family to your vill ge on Wed nesday. He is a good furmer and a kiud neighbor, and will be much missed fruni his neighb- rhood. Mr. Ellis Simms, of Roanoke, last eek visited friends ml relatives in this neighborhood. Miss Vasli. Duvis this week vi.-it- her sister, Mrs. Nathan Wool- ridge. Mr. William Marshall, near Reedy Bpring, and Mr. Charlie Thornhill, of Tower Hili, were this week the guests of Sheriff S. F. Coleman. Mr. Jos. Bell, of Irince Kdwurd, last week speut seven I days at Mr. George Colemans. Early Maun, the thirt eir-year-old son of Mr. William Maun, last week lost iu Lynchburg 49 that he bail received fur his tobacco. Mr. G. A. Coleman, whose death occurred in Baltimore on Tuesday last, had many lelatives aud friends in this neighborhood, whose hearts were made sad by the announce ment. Mr. Colemans career was a noble illustration of what a young man can make of bis life when he obeys the teaching of the Bible Seek ye first the kingdom of tiod and His righteousness. We re member bearing his grandmother say that, when he first went to live in Lynchburg, she wrote to him waVuing him against the temptations of a city life. His reply was  I aui kept very busy, but I take time to read the Bible aud the Religious Herald. Hont you think they wi keep me straight? The grim reaper, death has been Very busy iu the Coleman family fo the past few years, cutting down its brighten aud best. In almost every home iu its large family couuectio there is at least  oue vacant chair, and there are many who very ofte sigh, in vain"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "well attended, Dr. Win. <mark>H</mark>. <mark>Abbitt</mark> conducting the services. There"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "well attended, Dr. Win. <mark>H</mark>. <mark>Abbitt</mark> conducting the services. There"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1798.3, 1427.06, 2277.45, 1547.03], "bbox_id": "6571bd7161", "file": "AppomattoxNewspapers_1915-1918a_0131.pdf", "page": 1, "text": "t h e extraordinary . enaraoter of professional visit in the home tbe Ainu, will be of npreme inter-1 Q sister, Mrs. Haskins, on , No othr newspaper will inform rtfttlirdav laBt est. yon w ith the promptiie and cheap 1 S a tu rd a y la st, ness o t the Thr.oe--wek _____ ______ editi un M r s . Rom a G arnett cam e up HUhnre  of the New York World.  to see her grandmother, Mrs. mxoiiTK. i Tbjj Thnce a-Week Worlds! Noble ing back tl Arvonia Mr. William Abbitt Jenkins, of J regular subscription price is J  aturdav. and she bad litle Kansas, was a visitor to his folks! 1.00 per year,an t is pays o r ------- ---------------k-  1  n l relatives in this connty last  togetherfor one vear for 1,6."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "back tl Arvonia Mr. <mark>William</mark> <mark>Abbitt</mark> Jenkins, of J regular"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "back tl Arvonia Mr. <mark>William</mark> <mark>Abbitt</mark> Jenkins, of J regular"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "formed under Capt. Wm. <mark>H</mark>. <mark>Abbitt</mark>, and quite a number"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "formed under Capt. Wm. <mark>H</mark>. <mark>Abbitt</mark>, and quite a number"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2273.3, 572.31, 2455.97, 1727.39], "bbox_id": "bb728460dc", "file": "AppomattoxNewspapers_1943-1947a_0327.pdf", "page": 1, "text": "ported to the board after having discharges. Employers are urged to consider the veterans first when they have jobs to offer. The follow ing veterans have received reports of separation from the service. Anyone wishing to contact a vet eran, s e the Reemployment Com- mitteeman of Local Board No l R. B. Hudgins. It is the responsi bility of the community to assist the veteran by offering them jobs when they are available. William R. Harding Travis R. Martin Robert N. Patrick Rueben C. Johnson Melvin C. Arrington James M. Guill Edward L. Mayberry Scott H. Hubbard George H. Thompson Curtis L. Mitchell William A. Jones Robert C. Hubbard George W. DanieT Thomas P.. Almond Clarence. A. -Perdieu Thomas.. Jennings- Conner John J. Sears John W. Crews Mohie J. Carter Herbert H. Moore, Jr ihornton H. Marshall Tom H. Ferguson Randolph N. Jones George M. Blanks Ray D. Lewis Wesley O. Jarrell Alfred E. Marsh 4 Paulette Eames Thelbert M. Trent Charles H. Phelps Frederick Dickerson . John E. Eagle Thomas H. Dickerson Newton O. Williams Joseph W. Price John -Hi M-orga ------  Percy E. Guthrie . John P. Jones  Henry A. Perdieu Charles W. Martin Clifford. W. Childress Charlie E. Marshall Floyd Bingham 4 Jessie J. Grubbs John Miller Berkley H. Guill Charlie C. Ranson William E. Godsey Boyd C. Ranson Ollie R. Hammock Berkley D. Garrett ,. Kermit C. Paulette Ryland W. Staples Francis E. Hamilton William Rouse Mann Harry Reynolds. James E. Mason Henry H Beal a Dwight M. Pauletjjg, Horace A. Reid  Berkley S. Carter Clayton A. Harris Thomas E. Walker James E. Harvey William D. Patterson Richard H. Gowin Carlton Chilton Bernard D. Nuckols Clarence E. Wilkerson Ellsworth P. Carter Robert Lee McCormick John Sam Harvey David E. Baldwin Edward J. Gibson Harry L. Cumby Jennings W. Conner Warren C. Barlow Clarence G. Doss John Patterson Marshall, Jr, Richard George Janatka Irving W. Bushey James R. Coleman Marvin A. Herncall Martin L. Webb Will D. Cunningham Lawrence T. Nash, Sr. McKinley Tibbs Guthrie E. Gilliam Lincoln R. Martin Herman Walk,er John Randolph Holycross Warren Garland Crews Wilmer Lathan Harvey Henry Junius Abbitt William B. McCormick Calvin C. McCormick John W. Hamilton Edwin T. Paulette Richard C. Blankenship Osborne Jones Jerome J. Johnson Howard Penloy, Jr. Hubert A. Gurney Stafford L. Doss Robert L. Jackson Regain, Cyder    Harry W. Jarrell Ralph E. Harris John J. Spiggle Charlie W. Bryant."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "Lathan Harvey Henry Junius <mark>Abbitt</mark> <mark>William</mark> B. McCormick Calvin C."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "Lathan Harvey Henry Junius <mark>Abbitt</mark> <mark>William</mark> B. McCormick Calvin C."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1576.1, 392.32, 1745.5, 953.57], "bbox_id": "30f1f619d7", "file": "AppomattoxNewspapers_1892-1898a_0034.pdf", "page": 1, "text": "Jfewsy Botes of Interest to Appomsx ians. Mr. R. A. T. Clement, of Campbell county, was to re taai. week on bnsinesa, and says he expects to be a candidate for clerk of the circuit court of his county, Hon. H. D. Flood attended the ban- J net held in Richmond on the 25th of auuary.  Our old friend Bunk Abbitt was here last week visiting friends and relatives. W ith a bottle of Ayers Cherry Pectoral in the house, you have an effective remedy for ail sudden attacks ot throat nun luug trouble. An hours delay may lead to rerions consequence. No house hold should be without this wonderiul medicine. Mr. W. W. Statham, who ba been in Lyuohburg under ui-.dical treatm ent for a . louff while, spout the day cere on the 28th luteut.  We regret ihe vad duty of having to chronicle the death of Mr. William. W. Wright, bo died Sunday the 29th. A sketch of his Ufe a ill be given iu our next issue. Commissioner L. E. Smith has com menced taking the list of property iu this county. H. E. Gilliam was to re on the 28th in stant. W. -D. Thornton passed through town last week on the train. Capt . Wm. H annah died on the 26th of January. Mr. W. C. Franklin was in town Wed nesday. Dr. W, H. Abbitt was in Lynohburg Tuesday on business. A grand jury will be empanelled at the. February term of the county court. M r B. T. Rossers mill, located seven miles sooth of Pampliu Oity, 1 neariug completion. Dr. Wiustou, of Farmville, was In the village Wea today. W. S. Peet, of Concord, was here Satur day, survey iug some town lots. If, when orossing a railroad track, you ree a train approaching a t thirty unles an hourget Gut of the way as soon as possible. When threatened with chrome rheumatism or vaiari h, take Ayre s Sar saparilla pers.stently aud.hatlrutly, and the danger will soon pass away. Mr. G. W. Gilliam s tore, painting the storouonse of W. A. Moses S Co. Any one desirous of having any paiutiug doue would do well to see Mr. Giliiaiu before bargaining w ith auy one else. Col. R. B. Poore left here Wednesday -for Roauoaej where he was called cu busiutss. The schedule of the Norfolk and West ern road will appear in our next issue."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "Wed nesday. Dr. W, <mark>H</mark>. <mark>Abbitt</mark> was in Lynohburg Tuesday"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "Wed nesday. Dr. W, <mark>H</mark>. <mark>Abbitt</mark> was in Lynohburg Tuesday"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [723.15, 721.48, 923.89, 1354.01], "bbox_id": "c141d442d4", "file": "AppomattoxNewspapers_1922-1923a_0007.pdf", "page": 1, "text": "J o liu L. A b b itt A i.uuden attack of heart rouble cauted the death Thurs day night at 730 oclock, of John D. A bbiit, for several years prom inent in Norfolx jusiness circles Death occur red at his home, 521 Raleigh .venue. He was 57 years o i l Mr. A bbitt was born in Ap pom attox county. When he was a young man he moved to Southam pton county, where he lived until five years ago. For several years he was president of the M erchants aud Farm ers Bank of Franklin. While there he m arried Miss Aunie Preslow of Southam pton county, a sie ter of Miss Mary Denson Pret low, Norfolk city librarian. Five years ago Mr. A bbitt came to Norfolk to be president of the M ercantile bank, which later became the B ankers Trust Company. He _retired from business two years later on account of ilines?., but re ceutly his health improved to such an extent th at he entered the insurance business as dis trict m anager of the Reserve Loan Life Insurance Company and special m anager of the Standard Accident Insurance Company of Detroit. Mr. Abbitt is survivtd by his wife, and also by four children ilisses Edith and Eng .both A bbitt, John i !. A biitc, J r , and William Henry Abbitt. He was a m em ber of the First Bap 1 glorious tist church, Mr. Abbitt s also survived by three brothers aud two sistersRev. Chapman A bbiit, of Hopkinsville, Ky  Dr. Jam es B, Abbitt and Mrs Eleanor E. R. A bbitt and Rretlo w, of Appom was the a n of the late Dr. and VIrs. VV. H Abbitt, of Appo cnattox."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "Dr. and VIrs. VV. <mark>H</mark> <mark>Abbitt</mark>, of Appo cnattox."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "Dr. and VIrs. VV. <mark>H</mark> <mark>Abbitt</mark>, of Appo cnattox."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H", "H"], "snippet": "through W Drs. W.H. <mark>Abbitt</mark> <mark>H</mark>. C. Babcock, E. <mark>H</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H", "H"], "snippet": "through W Drs. W.H. <mark>Abbitt</mark> <mark>H</mark>. C. Babcock, E. <mark>H</mark>."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [453.31, 1259.65, 612.43, 1549.29], "bbox_id": "939f58b956", "file": "AppomattoxNewspapers_1922-1923a_0032.pdf", "page": 1, "text": "H onor B oll, V era H ig h School N inth GradeO tys Childers, Isabelle OBrien. E ighth GradeVivian Clark. Seventh GradeVara Morris, Phebe OBrien,Richard Jenkins Judy Ferguson, Verna Morris, Georgia Fobble. Sixth GradeH atie Morris. F ifth G rade- Herman Bryant Fourth GradeW illie Morris, Dora Abbitt, William OBrien Third GradeDella Carter, E unice M cNalley, Martha Rosepcham , Grover Childers. W illiam Carter, Conner Fergu son, W illis Eerlin. Second Grade  Albert OBrien, Mary Kannegan, Gor don Sandford, Alfred Garrett F irst Gtade David David Carter, Clarence Gobble, Mat tison Sandford, Richard Sand ford, Ernest Carter."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "GradeW illie Morris, Dora <mark>Abbitt</mark>, <mark>William</mark> OBrien Third GradeDella Carter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "GradeW illie Morris, Dora <mark>Abbitt</mark>, <mark>William</mark> OBrien Third GradeDella Carter,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [437.74, 396.89, 631.95, 1826.81], "bbox_id": "1551f2496e", "file": "AppomattoxNewspapers_1954-1955a_0099.pdf", "page": 1, "text": "By order of the Electoral Board of Appomattox County, Virginia, all Registration Books in Clover Hill District shall be purged as of Octo ber 4, 1954. The names listed below have been removed from the Regis tration Books, Clover Hill Precinct Clover Hill District, Appomattox Co., Virginia. This action is provided for and ordered under Sections 24- 94 through 24-107 of the Virginia Election Laws as amended. Anyone who can prove conclusive ly that any of the names listed be low have a right to be on the Regis tration Books of said county and dis trict, they shall make such informa tion available to the undersigned Registrar. A. W. COVINGTON Registrar Clover Hill Precinct.  111  Almond, George H. Transferred. Abbitt, R. D. Dead. Agee, F. L. Dead. Almond, C. D. Dead. Almond, N. B. Dead. Almond, Lucy K. Transferred. Abbitt, R. W. Dead. Almond, R. M. Dead. Abbitt, G. R. Transferred. Abbitt, R. O. Transferred. Almond, R. W. Tranferred to C. H. Abbitt, A. B. Dead Almond, H. C. Transferred to C. H. Almond, G. H. Transferred to C. H. Almond, Mrs. Williamina. Dead. Ayers, A. Malcom. Dead. Abbitt, George F. Jr. Transferred to C. H. Ayers, John C. Transferred to C. H. Abbitt, Herbert M. Transferred to Richmond. Banton, W. D. Dead. Browning, R. H. Dead. Bryant, D. C. Dead. Barlow, W. S. Dead. Beasley, C. W. Dead. Bingham, John R. Dead. Bagby, John H. Dead. Beasley, A. C. Dead. Baber, R. H. Dead. Browning, Aubrey. Dead. Bryant, J. M. Dead. Bryant, W. L. Transferred to Char lotte. Bingham, J. A. Transferred to C. H Babcock, Frank E. Dead. Bryant, Thos. E. Dead. Beasley, James R. Dead. Bingham, E. J. Transferred to C. H Bagby, H. C. Transferred to Lynch burg. Browning, Mrs. Emma. Dead. Babcock, Mrs. Lottie. Transferred tc C. H. Bass, W. C. Transferred to Oakville Bingham, Mrs. Mary S. Transferred to C. H. Bryant, Hal. Transferred to C. H. Babcock, Mary I. Transferred to C H. Burnett, Rev. E. F. Dead. Burnett, Rev. O. G. Transferred to Halifax. Babcock, T. H. Dead. Bagby, Mrs. Emmaline. Dead. Bohannon, A. A. Transferred to C. H. Burks, R. F. Transferred to Lynch burg. Burks, R. L. Dead. Brown, Rev. L. P. Transferred to C. H. Brown, Mrs. L. P. Transferred to C. H. Bingham, William A. Dead. Buckhanon, G. B. Transferred to C. H. Buckhanon, Mrs. Rosa J. Transfer red to C. H. Carter, J. A. Dead. Carter, Willie. Dead. Carter, Moby. Dead. Carter, Eddie. Dead. Cawthorn, S. D. Dead. Conner, Mrs. Lucy. Dead. Covington, Mrs. Annie. Dead. Carwile, E. B. Transferred to C. H Carwile, S. H. Dead. Connor, Mrs. Louise W. Transferred to C. H. Connor, Mrs. Sallie B. Dead. Cumby, C. M. Dead. Carwile, Mrs. Alice. Dead. Carwile, Sam T. Transferred to C H. Covington, W. J. Sr. Dead. Carter, W. D. Transferred to C. H Chambers, J. L. Dead. Covington, Lily A. Dead. Covington, Mrs. Helen. Transferred to Vinton. Carter, Mr. Warner. Dead. Covington, Thos. F. Dead. Covington, W. J. Jr. Dead. Connor, Thos. U. Dead. Cawthorn, S. W. Dead. Connor, D A. Transferred to C. H. Cawthorn, F. T. Dead. Cawthorn, S. P. Transferred to Lynchburg. Covington, Frank E. Transferred to Lynchburg. Carter, Mrs. Peggy. Dead. Coleman, George. Dead. . Connor, Walter. Transferred to C. H. Carter, R. L. Transferred to C. H. Carter, Mrs. Mildred W. Transferred to Buckingham. Cawthorn, Mrs. Mary E. Transferred to C. H. Carwile, Arthur. Transferred to C. H. Connor, L. E. Transferred to C. H. Covington, E. A. Transferred to Walkers Church. Covington, Mrs. Annie. Transferred Walkers Church. Carter, Berkley. Transferred to C. H. Cawthorn, R. W. Transferred to C. H."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "W. Tranferred to C. <mark>H</mark>. <mark>Abbitt</mark>, A. B. Dead Almond,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "W. Tranferred to C. <mark>H</mark>. <mark>Abbitt</mark>, A. B. Dead Almond,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2014.54, 1635.82, 2174.24, 1784.82], "bbox_id": "fc2529c2aa", "file": "AppomattoxNewspapers_1902-1905a_0179.pdf", "page": 1, "text": "and we enjoy hearing his honnds rnn but tbat wasnt all. The Hollywood club was out, too. Mr, Shepard, the leader of the Holly wood club, says they captured an old fox in 50-minutes. Beat that if yon can, Champion William Abbitt, A son of Mr. RobL Jenkins was painfully, bnt not seriously, hart by a horse throwing him on Snnday last. Mr. H. C. Tnrnes, P. J. Shepard, Thoi. Conner, J. W. Tweedy, and Lantha Drinkard attended the hone show in Lynchburg last week."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "if yon can, Champion <mark>William</mark> <mark>Abbitt</mark>, A son of Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "if yon can, Champion <mark>William</mark> <mark>Abbitt</mark>, A son of Mr."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [720.23, 430.68, 874.88, 960.06], "bbox_id": "4cfa536cb8", "file": "TimesVirginian_1976_0366.pdf", "page": 1, "text": "All that certain tract or parcel of real estate, lying and being in Stonewall Magisterial District of Appomattox County, Vir ginia, about four miles North of the Village of Oakville, Vir- ginia, adjoining the lands of Chesapeake Corporation, the Old Phelps home place now William H. Hunter and Dorothy P. Hunter, the lands of Richard Coleman, Sherman Hunter,  Emmett Cunningham, Junie Wright, William H. Hunter and others, containing approxi mately 40 acres, more or less. j Being the same identical tra c t of. real estate that was j conveyed into Stephen P. j Brunecz and Providence E.  Brunecz, husband and wife, by Clayton C. Bryant, et al, by deed dated January 2,1975 and recorded in Deed Book 121, Page 509 in the Clerks Office of j , the Circuit Court of Appomat- j tox County, Virginia. In execution of a deed o f trust Stephen P. Brunecz and 1 Providence E. Brunecz, dated ! January 31, 1975, recorded in j the Clerks Office of the Circuit  Court of Appomattox County in j Deed Book 121, Page 511, the j undersigned trustees will offer j for sale at public auction the  above-described 40-acre tract, , on the 23rd day of October ! nineteen hundred and seventy-  six at 1000 A.M., in front of the ! Courthouse, Appomattox, Vir- ! ginia, the property described in  such deed. Terms Cash 10 Deposit Required On j Day of Sale. WILLIAM S. KERR, Trustee W. M. ABBITT, Trustee i 9-23-4t"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Phelps home place now <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Phelps home place now <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [706.54, 420.88, 854.38, 949.0], "bbox_id": "c112b7f0b0", "file": "TimesVirginian_1976_0359.pdf", "page": 1, "text": "All that certain tract or parcel of real estate, lying and being in Stonewall Magisterial District of Appomattox County, Vir ginia, about four miles North of the Village of Oakville, Vir ginia, adjoining the lands of Chesapeake Corporation, the Old Phelps home place now William H. Hunter and Dorothy P. Hunter, the lands of Richard Coleman, Sherm an H unter, Emmett Cunningham, Junie Wright, William H. Hunter and others, containing approxi mately 40 acres, more or less. Being the same identical tract of real estate th a t was conveyed into Stephen P. Brunecz and Providence E. Brunecz, husband and wife, by Clayton C. Bryant, et al, by deed dated January 2,1975 and recorded in Deed Book 121, Page 509 in the Clerks Office of the Circuit Court of Appomat tox County, Virginia. In execution of a deed of trust Stephen P. Brunecz and Providence E. Brunecz, dated January 31, 1975, recorded in the Clerks Office of the Circuit Court of Appomattox County in Deed Book 121, Page 511, the  undersigned trustees will offer for sale at public auction the above-described 40-acre tract, on the 23rd day of October nineteen hundred and seventy- six at 1000 A.M., in front of the Courthouse, Appomattox, Vir ginia, the property described in such deed.  Terms Cash 10 Deposit Required On Day of Sale. WILLIAM S. KERR, Trustee W. M. ABBITT, Trustee y , 9-234t"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Phelps home place now <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Phelps home place now <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1809.07, 405.02, 1952.6, 932.27], "bbox_id": "31fb0d5663", "file": "TimesVirginian_1976_0379.pdf", "page": 1, "text": "All that certain tract or parcel of real estate, lying and being in Stonewall Magisterial District of Appomattox County, Vir ginia, about four miles North of the Village of Oakville, Vir ginia, adjoining the lands of Chesapeake Corporation, the Old Phelps home place now William H. Hunter and Dorothy P. Hunter, the lands of Richard Coleman, Sherm an H unter, Emmett Cunningham, Junie Wright, William H. Hunter and others, containing approxi mately 40 acres, more or less. Being the same identical tract of real estate th a t was conveyed into Stephen P. Brunecz and Providence E. Brunecz, husband and wife, by Clayton C. Bryant, et al, by deed dated January 2,1975 and recorded in Deed Book 121 Page 509 in the Clerks Office of the Circuit Court of Appomat tox County, Virginia. In execution of a deed of trust Stephen P. Brunecz and Providence E. Brunecz, dated January 31, 1975, reconled in the Clerks Office of the Circuit Court of Appomattox County in Deed Book 121, Page 511, the undersigned trustees will offer for sale at public auction the above-described 40-acre tract, on the 23rd day of October nineteen hundred and seventy- six at 1000 A.M., in front of the Courthouse, Appomattox, Vir ginia, the property described in such deed. Terms Cash 10 Deposit Required On Day of Sale. WILLIAM S. KERR, Trustee W. M. ABBITT, Trustee ________________ 9-23-4t"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Phelps home place now <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Phelps home place now <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1673.75, 226.7, 1820.12, 752.61], "bbox_id": "56f366618e", "file": "TimesVirginian_1976_0339.pdf", "page": 1, "text": "All Gull certain tract orparcel of reiki estate, lying akd being in Stonewall Magisterial district of Appomattox County, Vir ginia, about four miles North of the Village of Oakyille, Vir ginia, adjoining the lands of Chesapeake Corporation, the Did Phelps home place new William H. Hunter and Dorothy P. Hunter, the lands of Richard Coleman, Sherman H unter, Emmett Cunningham, , Junie Wright, William H. Hunter and others, containing approxi mately 46 acres, more or less. Being the same identical tract of real estate th a t was conveyed into Stephen P. Brunecz and Providence E. Brunecz, husband and wife, by Clayton C. Bryant, et al, by deed dated January 2,1975 and recorded in Deed Book 121, Page 569 in the Clerks Office of the Circuit Court of Appomat tox County, Virginia. In execution of a deed of trust Stephen P. Brunecz and Providence E. Brunecz, dated January 31, 1975, rbrded in the Clerks Office of the Circuit Court of Appomattox County in Deed Book 121, Page 511, the undersigned trustees will offer for sale at public auction the above-described 46-acre tract, on the 23rd day of October nineteen hundred and seventy- six at 1660 A.M., in front of the Courthouse, Appomattox, Vir ginia, the property described in such deed. Terms Cash 10 Deposit Required On Day of Sale. WILLIAM S. KERR, Trustee W. M. ABBITT, Trustee _________ 9-23-4t"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Phelps home place new <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Phelps home place new <mark>William</mark> <mark>H</mark>. Hunter and Dorothy P."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [560.31, 485.65, 720.39, 995.62], "bbox_id": "577148ce52", "file": "AppomattoxNewspapers_1898-1902a_0105.pdf", "page": 1, "text": "A Pretty Marriage. Wednesday eveuing at the appoint ed hour, 330 oclock, Mr. C. ft. Abbitt was married to Miss Annie Fleshman iu Liberty Church. The church had been beautifully decora ted with evergreens and flowers ami it is safe to say it was the prettiest marriage ever celebrated in the hew church. The ushers preceded the bride and groom down the aisle and passed under a beautiful arch of flowers at the altar. Following the ushers the bride eutered the left aisle on the arm of her sister, Miss Lizzie, aud the groom the left aisle on the arm of Mr. W. J. Trent They met under the arch at the al tar and Dr. Taylor soon pronounced them mau and wife. Miss Lizzie Fleshman was the brides maid and Mr. W. J. Trent best man. The following acted as ushers Messrs. J. B. Abbitt, H. S. Coleman, E. A. Cheatham, R. T. Fleshman, R. C. Harvey, F. W. McKinney, H. D. Flood and H. B. Harvey. Mrs. William Flesbman, of Bluefield, W. Va., officiated at the organ. The bi idal party repaired to the depot where the happy couple held a re ception while waiting fei the east bound train, and many were the congratulations. They will spend a week in Crewe, after which time they will be at home near here. The bride is a daughter of Mr. J. P. L. Fleshman, oue of the leading attor neys of this bar, and the groom is a brother of Dr. W. H. and Col. George Abbitt and is a prominent Appomat tox farmer."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "ushers Messrs. J. B. <mark>Abbitt</mark>, <mark>H</mark>. S. Coleman, E. A."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "ushers Messrs. J. B. <mark>Abbitt</mark>, <mark>H</mark>. S. Coleman, E. A."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [577.5, 1794.28, 727.09, 2003.08], "bbox_id": "fdb5e56d12", "file": "AppomattoxNewspapers_1898-1902a_0190.pdf", "page": 1, "text": "_ C O U N T Y O FFICER S, treasurer- D. Mott Robertson, 733.  AttocV. for the CommonwealthH. e A y P. Coleman, 761. Jgk of County and Circuit Courts EPeers. 42 J . K. Horsley. 13. JBpmmissioner o f the RevenueL , E. , 47Y H . C. Babcock, 404. D IST R ICT O F FIC E R S. S o u t h s id b D is t r ic t . PJr SupervisorJ . O. Jones. 229. For ConstableA . H . Abbitt, 232. For justicesJ . T .A ee, 187 Lantech Jones,-  j . R. H ill, 82 S. E . Howorton, 74 E. G. vey, 180, C 1 .OVKR--H 11 .L D is t r ic t . Ir SupervisorW . H . logon. 233. Er Constable-C. W. Inge, 126 for W. B. EfjustlcesP. M. Hannah. 167 William J. it 188 J- H. Forbes, 69 P. H. Fore, 184. overseerof PoorJ. W. Wright, 224. S t o h b w a ia , D is t r ic t . SupervisorS. c. Stratton, 234. fonstableH. C. Doss, 127 J. E. Chick, JusticesA. B. Thornhill, 141 J. C. 1 160- W C. Abbitt, 170 N. W. Owen, Vi! Stratton, 39 J. H. Thornhill, 38 kidson, 23."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "Jones. 229. For ConstableA . <mark>H</mark> . <mark>Abbitt</mark>, 232. For justicesJ . T"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "Jones. 229. For ConstableA . <mark>H</mark> . <mark>Abbitt</mark>, 232. For justicesJ . T"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1792.86, 393.25, 1961.08, 427.54], "bbox_id": "41a60bd449", "file": "AppomattoxNewspapers_1939-1943a_0352.pdf", "page": 1, "text": "W .M .Abbitt C. H. Swing, and J. w. Flood spent several days last week sora shooting in King William county."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H", "William"], "snippet": "W .M .<mark>Abbitt</mark> C. <mark>H</mark>. Swing, and J. w. Flood spent several days last week sora shooting in King <mark>William</mark> county."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H", "William"], "snippet": "W .M .<mark>Abbitt</mark> C. <mark>H</mark>. Swing, and J. w. Flood spent several days last week sora shooting in King <mark>William</mark> county."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1901.99, 632.89, 2235.77, 1027.68], "bbox_id": "f825e065c0", "file": "AppomattoxNewspapers_1952-1954a_0581.pdf", "page": 1, "text": "The Appomattox Blue Hornets will close their baseball season here tonight, when they meet Madison Heights at the Town Ball Park at 8 00 oclock. So far, the Blue Hor nets have won 9 games and lost 2, for another successful season. Last Tuesday, Bradley Mann pitched a no-hit game at A. H. S. downed William Campbell H. S. 14 to 1. The following seniors will be play ing their last baseball game for Ap pomattox Carter Woodson, Ottoway Guill, Robert OBrien, Carlton Guill and Bradley Mann. Benefit Game The Blue Hornets will meet an array of former baseball stars of Appomattox H. S. in a benefit game, on May 29. The purpose is for all funds to go toward a recreation program this summer at the school grounds and at Holliday Lake. Some of the former stars it is hoped will appear are Vernell Mitchell, Calvin Tanner, Lester Wingfield, Ray Wing field, Ed Cawthorne, James Paul- tte4 Bobby Chernauit, Maymona Mitchell, Ned Hancock, Watt Abbitt, John Caldwell, Sam Ferguson, Bud dy Ould, Bill Jamerson, .Sam Al mond, Robert Ayers, Jesse Rosser T W y iH F f t y f f i i e n n  t j j  m i ________ AAoiviu r erguson, ucu j . nomas Billy Perdue, Lewis Garrett, Sher- rilfi Robineon, Herman Wingfield. Any other veterans who would like to participate in this game are ask ed to contact Coach Gordon Bragg,. at Appomattox High School. Tickets bus and five ambulances were call-"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "A. H. S. downed <mark>William</mark> Campbell <mark>H</mark>. S. 14 to 1."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "A. H. S. downed <mark>William</mark> Campbell <mark>H</mark>. S. 14 to 1."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1631.99, 780.08, 1813.54, 958.28], "bbox_id": "6b4ae0a437", "file": "AppomattoxNewspapers_1933-1936a_0391.pdf", "page": 1, "text": "Pamplin, Feb. 12 William Jones Abbitt, 61, Pied at his home at Clover in .Halifax coUjity Sunday morning, Febuary 9 after a brief illness, of pneumnoia. He was born and reared in Appomattox county, and was well known here. Funeral services were held at his home on Monday, conducted by his pastor, the Rev Cabiness, assisted by the Rev.! R. E. Bodker. lnterm e was in the family .cemetery at Naruna. Besides his wife, he is survived by foifi sons and two daughters. His daughter, Miss Jane Abbitt is a member of the local school faculty. Mrs. J.B.W ilson and Mrs. H. avejT. Terry, of this county were sis f or 1 ters."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "Pamplin, Feb. 12 <mark>William</mark> Jones <mark>Abbitt</mark>, 61, Pied at his"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "Pamplin, Feb. 12 <mark>William</mark> Jones <mark>Abbitt</mark>, 61, Pied at his"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [449.05, 276.64, 621.41, 429.19], "bbox_id": "a01fe31522", "file": "AppomattoxNewspapers_1939-1943a_0006.pdf", "page": 1, "text": "Oakville, Nov. 22 .- Mrs. Kemper! Harris is very ill. Mrs. Jessie Harvey, Curry Har vey and Mrs. Terry motored to Wil son, N.C., last week to visit her brother, H. W. Abbitt,. Molly and Mildred Smith spent tho Week-end with Audrey William son. Mr. and Mrs. William Harvey spent Sunday in Scottsville. Mr. and Mrs. Lawson Lucado and daughter and Ruth Page spent th  week-end with George Page."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "to visit her brother, <mark>H</mark>. W. <mark>Abbitt</mark>,. Molly and Mildred Smith"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "to visit her brother, <mark>H</mark>. W. <mark>Abbitt</mark>,. Molly and Mildred Smith"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2089.06, 782.96, 2257.01, 1182.99], "bbox_id": "d0f48de77d", "file": "AppomattoxNewspapers_1955-1957a_0081.pdf", "page": 1, "text": "Mrs. Rosa Reynolds Buchanan died January 21 at her home here, after an illness of three months. She was born in Appomattox Coun ty June 13, 1898, daughter of Thomas Edwards and Emma Jones Reynolds. She was the wife of form er Appomattox Mayor George B. Buchanan, who also served as Ap pomattox County Treasurer, Besides her hufband, she is sur vived by three daughters, Mrs. Jo seph Tindall, Middletown, N. J. Mrs. Charles Morris, Richmond and Miss Ilah Buchanan, with the State Department in Saigon, Viet Nam one son, George B. Buchanan Jr., Appomattox one brother, Ho mer W. Reynolds, Ashbury Park, N. J., and four grandchildren. Funeral services were held at 2 P. M. Monday, at Robinsons Fu neral Home here. Interment was in Liberty Cemetery. Services were conducted by Dr. Carl A. Collins, Jr. Dr. Twyman Williams, and the Rev. Lee H. Richcreek. Active pallbearers were David T. Robertson, Grover Smith, A. R. Har wood Jr., Billy Conner, Robert C. Hubbard and William C. Hubbard. Honorary pallbearers were Dr. C. F. James, Watkins M. Abbitt, George Abbitt Jr., George Abbitt Sr., Chas. F. P. Crawley, J. A. Burke, William Burke, H. C. Pul liam, Carroll Ould, Calvin Robinson, Leonard E. Anderson, Fred Lawson, Jesse Guill, Robert Alford, Thos. T. Martin, Joel W. Flood, C. T. Moses, C. T. Moses Jr."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Crawley, J. A. Burke, <mark>William</mark> Burke, <mark>H</mark>. C. Pul liam, Carroll"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Crawley, J. A. Burke, <mark>William</mark> Burke, <mark>H</mark>. C. Pul liam, Carroll"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.63, 615.88, 2030.98, 941.97], "bbox_id": "25dc4bcb96", "file": "AppomattoxNewspapers_1955-1957a_0521.pdf", "page": 1, "text": "Funeral services for Joel Thomas Morris, 68year-old farmer of Route 2, Concord, killed in a traffic acci dent near Beckham last Thursday, were conducted from the Hebron Baptist Church Saturday at 3 P. M. Mr. Moris is survived by his wife, Mrs. Ghessie Wright Morris two sons, J. J. Morris arid Robert Mor ris, both of Appomattox four daughters, Mrs. Winston Martin, Mrs. T. R. Martin and Mrs. Evans Ferguson, all of Appomattox, and Mrs. Marvin Martin, of Lynchburg. Also by two brothers, R. B. Mor ris and J. H. Morris, both of Lynchburg four sisters, Mrs. J-ulian McFadden and Mrs. Willie Hamilton of Lynchburg Mrs. Janie Frazier, of Washington, D. C., and Mrs. Thornton Carter, of Appomattox 17 grandchildren and four great grand children. Funeral services were conducted by his pastor, the Rev. Colie Rock, assisted by the Reverends A. D. Smith, Fi-oy Cox and Charles Ad dington. Interment was in the church cemetery. Pallbearers were Robert Morris, Raymond Morris, Charlie Carter, Edwin Carter, David Carter, Maplewood Cemetery. Born in Appomattox, Va., the son . of Martha West Jones Abbitt and, Bob Steppe, Jerry Smith and Her- William Chatham Abbitt, Mr. Ab- j bent McFadden."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "Jerry Smith and Her- <mark>William</mark> Chatham <mark>Abbitt</mark>, Mr. Ab- j bent"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "Jerry Smith and Her- <mark>William</mark> Chatham <mark>Abbitt</mark>, Mr. Ab- j bent"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1124.14, 491.18, 1265.03, 1182.29], "bbox_id": "97eb373f8a", "file": "TimesVirginian_1980a_0361.pdf", "page": 1, "text": "FORECLOSURE Pursuant to a Deed of Trust, dated October 6, 1976, from Robnie L. Wright, single, to W. M. Abbitt and William S. Kero, Trustees, raewrded in the Clerics Office of the Cirouit Court of Appomattox Coun ty on October 8, 1976, and round in Deed Book 129,  Page 88, the hereinafter described real estate was conveyed in trust to the aforesaid Trustees to secure a Deedof Trust Note of even date and the said Deed of Triwt Note te now hi default, and, upon request of the Noteholder, the undersigned Trustee shall offer for sale the hereinafter described real estate on Friday, November 21,1900 at 1040 A.M., on the property All of that certain tract or parcel of real estate, with all buildings and improvements thereon and privileges sad appurtenances thereunto be longing, lying and being in the Soutaside Magisterial D istrict of Appomattox County, Virginia, containing 1984 acres, more or less, foproximately 5 miles Nor thwest of the Town of Appomattox, Virginia, and approximately 1 mile Nerth of the Virginia State Police H eadquarters on 8 tate Route 013, adjoining the lands new or form erly owned by David Bites, H. D. Flood, S. L. Ferguson, E. F. Collins, Robert G. Holt and William CDrinkard. Being th e . name i itigL . esa9e - conveyed u n to . Rennie WYIfcht by deed dated O ctober 0, 1070, from CbnrtOQ C, Bryant, et ux, and recorded m the afore said Clerics Office in Deed Book 129, Page 81. TERMS OF SALE CASH upon delivery of good deed with reasonable time to have , title examined. BIDDERS D E P08IT of 10 required on Day of Sale. W. M. Abbitt, Trustee Attorney at Law IDS Court Stieet Appomattqx. Virginia 24822 Telephone 8824229 or 352- aaan ,"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "single, to W. M. <mark>Abbitt</mark> and <mark>William</mark> S. Kero, Trustees, raewrded"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "single, to W. M. <mark>Abbitt</mark> and <mark>William</mark> S. Kero, Trustees, raewrded"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1341.09, 467.89, 1476.52, 1367.8], "bbox_id": "f3793d2fe7", "file": "TimesVirginian_1980a_0307.pdf", "page": 1, "text": "FORECLOSURE Pursuant to a Deed of Trust dated November 14, 1979 from SASU Investments N. V. to W. M. Abbitt and William S. Kerr, Trustees, recorded in the Clerks Office of the Circuit Court of Appomattox County on November 26, 1979, and found in Deed Book 144, Page 177, the hereinafter described real estate was conveyed in trust to the aforesaid Trustees to secure a Deed of Trust Note of even date and the said Deed of Trust Note is now in default, and, upon request of the Noteholder, the under signed Trustee shall offer for, sale the hereinafter described real estate on Friday. October 31, 1980 at 1000 A.M. in front of he Appomattox Circuit Court house in Appomattox, Vir ginia All of that certain tract or parcel of real estate, with all buildings and improvements thereon and privileges and appurtenances thereunto be longing, lying and being in the Southside Magisterial District of Appomattox County, Virginia, approxi mately three miles West of the Town of Appomattox, Virginia, and more particu larly shown and described on a plat of.survey by James C. May  Associates, Engi neers, Surveyors. Planners, entitled Plat of Survey  Partition of 848.54 Ac. Moses Tract, dated June 28,1979, and shown thereon as .Paneel AV,containing 700.90 tares, which skid plat is recorded in the Clerks Office of the Circuit Court of Appomattox County in Plat Book 2, Page 43. Being the same real estate conveyed unto SASU Investments N. V. by deed from W. H. Burruss, Jr., et al, dated November 9, 1979 and recorded in the aforesaid Clerks Office in Deed Book 144, Page 175. And more particularly described as lying on the North side of State Secon dary Route No. 691, and South of, but not fronting on U. S. Highway No. 460, being a portion of the Old Moses Place. TERMS OF SALE Cash upon delivery of good deed with reasonable time to have title examined. Bidders Deposit of 10 required on Day of Sale. W. M. Abbitt, Trustee Attorney at Law 108 Court Street Appomattox, Virginia 24522 Telephone 3528229 William S. Kerr, Trustee Attorney at Law 122 Court Street Appomattox, Virginia 24522 Telephone 352-7627 or 352- 5368 809-28-4tc"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "V. to W. M. <mark>Abbitt</mark> and <mark>William</mark> S. Kerr, Trustees, recorded"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "V. to W. M. <mark>Abbitt</mark> and <mark>William</mark> S. Kerr, Trustees, recorded"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.61, 219.73, 1730.62, 1237.51], "bbox_id": "73bf69ecf5", "file": "AppomattoxNewspapers_1905-1912a_0547.pdf", "page": 1, "text": "Democratic Mass Meeting. . There was a largely attended mass meeting of the Democra 8 of Appomattox at the. Courthouse Wednesday, for the purpose of electing six delegates to the Norfolk State Convention. Gapt. T. J. Stratton was made permanent chairman of the meeting he appointed W. A. Moes, S. C Stratton and E. E. Chism a com rnittee to nominate delegates to the Convention. The committee nomi nated and tbe meeting elected the following delegatee H. D. Flood J. R. Horsley, S. L. Ferguson, D.. J. B. Abbitt, R. H. Browning, W. T. Marshal alternates N. R. Featheratone, H. B. Jennings, R. C Mann, T. A. Caldwell, J. W. Caw- thorn Jr., C. W. Smith. The chairman then appointed the following committee on resolutions S. L. Ferguson, J. R. Horsley and L. E. Smith. The following resolutions were offered and adopted By S. L. FergusonResolved that it is the sense of this Demo cratic Mass Meeting, assembled at Appomattox Court House on May 1st. 1912, for the purpose of se lecting delegates aud alternates to the Democratic State Convention, which meets in Norfolk May 23rd, 1912, that the delegates and alter nates which have been elected, go to said Convention utunstructed, vote as a unit, and those who are present at said Convention, cast the vote of said delegation as a unit. By Dr. J. B. AbbittResolved that the course of our Unied States Senators, Hon. Thomas S Martin and Hon. Claude A. Swanson, in the Congress of the United States, Oas been nch as to commend it self to the people of Virginia, and we heartily endorse each of them as able and faithful representatives of the people and of Demncatic prin ciples. ByL, E. S.rithResolved that it is the sense of this Democratic mass meeting assembled that the administration of William Hodges .Mann, Governor of Virginia has oeen able and conservative. Resolved, That he has shown him self especially the friend of the farmer in advocating and securing special legislation in tfie interest of the agricnltnrai classes and the bet terment of the agricultural interests of Virginia. By J. R. HorsleyResolved, That Hon. J. Taylor Ellyson has served the Democratic party of Virginia ar chairman of the State Democratic Committee with unselfish z al and ability. Resolved, That, we hear ily en dorse Mr. Ellyson for re-election as chairman of the State Democratic committee and also as a member of the National Democratic committee By. J. IV. CawthomRes lived, That we, the Democratic voters of Appomattox county in mass-meet ing assembled heartily endorse Hon H. D. Flood for re-election to Con gress from the Tenth Virginia Dist rict. Resolved, That this District never had a more able and faithful representative in Congress, or one who has been more active or anc- cessful in representing the interests of his oonstionents. The meeting was a very harmoni ous affair and there was no attempt to instruct the delegates, and it is felt that all the delegates desire to be for the man who can win a Democratic victory."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Ferguson, D.. J. B. <mark>Abbitt</mark>, R. <mark>H</mark>. Browning, W. T. Marshal"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Ferguson, D.. J. B. <mark>Abbitt</mark>, R. <mark>H</mark>. Browning, W. T. Marshal"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1512.94, 397.55, 1681.4, 685.19], "bbox_id": "0f349b4bb3", "file": "AppomattoxNewspapers_1952-1954a_0446.pdf", "page": 1, "text": "complete insulation job has been done, with new acoustical metal ceil ing and indirect lighting. A modern vault was added a t the beginning of the improvement pro gram. . . , . Complete new w iring has been done, with new electric installation and recessed lighting fixtures. Officers and personnel a t the Farmers National Bank President, P. L. Murphy. Vice-president, L. J. Morris. Vice-president, C. S. McDearmon. Cashier, T. D eW itt Evans. Assistant cashier, Mrs. Paul Drink- ard. Assistant cashier, Gene Paulette. Bookkeepers and tellers William A. H unter, Mrs. T. J. Conner, Mrs. Beverley M artin. Directors F. L. Murphy, L, J. Morris, C. S. McDearmon, C. T. Moses, Mrs. F. L. M urphy, W. M. Morris, C. T. Moses, J r. T. W. Moses, W. M. Abbitt, George Ab- bitt, Jr.  C. S. Jenkins, A. R. H ar wood. J r. T. DeW itt Evans."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Paulette. Bookkeepers and tellers <mark>William</mark> A. <mark>H</mark> unter, Mrs. T. J."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Paulette. Bookkeepers and tellers <mark>William</mark> A. <mark>H</mark> unter, Mrs. T. J."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1490.14, 806.4, 1656.83, 1198.99], "bbox_id": "834150c251", "file": "AppomattoxNewspapers_1908-1909a_0435.pdf", "page": 1, "text": "Celebrating the tenth anni versary of the signing of the armistice which virtually brought to a close the great World War, Rev. W. M. Thompson will preach a special patriotic sermon i at Liberty Baptist church Sun day, November 11th, at 8 p. m. Patriotic hymns will be sung and a special number will be rendered by a mixed quartet. The follow ing names of men who served their country during the World War are found on the Liberty Church Honor Roll W. Ernest Abbitt, Russell Abbitt, Thos. H. Agee, Clarence Agee, W. Patt Coleman. John - Garter, J Oscar Cole, Thos. E. Caldwell, Richard Caldwell, Walter E. Durham, Terry C. Durham, G. Lewis Doss. Albert H. Ferguson, Thos. J- Ferguson, Kenneth Furbush, Leonard N. Gregory, Lloyd F. Goin, L. Harry Goin, James P. Gills, Julian Gills, C. Evant Hunter, Willis E. Inge, Joe Inge, Don Moses, W. Tunstall Morgan, Walter W Scott, William A. Walton, W. Berkley Woolridge. The subject for thle morning ser mon will be The Christians Armor ."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1494.23, 825.81, 1660.86, 1218.85], "bbox_id": "7f2879575e", "file": "AppomattoxNewspapers_1926-1933a_0435.pdf", "page": 1, "text": "Celebrating the tenth anni versary of the signing of the armistice which virtually brought to a close the great World War, Rev. W. M. Thompson will  preach a special patriotic sermon at Liberty Baptist church Sun day, November 11th, at 8 p. m. Patriotic hymns will be sung and a special number will be rendered by a mixed quartet. The follow ing names of men who served their country during the World War are found on the Liberty Church Honor Roll W. Ernest Abbitt, Russell Abbitt, Thos. H. Agee, Clarence Agee, W. Patt Coleman. John Garter, J. Oscar Cole, Thos. E. Caldwell, Richard Caldwell, Walter E. Durham, Terry C. Durham, G. Lewis Doss. Albert H. Ferguson, Thos. J. Ferguson, Kenneth Furbush, Leonard N. Gregory, Lloyd F. Goin, L. Harry Goin, James P. Gills, Julian Gills, C. Evant Hunter, Willis E. Inge, Joe Inge, Don Moses, W. Tunstall Morgan, Walter W Scott, William A. Walton, W. Berkley Woolridge. The subject for the morning ser mon will be The Christians Armor ."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "W. Ernest Abbitt, Russell <mark>Abbitt</mark>, Thos. <mark>H</mark>. Agee, Clarence Agee, W."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [443.74, 362.2, 620.74, 1795.51], "bbox_id": "c22bc15a56", "file": "AppomattoxNewspapers_1954-1955a_0110.pdf", "page": 1, "text": "By order of the Electorial Board of Appomattox County, all Regis tration Books in Southside District shall be purged as of October 4 1954. The names listed below have been removed from the Registration Books, Courthouse Precinct, South- side District, Appomattox County Virginia for reasons of death transferred or moved. This action is provided for and ordered under Sec tions 24-94 through 24-107 of the Virginia Election Laws as amend ed. Any one who can prove conclus ively that any of the names listed below have a right to be on the Registration Books of said County of said district, they shall make such information available to the undersigned registrar. JAMES H. LUCADO REGISTRAR. E. B. Abbitt W. A. Agee A. W. Almond Henry C. Almond Leonard Anderson T. F. Akers C. N. Abbitt J. Russell Abbitt J. R. Adams R. M. Almond T. Dyer Almond Daniel Almond Mrs. Patricia Almond Helen West Alvis Vergie L. Almond Mrs. W. M. Almond Mrs. R. F. Akers W. W. Brown J. W. Blackwell F. B. Blackwell Homer W. Blackwell John A. Booth K. V. Barlow H. H. Bazemore Harold W. Babcock George W. .Bass Alfred Bryant D. J. Berger L. I. Bryant Henry H. Beale William Boyce Alfred L. Barlow R. W. Burkey W. L. Brown H. M. Burge George P. Blackwell J. O. Babcock R. H. Bates O. S. Burnett Jerry A. Burke, Jr. P. M. Burton R. F. Burke, II F. E. Babcock R. H. Baber R. B. Boney, Sr. Berkley Brown H. 0. Blackard Jennie L. Blackwell Eula M. Burke Mrs. Myrna S. Bingham Mrs. Sallie Binkley Mrs. Julia A. Burton Mrs. Jessie Fitzgerald Baird Pearl E. Berger Mildred Babcock Mrs. K. V. Barlow Dorothy Buchanan Mrs. Nannie V. Blackwell Mrs. Ila Jean Buettner Miss Ila V. Buchanan Majorie B. Bailey Mrs. Martha A. Baber Mrs. Bertha L. Baber Addie Bates Mrs. Thelma L. Bazemore Katherine Burge Sara Beasley Mrs. Stanley Blystone Mrs. Mozell D. Boyce Mrs. R. B. Boney, Sr. J. W. Baber W. C. Chilton, Jr. Julian M. Campbell William A. Clark Tucker Cheatham J. W. Cawthorn, Jr. J. H. Cheatham L. Crawley J. B. Chilton J. T. Cole J. S. Cyrus E. P. Carson W. P. Coleman James L. Caldwell J. W. Caldwell J. T. Coleman J. M. Clapp Harvey A. Caldwell Wiley Coleman M. Earl Carson T. L. Christian R. L. Carter Archer A. Caldwell N. H. Cheatham E. H. Cawthorn Wilson R. Cole T. A. Clark S. H. Collins Twyman Conner R. E. Clapp Harry P. Clark W. Twyman Coleman P. W. Coleman W. A. Coleman W. W. Carter John L. Cates, Jr. G. A. Chocolate Enid M. Clapp Robert Cawthorn W. L. Coleman H. S. Coleman E. G. Cheatham T. E. Childress J. R. Conner John R. Cheatham Roy Conner D. L. Cawthorn F. T. Cawthorn, Jr. C. C. Cawthorn J. D. Cawthorn"}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "L. I. Bryant Henry <mark>H</mark>. Beale <mark>William</mark> Boyce Alfred L. Barlow"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "L. I. Bryant Henry <mark>H</mark>. Beale <mark>William</mark> Boyce Alfred L. Barlow"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2166.24, 1359.29, 2340.72, 1651.29], "bbox_id": "2b25c63221", "file": "AppomattoxNewspapers_1939-1943a_0113.pdf", "page": 1, "text": "Bamplin, June 12.- Relatives in Appomattox county were notified on Thursday of the death of the Rev. Benjamin Rolling Abbibt pastor of the First Baptist churchof Long Branch, New Jersey. Hs was born and reared in Appomattox county, the son of the late William Chatham Abbitt and West Jones Abbitt. Ha was a graduate of Richmond Col lege and of Crozier Theological Sem inary. HU death came as a shock, as he died following one weeks ill ness. He had served as pastor of the following fields Towson, Mary land Hempstead, Long Island Em manuel Baptist church of Camden, New Jersey Parmly Memorial Bapt ist church of Jersey City. He tod been a t Long Branch for the past year, where funeral services were held Monday afternoon at 330. In terment was made in Long Branch. Surviving are his widow and one daughter, Miss Gertrude Abbitt and the following brothers and sisters H. W. Abbitt of Wilson, N. C  George D. Abbitt of Collingswood, N .J . James C.Abbitt and Mrs. J.J.Harvey, of Appomattox and Mrs. J.B. Wilson and Mrs. H.fT,. Terry, of Pamplin.."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt", "Abbitt"], "snippet": "son of the late <mark>William</mark> Chatham <mark>Abbitt</mark> and West Jones <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt", "Abbitt"], "snippet": "son of the late <mark>William</mark> Chatham <mark>Abbitt</mark> and West Jones <mark>Abbitt</mark>."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [358.1, 464.8, 684.42, 695.84], "bbox_id": "11c2d1978d", "file": "AppomattoxNewspapers_1926-1933a_0213.pdf", "page": 1, "text": "Abbitt, Ned 41 1-2 Adj. J. L- Foster 502 Abbitt, Ned 38 1-2 Adj. W. F- W right 5.06 Abbitt, Robt Allen 40 Rough Creek 9-63 Brown, Anderson 14 Appomattox River 2-44 hawthorn, Anthonys Est. 83 Nr, Pr. House Farm 14.76 jilliam , W. E. 89 1-2 Adj- E. P. Sears 10-62 william, J. H.  Joel Daniel 101 1-2 Sawney Creek 9-77 William, Jas. Cary 44 1-2 Adj. E. P. Sears 6-54 Hancock, A- B- 1 Nr. Appomattox River 5.77 Hancock, E. A-  L. M. 7 3-4 Nr- Pamplin 3.87 Hunter, W alter 12 14-100 Nr- Vera 2.31 Jones, Jim 5 Nr- Evergreen 3.45 LiOgan, John R. 1 Nr. Pamplin 3.451 Marshall, Elsie 17 Nr. Evergreen 8-84 Morgan, Julia 100 Nr. Bent Creek 16-25 Moseley, Robt. D-  Annie I. 5 Ferguson Mt. 1-26 McDearmon, David 4 Evergreen 1.42 Walker, Jas. H. 33 1-2 On Appomattox River 3.76 Walker, Henry J. 21 Nr- Hixburg 8.01 Walker, Henry J. 46 Nr- Hixburg 4.86"}, "highlight": {"text": {"matched_tokens": ["william", "H"], "snippet": "E. P. Sears 10-62 <mark>william</mark>, J. <mark>H</mark>.  Joel Daniel 101 1-2"}}, "highlights": [{"field": "text", "matched_tokens": ["william", "H"], "snippet": "E. P. Sears 10-62 <mark>william</mark>, J. <mark>H</mark>.  Joel Daniel 101 1-2"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1177.2, 1394.71, 1405.53, 1670.74], "bbox_id": "a0d8f417e0", "file": "AppomattoxNewspapers_1939-1943a_0345.pdf", "page": 1, "text": "Abbitt, Ned . ............................  H 2!4 Austin, Edmund J .................. Ilo  Beasley, Stephen Jr ................... ..    i  . Brown, William . . . . . .................. J l-o Cousin, Hattie .............. .. .............. jj Davidson, William ....................... J Doss, Fannie ...............................  ............ Dungee, Edward ...........................  .......... Ferguson, Henry H............................ Ferguson, O. K ............................... Ferguson, Winston ............ .. Ferguson, Ancer  Hal ................ Ferguson, Hut Est .......................... Goff, Masco ..................... .. Johnson, Abington ................... Johnson, William ......... .............. Johnson, J. H .................................. Johnson, Alice also Alice Green Johnson, Ann ................. ..... Jones, Alex .. . .......................... Jones, Chas. . .............................. Jones, Martha Jane ............... Jones, P. S.  Ashby ........... Kimbro, Mary . .......................... Kelso, Mary Jane Scruggs .. ... Lewis, McKinley ................. Mason, Martin Luther .......... Myers, John H. ..................... . Nowlin, R. W.  M. LeGrande Pankey, John N."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "<mark>Abbitt</mark>, Ned . ............................  <mark>H</mark> 2!4 Austin, Edmund J"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "<mark>Abbitt</mark>, Ned . ............................  <mark>H</mark> 2!4 Austin, Edmund J"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1642.31, 619.84, 1814.88, 1090.88], "bbox_id": "de56b0fe00", "file": "AppomattoxNewspapers_1943-1947a_0356.pdf", "page": 1, "text": "The Aippomattox Chapter of the Future Farmers of America will be host to the Hub Federation of the Future Farmers of America at their annuial banquet Friday night February 1 . This event, which was not held during the war, includes the schools of Amherst, Appomat tox, Naruna, Rustburg, Gladys, Concord, New London Acedamey, Brookneal and Pamplin. The principal speaker will be Mr. D. J. Howard, supervisor of Agricultural Education o f Vir ginia. Mr. Howard is also treasur er of the Nat.onal Association of the Future Farmers of America. Also appearing on the program will be Robert Evans, Rustburg, as toastmaster Tom .Phillips,Kus.- burg, Who will make the address of welcomeRichard Carter, Appo mattox, wl will introduce the guests, and William Pollad, Glad ys, who will preside. The meal will be served by the Womans Society of the Memorial Methodist Church. Each of the nine chapters, will send four delegates and their fathers. In addition to the boys and their fathers, there will be twenty-eight special guests, as fol lows Major Lyle N. Garrette, Mr. W. C. Sweitzer, Mr. J. W. Stone, j Supt. A. J. Camden, Mr. Lindsey Crawley, Supt. J. J. Fray, Supt. J. A. Burke, Mr. Frank Duncum, Senator C. T. Moses, Mr. Max Guggenheimer, Mr- Warren King, Mr. R. L. Burke, Sr., Mr. B. G. Anderson, Mr. George F. Abbitt, Jr., Mr. H. F. Wood, Mr. O. L. Brown, Mrs. L. H. Shrader, Mr. T. J. Ligon, Mr. J. O. Davidson, Mr. jS. R. Crockett, Mr. Kermit Gardner, Mr. F. B. Cale, Mr. R. B. Hudgins, and Judge Joel W. Flood. Billy Wheeler, reporter."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Anderson, Mr. George F. <mark>Abbitt</mark>, Jr., Mr. <mark>H</mark>. F. Wood, Mr. O."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Anderson, Mr. George F. <mark>Abbitt</mark>, Jr., Mr. <mark>H</mark>. F. Wood, Mr. O."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1979.04, 1152.88, 2152.99, 1562.92], "bbox_id": "5bbb0a234b", "file": "AppomattoxNewspapers_1939-1943a_0331.pdf", "page": 1, "text": "Mr. Calvin Robinson The Young Democratic Club of Appomattox county held its annual brunswick stew and business meet ing last Friday aftem ion at Holli day Lake. Hon. William M. Tucx, Democra tic nominee for v Lieutenant Govern or of Virginia, Was guest speaker. Watkins M. Abbitt, president for the past three year?, presided. At the business meeting the following officers were elected President, Mrs. Calvin Robinson Vice-presidents for Clover Hill district, N. E. Farm. for Southside disVict,. George F. Ablit-r, Jr., for Stonewall district, I.. F. Ferguson Secretary, Miss Carolyn Moses Treasurer, Miss Mary Trent. Delegates named fsr the state convention to be held this week-end in Roanoke L. T. Lucado, N. E. Farrar, J. M. Cobb, W. W. Carter, Miss Elaine McDearmon, Howard Williams, Mrs. J. W. Cobb, Miss Flora B. Williams, J. H. OBrien, Mrs. J. H. OBrien, Z. T. Moran, C. T. Moses, D. A. Conner, G E. Smith, Geo. Abbitt, Jr., C. H. Rob inson, Mrs. C. H. Robinson, W. M. Abbitt, Eula May Burke, Ryland M. Mann, S. L. Ferguson, Jr., J. A. Burke, Mary V. Trent, N. R. Feath erston, Caroline Moses, W. F. Wool- fork, Mrs. J. A. Burke, Dr. C. G. OBrien, H. Y. Spencer, H. C Pull- am, C. F. James, L. F. Ferguson, W. W. OBrien, P. B. Stratton, C. H Swing, C. Roland Smith, Miss Frankie McKinney."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "G E. Smith, Geo. <mark>Abbitt</mark>, Jr., C. <mark>H</mark>. Rob inson, Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "G E. Smith, Geo. <mark>Abbitt</mark>, Jr., C. <mark>H</mark>. Rob inson, Mrs. C."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1970.13, 374.79, 2126.12, 710.73], "bbox_id": "de7b081304", "file": "AppomattoxNewspapers_1952-1954a_0257.pdf", "page": 1, "text": "Herman Bryant, May 1. Mrs. Hallie Childress, May 1. John Moore, May 5. T. R. Martin, Jr., May 5. Ocie Mae Grishaw, May 5. Mrs. Elliott Nash, May 8 . Martha Jennings, May 11. Mrs. E. C. Scruggs, May 11. Billy Williamson, May 11. Mildred Ferguson, May 14. Mrs. Fred Weakley, May 14. Mrs. Bolden McCormick, May 20. Terrence Newman, May 27. Lloyd Coleman, May 27. George Perdue, May 28. Mary Alice Henry, May 30. Claude Jennings, May 30. Sammy Ferguson, May 22. Walter Scott Cumby, April 30. Mrs. Walter Scott Cumby, May 1. W. M. Abbitt, May 21. H. F. Martin, May 1. Annie Roach, May 5. Mrs. Robert Roach, May 25. Ted Almond, May 15. Harry Almond, May 15. Peggy Baldwin, May 8 . Ruth Arrington, May 30. William Ranson, May 14. Sandra Roach, May 16. Ruth Ranson, May 26. Frank Roy Ranson, May 14. Mrs. C. M. Evans, May 31. Mrs. Mai Foster, May 31."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "May 1. W. M. <mark>Abbitt</mark>, May 21. <mark>H</mark>. F. Martin, May 1."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "May 1. W. M. <mark>Abbitt</mark>, May 21. <mark>H</mark>. F. Martin, May 1."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1769.99, 1128.15, 1943.96, 1361.6], "bbox_id": "a84f36b567", "file": "AppomattoxNewspapers_1943-1947a_0319.pdf", "page": 1, "text": "Funeral s.rvices for Mr. A. W. Almond were conducted from the Liberty Baptist Church on Sunday November 25. The Rev. H. Freder ick Jones officiated. Interment was in Liberty Cemetery. Active pallbearers were Roy L. Myers, Herman F. Carter, Wilson Gufll, Mott H. Layne, David C. Carter, Johnnie Burford and F. W, James. Honorary pallbearers L. E. Smith, C. S. Jenkins, G. F. Abbitt, Tom Ferguson, William W. Burke, R. L. Burke, L. J. Morris, A. T. Inge, W. S. Taylor and L. J. Harvey. Flower bearers were Estelle Layne, Florence Layne, Pauline Layne, Laura McFadden, Margaret Johnson, Shirley Bogar, Margaret McCormick, Mrs. Hazel G6m, Ez- ijeth Burley. Louise Burford, Ru by Roberts, Tdrs.Bee Mann,Ruh Wooldridge."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "S. Jenkins, G. F. <mark>Abbitt</mark>, Tom Ferguson, <mark>William</mark> W. Burke, R. L."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "S. Jenkins, G. F. <mark>Abbitt</mark>, Tom Ferguson, <mark>William</mark> W. Burke, R. L."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1520.58, 1033.64, 1690.44, 1485.96], "bbox_id": "5eea14af08", "file": "AppomattoxNewspapers_1954-1955a_0366.pdf", "page": 1, "text": "Community Election Boards for Appomattox County recently met and nominated candidates for ASC community committeemen. On Au gust 26 farmers will elect three of these candidates in each commun ity to serve as the community com mittee and two others as alternate committeemen. The nominees are as follows Clover Hill Community Harry W. Jenkins, Kermit Paul ette, Jack Cawthorne, G. Monroe Webb, Burr Abbitt, Francis P. OBrien, Bernard C. Richardson, Basil J. Lucado, Hunter Tolley and Tipton Paulette. Southside Community E. Carter Martin, E. D. Cheat ham, E. W. Marshall, Jr. William A. Hunter, E. W. Jones, C. C. Har vey, T. H. Chambers, Jr. A. B. Carson, David E. Paulette, Raymond F. Jamerson. Stonewall Community William D. OBrien, H. D. Reyn olds, Leonard C. Garrett, C. Roland Smith, Aubrey I. Moore, T. R. Mar tin, Jr. John P. Moore, Lyle B. Thomas, W. A. Wheeler, Hugh Tan ner. In addition to those nominated, ether names may be presented to Community Election Boards by peti tion of eligible farmers. If as many as ten eligible farmers present the names of persons eligible and will ing to serve as committemen whom they wish to be included on the ballots, the Community Election Board will include these names on the slate of nominees. Petitions should be presented to Community Election Boards by not later than August 18, 1955 to be considered."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "F. Jamerson. Stonewall Community <mark>William</mark> D. OBrien, <mark>H</mark>. D. Reyn olds, Leonard"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "F. Jamerson. Stonewall Community <mark>William</mark> D. OBrien, <mark>H</mark>. D. Reyn olds, Leonard"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1577.04, 432.26, 1737.44, 1077.06], "bbox_id": "a776f86573", "file": "AppomattoxNewspapers_1892-1898a_0090.pdf", "page": 1, "text": "C ircuit Court Proceedings, v The following decrees were entered in chancery at this term of the Cir cuit court J. R. Atwood against Willis Inges administrator, etc., order to convey land. J. R. Coleman, etc., against Joseph B. Coleman, etc., order to collect rents and pay cost. John R. Phelps against Jane. Phelps heirs etc., report confirmed. John H. Walker etc., against John A, Phelps etc., report confirmed. Samuel H. MeKinney against William E. Patteson etc., final decree. Edward S. Brown receiver, againist Milton S. Fore etc., order of sale. Frank P. Inge against Henry Inge admistrator etc., order for sale of land. John R. Franklin against William A. Durrum, referred to R. B. Poore, special commissioner. Mahala Davis against James E, Mitchels heirs referred to W. D. Thornton special commissioner. Wooldridge and wife against Webb, order of account. John W. Fisher against P. P. Pan key and Wife, order to rent out land. Sydnor Webb against S. D. Sears, order to rent out land. Allison and Adderson against Sarah Harvey and sons, order of ac count. Aug. Wright againsf S. R. Frank lin, report of H. D. Flood, order to collect and disburse. C. R. Pearsman and wife against J. Rolph Horsley and Fannir D. Horsley, order to divide land. Alex Johuson against Izetta John son, order against plaintiff to pay defendant 50 to defend her suit. Sami. M. Bryan and wife against R. A. Forbes trustee, and Wm. Ros ser, final decree. Mary E. Hannah against John R. Franklin, order to allot dower and order of account. S. F. Abbitt against Mary A. Rob ertson, final decree reestablishing decree."}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "etc., report confirmed. Samuel <mark>H</mark>. MeKinney against <mark>William</mark> E. Patteson etc., final"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "etc., report confirmed. Samuel <mark>H</mark>. MeKinney against <mark>William</mark> E. Patteson etc., final"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [690.5, 198.2, 849.01, 608.1], "bbox_id": "0b8c8d5414", "file": "AppomattoxNewspapers_1918-1922a_0593.pdf", "page": 1, "text": "B oll of H onor, V era School 10th GradeA u la Ferguson, Vara M orris, E velyn Oririen. 9th GradeIsabelle O Brieo, Hamner Coleman, Otys Obil- ders. 8th GradeV ivian Clarke. 7th GradeVara E. Morris, Verna Morris, Cora Page, Judy Ferguson, Phoebe OBrien, Georgia Gobble, Richard Jen- kins. 6th Grade  Kate Morris, Glenis Konuagau. 5th GradeHerman Bryant, Paul Ferguson. 4th GradeHerman Morris, Willie Morris, William OBrien, Dora Abbitt, Frances Jenkins, Lucille Lucado, Eiith OBrien. 3rd GradeMartha Rosen- balm, Conner Ferguson, Willie Kerlin. 2nd. GradeEunice McNally, Annie Mae Turnes, Many Kon aagan, Mary Elizabeth Morris, Frank Oawthorn, Gordon San ford, Thomas Page, William Carter, Grover Childers. 1st GradeEva Ferguson, Ann OBrien, Rosser Tweedy, Madison Sanford, Richard San ford, Albert OBrien, JudsoD Morris."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "GradeHerman Morris, Willie Morris, <mark>William</mark> OBrien, Dora <mark>Abbitt</mark>, Frances Jenkins, Lucille Lucado,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "GradeHerman Morris, Willie Morris, <mark>William</mark> OBrien, Dora <mark>Abbitt</mark>, Frances Jenkins, Lucille Lucado,"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1618.06, 945.31, 1760.85, 1501.3], "bbox_id": "bbef18cdbe", "file": "AppomattoxNewspapers_1962-1965a_0383.pdf", "page": 1, "text": "ance they can have. We will be seeking pledges payable over a 36-month payment period. The following persons have agreed to work in the campaign For Appomattox Captain, T. DeWitt Evans, Team, George F - Abbitt, Jr., A. R. Harwood, Jr., Dr. J. A. Mathews, Dr. C. G. OBrien Captain, R. B. Carter Team, Mrs. Helen Fayne Cole man, Mrs. LeGrand Webb, Mrs. Irene Kanipe, Mrs. Harry Jen kins, Mrs. Robert Morris, Mrs. Joe Megginson, Mrs. Betty Jean Drinkard, Beverley Martin Cap tain, Ralph Harris Team, Berk ley Cabiness, David R. Caldwell, Dan Carson, Tom Davidson, Bennett Harding, Carry Harvey, Carl Martin, John Tweedy, Jr., Co - captains, R. M. Fergu son, and H. W. Conner Team, T. Hunter Dickerson, Burke Guill, Bobby Phelps, Lloyd Vaughan, Robert Scott, R. W. Bobby Mitchell, Edwin Carter, Clifford Harvey, Billy Chenault, Vemell Mitchell, Fred C. Smith, Jimmy Rogers Captain, Floyd Flesh- man, Jr., Team, R. F. Jamer- son, T. C. Pankey, Sr., L. F. Wooldridge, Carter Martin, E.E. Agee, J. A. Conner, Jr. E. R. Ferguson, Mrs. Lloyd Hudson, William A. Hunter Captain, Marshall Goin, Mrs. Elliott Torrence Captain, Barb a r a Caldwell Team, Mrs. George F. Abbitt, Jr., John Hall, Mrs. Ellen Jamerson, Mrs. Newton Jenn ings, Kitty Lou OBrien. For Evergreen Captain, Rev. V. L. Hudson Team. Rev. W. H. Elder, Gleen Martin, Roy Moore Mrs. J. K. Hamilton, Aulden Roach, Peyton Harvey, Rosa Mae Wooldridge, J. T. Paulette. For Spout Spring Captain, Mrs. Nell D. Walton, Team, Mrs. Kenneth Jamerson, Mrs. D. H. Cyrus, Mrs. Allen Torrence, Mrs. Alice Layne, Rev. Thomas A. Waddill. For Pamplin Captain, Mrs. W C. Dudley, Team, R. K. Martin, Mrs. W. W. Fulcher, Mrs. J. H. Rosser, Mrs. William Hix, R. P. Lucado."}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "W. Fulcher, Mrs. J. <mark>H</mark>. Rosser, Mrs. <mark>William</mark> Hix, R. P. Lucado."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "W. Fulcher, Mrs. J. <mark>H</mark>. Rosser, Mrs. <mark>William</mark> Hix, R. P. Lucado."}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "Hubbard, Fitz Martin, Calvin <mark>H</mark>. Robinson, George F. <mark>Abbitt</mark>, Jr., T. W. Ferguson,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "Hubbard, Fitz Martin, Calvin <mark>H</mark>. Robinson, George F. <mark>Abbitt</mark>, Jr., T. W. Ferguson,"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.3, 803.87, 1897.63, 987.55], "bbox_id": "53884584c7", "file": "AppomattoxNewspapers_1926-1933a_0519.pdf", "page": 1, "text": "William Fulcher and George  - ------ Abbitt Covington were visitors ing school, in the home of W. H. Seay Sun- Elizabeth Oliver, age day. I four, died on January 2. She Miss Elizabeth Hancock, of was buried at J Huntington, W. V a, was a re- Elizabeth was the daughter of ent visitor at Mrs. Lillie Greg- Mr. and Mrs. R. H. Oliver, 01 orys. Spout Spring. Miss Mary Taylor Gills has j uds0n Kinney, 3r.,J eturned to Bedford to resume Baptist hospital in Lynchburg her duties in the high school where he was operatedpn there  Tuesday. He was taken sick tnere  Friday and his condition is re - N. E. Ridge, of Norton was a ag being serious guest last week-end in thehome  .  vi - a May If Miss Isabelle OBrien, who Little Mi Virginia May jives near Vera. Green, of Burkeville, has re-"}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "<mark>William</mark> Fulcher and George  - ------ <mark>Abbitt</mark> Covington were visitors ing"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "<mark>William</mark> Fulcher and George  - ------ <mark>Abbitt</mark> Covington were visitors ing"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1871.75, 1138.11, 2042.09, 1267.41], "bbox_id": "b31b431a2e", "file": "AppomattoxNewspapers_1952-1954a_0390.pdf", "page": 1, "text": "Those enrolled in the class are Mesdames J. W. Flood, John S. Grinels, C. R. Thomas, Willie A. McDearmon, Calvin H. Robinson, Bessie H. Caldwell, Stuart Farrar, William C. Dudley, Frank C. Dress er, Jerry A. Burke, David A. Christ ian, III S. S. Shouse, G. F. Abbitt, Jr. Thelma C. Caldwell, Charles S. Jenkins, W. D. Conner, H. A. Gur ney, L. L. Stanley and Misses Rosa Mae Wooldridge and Laura Mottley."}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "Calvin H. Robinson, Bessie <mark>H</mark>. Caldwell, Stuart Farrar, <mark>William</mark> C. Dudley, Frank C."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "Calvin H. Robinson, Bessie <mark>H</mark>. Caldwell, Stuart Farrar, <mark>William</mark> C. Dudley, Frank C."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1716.95, 347.65, 1883.19, 990.75], "bbox_id": "0c37e62dbf", "file": "AppomattoxNewspapers_1908-1909a_0273.pdf", "page": 1, "text": "The following jurors have been drawn for the June term. Criminal JUry2ndCourt ney C. HaiVey, Joel T. Morris, J. W. Coleman, Jr., W. Thos. Caldwell, Frank E. Jennings, Clayton T. Drinkard, John B. Chilton, H. M. Marshall, Thos. A. Guill, Rev. R. E. Redding, Harry W. Jenkins, A. T. Inge, Eldridge G. Cheatham, E- F. Pettinger, E. H. Carson, H. C. Wheeler, J. O, Davidson, Jas. W_ Childers, J. E. Burnette, R. E. Caldwell, Jr., W. J. Le- Grand, J. A. Garrett, Robt. M. Mitchell, S. W. Alvis. Petite Jury 3rd J, B. Wil son, S. T. Megginson, Jr., R. Curtis Haryey, Thos. H. Wright J. O. Robertson, L. J. Hatcher, R. S. Wheeler, Irby B. Wheeler. Grand Jurors 1stSam A. Ferguson, H. C. Babcock, R. F. Jamerson, J. Dillard Morris, T._ W. Odor, L. E. Smith, C. E. Car- son, T. A. King, C. E. Lewis, J. E. Martin, H. H. Stratton, R. W. Abbitt. o ------  Memorial Day Confederate Memorial Ex ercises at Appomatox Con federate Cemetery June 3rd, 330 p.m. Confederate Vete rans, Honary members, and speakers escorted to the dais by the daughters. U. D. C. ritual lead by jthe president of Appomattox chap ter, Mrs. N. A. Wagers. Decoratapn of soldiers, by the daughters. Decoration of graves by children of the confederacy. Salute the Flags, daughters, children, W. W. Veterans. SongBonny Blue Flag. AddressMrs. William Ca bell Flournoy, past president  historian Va. Div. Song, Dixie. Introduction o f oratorJ. A. Burke. Address P r o f . Fitzhugh Flournoy, Washington  Lee University, winner of U. D. C. scholarship Oxford, England 1928. Song, Old Folks at Home. America."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "J. E. Martin, H. <mark>H</mark>. Stratton, R. W. <mark>Abbitt</mark>. o ------  Memorial Day Confederate"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "J. E. Martin, H. <mark>H</mark>. Stratton, R. W. <mark>Abbitt</mark>. o ------  Memorial Day Confederate"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [486.68, 770.92, 649.78, 1371.81], "bbox_id": "6e9d6a0699", "file": "AppomattoxNewspapers_1933-1936a_0221.pdf", "page": 1, "text": "Oakville, May I5.1- Mrs. Carry Jarson was the guest of Mr. and ilrs. T. E Owen last Monday. Mrs. J. W. Scott, of Lynchbur .sited her daughter, Mrs, R. E. imith last week. M isses Idelle Ferguson and Mary .amerson spent last Tuesday night .viih Miss Madeline Bingham. Miss Cralk took the G. A. girls f Red Oak church on a picnic and ishing trip on the James at Bent Creek and Horseleys Pond last Sat urday. The girls whi went were Mice and Fannie Bass, Lillian, Kath line, Ruby Doss, Lila Wilcox, Hul- iah Wilkerson, Vernelle and Agnes Page, Frances Hamilton, Helen Mar- -in, Lula Mae Ayers, Irene Lucado, Tessalyn Moore. Other guests were Ellen Martin, Doyle Martin, Russ- 11 Moore, Miss Mary Jamerson and  ohn Walton. There was a Mothers Day pro gram at Mt. Comfort church on Sunday night. Mrs. O. W. Martin has returned home from Lynchburg, where she .ias been with her daughter, Mrs. U. B. Martin, who underwent an op eration at the Memorial hospital, ilrs. Martin is reported to be getting an nicely. Dinner guests of Mr. and Mrs. E. f. Marsh Monday night were Mrs. Thelma N. Carter, Mr. and Mrs. F. B Comer and daughter and Misses Mary Jamerson, Idelle Ferguson and Vivian Clark. Mr. and Mrs. Norton Phelps and Mr. and Mrs. Clayton Phelps, of Newport News spent last week end with their parents, Mr. and Mrs. Thomas Phelps. Mr. and Mrs. W. A. Owen were quests of Mrs. T E. Owen Sunday.  Miss Lillian Ferguson and Hunter Paris, of Lynchburg Visited his iunt, Mrs. Mollie Thorp Sunday. Miss Idelle Ferguson and Mary Jamerson spent the week end at their homes. Mr. and Mrs, Curry Abbitt, Mr, and Mrs. William Harvey and Miss Thelma Webb were dinner guests of Mr. and Mrs. C. E. Lewis of near Vera Sunday. Guests in the home of Mr. and Mis. E. J. Marsh Sunday were Mr. and Mrs. E. J Hillsman, F E Marsh, Mr and Mrs. Jack Marsh and John Apson. H. W. Phelps and family spent Sunday with Mrs. J. A. Burke. Misses Edythe Martin, Vivian Clark and John Walton were in Farmville Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "Mr. and Mrs, Curry <mark>Abbitt</mark>, Mr, and Mrs. <mark>William</mark> Harvey and Miss Thelma"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "Mr. and Mrs, Curry <mark>Abbitt</mark>, Mr, and Mrs. <mark>William</mark> Harvey and Miss Thelma"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1558.55, 690.01, 1727.16, 923.7], "bbox_id": "047c572787", "file": "AppomattoxNewspapers_1908-1909a_0519.pdf", "page": 1, "text": "Mr. and Mrs. W. D. Grigs, of Hopewell, were recent visi tors of Mr. and Mrs. S-  Evans. Robert Rose and Sonny  Wingfield, of Lynchburg, Were ed to W.  L. after the holi- Jdays.  V William Fulcher and George Abbitt Covington were visitors in the home of W. H. Seay Sun-1 day- ,  ! Miss Elizabeth Hancock, of Huntington, W. Va., was a re- I ,ent visitor at Mrs. Lillie Greg- lorys., .. . 7  Miss Mary Taylor pills has returned to Bedford to resume her duties in the high school there"}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "the holi- Jdays.  V <mark>William</mark> Fulcher and George <mark>Abbitt</mark> Covington were visitors in"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "the holi- Jdays.  V <mark>William</mark> Fulcher and George <mark>Abbitt</mark> Covington were visitors in"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [397.7, 543.34, 544.42, 1318.66], "bbox_id": "40edc02c77", "file": "AppomattoxNewspapers_1971-1973a_0435.pdf", "page": 1, "text": "Mr. and Mrs. Vernon Beas ley of Chicago and Tye Beasley of Appomattox are spending some time with Mrs. Grover Beasley, Sr. Mr. and Mrs. j Grover Beasley, Jr. and Mrs. j Claude Hamlett and Brenda j were dinner guest Sunday of Mrs. Beasley. Mrs. Holly Cawthorn, Mrs. Rachel Cawthorn and Mrs.  Raymond Harris visited Mrs. Addie Jenkins, Mrs. Ber Abbitt, Mr. and Mrs. H. W.J Jenkins, Mrs. Grover Beasley, Sr. and Mrs. Charlie Bagby Sunday afternoon. Mrs. Emma Lemon had lunch with Mrs. C.R. Banton Friday. Mr. and Mrs. Carlton Smith and family of Richmond spent the week end with Rev. and  Mrs. Otis Smith. Heath and Bryan Smith are spending the week with their grandparents. We are very sorry to hear Mr. Dewitt Beasley is a patient in the Eye Hospital in Richmond. We wish for him a speedy recovery. Mr. and Mrs. W.H. Wing field, Miss Julia Wingfield and Mr. and Mrs. bill watson and William attended the Wingfield reunion Sunday at Thaxton. Mr. Thomas Woodall, Mrs. Clem Woodall, Mr. and Mrs. L.L. Webb, Miss Joyce Webb, Miss Odell Webb, Mrs. Edwin Schampel, Mr. and Mrs. James Maxwell, Pat and Lonnie, Kim aud Becky Cook, Mrs. M.L. Covlngtonand Mr. and Mrs. Kenneth Deaner and girls visited Mrs. Charlie Bagby last week. Mrs. Bagby hasnt been well for a few weeks. We are sorry to hear Mrs. J.L. Torrence and Mrs. Robert Coleman are on the sick list. We hope they may soon be well. Saturday afternoon Mrs. Peggy Hartness and Mrs. Martha Banton of Phenix and Mrs. Maude Deaner of Lynch burg visited Mrs. C.R. Banton. Mrs. Grover Beasley, Sr., Mr. and Mrs. Vernon Beasley, and Tye Beasley visited Miss Della Inge, Mr. Bill Inge and Mrs. L. H. Watson and girls Monday. Mr. Lawrence Woodson is a patient in the Virginia Baptist Hospital. We wish him a very speedy recovery. Mr. and Mrs. Kenneth Deaner of Richmond spent Saturday with the W.H. Wingfields. Visiting Mrs. C.R. Banton Sunday were Misses Shirley, Hilda and Phyliss Casey all of Lynchburg. Mr. and Mrs. Cornelious"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Addie Jenkins, Mrs. Ber <mark>Abbitt</mark>, Mr. and Mrs. <mark>H</mark>. W.J Jenkins, Mrs. Grover"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Addie Jenkins, Mrs. Ber <mark>Abbitt</mark>, Mr. and Mrs. <mark>H</mark>. W.J Jenkins, Mrs. Grover"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [605.04, 354.39, 789.83, 1319.83], "bbox_id": "da9c51349d", "file": "AppomattoxNewspapers_1939-1943a_0298.pdf", "page": 1, "text": "Miss Elma Giles spent Saturday J night with Miss Thelma Smith. Mr. and Mrs. Eddie Gunter and Mrs. Jim Gunter called in the home of Mrs. J. A. Smith Sunday even ing. Mr. and Mrs. Jack Smith and J sen spsnt Sunday in the home of I Mr. and Mrs. Alfred Doss, of Con-1 cold. 1 Mr. and Mrs. F. Custis Gordon, of I Washington were week-end guests I of relatives in the county. 1 Leslie Gordon, Jr., of Camp j j Meade, Md., spent the week-end at his home here. Misses Louise and Doris Tolley, of Pamplin spent Weanesday with Miss es Martha and Ruth Lewis. Miss Alma Schmidt and Miss Fs- telle Vaughan visited in the home of Mrs. G. W. Lewis recently. Miss Isabel Ranson spent Sunday in Richmond. M 33 Virginia Pitg.r.iT accom panied her sister, Mrs. Albert Baird to Buckingham for the week-end. Mrs. B. R. Markham and daugh ter, of Lynchburg, are visiting her sister, Mrs. L. C. Shearer Mr. Shearer will spend week in Lvr chburg, attending the Young j Peoples Assembly, where he will be a member of the faculty. Jdiss Rachel Harvey and Miss Eleanor Carson visited friends in Altavista Sunday. Miss Lola Moore spent the week end in Farmville. Curry Harvey, of Richmond, is spending this week of his vacation with his parents, Mr. and Mrs, J. J. Harvey. Mr. nnd Mrs. Arthur Torrence, j  of Lynchburg, and Mr. and Mrs.  Paul Cawthorn visited Mrs. Eva Cawthorn Sunday. Miss Eleanor Carson was a guest of Miss Rachel Harvey during the week-end. Mr. and Mrs. Jimmie W. Harvey, of Lynchburg visited Mr. and Mrs. Lytton Harvey Sunday. Miss Mary Avis Brown, who will be married this month to Carroll Smith, of Charlottesville, and Mrs. Clarence Furney, of Radford, a re cent bride, were entertained last evening by Mrs. William Wotod Burke, at her home on Wembly Lane. Bridge was played at four tables. Wedding ilces and small cakes .were served and there were prizes for high and low scores and for the honorees. Louie Ciola, of Norfolk, spent the week-end in Appomattox. i Mrs. Alpha Higgenbotham left Tuesday for a trip to Los Angeles, California. Mrs. L. W. Carter spent the week end in Disputants. Buster Cundiff, of Richmond, vis ited in the home of his sister, Mrs. G. F. Abbitt, recently. Mrs. W. H. Miller, who has been dsiting the George F_. Langrans, left last Ihursday. for Washington. Mr. nd Mrs. W.H. Shirey, of  pout Spring, celebrated their 46th wedding anniversary Thursday. Joe Ferrell, George Shirey and Miss Virginia Shirey spent Thurs day in Richmond. Andrew Go -y celebrated his 1st -irthday Wednesday. Mrs. Elizabeth Eakin, Mrs. M. T. Parrish and daughter, of Lexington - ere visitors in Appcma tox Fri-"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "sister, Mrs. G. F. <mark>Abbitt</mark>, recently. Mrs. W. <mark>H</mark>. Miller, who has been"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "sister, Mrs. G. F. <mark>Abbitt</mark>, recently. Mrs. W. <mark>H</mark>. Miller, who has been"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [115.7, 313.91, 275.86, 809.74], "bbox_id": "a98b2a5ed4", "file": "AppomattoxNewspapers_1926-1933a_0554.pdf", "page": 1, "text": "Mias Donzella George, of Irvington, Mesdamea Tom R. Pugh, Jr., and Stanley Bald win, of Pamplin, visited Miss Mary Taylor Gills Tuesday. R. Edward OBrien is at tending the Farmers Institute at Blacksburg thisweek. Mrs. D. A. Connor had the misfortune to break her arm this week. J. C. Davidson entertained a group of friends over the week-end at Hemlock Hut, a cabin near the Peaks of Ot ter. Mrs. L. B. Pittman, of Richmond, and Mrs. R. E. Al- vis were chaperons. The par ty included Misses Margaret Pittman, of Richmond, Kate OBrien, Cornelia Gills, Emily Harvey, Catherine Gills, Phoebe OBrien, Mary Taylor Gills. Lrrle Pnitersoc and George nd Watt Abbitt. cal vin Robi-son, William Burke, Eddie Coffman, Chas. Parris, Jr., and Daniel Jennings. Misses Catherine Gills, Eleanor Harwood and Kate and Isabelle OBrien leave Saturday for a weeks stay in Baltimore and Altoona, Pa H. W. McKinney had an em ergency operation for appen dicitis Tuesday morning. Charles Crawley had the misfortune to be accidentally struck with a golf club and is suffering from a broken rib, as a result. Mrs. H. B. Foster and her two children are visiting Mrs R. A. Steffans."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "and George nd Watt <mark>Abbitt</mark>. cal vin Robi-son, <mark>William</mark> Burke, Eddie Coffman, Chas."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "and George nd Watt <mark>Abbitt</mark>. cal vin Robi-son, <mark>William</mark> Burke, Eddie Coffman, Chas."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1178.18, 717.49, 2463.74, 1165.98], "bbox_id": "51020751eb", "file": "AppomattoxNewspapers_1943-1947a_0350.pdf", "page": 1, "text": "LIBERTY BAPTIST CHURCH Appomattox Restaurant ing her daughter, Mr of Richmond. Miss Constance Fl.p, mond was home for th, Among those from here attend ing the inauguration in Richmond Wednesday were Mr. and Mrs. G. K? Abbitt, Jr., Mr. and Mrs. W. M Abbitt, Mr and Mrs H. Y. Spen cer, Mids Frankie McKinney, Lt. Chm. C. H. Swing, H. G. Johnson, Grover Smith, Senator and Mrs. Has. T. Moses, Judge and Mrs. J. Flood, Mrs. F. C. Dresser, Mr. apd Mrs. R. M. Mann, Colt and fts William A. Coleman, Mr. and Mrs. J. A. Burke, Mr. and Mrs. Charles Crawley.  Mr, and Mrs. Jerry Smith, of Ashland have announced the birth Of a son, born Monday, Jan. 14. Ifrs. Smith is the daughter of Mr. ahd Mrs. Clarence Evans, of Ap pomattox. ill Mrs. L. L. Gayle spent several l.diys last week in Richmond. M rs. W. P. Gills continues ill at her home near here. - Mrs. D. W. Dinkins and son, Em- mitt, of Lynihburg were visitors in Appomattox Wednesday. Miss Helen- Mitchell is recover ing fro mav recent illness. The P.-T. A. will meet Tuesday evening, Janzary 22 at 8 oclock, iii the county library.  Mr. and Mrs. T. M. Trent and Mrs. A. H. Gregory .left Tuesday for Remlik, where they will make their home."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "and Mrs. W. M <mark>Abbitt</mark>, Mr and Mrs <mark>H</mark>. Y. Spen cer, Mids"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "and Mrs. W. M <mark>Abbitt</mark>, Mr and Mrs <mark>H</mark>. Y. Spen cer, Mids"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2285.76, 956.35, 2432.51, 1795.33], "bbox_id": "153f6aaff0", "file": "AppomattoxNewspapers_1943-1947a_0225.pdf", "page": 1, "text": "James Carter J r D. Ferguson J. D. Ferguson, Jr. John Hall Elliott Pillow . j Arthur Blackwell Richard F. Burke Carl A. Collins Ned Stanley Thomas Jamerson James E. Cheatham Robert B. Haley, Jr. James E. Cheatham Ray Ferguson Warren Jones Billy Reynolds Curtis Mayberry James Mayberry Edwin Lucado Billy Southall Hubert S. McCormick Robert L. McCormick Otis McCormick Clyde C. McCormick Bates Turner Edward Harvey Herman Harvey Jack Baker Randolph Evans Charlie Smith H. B. Cralle, Jr. Shearer B. Roberta n Lloyd Nolley Lewis Carter Martin C. H. Swing C. G. OBrien Kermit Paulett James Spiggle Ralph Coleman H. B. Cralle, Jr. Charles F. James, Jr. Thomas Kern Russell Martin Ralph Coleman Emory Martin John Moore Herman Harvey Maynard G. OBrien Hiram L. OBrien Charlie Williams Sam Cawthorn Jack Baker Edward Harvey George W. Bass Curtis L. Mitchell Jack Baker Herman Harvey Robert A. Covington, Jr. William J. Covington Curtis W. Harris Norman H. Jones H. B. Cralle, Jr. Jack Baker Hugh Clapip Randolph Evans Daniel A. Clapp W. D. Patterson Jennings Conner William Roy Robertson Herbert Abbitt Kermit Paulett Joe Paulett Rufus Coffey A. R. Harwood, Jr, V. Arnold Godsey John A. Godsey James Perry Burton K. F. Godsey Newton Jennings Lee M. Wright Vincent W. Collins Howard E. Torrence John Will Hamilton Shelby. Kennard Gills Gt orge W. Bas Jack Baker Kenneth L. McClenny Kenneth L. McClenny Jny C. Tashner"}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "D. Patterson Jennings Conner <mark>William</mark> Roy Robertson Herbert <mark>Abbitt</mark> Kermit Paulett Joe Paulett"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "D. Patterson Jennings Conner <mark>William</mark> Roy Robertson Herbert <mark>Abbitt</mark> Kermit Paulett Joe Paulett"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2068.32, 185.25, 2167.17, 710.27], "bbox_id": "4d6037d7b2", "file": "AppomattoxNewspapers_1974-1975a_0214.pdf", "page": 1, "text": "Hilda Charles W. Gwendolyn Ernestine Eva May Milton Edith TrowerW. Betty Jane Orange Velvia M. William J. William Fannie F. George Abbitt H.T., Jr. J. E., Mrs. J. Everett Bill Catherine Dan Lee Annie P. Carrie B. FrankE. J.H . Rachel R. Roy M. Robert Lee Robert Lee, Mrs. Clyde Glenn E. InaC. Rosa Lee H. A. Helen Ronald Lee Ronald Mrs. Freda Genester Robert Acree T.R. Clarence E. Leslie Katherine A. Cecil D. D.B. Elizabeth M. Flora B. Georgie F. Gloria T. Rudolph John H. Lucile A. PER"}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "Velvia M. William J. <mark>William</mark> Fannie F. George <mark>Abbitt</mark> H.T., Jr. J. E.,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "Velvia M. William J. <mark>William</mark> Fannie F. George <mark>Abbitt</mark> H.T., Jr. J. E.,"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1694.63, 398.86, 1869.18, 1397.73], "bbox_id": "4c87e77ab3", "file": "AppomattoxNewspapers_1954-1955a_0420.pdf", "page": 1, "text": "Hello Readers! The Senior Class and the Ninth Grade spent Tuesday on a Field Trip, visiting the Lynch burg Foundry at its Open House. The guided tour of the plant was very educational. Parts are made for big machineryincluding tractors, water pipes and the Long Manufac turing Companys needs. We saw the molten metal being poured into molds made at the foundry welders, drilling engineers, the precision in struments used to measure the finish ed products and the strength of the products. To see approximately 700 workers on the job was also interest ingeach doing his assigned duty. Cooperation and safety were witness ed by us. Mrs. O. W. Smith and Mrs. H. P. James accompanied the fifty students on this trip. Today in Assembly we shall see the installation of Student Council officers and hear Representative Watkins M. Abbitt speak to the en tire student body. The N. F. A. has elected the fol lowing officers President, Joe Robinson Vice-pres., Bobby Booker Secretary, Samuel Scruggs Treasurer, Milton Minnifield Reporter, Herbert Williams Chaplain, Raymond Lawing Song leader, James Williams Historian, Sidney Watts Parliamentarian, William Bruce. The N. H. A. held its regular meeting on Monday in the Home Economics Building. Effie McCoy and Celestine Chambers made a re port of the State Convention which was held at Virginia State College on June 14-17, 1955. The Sixth Grade with Mrs. T. W. Hamlet, Instructor, has begun its second unit of work in social studies on How Early Man Lived and Learned. Many pictures have been collected on early man and much ma terial also. Miss H. B. Stephens reports that 28 students from the Third Grade took the Salk Vaccine shot. This class is progressing nicely in its studies. The Fourth Grade, under Mrs. C. D. Beasley, has been very busy dur ing their Art Period making music books. They enjoyed this activity- very much. Gilbert L. James, Jr., won the first prize for having made the best book. Second prize was won by Dorothy Austin, and Third Prize was won by Augusta McCoy. Each Friday the class looks forward to new activities in the art workbook. The Seventh Grade, under Mrs. T. M. Harris has elected the following officers President, Helen I. Pretson Vice-pres., Jenny M. Burns Secretary, Faye R. Hubbard Asst. Sec., Daisy L. McCoy Treasurer, Margaret Haskins Reporter, Remus A. Trent. Until next week, our thought Glorious indeed is the world of God around us, but more glorious the world of God within us. There lies the Land of Scfig there lies the poets native land. C afeteria Menu Monday, Oct. 3.- Steamed hot dogs, green peas, mashed potatoes, bread, butter, milk, applesauce. Tuesday, Oct. 4.- Saute Bologna, cole slaw, brown beans, bread, but ter, milk, fresh prunes. Wednesday, Oct. 5.- Stewed chick en with rice, string beans, bread, butter, milk, apple cobbler. Thursday, Oct. 6.- Macaroni and cheese, breaded tomatoes, turnip greens, bread, butter, milk, fruit jello. Friday, Oct. 7.- Vegetable- beef soup, cheese and peanut butter sand wiches, bread, butter, m ilk."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Historian, Sidney Watts Parliamentarian, <mark>William</mark> Bruce. The N. <mark>H</mark>. A. held its regular"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Historian, Sidney Watts Parliamentarian, <mark>William</mark> Bruce. The N. <mark>H</mark>. A. held its regular"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [477.86, 1090.69, 646.57, 1149.69], "bbox_id": "010d2433b8", "file": "AppomattoxNewspapers_1949-1952a_0446.pdf", "page": 1, "text": "Among those from here who left Wednesday for a soa hunt in King William County were J. W. Flood, W. M. Abbitt, G. F. Abbitt, Jr. Dr. C. H. Swing, James H. Lucado, G. B. Buchanan and Sam Conner."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H", "H"], "snippet": "M. Abbitt, G. F. <mark>Abbitt</mark>, Jr. Dr. C. <mark>H</mark>. Swing, James <mark>H</mark>. Lucado,"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H", "H"], "snippet": "M. Abbitt, G. F. <mark>Abbitt</mark>, Jr. Dr. C. <mark>H</mark>. Swing, James <mark>H</mark>. Lucado,"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1419.37, 374.25, 1585.2, 1615.54], "bbox_id": "3e8c30fbc6", "file": "AppomattoxNewspapers_1926-1933a_0043.pdf", "page": 1, "text": "Th-i county fair three weeks off a for it? The white schools are all open in running order. Mrs. J. W. Carter, has the Wildway to Liberty Chapel school wagon again this yearThornton Car ter has the one from Wildway to Vera. Julian Grow, who has been working in Lynchburg all mer, is back home. Mrs. Grow, of Roanoke, visiting her horne people. Messrs. Jeff Kinney and R. A. Steffans who went through the terrible storm at Miami, Fla., and escaped unharmed, are visit ing their parents, Mr. and Mrs. H. W. Kinney, for a few days, while conditions are improving in that water-soaked country they tell some thrilling incidents of what occured during those twelve long hours of howling wind and driving rain. Miss Susie and Olivia Booker, who have been visiting their parents, Mr. and Mrs. John Booker, at Tower Hill, have re turned to Richmond. George Booker, of Tower Hill, is attending school at Pamplin. Mr. John Beale, who was car ried to a Lynchburg hospital, was brought back last week. We are sorry to learn Mr. Beale is not improving as his friends would wish. Mrs. Lou Ferguson who has been an invalid for more than a year had a bad spell Saturday but is better at this writing. Mr. John Everette Childers, who has been suffering from an infected hand is improving right along, now, we are glad- to re port. Mrs. Jerome Menefee left for Richmond Saturday, to spend the winter With her son, J. T. Menefee and family. Miss Christine Garrett is at tending school at Harrisonburg. Messrs. Watkins and George Abbitt haver gone to Richmond to attend college, and Miss Dora Abbitt is attending A. A. H. S. at Appomattox Mrs. Mayne, who has visiting relatives here, left for Washing ton last week. The farmers are busy cutting and housing tobaccothey are antic pating a visit from Jack Frost in the near future. Sir Leon Levison, president of the International Christian He brew Alliance, in a speech in Toronto, declared that in Hun gary, there are at least forty thousand Jews, who believe in Christ in Poland, thirty-five thousand awhile in Norway, Den mark and Sweeden, fully four- fifths of the entire Jewish popu lation believe in Him. Mr. Stanley Baldwin, Prime Minister of Britain, said recent lyMany forces of good and of evil were loosed in 1914, forces that were not bound at the time of the Armistice and there is a strange leaven at work, today, among all the nations of the world. The Gentile Times ended in 1914. Mr. Baldwin is beginning to see some of the signs of the new dispensation Christs kindom now being ush ered in. Mr. and Mrs. J. R. Booker announce the marriage of their daughter, Marie Susie to Mr- William Dinguid Christian, on Saturday, September 25th, at Washington, D. C- These young people were born and raised in this neighborhood and have a host of friends who wish them God Speed, blessings and happi ness through life. They will be at home at 80 Ridgeway Terrace, Cumberland, Md."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "college, and Miss Dora <mark>Abbitt</mark> is attending A. A. <mark>H</mark>. S. at Appomattox Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "college, and Miss Dora <mark>Abbitt</mark> is attending A. A. <mark>H</mark>. S. at Appomattox Mrs."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1350.19, 941.69, 2001.5, 1381.67], "bbox_id": "e028af5b57", "file": "AppomattoxNewspapers_1908-1909a_0333.pdf", "page": 1, "text": "REPUBLICAN BUGABOOS Henry W. Anderson, fore- bakery size yeast, 2ndMra. Hfc -C. Babcock 50c 3rd, Mrs. m 03 t Republican boss, Lieuten- J. E. Dinwiddie 25c. Plate of ant-Cblonel in Red Cross, and imlls, 1stBessie Zimmerman a lif elong rsident of Virginia, 75c 2nd, Mra. Bessie Foster has a d v e rtid to the world by I v S t  T M radio and, through the prees 50c. Plate of soda biscuits, that his nathre Virginia is the mg ground. Quite a Evergreen Nov. 22nd, 10 1stBessie Zimmerman 75c worst govertied state in the d attended the funeral  J? to,.3 p , 2nd, Miss Lena Bates 50c. western hemisphere and with many floral designs were 2Sth 9 a Cheese Straws, 1 s t - Mrs. Bes- the most tyrannical form of by friend, A l t a  t  m r t . d e r of the time  Foer 50 2nd, Mm a Uevemmen. ,ny AnIe Son any of our people attend- at my office in The Bank of W. Smith 25c. ie funeral of Mr. Ben Cole- Appomattox.  Class 2 Cakes, pies, etc You save 5 penalty by p  t cake, 1 st Mrs. W. L. , . , paying your taxes on or before ase leaving us one by one. December 5 th. tom to Rev. and Mrs. H. L.  Yours very truly, ves a son. R L. BURKE, Co. Tréas. Ira. Lillie Moses had ps her ------ o  - sk-end guests, Mrs. Sue Curtis Brown rey and daughter, Miss Lil- Uied at his home near Holly-1 Stratton 75c. iarvey.  wood on Oct. 20th. tecent visitors of Mrs. H. was the son of William Henry Mrs? E. M Stratton 50c. Devil pictured as an octopus reach- ferry were Miss Anna Price pd Ruth Brown,Who arq wide- cake, 1stMrs. W. H. Cpnnor -ing out to destroy Virginia and Mary Lizzie Abbitt and ly and prominently known citi- 75c. 2 nd, Estelle Dickerson to overthrow prohibition, in Mike Jones, of Lynch- zens of the county. He was 50c. Chocolate cake, 1 st Virginia. the oldest of six children, be- Mrs. Jhck Caldwell 75c 2 nd, Yet Tálhiiáihy Hall, in fee Bible Study Circle met ing 21 years of age. He was af- Mrs. Rqb Irby 50c. Derorat- reaiity a k 6 w York City poli che home of Mrs. R. D. hinted all his life,, but ed cake, 1st Mrs. H. B. Mar- tical club and in no way a na- iwin Tuesday afternoon, he bore his suffering with pa- shall 75c 2nd, Mrs. H. C. tional organization. R. R. Davis was leader tience and was never heard to Babcock 50c. Apple pie, 2 - ing as her subjéct the 5th murmur. All that medical ndMra. H. B. Marshall 50c. pter of Acts, which was skill and loving hands could do Peach pie, 2ndMra. H. B. lied and discussed. The WAS done for him. Marshall 50c. Chess pie, 1 st John Ji Raskob has been tess served a delightful Wie will never say good-bye in Mra. H. B. Marshall 75 c 2 nd dWfrihed as the political Satan"}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "tecent visitors of Mrs. <mark>H</mark>. was the son of <mark>William</mark> Henry Mrs? E. M"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "tecent visitors of Mrs. <mark>H</mark>. was the son of <mark>William</mark> Henry Mrs? E. M"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2245.69, 1279.28, 2409.94, 1316.88], "bbox_id": "ce8578d22c", "file": "AppomattoxNewspapers_1933-1936a_0473.pdf", "page": 1, "text": "Mr. and Mrs. W. H. Sanders, Billy and Marion Sanders, of Rich mond are vhdting Mrs. William Harvey and Mrs. Curry Abbitt."}, "highlight": {"text": {"matched_tokens": ["H", "William", "Abbitt"], "snippet": "Mr. and Mrs. W. <mark>H</mark>. Sanders, Billy and Marion Sanders, of Rich mond are vhdting Mrs. <mark>William</mark> Harvey and Mrs. Curry <mark>Abbitt</mark>."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William", "Abbitt"], "snippet": "Mr. and Mrs. W. <mark>H</mark>. Sanders, Billy and Marion Sanders, of Rich mond are vhdting Mrs. <mark>William</mark> Harvey and Mrs. Curry <mark>Abbitt</mark>."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [139.7, 330.45, 314.48, 1419.99], "bbox_id": "bd44b77e73", "file": "AppomattoxNewspapers_1926-1933a_0553.pdf", "page": 1, "text": "Miss Donzella George, of Irvington, Mesdames Tom R. Pugh, Jr., and Stanley Bald win, of Pamplin, visited Miss Mary Taylor Gills Tuesday. R. Edward OBrien is at tending the Farmers Institute at Blacksburg this week. Mrs. D. A. Connor had the misfortune to break her arm this week. J. C. Davidson entertained a group of friends over the week-end at Hemlock Hut, a cabin near the Peaks of Ot ter. Mrs. L. B. Pittman, of Richmond, and Mrs. R. E. Al- vis were chaperons. The par ty included Misses Margaret Pittman, of Richmond, Kate OBrien, Cornelia Gills, Emiiy Harvey, Catherine Gills, Phoebe OBrien, Mary Taylor Gills. Parle Patterson and George nd Watt Abbitt. Lai vin Robi son, William Burke, Eddie Coffman, Chas. Parris, Jr., and Daniel Jennings. Misses Catherine Gills, Eleanor Harwood and Kate and Isabelle OBrien leave Saturday for a weeks stay in Baltimore and Altoona, Pa H. W. McKinney had an em ergency operation for appen dicitis Tuesday morning. Charles Crawley had the misfortune to be accidentally struck with a golf club and is suffering from a broken rib, as a result. Mrs. H. B. Foster and her two children are visiting Mrs. R. A. Steffans. Miss Bettie Morris has re turned from the hospital in Lynchburg, much improved. Mr. and Mrs. Jeff Kinney are spending this week-end in Baltimore, being accompanied us far as Washington by Dr H. B. Foster, of Snow Camp, N. C. Mr. and Mrs. A. B. Abbitt of Newport News, are spend ing a few days at their Vera home this week. Mrs. E. H. Huddle, of Roan oke, spent the week with her sister, Mrs. W. D. Anderson. Mrs. C. A. Anderson . left Friday to visit her daughter, Mrs. John R. Crabtree of Taze well. Mrs. Annie Hiatt and son Clarence, of Lynchburg, visit ed Mr. and Mrs. W. D. Arider son Wednesday. Mr. and Mrs. C. L. Carter, of Tower Hill, were guests at Wayside Cottage Sunday. Mrs. Jack Powell and chil dren, of Reedsville, N. C., are visiting Rev. R. E. Redding. Little Lottie Martin cele brated her fifth birthday Sun day. Miss Virginia Beard is visit ing her sister, Mrs. Lewis Fer guson. Misses Katherine McElroy, of Wise and Estelle Ironmon ger, of Korktown, are visiting Miss Corinne Hancock. Miss Adeline Dodd, of Ped- lar Mills, is visiting her sister, Mrs. G. D. Coffey.  Mrs. Annie Pretldw fyas been very sick since Saturday. Miss Virginia OBrien, of Lynchburg, is visiting at Mrs. W. B. Caldwells. Miss Ella Drinkard, of Lynchburg, is a guest in the j home of her nephew, A. R.  Harwood. !"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "and George nd Watt <mark>Abbitt</mark>. Lai vin Robi son, <mark>William</mark> Burke, Eddie Coffman, Chas."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "and George nd Watt <mark>Abbitt</mark>. Lai vin Robi son, <mark>William</mark> Burke, Eddie Coffman, Chas."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [110.91, 301.65, 273.73, 798.42], "bbox_id": "1b889e7297", "file": "AppomattoxNewspapers_1908-1909a_0555.pdf", "page": 1, "text": "Miss Donzella George, Irvington, Mesdames Tom R. Pugh, Jr., and! Stanley Bald win, of Pamplin, visited Miss , Mary Tayldr Gills Tuesday. R. Edward OBrien is at tending the Farmers Institute at Blacksburg thisweek. Mrs. D. A. .Connor had the misfortune to break her arm this week. , J. C. Davidson entertained a group of friends over the week-end at Hemlock Hut, a cabin near the Peaks of Ot ter. Mrs. L. B. Pittman, of Richmond, and Mrs. R. E. Al- vis were chaperons. The par ty included Misses Margaret Pittman, of Richmond Kate OBrien, Cornelia Gilte, Emily Harvey, Catherine Gills, Phoebe OBrien, Mary Taylor Gills. Larle Patterson and George nd Watt Abbitt. cal vin Hobi son, William Burke, Eddie Coffman, Chas. Parris, Jr., and Daniel Jennings. Misses Catherine Gills, Eleanor Harwood and Kate and Isabelle OBrien leave Saturday for a weeks stay in Baltimore and Altoona, Pa. H. W. McKinney had an em ergency operation for appen dicitis Tuesday morning. Charles Crawley had the misfortune to be accidentally struck with a golf club and is Buffering from a broken rib, as a result. Mrs. H. B. Foster and her two children are visiting Mrs. R. A. Steffans."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "and George nd Watt <mark>Abbitt</mark>. cal vin Hobi son, <mark>William</mark> Burke, Eddie Coffman, Chas."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "and George nd Watt <mark>Abbitt</mark>. cal vin Hobi son, <mark>William</mark> Burke, Eddie Coffman, Chas."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1908.17, 619.8, 2078.39, 1045.94], "bbox_id": "c7f0a434fa", "file": "AppomattoxNewspapers_1952-1954a_0544.pdf", "page": 1, "text": "Ivey Holland, chairman Mrs. Otis Dewberry, Mrs. T. M. Richardson, Mrs. Jessie Carwile.Mrs. H. S. Jones, Jr. Horticulture Mrs. Newton Jen nings, chairman Mrs. Marvin Hern- call, Mrs. H. D. Fulks, Mrs. Jessie Carwile, Mrs. T. M. Richardson, Mrs. K- C. Gregory, Mrs. Mitchell Lewis, Mrs. R. J. Franklin. Hospitality Mrs. J. C. Caldwell, chairman Mrs. J. A. Burke, Mrs. Mildred Alvis, Mrs. William Bigoney, Miss Carolyn Carlton, Mrs. George Langran, Mrs. Walter Dresser, Mrs Amy Glenn, Mrs. C. F. James, Mrs. H. Y. Spencer, Mrs. George Abbitt, Jr. Mrs. C. S. Jenkins, Mrs. J. E. Sears, Mrs. Walter Ferrell, Mrs. A. R. Gordon, Mrs. H. E. Kerf Mrs. B. G. Anderson, Mrs. H. P. Wood- son, Mrs. H. A. Gurney, Mrs. W. P. Ferrell, Mrs. Schuyler Marshall, Mrs. H. S. Jones, Sr. Mrs. J. D. Mc- Dearmon. Junior Garden Club Miss Flora Belle Williams, chairman Mrs. K. C. Gregory, Mrs. Mitchell Lewis, Mrs. Mildred Alvis, Mrs. Herman Schweizer. Program Mrs. S. S. Shouse, chair man Mrs. H. D. Fulks, Miss Beulah Ferrell. Publicity Miss Beulah Ferrell, chairman Mrs. F. K. Mabley, Mrs. J. W. Smith, Mrs. Robert McIntyre, Mrs. Henry Barger, Mrs. R. V. Lef- fers. Judges Hospitality Mrs. L. Craw ley, chairman Mrs. H. Y. Spencer, Mrs. J. D. McDearmon, Miss Beulah Ferrell."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "C. F. James, Mrs. <mark>H</mark>. Y. Spencer, Mrs. George <mark>Abbitt</mark>, Jr. Mrs. C. S."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "C. F. James, Mrs. <mark>H</mark>. Y. Spencer, Mrs. George <mark>Abbitt</mark>, Jr. Mrs. C. S."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1775.98, 1165.76, 1952.87, 1406.4], "bbox_id": "d560ac14fd", "file": "AppomattoxNewspapers_1960-1962b_0196.pdf", "page": 1, "text": "Harvey Sr., 82, a farmer died at 545 J?. M, Tuesday at his home, Rt. 4, Appomattox. Bdm in Ap pomattox County Oct. 28, 1877, he was the son of William Clifton and Mildred Walker  Harvey. He was a member of Red Oak Baptist Church where he was a deacon and past treasurer. Survivors are his wife, Mrs. Lola Abbitt Harvey, one daughter, Mrs. H. M. Crowder of Lynchburg two sons, Jesse J. Har- ygy. Jr. of Lynchburg and B. Curry Harvey of Appomattox ue brother, Lytton Harvey of Appomattox one sister, Mrs. W. J. Walton of Hamp- tton five grandchildren. Funeral services will be conducted at 11 A. M. Thursday from Red Oak Baptist Church with burial in Liberty Ceme tery. The body will be at Roibinson Funeral Home until 930 A. M. Thursday when it will be placed in the church."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "his wife, Mrs. Lola <mark>Abbitt</mark> Harvey, one daughter, Mrs. <mark>H</mark>. M. Crowder of Lynchburg"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "his wife, Mrs. Lola <mark>Abbitt</mark> Harvey, one daughter, Mrs. <mark>H</mark>. M. Crowder of Lynchburg"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1098.91, 319.85, 1278.41, 782.24], "bbox_id": "28171bf64c", "file": "AppomattoxNewspapers_1952-1954a_0132.pdf", "page": 1, "text": "Funeral services for Mrs. Stella Abbitt Wilson, formerly of Hixburg were held at the Glasgow Presbyter ian Church in Rockbridge County Monday afternoon, with interment the Glasgow Cemetery. Mrs. Wilson, who recently moved from Hixburg to Glasgow, died sud denly of a heart attack at Virginia Baptist Hospital Saturday after noon. She was the wife of Mr. James Blair Wilson and is survived by one daughter, Mrs. Douglas McClure. Mrs. Wilson was born Decembe 14, 1886, the daughter of William Chatham and Martha Jones Abbitt of Appomattox County. She attend ed the schools of Appomattox Coun ty, Jeter Institute of Bedford, and the State Teachers College of Farm ville. Tjj funeral services were con ducted by Dr. Twyman Williams, pastor of Appomattox and Hixburg Presbyterian Churches, assisted by the Rev. C. P. Whitley, of the Pres byterian- Church of Glasgow and the Rev. John H. Buchanan, of the Glasgow Baptist Church. Active pall bearers were Benjamin C. Harvey Jesse Harvey, Jr. George Abbitt Terry, Joseph B. Terry, Henry T. Terry, Jr., nephews of Mrs. Wilson, and Buel Harmon. She is also survived by two sis ters, Mrs. Jesse Harvey, of Oak ville and Mrs. H. T. Terry, of Pam plin three brothers, James Curry Abbitt, of Oakville Harry W. Ah bitt, of Wilson, N. C., and G. D Abbitt, of Collingswood, N. J., anr a number of nieces and nephews. She was an active member of tho Mathews Baptist Church, and was al- ways interested in the activ?tis of the church and community."}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "1886, the daughter of <mark>William</mark> Chatham and Martha Jones <mark>Abbitt</mark> of Appomattox County. She"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "1886, the daughter of <mark>William</mark> Chatham and Martha Jones <mark>Abbitt</mark> of Appomattox County. She"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1915.17, 944.57, 2060.86, 1666.36], "bbox_id": "8689ea4b4f", "file": "AppomattoxNewspapers_1962-1965a_0256.pdf", "page": 1, "text": "Fitz Tyree of Nelson County, charged with felonious assault on Hulet H. Stevens of the Bent Creek community on Aug. 2, last Adolphus Edward Cox, Jr., Ne gro, of Six Mile Bridge, Camp bell County, charged with mali ciously cutting Claude Lewis, Ne gro, of Oakville, last Aug. 30. And Claude Lewis, charged 1 with malicious assult on Adolp hus Edward Cox, Jr. on the same date. Appomattox County Common wealths Attorney George Abbitt Jr. said the cases in which true bills were returned would be set for trial later. Judge Flood appointed Harry G. Lawson, Appomattox attorney to defend Adolphus Edward Cox, Jr. when his case is called for trial. Cox Informed the court he was unable to employ an attor ney. The grand jury was composed of William S. Jones, foreman J. H. OBrien, D. A. Conner, Geor ge F.. Langran, R. B. Hudgins, J. W. Conner and E. Irving Bing ham. A 35,000 lawsuit by Morton L. Fergusons widow against business C. Lewis McDear- mon was set down Tuesday for trial in Appomattox County Cir cuit Court on Jan 30-31 and Feb. I . Counsel for the widow, Mrs. Audrey Bergman Ferguson, had a subpoena issued on behalf of the plaintiff for the 57-year-old oil distributor to testify in the trial as an adverse witness. McDearmon was acquitted aft er a three-day trial in early Jan uary of this year of the pistol slaying of Ferguson, a 34-year- old Lynchburg real estate deal er. Ferguson was shot to death in the rear drive of McDearmons j Appomattox residence the night I of Sept. 21, 1962. I McDearmon did not testify at his trial, but defense counsel suc cessfully argued to the trial Jury that the older man fired only  after being put in fear for his  life and that the homicide was justifiable. Under subpoena isued by the court on behalf of Mrs. Fergu son, McDearmon may be called by the plaintiff as an adverse witness to testify for the first time when the civil suit comes on for trial. Virginia law provides that a witness so summoned may be  examined according to the rules  applicable to cross-examination. The trial dates for Mrs. Fer- i gusons suit were fixed by Judge  Joel W. Flood of"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "jury was composed of <mark>William</mark> S. Jones, foreman J. <mark>H</mark>. OBrien, D. A. Conner,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "jury was composed of <mark>William</mark> S. Jones, foreman J. <mark>H</mark>. OBrien, D. A. Conner,"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [256.08, 1257.51, 579.14, 1463.57], "bbox_id": "bdca0e46a7", "file": "AppomattoxNewspapers_1933-1936a_0028.pdf", "page": 1, "text": "Caldwell, Hubert H. 80 83 j 6 Lewis, John L. 190114! ll Caldwell, Mrs. 3011177117 Ligón, L. N. Exct. 487  496 29 Carrie M.  - I-  Torreni e, Sam E. Bohanon, Thomas Lucado Robert H. 280 325 19 50 Caldiwell, James W. 230 129 15.25 Bass, William C. Caldwell, Cleve- 256 215 17 75 Marsha1.1, Howard B. 177 89 11 .................... land M. 1 1 1 Fleshman, Ernest J. Caldwell, Madison C. 207 127 9 25 Marshall, Elliott H. 140 112 7 75 Carson, Charlie yL- 210 190 12 75 Maya, William A., 113 70 11 Abbitt, Jim Mays, Louis G. 50 141 7 75 Carson, Ernest H.- 212 255 17 Miller, John L. 136 109 10 25 Walker, Raymond 1 Miller, Edgar M. 374 411 35 75 Carson, Joseph O. 325 182116 Mitchell, Lemuel M. 78 141 7 Carson, Charlie L. 210 119 11 Perdue Dotridge E. 50 Culpepper  Son 116 Moore, Herman R. 153 153 13 Carter, Johnnie A. 87 7 50 Martin, Thomas R. Carter, Eddie D. 100 117 7 50 Moore, T. B.  Son. 346 216 12 50 Carter, Thornton R 240 120 12 Moore, Herman R. 80 147 8 Cawthorn, Frank T. 197 77 6 75 Ferguson, Savan 162 12 Cawthorn, Samp- 1 1 1 Morris, Robert W. 153 . .................... son D. .. 1 OBrien , Robert E. 100 164 10 25 Cheatham, Oscar F. 205 119 12 75 OBrier , Frank A. 117 225 12 75 Cheatham,John 215 188 25 Odor, Thomas W. 190 122 12"}, "highlight": {"text": {"matched_tokens": ["William", "Abbitt"], "snippet": "190 12 75 Maya, <mark>William</mark> A., 113 70 11 <mark>Abbitt</mark>, Jim Mays, Louis G."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Abbitt"], "snippet": "190 12 75 Maya, <mark>William</mark> A., 113 70 11 <mark>Abbitt</mark>, Jim Mays, Louis G."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1167.07, 192.66, 1314.46, 738.38], "bbox_id": "19e8f882f7", "file": "AppomattoxNewspapers_1971-1973a_0526.pdf", "page": 1, "text": "and Mr. and Mrs. Monroe Webb Sunday afternoon. We are sorry to hear Rev. and Mrs. Otis Smith are on the sick list but hope they may soon be well. Dinner guest Saturday of Mrs. Charlie Bagby were Mr. and Mrs. James Woodall. Mrs. Twyman Baldwin, Clem Wood- all, Mr. Clarence Coffey, Thomas Woodall, Mr. and Mrs. W. H. Wingfield and Miss Julia Wingfield. We were very sorry to hear of the deaths last week of Mrs. Alvin Hamilton and Miss Mattie Moss. Deepest sym pathy is extended their families. Mr. Richard Jenkins of Baltimore spent Tuesday night with Mr. and Mrs. Julian Jenkins of Lynchburg. He spent a few days with his mother, Mrs. Addie Jenkins, Mrs. Ber Abbitt and Mr. and Mrs. H. W. Jenkins last week. Mr. and Mrs. James Wald ron of Bedford, Mr. and Mrs. Bill Watson and William were guest Sunday of Mr. and Mrs. W. H. Wingfield and family. The L. L. Webbs visited Mr. Sam Coleman Sunday after noon. Mrs. Claude Hamlett and daughter, Brenda and Mr. Grover Beasley Jr., visited their mother, Mrs. Grover Beasley, Sr. last week. Mr. and Mrs. Daniel Repass and daughter, Sherri were visitors Sunday of Mr. and Mrs. R. M. Webb and Mr. Walker Webb. Mr. and Mrs. Grover Smith of Baltimore visited Mrs. Smiths mother, Mrs. C. R."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "Addie Jenkins, Mrs. Ber <mark>Abbitt</mark> and Mr. and Mrs. <mark>H</mark>. W. Jenkins last week."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "Addie Jenkins, Mrs. Ber <mark>Abbitt</mark> and Mr. and Mrs. <mark>H</mark>. W. Jenkins last week."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1747.45, 1132.76, 1918.13, 1377.1], "bbox_id": "ea4fb6ea8e", "file": "AppomattoxNewspapers_1926-1933a_0519.pdf", "page": 1, "text": "were miss o r  -- Lynchburg, Carlyle Scruggs, of Spout Spring, George Abbitt, Miss Colia Abbitt, of Vera, Mr. and Mrs. William Fulcher of Prospect, Miss Edna Seay and Miss Bessie Watson. Miss Frances Street, daugh ter of Mrs, J. Street, of Crewe,, and John Runyan Massie, of Lowesville, were married at Crewe, December 26. They will make their home near Lowesville. Mrs. Massie was a former teacher in Appomat tox and a resident of Stone-, wall, where her father was pas tor of Hebron church for many years. The Womans Missionary and parsonage societies of Memorial church h e l d their"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "George Abbitt, Miss Colia <mark>Abbitt</mark>, of Vera, Mr. and Mrs. <mark>William</mark> Fulcher of Prospect, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "George Abbitt, Miss Colia <mark>Abbitt</mark>, of Vera, Mr. and Mrs. <mark>William</mark> Fulcher of Prospect, Miss"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1675.7, 599.89, 2011.43, 789.95], "bbox_id": "e7e68a8024", "file": "AppomattoxNewspapers_1949-1952a_0346.pdf", "page": 1, "text": "Tv?Ilgratu!ati0nJ? ,to William C. Mrs. Hattie West, of Alexandria Johnston, son of Mr, and Mrs. A. is visiting her daughter, Mrs. Craw- M. Johnston, vho was recently ford Davidson here elected vice-president of the Busi ness Club at Lynchburg College. and Mrs. Harry F. Belcher This is one of the largest and most and daughter, Judy, of Roanoke, active clubs on the campus. spent a few days last week with - -------- Mr- and Mrs. Wesley Stanley. Lt. Governor L. Preston Collins, jyirs Leia . n . of Marian, pant Tna.dn, ht with n n i Mn, John D OhUdia  S T S   7 JWatk   dinner enaaM l t T h u r X of Mra Abbitt. Robert Lane Anderson, own- C arroll OulH  Mrs er and publisher of the Smyth Coun- ty News at Marion, was a luncheon Sgt. Clarence Mit.ncli, ..f Fort guest Tuesday of the Abbitts. , Beivou- spent rh t wee-end hero --------  with his mother Friends are glad to hear that Mrs. W. W. OBrien has returned  Miss Frankie McKinney and Dr. home from the hospital and is do- , . .,,win sPent Sunday in Char- !injg fine. Mrs. Annie Burnrs, of lottSvl,,e, Va."}, "highlight": {"text": {"matched_tokens": ["h", "Abbitt"], "snippet": "enaaM l t T <mark>h</mark> u r X of Mra <mark>Abbitt</mark>. Robert Lane Anderson, own-"}}, "highlights": [{"field": "text", "matched_tokens": ["h", "Abbitt"], "snippet": "enaaM l t T <mark>h</mark> u r X of Mra <mark>Abbitt</mark>. Robert Lane Anderson, own-"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1203.81, 182.57, 1366.51, 871.61], "bbox_id": "d1282ed1b3", "file": "AppomattoxNewspapers_1922-1923a_0146.pdf", "page": 1, "text": "tlriL factor in the distribution of blessings to State, Nation and Humanity He comes to remain among tbe people who loved him with a deep affection and who had for him a confi dence and admiration never excelled. Gov. Trinkle was tbe intro duced by Hon- R- L. Burke and in a few well-chosen remarks the govern it paid a high tribute to the character and. worth of Mr Flood. Rev. H P E st dismissed the audience and then the Masons leading the procession bora tbe remains of Hall Fiood to tbe Courthouse iquare and deposit ed them in ihe beautiful grauit mausoeum, in which his two infaut children rest C M. ranfortb, of Burkeville, Grand Deputy Master conducting the service. Rv. W. G. Bates otfere i the prayer. Among tnose present were Senator Claude A. Swanson and Caner Giass, of Virginia Gov. and Mrs E. Lee Trinkle,Colonel and Mrs. Joseph Bullion, Con gressmenJ. P Woods, ex-Sena tor diaries F. Faulkner, Mrs. Thomas W. Harrison, Mrs. J. W. Hope,iiias Carrie Longhorn, Mesdauies. Adam,A F. Ander son, Soliy Roberts, Ella John sou, R E. Byrd, Lieutenant Commanuer R. E Byrd, Jr., Captain l B Bj rd, S.nator ti. F. Byrd, Dr A 8 . Priddr, iloo- s_m Norveli, J. U- 11 zp..rick, K U Garrett, Uoaat l vloRae, Jooi Witsms, N E Donaldsoa, Stcrtiog j o ration, Uscai Portu. r, J lavior iVoiupBOn Cha irs u ell 1 ltiumpson, William u i auo bt.r, J .d Cabell Fi zp M. ik, Jon. i Suhrer, Pet r S .o u ter, J A Tw inan, R .Oort A. H  b  i . W. E. Uaidweil, W F. Wood W. K. Wood, WilliamA King, Charles Oborne, VJr. and Mrs. L. N. Ligon, W O Paxton, W. G Dickinson Senator John H Cro ker.t, Dr, J. B Abbitt ant B. S Oieu"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "G Dickinson Senator John <mark>H</mark> Cro ker.t, Dr, J. B <mark>Abbitt</mark> ant B. S Oieu"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "G Dickinson Senator John <mark>H</mark> Cro ker.t, Dr, J. B <mark>Abbitt</mark> ant B. S Oieu"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [646.3, 401.54, 1154.34, 483.07], "bbox_id": "57bff63078", "file": "AppomattoxNewspapers_1933-1936a_0347.pdf", "page": 1, "text": "Report of Condition of The Mrs G F. Abbitt Jr. and Miss Elaine McDearmon and H. Y. Spencer will attend the William and Mary, U. of Richmond football game in Rich mond today."}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "Miss Elaine McDearmon and <mark>H</mark>. Y. Spencer will attend the <mark>William</mark> and Mary, U. of"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "Miss Elaine McDearmon and <mark>H</mark>. Y. Spencer will attend the <mark>William</mark> and Mary, U. of"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1581.36, 1069.14, 1901.45, 1163.74], "bbox_id": "f3a11f3a01", "file": "AppomattoxNewspapers_1908-1909a_0519.pdf", "page": 1, "text": "Misses Corinne a n d Annie Mrs. George C orin gave have returned to  birthday Party turday, nnd Crozet, respuc-  were Miss Grace Casey, of has Lynchburg, Cariyle Scruggfc of Spout Spring, George Abbitt, herst to resume work after a , Miss Colia Abbitt, ov era, mr. mnii with h e r home folks on and Mrs, William Fulcher of"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "h"], "snippet": "after a , Miss Colia <mark>Abbitt</mark>, ov era, mr. mnii with <mark>h</mark> e r home folks"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "h"], "snippet": "after a , Miss Colia <mark>Abbitt</mark>, ov era, mr. mnii with <mark>h</mark> e r home folks"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [137.99, 328.11, 289.81, 821.93], "bbox_id": "a28eb1ac13", "file": "TimesVirginian_1981a_0386.pdf", "page": 1, "text": "Dedication ceremonies, of Monroe Lodge 301 A.F. A M. weie held on October 4. Mt. Wor. Spender McMath Rogers, Grand Master of the Grand Lodge of Virginia was speaker. A note burning ceremony was held declaring Monroe Lodge 301 free of debt. Monroe Lodge 301 was namfed in honor of James Monroe, the fifth President of the United States, who was initiated in Williamsburg Lodge 6 while a student at William  Mary. Monroe Lodge was instituted on April 11,1908 by Joseph W. Eggleston. Appointed officers were R. F. Burke, Worshipful Master J. R. Atwood, Senior Warden T. A. Smith, Junior Warden. The following were elected at the first stated meeting J. C. Jones, Treasur er J. R. Horsley, Secretary. J B. Abbitt, Senior Deacon J, C. Shearer, Junior Deacon. Those . appointed were J. C. Martin, Tiler W. L. Murphy, Chaplain H. C. Babcock and C. N. Abbitt, Stewards. The first petition of record for degrees was presented at this meeting by C. S. McDearmon. Pursuant to a charter dated February 11, 1909, Monroe Lodge was assigned No. 301 and duly constituted on April 30,1909. Meetings were held in a building on the south side of the Norfolk-Western Railroad, opposite the Railroad Station. The rent at this time being 36.00 a year. This building was shared by the Woodmen of the World. Meetings were held in. this"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "W. L. Murphy, Chaplain <mark>H</mark>. C. Babcock and C. N. <mark>Abbitt</mark>, Stewards. The first petition"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "W. L. Murphy, Chaplain <mark>H</mark>. C. Babcock and C. N. <mark>Abbitt</mark>, Stewards. The first petition"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2636.11, 725.26, 2776.36, 1109.39], "bbox_id": "497585a2ba", "file": "AppomattoxNewspapers_1971-1973a_0633.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomattox County, on the 29th day of January, 1973. William Hix, John Hix, Plaintiffs AGAINST Flossie H. Irvin, et al, Defendants The object of this suit is to have partition of the real estate described in the bill in this cause in some manner presecribed by law, the real estate being located in Appo mattox County, Virginia, at Hixburg in Clover Hill District, containing approximately 406 acres, and formerly owned by W. D. Hix, Miss Maggie Hix and Miss Carrie Hix. And it appearing by affidavit filed that Flossie H. Irvin is not a. resident of the Common wealth of Virginia, she is hereby required to appear within ten days after the due publication of this order and do what is necessary to protect her interest. TESTE Aldah B. Gordon, Clerk W. M. Abbitt, p.q. 2-l-4t"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "day of January, 1973. <mark>William</mark> Hix, John Hix, Plaintiffs AGAINST Flossie <mark>H</mark>. Irvin, et al, Defendants"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "day of January, 1973. <mark>William</mark> Hix, John Hix, Plaintiffs AGAINST Flossie <mark>H</mark>. Irvin, et al, Defendants"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2569.87, 749.38, 2712.18, 1134.21], "bbox_id": "3c520180c8", "file": "AppomattoxNewspapers_1971-1973a_0624.pdf", "page": 1, "text": "VIRGINIA In the Clerks Office of the Circuit Court of Appomattox County, on the 29th day of January, 1973. William Hix, John Hix, Plaintiffs AGAINST Flossie H. Irvin, et al, Defendants The object of this suit is to have partition of the real estate described in the bill in this cause in some manner presecribed by law, the real estate being located in Appo mattox County, Virginia, at Hixburg in Clover Hill District, containing approximately 406 acres, and formerly owned by W. D. Hix, Miss Maggie Hix and Miss Carrie Hix. And it appearing by affidavit filed that Flossie H. Irvin is not a resident of the Common wealth of Virginia, she is hereby required to appear within ten days after the due publication of this order and do what is necessary to protect her interest. TESTE Aldah B. Gordon, Clerk W. M. Abbitt, p.q. 2-l-4t"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "day of January, 1973. <mark>William</mark> Hix, John Hix, Plaintiffs AGAINST Flossie <mark>H</mark>. Irvin, et al, Defendants"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "day of January, 1973. <mark>William</mark> Hix, John Hix, Plaintiffs AGAINST Flossie <mark>H</mark>. Irvin, et al, Defendants"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2023.69, 801.61, 2197.18, 1281.05], "bbox_id": "47dc86c548", "file": "AppomattoxNewspapers_1954-1955a_0385.pdf", "page": 1, "text": "Results of the ASC committeemen elections held recently have been an nounced as follows William D. Hix, HI, 0f Clover Hill, was elected chairman E. W Marshall, of Southside, vice-chair- man, and Bennett Harding, of Stone wall, regular member. Alternates to the County Committee, chosen at the same time by farmer-elected dele gates to the county convention, are D. A. Pugh, of Southside, and C. D Lewis, of Stonewall. Farmers also elected a community committee of three farmers in each of Appomattox Countys three com munities  Stonewall Community T. R. Martin, Jr., chairman C. Roland Smith, vice-chairman Lyle B. Thomas, regular member Aubrey L Moore, first alternate and Hugh Tanner, second alternate. Clover Hill Community H. W. Jenkins, chairman B u t Abbitt, vice-chairman Jack Caw- thorne, regular member R. C. Rich ardson, first alternate G. M. Webb, second alternate. Southside Community E. Carter Martin, chairman C C. Harvey, vice-chairman E. W. Jones, regular member William A. Hunter, first alternate E. W. Mar shall, Jr., second alternate. Committeemen will take office to day, Sept. 1 , and serve one year. They will act as a policy determining body, making program recommenda tions, establish acreage allotments allocate ACP funds, approve impor tant documents, and make decisions affecting farmers in the county. Mat ters of program detail operations will be handled by the county office manager and his staff."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "alternate. Clover Hill Community <mark>H</mark>. W. Jenkins, chairman B u t <mark>Abbitt</mark>, vice-chairman Jack Caw- thorne,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "alternate. Clover Hill Community <mark>H</mark>. W. Jenkins, chairman B u t <mark>Abbitt</mark>, vice-chairman Jack Caw- thorne,"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.5, 393.76, 1744.92, 899.71], "bbox_id": "666d46fa0d", "file": "AppomattoxNewspapers_1918-1922a_0383.pdf", "page": 1, "text": "llOMlt ft  -r-Jpgelp Wauted w hnav Is your job unssfet, , - I I on Fraact Minnie L tty0t,rt80n Grace 8by, Reg sTSTii yow? b a-i7oubow iti! Stanley.  o k l  urad. l U S i f ! I .France Waguer, Jorm Cheat Oglesoy, Jos- Vorta S ui of Rice,Iiiola Burkwj, Stella tayne Mrs! I Tflir.d YearLydia Rogert, Christine Foster, Marguerit Giiliam, Iva Ferguson, Ray itt Aletbia Doss spent the moud g eae Ray Lde Oolonei tend with her cousin, Mrs. Fourquerlan,Berkley Andrews, Conner, at Evergreen Reid Hatcher, William Burke, r. Robert Jones and A H Rupert Rogers, Earl Carson, iment have returned from a Ned Hancock, Deroy Jennings, lioesstrip to Amherst. Willard Peake. he farmers of Appomattox Second Year-Artie Drink- looking after the sale of GUmly Van Volkenburg, , tobaccoSaturday. oh oR Stanley, Walter Ford, Annie Suell, Clara Caw T L F . Burnett will preach fchor1 ZjU Harper Kennifc otral Baptist church Sun- Qra?jtt Mary Hale, Elsie Halt afternoon, February 18tfc, Eleanor Casey, Dorothy Hund oclock.  ley, Bessie V. Harwood, Alot mto Mr. and Mrs. John D. Street, Virginia Sherer, Hunp ,Jr,at Henderson, N. O , ton Ouster, Myitle Smith, February 2nd, a girlier I Nellie Cawihorn. is is Billie Abbitt Rose. First GradeAlfred Jenning in Ellen Marshall Rugg, France lord a. Carlton Crews representative of the Red Uucy Hale 7ch GradeKennard Gills, Fred Twymaa, Frank Harper, Nathan Goin, Howad Rogers, Harry Puckett, Teddy Gills. 6.h GradeRebecca Martin, Florence Gregory, Frances Up ton, Billy Trent, Vara Smith, Alice Harwood,Catherine Giiie, Neil Oawthorn. 5th Grade"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "at Evergreen Reid Hatcher, <mark>William</mark> Burke, r. Robert Jones and A <mark>H</mark> Rupert Rogers, Earl Carson,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "at Evergreen Reid Hatcher, <mark>William</mark> Burke, r. Robert Jones and A <mark>H</mark> Rupert Rogers, Earl Carson,"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1678.1, 1008.25, 2058.12, 1305.08], "bbox_id": "89937b2560", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "County surveyor w ie A. S. Swan.  Chrbtian. the grandfather of local Treasurer for the county was J. F. dtissn, Chesley Christian and the W  rA im tj finwiintirfnnir e t father of the late Dr. David Christian, Revenue was George W. Abbitt, who Sr. H.T. Parish, R B . Poore and C. H. incidently, was the grandfather of Sackett. several Appomattox redden ts. Retired If you happened to be. livmg in the Congressman Watkins M. Abbitt, community of Evergreen in 1688 you H erbert M. A bbitt, pharm acist, had only a short walk to a law Retired Judge George F. Abbitt, Jr. office.....the attorney was J.P.L . and Mrs. Dora Abbitt Conner.  Fleshman located there in the village. In 1888 Appdlnattox County Pamplin City had not one, but two Commonwealths Attorney was W. C. law offices. One was that of W. C. Franklin. Franklin, also the County Common- As it is today, three, county wealth Attorney. The second Pamplin supervisors made up the governing attorney w asE .R Woodson. body for the county. They were William B. Tinsley wad an attorney Wflfiam A. White, Chairman D. R with an office in Mineral, community in Marshall and H. E. Gilliam. the area known today as Bent Creek. There was no shortage of attorneys If you lived in Tower HOI community in Appomattox bad in 1888. Attorney the lawyer to see was T. J. Thornhill. T.S.Bocoek had iris law office set up m There were no automobile dealer- the community of Tower Hfll which is ships back in 1888 but plenty of coach near what is today Routes 60 and864. and wagonmakers. Stephen Beasley Appomattox Court House had four was the man to see for a new coach or law offices. One attorney was D. A. wagon if you lived in Tower HilL E. E. Chism and W.W. Ragland were coach A a fi f  and wagon m ake in Evergreen. J.W.  Clark, Samud Davis and Z. Taylor in"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "the Congressman Watkins M. <mark>Abbitt</mark>, community of Evergreen in 1688 you <mark>H</mark> erbert M. A bbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "the Congressman Watkins M. <mark>Abbitt</mark>, community of Evergreen in 1688 you <mark>H</mark> erbert M. A bbitt,"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2353.37, 539.56, 2541.47, 1042.4], "bbox_id": "8a77131f46", "file": "AppomattoxNewspapers_1960-1962b_0427.pdf", "page": 1, "text": "Appomattox Rebels Open Here Frw day Night Against Amherst The Appomattox High School Rebels will open their 196i football season here Friday night at 800 M. when they meet a strong ,Amherst eleven. Last year Appo mattox won a close game from Amherst by a 13 to 6 score. The . Rebels have drilled very hard dur ing their training period and have plenty of hard contact workouts. The boys are in very fine physical shape and should have a very fine season. The probable players who will start on offense are WillarcT Johnson, end Frank Weighiman, end Freddie Carter tackle, Calvin Martin tackle, Donald Zenter guard Clarence Mayberry, gufeurd, Brbby Clifton center, Jimmy Torrence back, G. H. Jamerson back, James WhitJehead back, Buddy Wilcox back. The defensive unit will be Frank Weightman end, Freddie Car ter tackle, Samuel Inge guard, Clarence Mayberry or Donald Zent er guard, Calvin Martin tackle, Willard Johnson end, Bobby Wil liams linebacker, Robert! Morris line backer, Billy Allen Burkes line backer, Jimmy Torrence safety, G. H. Jamerson safety backs. Other boys who will see service are Wat kins Abbitt, Elmer Phelpe, Dickie Fuller, John Goin, William Bryant, Austin Panky, Joe Mayberry. Above is a list of boys who will see actioi in most games. The Appomattox High School band will perform at halftime for the opening game. Amheist High SchooA will also bring their band for this game. So there will be plen ty of action here Friday night for all fans. Admission will be 1.00 for adult and .50 for students. . - ------------------- - . -.ft! r."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "service are Wat kins <mark>Abbitt</mark>, Elmer Phelpe, Dickie Fuller, John Goin, <mark>William</mark> Bryant, Austin Panky, Joe"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "service are Wat kins <mark>Abbitt</mark>, Elmer Phelpe, Dickie Fuller, John Goin, <mark>William</mark> Bryant, Austin Panky, Joe"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1540.55, 762.44, 1698.33, 850.74], "bbox_id": "67fc741981", "file": "AppomattoxNewspapers_1908-1909a_0236.pdf", "page": 1, "text": "Mrs. Kate Bright, of Pierce Jity, Mo., died Friday at her lome. She was a daughter oh he late William Archer Le- irande, a n d was a sister ot A ys . C. A. Abbitt, C. W. Han- ock, and Mrs. S. H. Kelly, of Crewe."}, "highlight": {"text": {"matched_tokens": ["Abbitt", "H"], "snippet": "A ys . C. A. <mark>Abbitt</mark>, C. W. Han- ock, and Mrs. S. <mark>H</mark>. Kelly, of Crewe."}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "H"], "snippet": "A ys . C. A. <mark>Abbitt</mark>, C. W. Han- ock, and Mrs. S. <mark>H</mark>. Kelly, of Crewe."}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [695.76, 515.07, 1014.13, 1185.55], "bbox_id": "491073e5ee", "file": "AppomattoxNewspapers_1926-1933a_0425.pdf", "page": 1, "text": "Hawaiian Language TtfeHawuilun is one of tlie Poly- I tieslan languages. The written Ian-  guage dates only from the time of the I arrival of missionaries In 1820. Tbe I alphabet consists of 12 letters which I are pronounced us In l-ntln. I Commissioners Sale Of Valuable Real Estate Pursuant to a decree of the I Hustings Court for the City of  Roanoke, Virginia, entered on  the 6th day of December, 1927,  in the chancery cauie of Fannie Lessie Thurman, Guardian ver sus William Allen ThuEmatL et lals pending in the H stings  I Court for the City of Roanoke, I Virginia, I will on J a n u a r y 1 2 th , 1 9 2 9 on the premises about one-half  mile southeast of the Town Of I Appomattox, Virginia, in Appo-i mattox, Virginia, at 2 oclock P. M. of that date, offer for sale to i . , ------ BN N J the highest bidder the following JSSif- acr8 and wl Y S i  described real estate  All that certain tract or parcel  of land containing 23acres, more or less, with the buildings and J  improvements thereon ana prfai-  leges and appurtenances there-  unto belonging, lying and beiftg in the Southside District of Appo mattox County. Virginia, about one-half mile Southeast of the  Court House, and immediately II on the West side of the Lynch-1 burg-Evergreen Public Roap,  and where the soil road leading  11 from Appomattox toward Ever green intersects with sud J  Lynchburg - Evergreen Road, and adjoining the lands of L. E- Smith, A. R. Harwood and o th r I lands of E. R. Abbitt and others  and being the same .properly  conveyed to A. G. Thurman ny E. R. Abbitt and Maggie Q. Ab-j bitt, his wife, by deed dated  January 14, 1922, and recorded! January 14, 1922, in the Clerks! Office of Circuit Court of Appo-j  mattox County, Virginia. J This property will be offered J first as a whole and then in sep- arate parcels, as shown by a survey, a copy of which may be  seen by application to H. C. Bab cock, Appomattox, Virginia, and  the highest bid received therefor will be reported to the Court for confirmation. Terms of Sale One-fourth"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Thurman, Guardian ver sus <mark>William</mark> Allen ThuEmatL et lals pending in the <mark>H</mark> stings  I Court for"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Thurman, Guardian ver sus <mark>William</mark> Allen ThuEmatL et lals pending in the <mark>H</mark> stings  I Court for"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [693.58, 493.91, 1018.79, 1073.0], "bbox_id": "9b18860048", "file": "AppomattoxNewspapers_1908-1909a_0425.pdf", "page": 1, "text": "Hawaiian Language TheHuwuilun la one of the Poly nesian languages. The written lan guage dates only from the time of the arrival of missionaries In 1820. The alphabet consists of 12 letters which are pronounced us In l-atln. Commissioners Safe Of Valuable Real Estate Pursuant to a decree of die Hustings Court for the City of Roanoke. Virginia, entered on  the 6th day of December, 1927, in the chancery cauie of Fannie Lessie Thurman, Guardian ver sus William Allen Thusnufti. et1 lals pending in. the H stings  Court for the City of Roanoke Virginia, I will on January 12th, 1929  on the premises about one-half I mile southeast of the Town Appomattox, Virginia, in Appe-  mattox, Virginia, at 2 oclock P. M. of that date, offer for sale to l Kor Mentor  ale at Evergreen8 - room the highest bidder the following  T  8  5   I described real estate , ,  All that certain tract or parcel! I of landcontaining 23 acres, more I  lor less, with the buildings andj improvements thereon ana pri i-1 lieges and appurtenances there-J  unto belonging, lying and bemg I in the Southside District of ApiJp- II mattox County, Virginia, abopt lone-half mile Southeast of Court House, and imroedia  jon Hie West side of the Lyfli  j burg-Evergreen  Public 11 and where the .soil road leadi  from Appomattox toward Eyjfr-1 reen intersects with raid  ,ynchburg  Evergreen, R om , and adjoining the lands of L. IB. Smith, A. R. Harwood and otrar lands of E. R. Abbitt and othqp and being the sanire .propew conveyed to A. G. Thurman ByI E. R. Abbitt and Maggie Q. A- bitt, his wife, by deed dated I January 14, 1922, and recorded January 14,1922, in the- Chflrti Office of Circuit Court of Appo-  mattox County, Virginia.  This property will be offered"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Thurman, Guardian ver sus <mark>William</mark> Allen Thusnufti. et1 lals pending in. the <mark>H</mark> stings  Court for the"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Thurman, Guardian ver sus <mark>William</mark> Allen Thusnufti. et1 lals pending in. the <mark>H</mark> stings  Court for the"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [791.28, 248.4, 952.38, 1564.92], "bbox_id": "f61f56741f", "file": "AppomattoxNewspapers_1898-1902a_0509.pdf", "page": 1, "text": "from the observation either of his own family or of persons who might pass along the road. Mrs. Nowlin went out on the porch and gave the alarm, and requested Constable N. W. Owen to arrest Mr. Nowlin, say ing that be had twice shot at her. Heury, a sou of Mr. Nowlin, came up, and went in search of his lather. He found him behind an outhouse. Mr. Nowlin said to him  Get my horse. I want you to carry me to Spout Spring. He spoke so ration ally that the young mau left him to go to the field and take a horse from the plow for bis fathers use in go ing to Spout Spring. Before leav ing his father, Heury tequested him to give up the pistol which he had concealed on his person. Mr. Now lin was searched, but no pistol was found. His son had proceeded ouly a few steps when Mr. Nowlin sent u bullet through his own brain. He eeled aud fell, and died within 30 minutes. The bullet entered his left temple and came out just above his right car. Diligent inquiry has not developed any cause whatever for the rasl. act of Mr. Nowlin, and, al though he was of a despondent dis position and very high-tempered, he had never had an attack that made him the mudmau he was on Friday. Those nearest to him claim that he was evidently cruzy, aud that is the general verdict of the people. He nad for years beeen a great sufferer from ueuralgia and his bodily health was generally rather infirm. Borne reports say that Mr. Nowlin became enraged at a negro servant on the place, and had no occasion to be an gry with his wife, who is one of the best ladies in our county. It is one of the saddest affairs that ever hap pened in this county, as the family upon both sides is well known and highly connected. The deceased was born about 62 years ago in the house in which he was piepared for burial. He was not a member of any church. While he was high-tempered and courageous, he had a warm heart, full of sympathy. He had beeu a merchant and postmaster at Oak ville most of his life, but was engaged in farming at the. time of his death. Besides his wife, who was a Miss Woodson, Mr. Now lin leaves six children. He is also survived by two brothers and two sisters Mr. S. Walker Nowlin, of Lynchburg Mr. William S. Nowlin, of Spout Spring Mrs. Samuel H. Overton, of Spout Spring and Mrs. John Hughes, of Oakville. His burial took place on Saturday even ing, at the family burying ground on the place, and was quite largely attended by friends of the family. Evergreen. We have had another fine rain. Crops are looking very well. The wheat is very good all through this part of the county. There is some complaint about the oats turning yellow in some places. The tobacco crop in general is rather small, but is growing well, and nearly every body has a good stand. The corn is looking green and is growing well. The crops of clover and grass are not of much account There are about 75 railroad men now at work here. - Alost of t.heni spend their nights in our village, anu it is something of a sight to see them come in at night. The mer chants report good sales now, espe cially of cider. They cant keep a supply of that equal to the demand. We are sorry to learn that little Gerard Davis is still very ill. Drs. Julian Abbitt and Walker are both attending him. Mr. Walter Davis has again been called to his bedside. Mrs. Sue Harvey continues very ill at her home near this place. Mrs. Ed. Hamilton has been call ed home in great haste to attend her husband, who is very ill of fever. Mrs. Nat. Gregory last week spent several days visiting her husband in and around this place. She won many friends by her pleasant man ners and sweet ways. We heartily hope that she had a pleasant visit, and that she will come again. Mr. N. H. Gregory left on Mon day for the Hill City. Mr. Geo. Carter, of High Bridge, was in our town on Monday. Mr. James Suliivan and his little daughter Eliza spent several days in Lynchburg last week."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Nowlin, of Lynchburg Mr. <mark>William</mark> S. Nowlin, of Spout Spring Mrs. Samuel <mark>H</mark>. Overton, of Spout Spring"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Nowlin, of Lynchburg Mr. <mark>William</mark> S. Nowlin, of Spout Spring Mrs. Samuel <mark>H</mark>. Overton, of Spout Spring"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1999.57, 701.71, 2171.62, 1161.17], "bbox_id": "bcd715fe33", "file": "AppomattoxNewspapers_1939-1943a_0567.pdf", "page": 1, "text": "A crowd estimated all the way from 1,200 to 2,600 attended mem orial services here last Sunday af ternoon, saw tablets unveiled honor ing Appomattox men and women who have served in four wars, and heard an informative address by Virginias youthful and popular Governor Colgate W. Darden, Jr. The crowd began gathering soon after noon. The 31st Infanty Div ision band from Camp Pickett led a parade of local Minute Men from the high school to the court house at 230. George F. Abbitt, Jr. act- ed as master ,of Ceremonies, and brief talks were made by J. H. OBrien, Col. Charles McCloud, of Lynchburg, W. M. Abbitt, Senator Chasi T. Moses, Lieutenant Govern or William M .Tuck and Judge J. W. Flood. CaptainB C. G. OBrien and G. F. Abbitt, Jr. presided, a heads of the Minute Men companies. Special guests included Charles H Coleman and C. W. Cardwell, sur viving veterans of the War Between the States, and the mothers having as many as four sons in the present war. Veterans of World War I were also special guests. A loud speaker system-added.-tothe effectiveness of the program. Reviewing the course of history for the quarter century since the last war, Governor Darden declared that the United States must main tain a permanent military establish ment of such size and strength as to enforce peace. He attributed the acts of aggresion of the past twen ty years to the lack of any such force by the peace-loving nations. Col. Jos. Button Died Yesterday"}, "highlight": {"text": {"matched_tokens": ["Abbitt", "William"], "snippet": "of Lynchburg, W. M. <mark>Abbitt</mark>, Senator Chasi T. Moses, Lieutenant Govern or <mark>William</mark> M .Tuck and Judge"}}, "highlights": [{"field": "text", "matched_tokens": ["Abbitt", "William"], "snippet": "of Lynchburg, W. M. <mark>Abbitt</mark>, Senator Chasi T. Moses, Lieutenant Govern or <mark>William</mark> M .Tuck and Judge"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [981.86, 202.68, 1147.96, 892.63], "bbox_id": "6fab7bab89", "file": "AppomattoxNewspapers_1915-1918a_0416.pdf", "page": 1, "text": "191, Charles Washington Tan ner 477, Wm. Fletcher Garrett 139, Henry Harrison William son 168, Edward Watson  424, Willie Wesley Mitchell 176, George Elliott Cheatham 300, Allen Thornhill  278, John Wiley Davis 524, Harry Leonard Doss 532, James Clarenoe Horsley 336, Ewell Ferguson 212 , Rexford Lion Martin 8 , Hal Thornhill Baber 49, Alfonso Godsey I 305, Howard Thomas Will iams j 657, Thomas Talmage Phelps 622, James Tazewell Jenes 585, Samuel Boyd Johnson I 323, Colonel Oscar Patterson! 438, Wilmer I Smith 441, Willie A Trent 28, Wm. Andrew Day 357, George H White ! 331, Marcus Case i 49!, Wesley Abbitt Smith 566, Frank James Smith 639, Ashley Carrol Martin I 562, Richard Field Smith  I 649, Wm. Douglas MoCormick  501, Eugene Jones 102 , Omry Lae Pope 86 , Ewen Talmage Mitchell 71, Herbert Strother Jones 555, Walter P. Phelps 506, Mace Robert Lewis 681, Geo. Washington Smith 435, Harvey E Smith 450, Eddie A Wright j 113, George Iverson Smith 156, Robert Harrison Patter son 362, Willie Lee Goode 267, Wm. Archer Cheatham 421, Ira Lucado 567, Ernest Jaokson Stevens 169, Charles Emmett W right j 436, David Lee Smith 396, Samuel L Cheatham 155, Dennis Lee Patterson 257, Roscoe G. Fleming 284, Zebulon Vance Harvey 138, Wm. Fonrose Woolf oik 185, James Oscar Robertsqn 265, Jamuel J Price j 286, Hoyl Penick Harvey  j 560, Wiley 8 . Rogers"}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "Andrew Day 357, George <mark>H</mark> White ! 331, Marcus Case i 49!, Wesley <mark>Abbitt</mark> Smith 566, Frank James"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "Andrew Day 357, George <mark>H</mark> White ! 331, Marcus Case i 49!, Wesley <mark>Abbitt</mark> Smith 566, Frank James"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [392.12, 342.67, 559.53, 1285.57], "bbox_id": "820e06c64b", "file": "AppomattoxNewspapers_1926-1933a_0512.pdf", "page": 1, "text": "week in Ivor. l The senior class of the local school will sponsor a square dance at the town hall on Wed nesday night, April 27. C. W. Dickerson, state sup ervisor of Public School Libra ries, visited Appomattox high school this week. Miba Frankie McKinney ex pects to return home this week after a visit to relatiyes in Lynchburg. J. E. Dinwiddie and family are moving into one of Mrs. At woods houses this week. Mrs. Sammie Furr, of West Virginia, is visiting her parents at the old court house Mrs. Ola Patterson enter tained at a surprise dinner par ty for her daughter, Earle, Wednesday evening. The din ner guests were Misses Elaine McDearmon, Vara Morris, Kate OBrien and Messrs Cal vin H. Robinson, Harold Spen cer, Willilam T. Smith, Geoirge Abbitt. Mr. and Mrs. C. A Hancock visited Mrs. Lillie Gregory last week. While here, Mrs. Han cock had new lighting fixtures put up in the post office build ing. Several members of Dr- Christians family have b e e n sick during the last week, but are now out again. Mrs. E E. Gills, Mias Louise and brother, Robert, returned with Mr. Jamie Gills to Blue- field for a visit. Miss Bessie Jeter, of Home Economics Department, S. T. C- Farmville, accompanied by her mother, visited Miss Florence Gregory last week-end. Robert Edward Lee chapter of U. D. C. met with Mrs. Kate OBrien on last Saturday night. Mrs. Evrod Connor was elected delegate to district meeting to be held in Chase City. Mrs. Dora Martin, of Farm ville, returned home Friday after spending a few days with Mrs. Charles E. Seay. Mrs. Hallie Ferguson of Vera spent a few days last week with her mother, Mrs. Charles E. Seay. Mrs. W. H. S. Barlow and son, Ralph, have returned home after a pleasant visit to rela tives in Clifton Forge. Mr. and Mrs. J. D. Morris Miss Thelma Morris, Mrs. Flo rence Bingham and William Moore visited relatives in Rich mond last Sunday. The Recreational Club helc its social for the month of Ap ril on Tuesday night. Enter tainment was in the form of a leap-year dance. Little Lester Hudgins enter tained a score of his little friends at his birthday party Tuesday. He was ten years old. Mr- and Mrs. K. O. Reid, of Richmond, stopped by to make a short visit to friends on Wed nesday. See Wilkes plant advertise ment."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer, Willilam T. Smith, Geoirge <mark>Abbitt</mark>. Mr. and Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer, Willilam T. Smith, Geoirge <mark>Abbitt</mark>. Mr. and Mrs. C."}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [392.62, 319.6, 559.26, 1261.31], "bbox_id": "49af0f2af3", "file": "AppomattoxNewspapers_1908-1909a_0512.pdf", "page": 1, "text": "week in Ivor.   , The senior class of the loteal school will sponsor a square dance at the town hall on Wed nesday-mght, April 27. C. W. Dickerson, state sup ervisor of Public School Libra ries, visited Appomattox high school this week. Miiha Frankie McKinney ex pects to return home this week after a visit to relatiyes in Lynchburg. - J. E. Dinwiddie and family are moving -into one of Mrs. At woods houses this week. Mrs. Sammie Furr, of West Virginia, is visiting her parents at the old court house. Mrs. Ola Patterson enter tained at a surprise dinner par ty for her daughter, Earle, Wednesday evening. The din ner guests were Misses Elaine McDearmon, Vara Morris, Kate OBrien and Messrs Cal vin H. Robinson, Harold Spen cer, Willitam T. Smith, George Abbitt. Mr. and Mrs. C. A- Hancock visited Mrs. Lillie Gregory last week. While here,. Mrs. Han- cock had new lighting fixtures put up in the post office build ing. - Several members of Dr- Christians family have b e e n sick during the last week, but are now out again. Mrs. E E- Gills, Mias Louise and brother,, Robert, returned with Mr. Jamie Gills to Blue- field for a visit. Miss Bessie Jeter, of Home Economics Department, S. T. C- Farmville, accompanied by her mother, visited Miss Florence Gregory last week-end. Robert Edward Lee chapter of U. D. C. met with Mrs. Kate OBrien on last Saturday night. Mrs- Evrod Connor was elected delegate to district meeting to be held in Chase City. Mrs. Dora Martin, of Farm ville, returned home Friday after spending a few days with Mrs. Charles E. Seay. Mrs. Hallie Ferguson of Vera spent a few days last week with her mother, Mrs. Charles E. Seay. Mrs. W. H. S. Barlow and son, Ralph, have returned home after a pleasant visit to rela tives in Clifton Forge. Mr. and Mrs. J. D. Morris, Miss Thelma. Morris, Mrs. Flo rence Bingham and William Moore visited relatives in Rich mond last Sunday. The Recreational Club heli its social for the month of Ap ril on Tuesday night. Enter tainment was in the form of a leap-year dance. Little Lester Hudgins enter tained a score of his little friends at his birthday party Tuesday. He was ten years old. Mr- and Mrs. K. O. Reid, of Richmond, stopped by to make a short visit to friends on Wed nesday. See Wilkes plant advertise ment."}, "highlight": {"text": {"matched_tokens": ["H", "Abbitt"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer, Willitam T. Smith, George <mark>Abbitt</mark>. Mr. and Mrs. C."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Abbitt"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer, Willitam T. Smith, George <mark>Abbitt</mark>. Mr. and Mrs. C."}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
