{"document": {"bbox": [626.4, 1119.32, 830.52, 1718.1], "bbox_id": "b6520467c7", "file": "AppomattoxNewspapers_1915-1918a_0189.pdf", "page": 1, "text": "Womens Missionary Society of liberty Baptist Church The Women Missionary Society of Liberty Baptist Church, or rather known first as the Ladie  Aid Society, was organized by Rev. Dr Henry W. Tribble in the year of his pastorate of this church, in 18 85. It was a small and feeble beginning but an earnest Christian spirit and effort tup ported the movement of this struggling band of Christian workers. Dr. Tribble even in vited the men to join the society so as to encourage and help the ladies in their Christian work Miss Sue Sears was elected president for several years, and she was active and efficient in the society, as in all other church work, wherever her consecrated life found work for the Heavenly Father Miss Sears best endeavors for His cause were always given I remember a few of the orig inal members Mrs. William H Gills, Mrs. William H. Abbitt Mrs. Joel Oawthorn, Mrs. T. A Caldwell, Mrs. C. W. Hancock Misses Sis OConner, Sis Ab bitt, and Lula Jones. This society met in the Amen corn er of the chnrch for years, after the regular monthly service on the 3rd Sunday of each month This society did much church work in individual ways, but rarely ever had any money, ex cept a few cents in the treasury. We tried lawn parties, lectures, oyster suppers, tableaux, etc. But rains, illness, or something seemed to break us up, minus of finances. If we raised fire or ten dollars a year for our society we thought we had done well, aa in those days ladies Ad minis- were not supposed to have any"}, "highlight": {"text": {"matched_tokens": ["William", "H", "Gills", "William", "H"], "snippet": "orig inal members Mrs. <mark>William</mark> <mark>H</mark> <mark>Gills</mark>, Mrs. <mark>William</mark> <mark>H</mark>. Abbitt"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Gills", "William", "H"], "snippet": "orig inal members Mrs. <mark>William</mark> <mark>H</mark> <mark>Gills</mark>, Mrs. <mark>William</mark> <mark>H</mark>. Abbitt"}], "text_match": 1736172819517014137, "text_match_info": {"best_field_score": "3315704397824", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172819517014137", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1502.88, 392.29, 1689.55, 1087.98], "bbox_id": "9ac43e9f8c", "file": "AppomattoxNewspapers_1943-1947a_0042.pdf", "page": 1, "text": "Mss. W. T Steele, who has been spending some time in Petersburg and Richmond has returned to her home here. Mr. and Mrs. James P. Gills and children, Lucille and Jimmy, of Biuefield, West Virginia are guests in the home of Miss Mary Lpuise Gills. Mrs. Helene Welch spent the week-end in Richmond as the guest of Mrs. J. T. Harvey. Miss Bessie Jeter, of Farmville, spent several-days last-week as-the guest of Mrs. T. M. Trent. Ms. F. C Dres.er, Miss Clara Whitney Moses, Frrnk and Walter Dres er were in Lexington -this week. Mrs. Bessie Ferghson is spending tve week with her daughter, Mrs. Charles Allen Carter in Gladstone. ,  Paul Drinkard, of Camp Pickett, spent several days this week in the home of Mrs. W. M. Hancock.  Walter and Frank Dresser spent several  -ys 1 st week in Lawrence- ville.  Dr. and Mrs. Havilah Babcock, of. Columbia, S. C. are spending some time at Hotel Appomattox. The Susie Whittinghill Y. W. A will meet Thursday evening in the home of Mrs. Edwin Frayscr. The McLean Circle of the W. M. S. of Liberty Bap ist Church will meet in the home of Misses Myrtle and C-roline Smith next Thursday evening. Mrs. William Haller Copenhaver, of Richmond will arrive in Appo mattox next week to spend the sum mer vacation with her mother, Mrs. William P. Gills. Rev. and Mrs. H. Frederick Jones had as recent guests at dinner Miss M. Anna Jones, Col. and Mrs. John Markey, Col. Reynolds and Pfc. E- mil Markow, of Camp Pickett and Mbs. Vance Perkins. Mrs. E. Ted Gills and daughter, Marianne, of Biuefield, W. Va. are spending some time in the home of R. C. Wagner. Jesse Morton Rosser, young son of Mr. and Mrs. J. M. Rosser, came by to see us yesterday morning, bringing two huge hen eggs from his mothers flock. The shell on each of the eggs was very rough, and it was not too difficult to trace several letters of the alphabet at the ends of the eggs. -Carroll Smith, of Richmond spent  the week-end in the home of W. L. Brown."}, "highlight": {"text": {"matched_tokens": ["William", "Gills", "H"], "snippet": "with her mother, Mrs. <mark>William</mark> P. <mark>Gills</mark>. Rev. and Mrs. <mark>H</mark>. Frederick Jones had as"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills", "H"], "snippet": "with her mother, Mrs. <mark>William</mark> P. <mark>Gills</mark>. Rev. and Mrs. <mark>H</mark>. Frederick Jones had as"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [943.42, 481.08, 1108.72, 687.18], "bbox_id": "129a9edaff", "file": "AppomattoxNewspapers_1954-1955a_0109.pdf", "page": 1, "text": "Entertaining Saturday evening at Maudes Hot Shop, Mrs. W. Pitzer Gills, of Appomattox, and Mrs. William H. Copenhaver, of Rich mond and Appomattox were hos tesses at dinner in honor of Miss Eloise Gills and William Ray Saville whose marriage will be an event of November. Mrs. Gills is the grand mother and Mrs. Copenhaver is an aunt of the bride-elect. An arrange ment of white flowers formed the centerpiece. The honoree was pre sented a gift. Others present includ ed Mrs. R. E. Saville, Mr. and Mrs. Van T. Wood, Mr. and Mrs. J. Allen Gills, Mrs. Rebecca Shanks, Bobby Saville, Miss Joan Gills and Hugh Spencer."}, "highlight": {"text": {"matched_tokens": ["Gills", "William", "H"], "snippet": "Shop, Mrs. W. Pitzer <mark>Gills</mark>, of Appomattox, and Mrs. <mark>William</mark> <mark>H</mark>. Copenhaver, of Rich mond"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William", "H"], "snippet": "Shop, Mrs. W. Pitzer <mark>Gills</mark>, of Appomattox, and Mrs. <mark>William</mark> <mark>H</mark>. Copenhaver, of Rich mond"}], "text_match": 1736172818980143225, "text_match_info": {"best_field_score": "3315704135680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818980143225", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.66, 533.69, 1786.09, 593.84], "bbox_id": "07987c17b5", "file": "AppomattoxNewspapers_1947-1949a_0508.pdf", "page": 1, "text": "Mr. and Mrs. R. Banks Frazier left today to spend the week-end in Marion as guests of Mr. an Mrs. H. P. Gills. They were accompanied by Mrs, William H. Copenhaver, who will remain for several weeks."}, "highlight": {"text": {"matched_tokens": ["Gills", "William", "H"], "snippet": "an Mrs. H. P. <mark>Gills</mark>. They were accompanied by Mrs, <mark>William</mark> <mark>H</mark>. Copenhaver, who will remain"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William", "H"], "snippet": "an Mrs. H. P. <mark>Gills</mark>. They were accompanied by Mrs, <mark>William</mark> <mark>H</mark>. Copenhaver, who will remain"}], "text_match": 1736172818845925497, "text_match_info": {"best_field_score": "3315704070144", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818845925497", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1534.74, 517.15, 1702.84, 939.16], "bbox_id": "c309871cd9", "file": "AppomattoxNewspapers_1933-1936a_0032.pdf", "page": 1, "text": "The annual every canvass of Liberty church will be made afternoon, December following people have been se lected to make the canvass and are requested to meet at t h e churchJMonday, November 27, a 1 45 P. M. W. M- Hancock, Joe Le- Grand, R. L. Burke, L. J. Mor ris, L- E . Smith, R. B- Hudgins, R. F. Ramsey, A. T. Inge, Mrs W. M Thompson, Mrs. E.-E. Gills, Don Moses, Lucy Le- Grand, Louise Gills, Mrs. Flo rence Trent- F. L. Murphy, Ernest Ferguson, C. F. James, Mrs. A . R. Harwood, Mrs Helene Welsh, Mrs. Don Moïs es, Mrs- W. W. Scott, T. A. Walton, Travis Lee, William Burke, Mrs. W. P. Gills, Mrs. T- H. Ir.ge, Mary Taylor Gills, R. E. OBrien, W . H . Morgan, J. L. Caldwell, Mrs. J. L. Cald well and Mrs. J .. W . Caw- thorn . At the meeting Monday night full instructions will be given, assignments made and all equip ment placed in hands of t h e canvassers. Liberty Church will be celebrating its . ohe hun dredth anniversary next year and a special effort will be made to enlist all in all the work of the church- --------- - ------- o ---- ------------"}, "highlight": {"text": {"matched_tokens": ["William", "Gills", "H", "Gills"], "snippet": "A. Walton, Travis Lee, <mark>William</mark> Burke, Mrs. W. P. <mark>Gills</mark>, Mrs. T- <mark>H</mark>. Ir.ge, Mary Taylor <mark>Gills</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills", "H", "Gills"], "snippet": "A. Walton, Travis Lee, <mark>William</mark> Burke, Mrs. W. P. <mark>Gills</mark>, Mrs. T- <mark>H</mark>. Ir.ge, Mary Taylor <mark>Gills</mark>,"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1992.49, 1201.6, 2205.25, 1438.64], "bbox_id": "d46febfff7", "file": "AppomattoxNewspapers_1947-1949a_0054.pdf", "page": 1, "text": "ented to Robert Alfred OBrien, 48, died dim for Tuesday, July 1, after a months Harris, illness, in Huntington, W. Va. He id the was an adjudicator in the Veterans E. Rey- j Administration. He was an attor- f Farm-j ney, formerly practicing here and ban-on in Roanoke, a veteran of World of Ever- j War I, and former adjutant of the also of local American Legion. Lynch- . . .  . e Mr. He is survived by a son, Robert .tte Rey- Alfred OBrien, Jr., of Richmond ,n mrSi his parents, Mr. and Mrs. F. A. Irs. Bur- OBrien, of Appomattox, and three rs. Jess- sisters, Mrs. Mildred Alvis, Mrs. E. C. Rey- Louis Dahl, and Miss Kate OBrien. s  Funeral services will be conduct-   ed from th home of his parents m S OO P. M. this afternoon, with burial in the family cemetery. Ac- Mr. and ve pallbearers will be Elliott r. and Torrence, J. Allen Gills, William D. i tir Morris, William OBrien, H. A. my, Mr. Torrence and Clem H. OBrien."}, "highlight": {"text": {"matched_tokens": ["Gills", "William", "William"], "snippet": "and Torrence, J. Allen <mark>Gills</mark>, <mark>William</mark> D. i tir Morris, <mark>William</mark> OBrien, H. A. my, Mr. Torrence"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William", "William"], "snippet": "and Torrence, J. Allen <mark>Gills</mark>, <mark>William</mark> D. i tir Morris, <mark>William</mark> OBrien, H. A. my, Mr. Torrence"}], "text_match": 1736172818711707769, "text_match_info": {"best_field_score": "3315704004608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818711707769", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.94, 923.84, 1767.49, 1184.13], "bbox_id": "75a3fff2f9", "file": "AppomattoxNewspapers_1933-1936a_0467.pdf", "page": 1, "text": "The family of Mr. and Mrs. William Pitzer Gills held a reun ion on the week end of May 24, 1 it being the occasion of the birth days of Miss Catherine Gills and  Mr ..Pitzer Gills.  A number of friends and relat-  ives called to express their good  wishes. Those from a distance who i spent the week end in the home of 1 Mr. Gills were Miss Martha Cop j enhaver, of Charlottesville Mrs.  O. P . Farrar, of Blackstone Mr. land Mrs. Kennard Gills and Mr. and Mrs. Luther Pittman, of Richmond Henry P . Gills, and daughter, Miss Irene and Mr.and Mrs.. William H. Copenhaver, of Marion R. B. Frazier, of Hend ersof, N . -VC. I Lynwood Faufett, of Phenix and Miss Hallie C. OBrien, of Chestnut Grove Mr. and Mrs. J . Alen Gills and daugh ter, Eloise and Miss Lucy OBrien of Lynchburg. Mrs. L. B. Pittman is spending the week in the home of her father W. P. Gills."}, "highlight": {"text": {"matched_tokens": ["Gills", "William", "H"], "snippet": "of Richmond Henry P . <mark>Gills</mark>, and daughter, Miss Irene and Mr.and Mrs.. <mark>William</mark> <mark>H</mark>. Copenhaver, of Marion R."}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William", "H"], "snippet": "of Richmond Henry P . <mark>Gills</mark>, and daughter, Miss Irene and Mr.and Mrs.. <mark>William</mark> <mark>H</mark>. Copenhaver, of Marion R."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["William", "H", "Gills"], "snippet": "Watkins, Geo. T. Peers, <mark>William</mark> Paris, Wilson Hix, W. T. Johnson, Wm. <mark>H</mark>. <mark>Gills</mark>, Cooch Plunkett, T. B."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "Gills"], "snippet": "Watkins, Geo. T. Peers, <mark>William</mark> Paris, Wilson Hix, W. T. Johnson, Wm. <mark>H</mark>. <mark>Gills</mark>, Cooch Plunkett, T. B."}], "text_match": 1736172818577490041, "text_match_info": {"best_field_score": "3315703939072", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818577490041", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1466.9, 942.06, 1609.91, 1809.19], "bbox_id": "18e17810dc", "file": "AppomattoxNewspapers_1952-1954a_0508.pdf", "page": 1, "text": "t it. iO U n ccv u v a i tobacco commission mer- bacco leaf dealers and no 22 chewing tobacco manu- were listed. Tobacco ware- re Friends, Lynchs, Lib- j-tins, Moormans, Paces, Sc. George A. Diuguid   undertakers at 46 Main, e Lynchburg was disposed directory, on page 195, ets around to the miseel- ppartmer And therein at Appomattox County was fth Judicial CircAiit, with stavus A. Wingfield hold- ere the 15th of March and of September. He served, rounties of Bedford, Camp- nd I Amherst, as well as the f Lynchburg. Henry T. Parrish judge of the county court in  u b x , holding court the firs daw after the first Monday in mofth. is alnost incredible to find out H er of secret, benovolent ther societies and organizations d in the 1880s. Marshall 39, Hill City Lodge No. iburg Chapter No. 10, De r kmandery No. 4, Covenant 12, Star of the West e, Prince Hall Lodge No. 29, hapter No. 5, Knights of ujth two lodges, I. O. txyo lodges, I. O. R. M., gbities, Legion of Honor, mm, Knights of Honor, ite with four units, St. eneficial Society, St. viers, Ladies of the Al- en add in the Garland lub, Oliver Twist Club, ty Boat Club, The Gentle- ng Club, Ladies Glee ordia Glee Club, Mozart ___ and Opera House. Gee, sver stayed at home no won- m didnt need television! to newspapers, there were The Lynchburg News pub- evefcr morning except Mon- WHfgjplso got out a tri-weekly 1 onlMonday, Wednesday and i, and on top of that a weekly  enlThursday. That seems to P toJTEN issues a week. The bum Virginian and the Daily lC j tbe same, except that dvaniee got out a semi-weekly  fa tri-weekly on top of its and weekly issues it all indi- tbai 29 papers a week were led.A. Waddill was proprie- ThigNews and a young fellow 8 6Pne of Carter Glass was ditor. JgjBpomattox way, N. H. Rag- ras mstmaster and ran a gen- aerchndise store. The school nown as Budwells High L mbert P. Pattei son was the  daitor. Joel W. Flood was  cattle dealer, as was W. tneyUEdward G. Hix ran the loteLIWilliam H. Gills was the 7 hwosurer, David A. Christian I William A. Plunkett aeriff, John Robertson was the akerand T. P. Taylor was e of peace. John and Will- osser ran stores. Leading farm- nr w Woodson, John .M   Sears, Charles H. Sack- ilhsjgb,e, William Trent. Allen pings Conner, Ed S. -ontmfced on Page Four"}, "highlight": {"text": {"matched_tokens": ["H", "Gills", "William"], "snippet": "Hix ran the loteLIWilliam <mark>H</mark>. <mark>Gills</mark> was the 7 hwosurer, David A. Christian I <mark>William</mark> A. Plunkett aeriff, John"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills", "William"], "snippet": "Hix ran the loteLIWilliam <mark>H</mark>. <mark>Gills</mark> was the 7 hwosurer, David A. Christian I <mark>William</mark> A. Plunkett aeriff, John"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [792.48, 897.87, 952.36, 1170.72], "bbox_id": "97c56f7934", "file": "AppomattoxNewspapers_1898-1902a_0219.pdf", "page": 1, "text": "Hixburg. Rev. S. H . Thompson, of South Boston, aided Rev. P. T. Warren in a meeting at Walkers Church last week. Mr. Thompson is a conse crated Christian, and preaches with earnestness and power. Only four persons made a public profession of religion, but the Christians feel that they have been benefited and encour aged by the sermons of the week, and will always remember Brother Thompson in their homes, especial ly around their family altars. During sthe meeting there were several visitors in Hixburg neigh borhood  Miss Gold, of Richmond  Misses Ellen Cunningham and Kale Verser, of Earmville and Misses Elcan and Jones, of Buckingham. Mr. Thus, I. Gilliam,who is spend- iu his summer at Hampden-Siduey, spent two days at the home of his father, Mr. H . E . Gilliam. Dr. Al- sop, of Prospect Mr. William Gills, of Earmville, and others, came up for a day. X ."}, "highlight": {"text": {"matched_tokens": ["H", "William", "Gills"], "snippet": "of his father, Mr. <mark>H</mark> . E . Gilliam. Dr. Al- sop, of Prospect Mr. <mark>William</mark> <mark>Gills</mark>, of Earmville, and others,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William", "Gills"], "snippet": "of his father, Mr. <mark>H</mark> . E . Gilliam. Dr. Al- sop, of Prospect Mr. <mark>William</mark> <mark>Gills</mark>, of Earmville, and others,"}], "text_match": 1736172818443272313, "text_match_info": {"best_field_score": "3315703873536", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1736172818443272313", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [786.51, 390.53, 1126.43, 708.93], "bbox_id": "2fc7674121", "file": "AppomattoxNewspapers_1939-1943a_0084.pdf", "page": 1, "text": "teaon and G. L. Doss spent Monday wood, of Victoria, were guests Sun- at Buckingham Court House as the day of Mr, and Mrs. A.R.Har- guests of Mrs. P . J . Shepherd. wood. Rev. Harwood preached Sun- ,  , .. day morning ab Liberty church. The x . v v . A . s will meet tonight with Miss Ethelyn Lee. M in Lee. Misses Jessie Fitzgerald and Lill- Mrs. Thelma Caldwell and Miss Lola Ian Davidson spent the week-end in Moore will be joint hostesses. Lynchburg and attended a beauty  ,    _ operators convention in Roanoke on Mrs. Robert McQueen, of Damas- Monday and Tuesday, cus and Mis. Albert Reynolds, of Lynchburg are visiting their parents Misses Ethelyn Lee and Cornelia Mr. and Mrs. John Tweedy Gills will spend Sunday In Richmond.  , . . . ,,  .  They will be accompanied by Miss Kyland M. Mann, Mr and Mrs. jjajie OBrien, who will remain for Grover Smith and Mrs. Percy Sta- a visit with Mrs. l .B .P ittman, ten motored to Washington Monday to attend the opening ball game. M r. and Mrs. Frank Gilliam and Willie Gililam, of Roanoke, were Mr. and Mrs. J.N Phe.n. and recent, visitors of their mother, Mrs. iP.ily and Mr. and Mrs. J . H. m je Gilliam at her home in Hill- Luoi.dj spent Sunday with Mr .and pt Mrs W L. Coleman. h i .. Mr. and Mrs. Adolph Haug an-  lte rt 0 Brien, i f W auigbw , nounce the birth of a baby boy, stunt r few days km week with WiUlam Adolph, bom Monday at !r Y  tn s Mrs. W , W , t h e Virginia Baptist hospital in UJin. Lynchburg, April 15. Mrs. William H. Copenhaver Mr and Mrs William HarVeyi has rs im ed to Mar.or. after spend- Mr and Mr3  . E . Harvey of mg several days here with her par- , _  _ TT ents, Mr. and Mrs. W .P.G ills. Chase City and Lester B. Harvey were dinner guests of Mrs. R.F. Miss Mary Ann LeGrand, who has Akers Sunday, been spending sometime at her home! ... . _ ,  _. here, left Sunday for Beckley, W. Miss Sadie Reyonlds and Uoyd"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Lynchburg, April 15. Mrs. <mark>William</mark> <mark>H</mark>. Copenhaver Mr and Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Lynchburg, April 15. Mrs. <mark>William</mark> <mark>H</mark>. Copenhaver Mr and Mrs"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [797.06, 261.74, 970.84, 357.7], "bbox_id": "1525733e74", "file": "AppomattoxNewspapers_1960-1962b_0120.pdf", "page": 1, "text": "SFC and Mrs. William H. Jacobs of Fort Knox, Ky., are. voting Mrs. Jacobs parents, Mr. and Mrs. D. P. Moon. SFC Jacobs is on a 15- day leave. Mr. and Mrs. R. C. Hubbard, Mr. William C. Hubbard and Miss Suzanne __ Gills E. Hancock, Jr., spent this"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "SFC and Mrs. <mark>William</mark> <mark>H</mark>. Jacobs of Fort Knox,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "SFC and Mrs. <mark>William</mark> <mark>H</mark>. Jacobs of Fort Knox,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [222.25, 1026.72, 2253.27, 1261.64], "bbox_id": "6e1c5e1e53", "file": "TimesVirginian_1984a_0057.pdf", "page": 1, "text": "Pamplin City Dr. J. T. Tinsley, the dentist in Mineral andDr. B. S. Venter, thedentist in Beat Crock. Druggist listed in the directory in 1888 for Appomattox included H. C. Babcock in Mineral he was the grandfather of feed residents, H. W ebster Babcock, owner-operator of Babcock Manor M arniet Babcock Seargent, and Bfenche Babcock Poe. In Bent Creek the drimgist was J. J. Bolton and in Pamplin City D. W. Gills. H. the dentist and the druggnt couldnt ease the pdm then augroe it would have been time to call on one of the distillers in the county bade then __ jail nice and legd tool According to the directory. Tower Hfll and Evergreen had the most. In Evergreen, the distillers were George T. Farrar, William A. Glover, A. N. Harvey. In Tower Hfll, if booae Who Make Appomattox Countys"}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "Pamplin City D. W. <mark>Gills</mark>. <mark>H</mark>. the dentist and the"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "Pamplin City D. W. <mark>Gills</mark>. <mark>H</mark>. the dentist and the"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1898.9, 1144.83, 2068.65, 1499.68], "bbox_id": "337a49fbf8", "file": "AppomattoxNewspapers_1952-1954a_0581.pdf", "page": 1, "text": "On May 16, Troop 46 of the Boy Scouts attended the morning service at Memorial Methodist Church. They were accompanied by their Scout master, Eames A. Powers. The troop in Appomattox is sponsored by the Lions Club. Scoutmaster Powers states that he hopes to make periodic attendance at alternate churches a regular part of the Scout program. Those attending the service Sun day were Richard E. Hamilton, 2nd class Scout and Senior Patrol Lead er John S. Evans, Tenderfoot, As sistant Patrol Leader William H. Caldwell, Tenderfoot, Assitant Pa trol Leader Brian E. Thomas, Ten derfoot, Patrol Leader Thomas E. Holland, Tenderfoot, Scribe Julian C. Gills, Tenderfott, Stephen W. Runkle, Tenderfott, Patrol Leader Samuel E. Shouse, Jr., Tenderfoot Holcombe T. Wood, Tenderfoot Charles F. P. Crawley, Jr., Tender foot Franklin L. Burke. Those not attendeding, but members of the troop Kenneth Lovell, Daniel C. Paulette, Wilson K. Fleshman, Walter E. Hancock, Clyde F. Mitchell, Wil bur C. Fleshman, William Runkle, Life Scout and Junior Assistant Scoutmaster. Summer activities of the troop will include overnight camping trips, a party and attendance at the Scout Camp Monocan."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "As sistant Patrol Leader <mark>William</mark> <mark>H</mark>. Caldwell, Tenderfoot, Assitant Pa"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "As sistant Patrol Leader <mark>William</mark> <mark>H</mark>. Caldwell, Tenderfoot, Assitant Pa"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1778.81, 1033.24, 1948.81, 1111.64], "bbox_id": "4cd57a3691", "file": "AppomattoxNewspapers_1949-1952a_0393.pdf", "page": 1, "text": "Mrs. James A. Conner, of Hali fax Mrs. Banks Frazier, of Ken- bridge, and Mrs. William H. Copen- haver, of Appomattox, attended the funeral of their cousin, Miss Vir ginia Gills in Charlottesville on Fri day. Miss Gills died at the home of her sister, Mrs. John Bell."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Ken- bridge, and Mrs. <mark>William</mark> <mark>H</mark>. Copen- haver, of Appomattox,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Ken- bridge, and Mrs. <mark>William</mark> <mark>H</mark>. Copen- haver, of Appomattox,"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1748.11, 1159.2, 1922.59, 1379.8], "bbox_id": "50e7c69ce0", "file": "AppomattoxNewspapers_1943-1947a_0472.pdf", "page": 1, "text": "j-Viisg Liindy Warrinar was in Lynchburg Tuesday. Mrs. Leswood Harvey and Miss Llimmey Maxwell will leave Friday to visit Sgt. James Maxwell and Pvt. Raymond Maxwell at Langley l? ield, r a Mrs. Andrew Bigger and grand sons, Henry Watkins Conner, Jun- ioi , and Wallace DuPlantes, and Mrs. Earle Lauvre, of Por tArthur, lexaSWho. are spending sometime wi.h relatives in Halifax County, spent Sunday with Mrs.  James Alexander Conner at LocustGrove. Mrs. William H. Codenhhver, who spent last week in arion, Va., has returned to her home near here. Miss May Conner, of Danville, Miss Evelyn Conney and Mr. P. E. Conner, of Lennig, sjwnt Sunfey in the home of Mrs. Pitzer Gills."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Conner at LocustGrove. Mrs. <mark>William</mark> <mark>H</mark>. Codenhhver, who spent last"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Conner at LocustGrove. Mrs. <mark>William</mark> <mark>H</mark>. Codenhhver, who spent last"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1414.81, 1104.04, 1744.66, 1193.73], "bbox_id": "bfcd0fa6bc", "file": "AppomattoxNewspapers_1939-1943a_0081.pdf", "page": 1, "text": "Htajkreaching on the third Mrs. J . R . Maritoall, Mrs  HHtaRi nlni church moved to 3 Carson and son, ana Mrs. n . William S. Royall M Marshall and Morton J r. called     B e s id e n t. Then Mrs. jn the home of E .P .S ears Wed-    H fan co ck served as the nesday. __ , E K ver 20 years. Mrs. , Mrs. H .J . Cdvtogton tetumed H H  Gills succeeded her. to her home here Sunday alter vi - K  j iting in Lynchburg. . . Catlett Conway Talliferro, 1 Ed McPhillips to confined to hw Major account of sickness."}, "highlight": {"text": {"matched_tokens": ["H", "Gills"], "snippet": "J . Cdvtogton tetumed H <mark>H</mark>  <mark>Gills</mark> succeeded her. to her"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills"], "snippet": "J . Cdvtogton tetumed H <mark>H</mark>  <mark>Gills</mark> succeeded her. to her"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [307.9, 450.26, 479.85, 940.06], "bbox_id": "7c7c5e9054", "file": "AppomattoxNewspapers_1943-1947a_0015.pdf", "page": 1, "text": "A wedding of widespread interest gas solemnized Tuesday evening at .30 in Liberty Baptist Churci here, when Miss Josephine aullivar. .Jenkins, daughter of Mr. and Mrs. Charles Spurgeon Jenkin?, became He bride of Captain Jack Marvin Dickerson, United States Army Air Corps, son of Mr. and Mvs James y, Dickerson, of Kenbridge, Vir ginia. The brides pastor, the Rev. Frederick Jones, was the offi- sting minister, the ring ceremony hi ng used. The church was deco- fsted wi h cathedral candles, palms and white flowers. Ah organ prelude was rendjred by Miss Cornelia Ky.e Gills  Ain hfan Aimee,  My Hart at. Thy Mveet Voice,  Ve.ietian Love Jong,  Barcarolle Se-er-lae and Mr. John Curtis Caldwml sang  Be cause and  At Dawning.  i The bride, who was given in mar- fiage by her father, wore a wed ding gown of ivory slipper satin fanioned with high round neck iealloped yoke of marquisette, long sleeves tapered to points over the bands shirred panel .basque bodice with the fullness of the gathered gkirt forming a sweeping train.Her full length veil of imported illusion dotted with buds or orange blos som s fell from a bandeau of orange blossoms. Her only ornament was a String, of pearls, a gift from the j-oom, She carried a cascade o f white bridal flowers.   The brides ring was carried b y Master Jack Caldwell. The maid- gf-honor was Miss Ruth Stone of Richmond, who wore a mellon jer- gtty bask waist with chiffon skirt, veetheart neckline, with matching n .broidery. The brides maids, Miss Vi-ginia Christian of Appomattox, Musdames William H. Daughtery of Blacksburg, a sister of the groom, n d Robert E. Garrison of Norfolk, wore gowns in mellon and aqua,."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Christian of Appomattox, Musdames <mark>William</mark> <mark>H</mark>. Daughtery of Blacksburg, a"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Christian of Appomattox, Musdames <mark>William</mark> <mark>H</mark>. Daughtery of Blacksburg, a"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1524.7, 301.14, 2024.27, 1181.39], "bbox_id": "6401a90f6c", "file": "AppomattoxNewspapers_1939-1943a_0242.pdf", "page": 1, "text": "4 night, and underwent an operation for appendicitis. ... , Miss Maxine Glenn, Mrs. Ever- j ette Kangas and Frank Coleman, of  Washington, pipent the week-end with Mr. and Mrs. E. R. Glenn. Miss Mildred Lawson returned home Tuesday from Johnston-Willis hospital, Richmond, i after having pneumonia. Mrs. William H. Copenhaver, -of Marion, and Mr. arid Mrs. J. A. Gills, of Chatham spent the week end with Mr. and Mrs. W. P. Gills. Charles Bernier, of Hampden- Sydney, will address the Appomat tox Lions Club tonight A student .orchestra has been or ganized at the Appomattox school. The Rev. and Mrs. H. F. Jones are attending the General Baptist Association in Dariville. Mr. and Mrs. F. A. Duffcy and family, of Daleville, spent Saturday with Mr. and Mrs. W. P. Ferrell. Mr. and Mrs. W. P. Ferrell nd family will spend Sunday jvlth Mr. and Mrs. C. C. Croucn, in Roan oke. Mr. and Mrs. Ben F. Saunders, of Richmond, and Miss Lucille Cralle, of Charlottesville spent the week-end in the home of Mr. and Mrs. C. C. Cralle. M ss Susie Plunkett, of Chatham, was home for the week-end, with her parents, Mr. and Mrs. J. D. Plunkett. Edwin Frazier, of Richmond, was in Appomattox for the .week-tnd. The Susie Whittinghill Circle of the Y. W. A.S, had a covered dish supper and a study, course, in the home of Mrs. H. F. Jones Tuesday evening. Mr. and Mrs. Frank Shramck and Mr. and Mrs. Morgan Gibson, of Baltimore, were guests of the Rev. rnd Mrs. H. F. Jones for the week end. Mr. and Mrs. Herman Robertson, of near Lovingston, visited relatives in the eounty during the week-end. Mr. and Mrs. J. Rolfe Brame, of Richmond were week-end gues s of Mr. and Mrs. J. C. Caldwell. Miss Violet Ramsey and A. R- Harwood, Jr., visited friends at Charlotte Court House Sunday, Toni Collins, who works at Rad ford, was home for the Week-end. Miss Kate OBrien, of Farmville was here Sunday. Ed Harvey has accepted a posi tion in Farmville, and will go there he first of the coming month. The Thursday bridge club met last week with Mrs. Raymond Law- son. Prizes -Went- to Mrs. W. M. Morris and Sirs. -L. L. Gayle. Week-end guests of Mrs. Joel W. Flood were Miss Ada Davis and Mrs. Robert Whitehead, of Rich mond. Mrs. H. D. Flood, and son, Boll ing, of Washington, D. C., spent I Wednesday night. here en route to Florida. .-Robert Lynch was taken to the _ .. . - e _ Virginia Baptist. Hospital. Tuesday  Mrs. B. F. Robinson, of Syringa,"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "after having pneumonia. Mrs. <mark>William</mark> <mark>H</mark>. Copenhaver, -of Marion, and"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "after having pneumonia. Mrs. <mark>William</mark> <mark>H</mark>. Copenhaver, -of Marion, and"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1374.93, 677.69, 1639.73, 888.79], "bbox_id": "83b19cdea3", "file": "AppomattoxNewspapers_1939-1943a_0071.pdf", "page": 1, "text": ". .. ,  , - V Ranks Frazier and Mrs. Vera by Alfred Garrett, nnk, of Richmond spent  la the home of their par- Mr.and Mrs. W .P. Gills. William PJtzer Gills is aawiy from a illness tracks. Kate and Edith OBrien, GUIs and Robert Work, Pamplin, Mart 27.-flBB.  tour or charieston T . U observed the a n a o i l 95 ial Thursday in the h o n S f ther Igooi fortune to be O E P e te L n . Mra. L j P B P  f ref  . JÊütt, one of the first plays g a T iu -iV ff America, at the oldest ber Mra H. . A frica, the Dock Street of the program. Aftvr on , ,h clst session covered dish supper  J l a y S the of India Wilkes in the movie -W ith the Wind, as well as t P,vp, v-H d u m TftfecrnïSmthe noted L. Reeves had charge 01 personal"}, "highlight": {"text": {"matched_tokens": ["Gills", "William", "Gills"], "snippet": "Mr.and Mrs. W .P. <mark>Gills</mark>. <mark>William</mark> PJtzer <mark>Gills</mark> is aawiy"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William", "Gills"], "snippet": "Mr.and Mrs. W .P. <mark>Gills</mark>. <mark>William</mark> PJtzer <mark>Gills</mark> is aawiy"}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "<mark>William</mark> Pitzer <mark>Gills</mark>, who died at his"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "<mark>William</mark> Pitzer <mark>Gills</mark>, who died at his"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1470.23, 609.32, 1709.02, 1013.2], "bbox_id": "7237f76423", "file": "AppomattoxNewspapers_1926-1933a_0274.pdf", "page": 1, "text": "training. Dr. Brumfield, district health officer in co-operation with county physicians will begin week of May 26th to examine ail children of Appomatto couhty who expect to Tbegir school next session. Parents will get in touch with their family physician and make ar rangements to have children examined The cost will be slight to each Each physician has set aside one day during the week begining the 26th for these examinations at his office. William- Pitzer Gills after 27 years as carrier on Route 2 retired yesterday in good health. He had gotten several extensions and his last one ex pired yesterday and he is in town to-day receiving the con gratulations of his friends. The post office employees pre sented Mr. Gills with a new hat just the kind he likes, and the presentation and acceptance speeches were mingled with Motto Wool- tears. Just what Pitzer will T h e l m a  dno one knows but it-- 181 hoped that as he works the flowers garden at home the fragrance and beauty of his home will give him a life of joy and pleasure. Mr. Gills is 71 years of age."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "examinations at his office. <mark>William</mark>- Pitzer <mark>Gills</mark> after 27 years as"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "examinations at his office. <mark>William</mark>- Pitzer <mark>Gills</mark> after 27 years as"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1713.81, 909.03, 1892.09, 1145.58], "bbox_id": "abadba4615", "file": "AppomattoxNewspapers_1943-1947a_0512.pdf", "page": 1, "text": "Mrs. William Pitzer Gills and 1 Mrs. James Alexander Conner en tertained at their home, Locust Grcve, last Friday evening at a buffet supper preceding tne wed ding rehearsal for Miss Hilda Car ter, who was married on Saturday evening to Mr. Carey Jefferson. Tne hostesses were assisted in Gwendolyn Paulette.  serving by Mrs. James W. Waller, MissRosa Mae Wooldridge and Miss Guests included Miss Hilda May Carter, Mr. Carey Jefferson, Mr. and Mrs. William Wood Burke and little Emily Wood Burke, Mr. and Mrs. J. C. Caldwell, Miss Har- riette Holley, Mr. and Mrs. Dwight Paulette, Mr. ari Mrs. Charlie Carter, Mr. and Mrs. Thomas Rich- M v qw J TV s V g T Ttf usvii, iui. cuiu mi b, jueonara w  Carter, Mr. and Mrs. Edwin Car ter, Mr. Floyd Flora, Mr. and Mrs. Wilkerson, Mr. Melvin Jefferson, and Rev. and Mrs. H. F. Jones."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Mrs. <mark>William</mark> Pitzer <mark>Gills</mark> and 1 Mrs. James"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Mrs. <mark>William</mark> Pitzer <mark>Gills</mark> and 1 Mrs. James"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [581.29, 702.88, 753.82, 897.42], "bbox_id": "37c182ef7e", "file": "AppomattoxNewspapers_1943-1947a_0301.pdf", "page": 1, "text": "Mrs. James A. Conner spent last week in Roxboro, N. C. Mr. and Mrs. W. H. Churchwell , of the University of Richmond fa-  eulty and J. Allen Gills spent Sun day with Mrs. William Pitzer Gills. Capt. Richard F. Dudley, who recently returned from China will rpand the week-end here with his brother, W. C. Dudley. M iss Ola Carter and Ifflss Mar garet Ligon, Wm. C. Dudley and Capt Richard F. Dudley will at tend the V. P. I., Virginia foot ball game Saturday in Raanoke. Mr. and Mrs. Joe Terry and M iss Emily Featherston were visi tors this week in Lynchburg."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Sun day with Mrs. <mark>William</mark> Pitzer <mark>Gills</mark>. Capt. Richard F. Dudley,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Sun day with Mrs. <mark>William</mark> Pitzer <mark>Gills</mark>. Capt. Richard F. Dudley,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.92, 1128.39, 1792.53, 1449.69], "bbox_id": "b7ef399b44", "file": "AppomattoxNewspapers_1939-1943a_0340.pdf", "page": 1, "text": "Mr. and Mrs. James P. Gills and children, Julian Scott, Lucille and Jimmy, of Bluefield, West Virginia spen the week-end in the home of Mrs. E. E. Gills. Mr. and Mrs. Luther B. Pitman, of Richmond, recently visited in the home of W. P. Gills. Mrs. William Halller Copenhaver left last week to spend the school session in Marion, where she is on the faculty of the high school.. Raymond Crawley will attend William and Mary College this ses sion. Mrs. George Perdum has return ed from a vsit to relatives in B.uefield, W. Va.  J. C. Caldwell spent last Thurs day in Washington. Charles T. Moses Jr., and James Elictt Cheatham left ast week to resume their studies at V. M. I.  Mrs. Annie Adams left Sunday for her home at Outwood, Ky., after spending several weeks in the home of J. H. OBrien with her mother, Mrs. Lucy Conneer who continues ill. Mr. and Mrs. G. M. Deane will"}, "highlight": {"text": {"matched_tokens": ["Gills", "William"], "snippet": "home of W. P. <mark>Gills</mark>. Mrs. <mark>William</mark> Halller Copenhaver left last"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William"], "snippet": "home of W. P. <mark>Gills</mark>. Mrs. <mark>William</mark> Halller Copenhaver left last"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [487.7, 412.06, 657.5, 1225.39], "bbox_id": "cd64ec0c22", "file": "AppomattoxNewspapers_1918-1922a_0581.pdf", "page": 1, "text": "HIGH SCHOOL Fourth YearRachel Fergu son, Frances Street, Minnie L Robertvon, Grace iiagby, Reg gie Stanley, Frank La Prad,, Frances Wagner, Joun Cheat ham, Gxines Oleehy, J, phiue Towler, Veria S oi Nola Burk y, Stella Iayne. Tnird YearLvdia Roger?, Cor  b tine Foster, Marguerit Giiham, Iva Ferguson, Ray mond Beale, Ray Lee, Colonel Fourquerlan, Berkley Andrews, Reid Hatcher, William Burke, Ruper Rogers, Earl Carson, Ned Hancock, Deroy Jennings, Willard Peake. - Second YearArtie Drinx- ard, Gladys Van Volkenburg, John Caroll Stanley, Walter Ford, Annie Saell, Clara Caw thorn, Zell Harper, Kmnit Gravitr, Mary Hale, Elsie Hale Eleanor Casey, Dorothy Hund ley, Bessie V. Harwood, Alct Street, Virginia Sherer, Hump ton Custer, Myrtle Smitn, Nellie Gaw,norn. First Grader Alfred J inning? Frances Gordon, Carlton Orewt Lucy Hale. 7th GradeKennard Gills, Fred Twyinan, Franx Harper, Nathan Goin, Uowa d Rogers, Harry Puckett, Teddy Gills. 6 h GradeRebecca Martin, Florence Gregory, Frances Up ton, Billy Trent, Vara Smith, Alice Harwood, Catherine Gills, Nell Cawthorn. 5h GradeMary Trent, Billy Ferguson, Eva Doss, Thelma Ferguson, Florence Gilbert, Clyde OBrien, Joe OBrien, Harold Furbusb, Corinne Han cock, Frankie McKinney, Josie Jamerson, Ruuy Upton, Rich ard McDearmoo. 4th GradeFloyd Dinkins, Edward Almond, Eleanor Har wood, Lucy LeGrande, Mary Ann LeGrande. 3rd GradeLula Wooten. Carrie Warnner, Virginia Puckett. 2ud GradeBilly Cawthoru, James Morns, Holcombe Cald well, Bennett Smith, Ruby Wooldridge, Margaret Hundley Elizabeth McDearmon, Ethel O. Guilt, Homer Babcock, Louise Doss Charles  Crawley, Charles James Jr., E. T. Price J r , derman Carter, Mary Smith, Beatrice Smith."}, "highlight": {"text": {"matched_tokens": ["Gills", "h"], "snippet": "Rogers, Harry Puckett, Teddy <mark>Gills</mark>. 6 <mark>h</mark> GradeRebecca Martin, Florence Gregory,"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "h"], "snippet": "Rogers, Harry Puckett, Teddy <mark>Gills</mark>. 6 <mark>h</mark> GradeRebecca Martin, Florence Gregory,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.28, 496.22, 1852.05, 898.16], "bbox_id": "6c6d338bc0", "file": "AppomattoxNewspapers_1943-1947a_0026.pdf", "page": 1, "text": "Guests of Mr. and Mrs. Roland Ferguson Sunday were Mr. and Mrs Clarence Smith and family, of Lynchburg, Mr. and Mrs. W. H. Guill and family, Mr. and Mrs.Jack Smith and family, Mrs. Ann Fer guson and grand-daugh er, Jean Ferguson. Miss Claudine OBrien has return ed home after spending a week at Iron Gate with her sister, Mrs. O wen Persinger. Mrs. Malcolm MacLean and grand son, Sam Bernard Gutchins, o f Franklin are guests in the home of Miss Mary Louise Gills. The MacLean Circle oi the W. M. S. of Liberty Church will meet Thursday evening on the lawn at  the home of Mrs. W. W. Burke, the occasion being, in addition to the  regular meeting, a picnic. Mrs. IT . A. MacLean will be the guest of hono,. The Circle was named in lov ing numory of the late Dr. M. A. MacLean, who was a former pas tor of Liberty Church The program will be conducted by M.ss. Mary Louise Gills and the subject will be, Who Dares? Mrs. Luther Boyd Pittman, c f Richmond was a recent guest in the nome of Mrs. W. P. Gills. Mrs. M. A. MacLean, Sam Ber nard Cu.chins, of Franklin and Miss Mary Louise Gills and Robert Ter rill Gills were week-end guests at Locust Grove, the heme of Mrs. William Pitzer Gills, near Appomat tox."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "the heme of Mrs. <mark>William</mark> Pitzer <mark>Gills</mark>, near Appomat tox."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "the heme of Mrs. <mark>William</mark> Pitzer <mark>Gills</mark>, near Appomat tox."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [955.62, 1135.06, 1093.64, 1483.0], "bbox_id": "eaeb8de7cd", "file": "AppomattoxNewspapers_1952-1954a_0113.pdf", "page": 1, "text": "F. P. OBrien John M. Biakeuey Harold Y. Spencer Dr. D. A. Christian, III. John P. Taylor Robert Allen Sears Mrs. Rose J. Coleman Mrs. R. G. Coleman Dorothy Johnson Coleman T. A. GuiU W. L. Coleman Mary P. Gills Mrs. Alton Moore Claiborne Inge R. B. Martin Ruby Paulett Mrs. Marie Carson E. O. Wooldridge Beverley K, Martin Mr. and Mrs. J. C. Garner Pat M. Mohler Mrs. D. W. Jamerson Mrs. R. A. Lucado W. T. Covington L. S. McCormick, Jr. E. H. Johnson R. H. Fore William J. Walton, Jr. Z. E. Cheatham Clarkie E. Ranson Mr. and Mrs. E. C. Baldwin Gladys J. Harvey J. K. Marshall W. D. Hix T. T. Martin R Clarke Lewis"}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "E. H. Johnson R. <mark>H</mark>. Fore <mark>William</mark> J. Walton, Jr. Z."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "E. H. Johnson R. <mark>H</mark>. Fore <mark>William</mark> J. Walton, Jr. Z."}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1863.58, 213.25, 2019.7, 1215.23], "bbox_id": "1205441563", "file": "AppomattoxNewspapers_1915-1918a_0310.pdf", "page": 1, "text": "Appomattox Agr. H. S. Honor B oll for December Grade 1Hester Guill, Cor- rinne Hancock, Kate Morris, Frankie McKinney, Richard McDearmon. Grade 2 Al i c e Harwood, Ouida OBrien, Allen Gills, Florence Gregory, Lillian Cald well, Elite Puckett, Elizabeth Smith, Ruby Caldwell, Mary  oss, Eddie Babcock, Elton Callaham, Baker Farrar, Ken- nard Gills, Lawson Fore. Grade 8 Margaret Furbush, Estelle Dickerson, Thelma Fer guson, Rebecca Martin, Lea  Martin, Vara Morris, Pauline lucker, Graoie Morris, Vara Smith, Francis Upton, Edith Thomas, Eunice Gahliar, Joe ferguson, Ivein Farrar, Will- iam Fergus on, Berkeley Gil bert, Teddie Gills, Russell Jam- erson, Hugh Martin, Riohard ! Plunkett, Obie Ferguson. Grade 4Willie Booth, Hes ter Davidson, Hallie Mitchell, Rachel Perdue, Helen Dicker- son, Nellie Callaham, Sears Booth, Randolph OBrien,Dave Cutlip, Howard Inge, Arthur i lobinsón, Billy Trent, Jimmie Wooldridge. Grade 5George Inge, Lyle McDearmon,Eleanor Ferguson, 3essie Harwood, Mary Ruoker, Esther Scheffler, Myrtle Smith, Vivian Wooldridge. Grade 6 B e s s i e Mitchell, E a r l e Patterson, Elizabeth Trent, Burke Steele, Ned Han cock, Lucy Fore, Mabelle Con ner, Ruth Clement, William ! Burke, Ryland Mann. Grade 7C a 11 i e Baocock, Stella Payne, Ressa Evans, Lee Giles, Mattie Gunter, Edgar Howl, Nola Burkey, Reggie Stanley. I High SchoolHettie Wood son, John Perdue, Roselle Han dley, Margaret Gibson, John . fere, Minnie Robertson, Adam Parks, Kathleen Morgan, El aine McDearmon, Mary Ban- ton, Rheda Drinkard, James fersythe, Cornelia Gills, Mary Gills. II H i g h SchoolJessalyn H a n c o c k , Braxton Gordon, Lewis Doss, Clark Caldwell, Georgia W a l t o n , Elizabeth Wagner, Anna Vries, Mildred Trent, Riohard Smith, William Shelton, Bednego Morris, Geo Hubbard, Agsteavidson, El sie Carson, Harry Plunkett, Lougenia Patteson, Gladys ! Patteson, Mortie Morgan, Mil dred McDearmon, Virgie Inge, Virginia Hancock, Nellie Rob ertson, Astatyy Rucker. III High SchoolKathleen Ruoker,Joe Inge, Elliott Cheat ham, Ruth Foster, Edwin May hew, Elsie Payne, Russell Pril- laman, Lilian Evans, Aubrey Webb. IV High SchoolAnnie Han cock, Lila Robertson, Archer Crute, Annie Carson, Merle Da vis, Francis McDearmon, Em ma Hancock, Guy Rice, John Robertson, Ernest Shot well, Harry Shot well, Eiva Stratton, Kathleen Rosser, Annie Alvis"}, "highlight": {"text": {"matched_tokens": ["Gills", "H", "h"], "snippet": "fersythe, Cornelia Gills, Mary <mark>Gills</mark>. II <mark>H</mark> i g <mark>h</mark> SchoolJessalyn"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H", "h"], "snippet": "fersythe, Cornelia Gills, Mary <mark>Gills</mark>. II <mark>H</mark> i g <mark>h</mark> SchoolJessalyn"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [629.3, 385.48, 789.25, 1002.14], "bbox_id": "388f5279a9", "file": "AppomattoxNewspapers_1918-1922a_0403.pdf", "page": 1, "text": "A P P O M A T T O X A G R IC U L T U R A L H IG H S C H O O L 4th YearUrace Bagby, Stella Payne, Frances Street. Minnie Lee Robertson, Gaines Oglesby, datteau Carr. 3rd Year  Willard Peake, Reupert Rogers, Reid Hatcher, DeRoy Jennings, Margaret Gilliam, Berkley Andrews. 2ad YearElizabeth Trtn , Bessie V. Harwood, John C. Stanley, Hampton Custer,Clara Gawthon, Alice Street, Mary Hale, Elsie Hale, Anuie Snell, Zelle Harper, Gladys VanVolk- enburgh. 1st YearAlfred Jennings, Frances Gordon, Frances Ford, Lucy Hale. 7th GradeHoward Rogers, Teddy Gills 6 h GridtCatherine Cld well, Roy land Lawson, Lillian Oaia well, Florence Gregory, Alice Harwood, Catherine Gills Nell Gawthon, Inez Going, iiaigaret Fa. bush. 5 ,n Grade0yd O B-ion, DeipTiu Godsev. Je OBrien, Jof.it J nuers n, Frankie Mo Kium-y, Rtchar.i McD vsrmon, i.ue.nn Fergusoj. 4ob Gradeltobart Lucado Lula Smith, 3rd Grade Howard Goin. 2 ad GradeBilly Cawthon, James Morris Margaret Hund ley, Araie Mae Layne, Kermit Maun, tllen Frances Burnett, Elizabeth McDearmon, Frances Gallier,Thelma Dinkins, Louise Doss, Vivian D o b s , Ruby Wool ridge, Holcombe Caldwell, Ned IteGraude, Fay Babcock, Lo- re-e Turnes, Alfred Harwood. 1st GradeCurtis Ferguson, William Ford, Herman Carter, Woodrow Stephenson, John Wilke, Charles James Jr ., Charles Crawley, Berkley Car ter, Twyman Dinkins, Wiley McNailey, E. T. Price, Wood row Wooldrige, Roy Witt War riner, Alfred Almond, Curtis Mitchell, Twyman Wingfield, Vlyrtle Blackwell, Claudine OBrien, Jessie May Farrar, Mary Smith, Eloise OBrien Evelyn Almond, Beatrice Smith Minnie McNally, Josephine LeGraude, Mildred Ide."}, "highlight": {"text": {"matched_tokens": ["Gills", "h"], "snippet": "7th GradeHoward Rogers, Teddy <mark>Gills</mark> 6 <mark>h</mark> GridtCatherine Cld well, Roy"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "h"], "snippet": "7th GradeHoward Rogers, Teddy <mark>Gills</mark> 6 <mark>h</mark> GridtCatherine Cld well, Roy"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [307.45, 688.93, 635.4, 874.52], "bbox_id": "7fd36b8688", "file": "AppomattoxNewspapers_1933-1936a_0347.pdf", "page": 1, "text": "------ - ----  m - M. 11 and Mrs G L Doss spent Sunday with B L Jordon, at Cullen.  o Mrs. Cornelia Anderson returned giving hunting in Charles City i,rSo ,orea Anderson returned county. ...  b?7e Saturday after an extended __ 0 visit with relatives in Tazewell. Misses Emily Harvey and Cather- u . T . ine Gills and William ,Burke and t0 ad, Ml-S- Howard R. B. Frazier, of Henderson, N. C, owers a baby rl on November motored to Roanoke today, where  v they are attending the V. P. I. and , , _ V M I football game. p.?  ad Mrs- J c - Caldwell, of t_T0_ Richmond spent the week end Mr. and Mrs. Galvin H. Robinson I left this morning, accompanied by u, .. ? . _. , Mrs. Ola Patteson, to attend the I R o . Hubbard was in Richmond Richmond and William and Mary Mast day- football game and to spend Thanks- T 0 giving I With Rev- and Mrs. B. F Jobn Carroll Stanley spent Robinson at Syringa. Monday in Richmond."}, "highlight": {"text": {"matched_tokens": ["Gills", "William"], "snippet": "Cather- u . T . ine <mark>Gills</mark> and <mark>William</mark> ,Burke and t0 ad,"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William"], "snippet": "Cather- u . T . ine <mark>Gills</mark> and <mark>William</mark> ,Burke and t0 ad,"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1582.3, 277.71, 1834.64, 498.91], "bbox_id": "fb79b4a46d", "file": "AppomattoxNewspapers_1908-1909a_0465.pdf", "page": 1, "text": "ud Phenix ball RjL J Saturday. iy In Lynchburg j sh belonging to L . - - ..I1S luOM was stolen from his I Saturda.y afternoon, at 4 o Gills. License I h Second Presb No clue or in-CIlurch when Miss Mar robber has been I ot Smedley, daughter  A telegram th isa6d Mrs- William Smedh ed Mr. Gills that came the bride of Joseph een captured atl? ne of Evergreen, Va. I The church was attractively dec- eady to buy all k!? m pink roses Any amount I brfath and M 1 d. I Palms and ferns. rox W arehousb J Charles Earl .Graf performed ttie ck, said to be  m jail charged"}, "highlight": {"text": {"matched_tokens": ["Gills", "h"], "snippet": "afternoon, at 4 o <mark>Gills</mark>. License I <mark>h</mark> Second Presb No clue"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "h"], "snippet": "afternoon, at 4 o <mark>Gills</mark>. License I <mark>h</mark> Second Presb No clue"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [684.95, 1245.38, 843.34, 1766.8], "bbox_id": "ae76dacb7d", "file": "AppomattoxNewspapers_1898-1902a_0295.pdf", "page": 1, "text": "WIDOWS. Mr. Lucy Intro.................................................26 Mrs. Mary S. Paulette.................... 26 Mr. Martha E. Tuirsle ................................... 25 Mr. Melissa E. Bell ........................................ 25 Mr. Susan A. Singleton................................. 25 Mr. Lucy D. M artin ....................................... 26 Mrs. Sarah A, Harvey....... 26 SOLDIERS Robert E. Marshall...........................................16 George W. Doss ............................................... 16 H. R. Pitm an.................................................... 16 J. W. W heeler ................................................. 16 Thomas E. Nowlin........................................... 36 L. N. Pugh......................................................... 15 J. W. W hite....................................................... 16 Thomas H. Baldwin ........................................ 16 George A. Gills ................................................ 30 C. C. Ferguson.................................................. 15 John W. Pulliam ...............  ................... . 16 J. W. A ustin.................................................... 30 Jam es P. Harvey.............................................. 16 S. A. Scruggs ................................... 16 H. M. Bethel.................................................... 30 G. B. W arner ................................................ 16 C. H. Gilliam..................................................... 30 Jam es W. Jim erson......................................... 15 J. T. Childress .................................................. 16 W .P. Mann ...................................................... 15 John J. Cheadl j ............ ............................... 16 Daniel B. Wooldridge .................................. 30 Monroe W. Jim erson ...................................... 15 G. W. Almond .................................................. 15 J. H. W ootton .................................................. 16 J. B. Hughes ..................................................... 16 William A rthur Overton ............................... 16 Reuben H. Thom as................................ 15 Hartwin Scruggs............................................ IS Joseph E. Doss................................................. 15 Drury Coleman ................................................ 16 W. A. M artin .............................. .. ................. 16 W. P. Layne ............................ 16 W. W. W right .................................................. 30 P. C. Ramsay ..............................................  15 George W. Jam eson ........................................ 15 W. D. C arter ..................................................... 15 Cornelius Neighbors ....................................... 30 The board will sit again oa Wed nesday, June 20. When the pension act was passed, it was supposed that it wonld take about 100,000 a year. It now ap pears likely to take 500.000 a year. We do not mention thiB as an argu ment against tbe act, but as showing that the number of persons needing such aid is four or fire times larger than had been supposed."}, "highlight": {"text": {"matched_tokens": ["H", "Gills"], "snippet": "W hite....................................................... 16 Thomas <mark>H</mark>. Baldwin ........................................ 16 George A. <mark>Gills</mark> ................................................ 30 C. C. Ferguson.................................................."}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills"], "snippet": "W hite....................................................... 16 Thomas <mark>H</mark>. Baldwin ........................................ 16 George A. <mark>Gills</mark> ................................................ 30 C. C. Ferguson.................................................."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [786.47, 1039.09, 951.2, 1135.69], "bbox_id": "105a8368a1", "file": "AppomattoxNewspapers_1955-1957a_0318.pdf", "page": 1, "text": "Mrs. William T. Copenhfver, of Richmond spent the week-end with her mother, Mrs. W. P. Gills. Mr. and Mrs. Albert H. Morris, Miss Nina Barlow and Grover P. Beasley, Jr. motored to Nashville, Tenn., during the week-end and attended a performance of The Grand Old Opera on Saturday evening."}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "mother, Mrs. W. P. <mark>Gills</mark>. Mr. and Mrs. Albert <mark>H</mark>. Morris, Miss Nina Barlow"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "mother, Mrs. W. P. <mark>Gills</mark>. Mr. and Mrs. Albert <mark>H</mark>. Morris, Miss Nina Barlow"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [913.35, 990.83, 1075.63, 1777.92], "bbox_id": "aa285c9c73", "file": "AppomattoxNewspapers_1905-1912a_0417.pdf", "page": 1, "text": "formulate plans for the constructio of the road, following the tour of a party of automobile scouts across the State to Washington early in Octo ber. Roanoke.J. Hoge Tyler, of Rad ford, former Governor of Virginia, was operated on here at the Jeffer son Hospital. He stood the opera tion well, in spite of his 66 years. Governor Tyler was accompanied here by several members of his fam ily. His condition is serious and the physicians say it. is too early to say whether he will survive the ef fects of the operation. Fredericksburg.The Daughters of the Confederacy, of this city, have conferred crosses of honor on B. F. Price, A. A. Cannady, A. D. Jett and L. A. Weaver, Confederate veterans, and W. Key Howard, son of a vet eran. The chapter elected Miss Etta Barney and Mrs. G. R. Swift dele gates to the annual convention of the United Daughters of the Con federacy, which convenes in Roa noke. Lynchburg. A new lodge of Re- bekahs has been formed at Fairview Heights, to be known as Oak Leaf Lodge, No. 15. The officers are Noble grand, Mrs. J. W. Gills vice grand, Mrs. B. H. Goding, recording secretary, Miss Hattie Patterson ebr- responding secretary, Miss Pearl Bu- comb treasurer, Miss Arrah Fergu son warden, Miss Edna Ferguson conductor, Mrs. H. F. Watts inside guardian, Mrs. R. W. Callahan, ana chaplain, Miss Edna Callahan. Fredericksburg.The street com mittee of the fcity Council has award ed J. H. Davis the contract for ma cadamizing the roadway on the west side of Washington avenue and the circles at Mercer Monument. The contract price is 1,200. Newport News. Judge Beverly Randolph Wellford, aged 83 years, who for 40 years served as judge of the Circuit Court at Richmond, and who had been prominent in the Masonic affairs of the State, died at the home of his son here. Fredericksburg. The Wright-La- tane Camp of Confederate Veterans of Essex County has elected John M. Lewis, Dr. Warner Lewis, R. B. Whitlock, William Campbell, J. W. Phillips and Muscoe Garnett, Jr., delegates to the Grand Camp of Con federate Veterans, which convenes at Newport News October 17. Fredericksburg.  Rev. A. Jy Reamy and his son, who Is also a minister, have accepted calls to Fair- port, Fairfield, Smithfleld and Coan Baptist churches, in the Northern Neck. Harrisonburg.In the woods near Burketown Charles Ragner shot at a squirrel in a tree. The shot missed the squirrel and struck the breast and arms of Joseph Shaffer, who was in the tree gathering wild grapes. Neither man knew the other was In the woods. Shaffer is badly hurt, but will recover. Leesburg.The residence belong ing to Dr. John Cline, near Bluemont, was totally destroyed by fire Thurs day night. The origin is unknown. The loss was about 5.000. T. C. HsllM fir, deputy sheriff, and his .mil were occupying the house."}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "grand, Mrs. J. W. <mark>Gills</mark> vice grand, Mrs. B. <mark>H</mark>. Goding, recording secretary, Miss"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "grand, Mrs. J. W. <mark>Gills</mark> vice grand, Mrs. B. <mark>H</mark>. Goding, recording secretary, Miss"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [244.1, 703.85, 578.9, 1121.84], "bbox_id": "7fdfde4b70", "file": "AppomattoxNewspapers_1926-1933a_0157.pdf", "page": 1, "text": "cookies, first, Miss Annie Caldwell second. Miss Florence Caldwell can dy, first, Mrs. Jim Harvey second, Mrs. Lewis Doss rolls, first, Miss Louise Gills second, Mr. C. R. Cald well. Pickles and Preserves TomatoFirst, Mrs. H. c. Bab cock second, Mrs. Bessie Foster cherry, first, Mrs. W. M. Hancock well biscuit, first, Elizabeth Trent I second, Mrs. Jim Hamilton apple, second, Cecil Torrence candy, first,Drat, Mrs. Della Stratton second, Susie Cheatham second, none apple Mrs. H. C. Babcock grape, first. Miss pie, first, Gladys Inge second, Eliza- j Della Stratton second, Mrs. E. L. beth Trent canned tomatoes, first,1 Smith peach, first. Miss Della Strat- Alice Lee Smith second, Cecil Tort ton second, Mrs. E. M. Stratton rence canned snaps, first, Gladys Pear, first, Mrs. J. A. Stratton sec- Inge second, Mary Trent canned d, Mrs. B. M. Stratton plum, first, peaches, first, Mary Trent second Mrs. H. C. Babcock second, Miss Francis Smith tomato pickle, first,I Ocie Ferguson quince, first, Mrs. H. Mary Trent, Gladys Inge watermel-C Babcock second, no name straw- on, first, Gladys Inge strawberry,berry, first, Miss Della Stratton sec- preserves, first, Alice Lee Smith. ond, Mrs. H. C. Babcock raspberry, Central Europe, first, Fay Babcock i first, Mrs. H. C. Babcock second! second, Blanch Babcock, Ethel Alvls Mra F. I. Murphy watermelon, first, second, Evelyn Robertson self feed- Hiss Della Stratton second, Mrs. F. er, ..first, Howard Smith second, L. Murphy. none farm rake, first, Homer Bab-1 Canned goods  Tomatoes, first, cock axe handle, first, William Miss Virginia Smith second, Mrs. E. Ford self feeder poultry, first, How-jL. Smith cherries first, Mrs. Bessie ard Smith second, William , Ford,Foster second, Mrs. W. J. Trent evener, first, William Ford second,1 beets, first, Mrs Cleveland Fore sec- Marshall Stratton porch swing, first,ond, Mrs. Mary Moon peaches, first, Homer Babcock second, William j Mrs. M. C. Smithsecond. Miss Vir- Ford single tree, first, Rickard ginia Smith pears, first, Mrs. H. C. Smith, Jr. second, William Ford I Babcock second, Miss Della Strat- pergola, first, Hunter Ferguson sec- ton snap beans, first, Mrs. L. F. ond, none. Geometry exercises, first,Caldwell second, Mrs. L. F. Cald- Eleanor Harwood second, Katherine j well corn, firBt, Mrs. E. M. Strat- Paulette experiment, first, Evelyn to second, Miss Della Stratton ap- Dickerson second, Josephine Le- Pie jelly, first, Mrs. W. A. Moon sec grand. Poultry Barred Rock, cock, first, Mrs. J. H."}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "Smith pears, first, Mrs. <mark>H</mark>. C. Smith, Jr. second, <mark>William</mark> Ford I Babcock second,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "Smith pears, first, Mrs. <mark>H</mark>. C. Smith, Jr. second, <mark>William</mark> Ford I Babcock second,"}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [738.94, 1022.53, 908.64, 1531.97], "bbox_id": "143cef2e6d", "file": "AppomattoxNewspapers_1939-1943a_0003.pdf", "page": 1, "text": "Robert T. Gills, of Richmond, is spending several days in the home of his mother, Mra. E.E.Gills. Mr. and Mrs. T . H. Garrett and son, Tommy, spent the week-end in Richmond and King William. Mr. and Mrs. Lewis McDearmon, H. G. Johnson and Grover Smith spent Tuesday in Roanoke. Calhoun and Lawrence Moore flew to Leesburg Wednesday. The ship was piloted by Calhoun MooTe. Mrs. Betty Stanley, Mrs. H.M. Burge and Watt Stanley attended the funeral of Mrs. Simon Stanley in Hanover county last week, Mesdames D. E. Caldwell, Sr., G. A. Randolph and D. E . Cald well Jr., spent last Thursday at Amelia. Mrs. H. B . Pack, of Clover, is spending this week with Misses Em ma and Lucy Smith. Mr. Pack will spend the week-end in the same home. George Cale and Dick Poleski, of Fork Union spent the week-end with Mr, and Mrs. F . B . Cale.  Miss Maxine Glenn and Miss Aileen Shipley, of Lynchburg spent the week-end at their homes here. H. C, Pulliam was in Richmond for the week-enC L t. E . A. Powers, of Richmond, was a guest in the home of J.E . Sears for the week-end. J Carlton Price spent the week end in Richmond. Mra. J. W. Eure and Mrs. J. K. Joliff, of Lynchburg, were week end guests of the Rev, and Mrs. L. C. Shearer. Rev. Shearer left Wednesday for North Garden where he will teach a religious training class the rest of the week. The contract bridge club will meet Friday evening with Mrs. C."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "in Richmond and King <mark>William</mark>. Mr. and Mrs. Lewis McDearmon, <mark>H</mark>. G. Johnson and Grover"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "in Richmond and King <mark>William</mark>. Mr. and Mrs. Lewis McDearmon, <mark>H</mark>. G. Johnson and Grover"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1546.51, 956.26, 1720.51, 1094.96], "bbox_id": "d4f89fd22f", "file": "AppomattoxNewspapers_1939-1943a_0582.pdf", "page": 1, "text": "Mrs. Albert Baird, of Bucking ham spent Saturday in Appomattox. Mrs. William Copenhaver, Rich mond, Mrs. Allen Gills and children I of Lynchburg, and Jimmy Conner,! of Crystal Hll were guests in the home of Mrs. W. P. Gills for the week-enl. Mrs. Gills wa given a surprise birthday dinner Sunday Mrs. Emma Nowlin and Mrs. J. I H. Lucado spent Monday in Lynch burg with Mrs. Walter Wooldridge,! who is improving from an illness o f! several months."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Saturday in Appomattox. Mrs. <mark>William</mark> Copenhaver, Rich mond, Mrs. Allen <mark>Gills</mark> and children I of"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Saturday in Appomattox. Mrs. <mark>William</mark> Copenhaver, Rich mond, Mrs. Allen <mark>Gills</mark> and children I of"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2119.7, 956.36, 2280.65, 1795.91], "bbox_id": "de4cc8bd25", "file": "AppomattoxNewspapers_1943-1947a_0225.pdf", "page": 1, "text": "Miss Hildia Mae Cartter Mrs. Adelia M. Ferguson Mrs. Adelia M Ferguson Mrs. Lizzie M. Reynolds Mrs. Lizzie M. Reynolds Mrs. Lizzie M. Reynolds Mrs. Lizzie M. Reynolds C. Courtney Harvey Samuel L. Stanley Bryant T. Jamerson Zack E. Cheatham Robert B. Haley J. Hudson Cheatham William T. Nash William T. Nash  William T. Nash William T. Nash  William T. Nash George W. Perdue Edward P. Davis Mrs. Annie L. McCormick Mrs. Annie L. McCormick Mrs. Annie L. McCormick Mrs. Annie L. McCormick Arthur D. Bates Bennie W. Harvey Bennie W. Harvey Bennie W. Harvey Bennie W. Harvey Ben lie W. Harvey Bennie W.  Harvey Mrs. Mary C Roberts u John Lloyd Lewis John Lloyid Lewis John Lloyd Lewis John Lloyd Lewis John Lloyd Lewis Mrs. Alma Spiggle M iss Lucille M. Coleman Edward N. Harvey Charles F James Mrs. Alice Irene Moore Mrs Alice Irene Moore Mrs. Alice Irene Moore Mrs. Alice Irene Moore Mrs. Alice Irene Moore Edward N. Harvey William D. OBrien William D. OBrien Miss Peggy Dawn Garrett Miss Helen E. Smith Edward N. Harvey Mrs. Lillie B. Moses Willie J. Mitchell Willie J. Mitchell James Robert Dinkins Gilbert Moses Dinkins Arris Beryl Covington Arris Beryl Covington Mrs. Alma Wright Harris Mrs. Rachel H. Jones Daniel A. Clapp Daniel A. Clapp Daniel A. Clapp Daniel A. Clapp Miss F. Sylvia Clapp Mrs. Edna B. Patterson Mrs. Earle P. Robinson Miss Beulah M. Robertson Miss Anne Culvin Abbitt Oscar Cleveland Paulett Mrs. Ethel Judith Paulett Miss Dorothy G. Austin Mrs. Eleanor Harwood Caudle Miss Julia Ann Burton Mipsi lean tGibbings Burton Richard Nicholas Burton James Perry Burton Edward N. Harvey Miss Mary A. Adcock Samuel H. Collins Mrs. Lorraine H. Torrence Richard A. Hamilton Mrs. Bertha OBrien Gills Cecil Ray Bass Mrs. Ora H. Baker Mrs. Nellie L. McClenny Miss M. Aileen McClenny Henry De La Warr Flood IV"}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "Hamilton Mrs. Bertha OBrien <mark>Gills</mark> Cecil Ray Bass Mrs. Ora <mark>H</mark>. Baker Mrs. Nellie L."}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "Hamilton Mrs. Bertha OBrien <mark>Gills</mark> Cecil Ray Bass Mrs. Ora <mark>H</mark>. Baker Mrs. Nellie L."}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1485.87, 977.4, 1631.48, 1221.64], "bbox_id": "568cf0780c", "file": "AppomattoxNewspapers_1962-1965a_0258.pdf", "page": 1, "text": "Miss Annie Alvis, who has been visiting Mr. and Mrs. Neal Fletcher, of Newport News, re turned home Wednesday. She Whs accompained by Mrs. Fletcher and son, Ed, who are Visiting Mrs. Fletchers parents, Mr. and Mrs. DeWitt Evans. Mr. Fletcher will arrive Friday for the week end.   Miss Susanne Gills, a student at Mary Washington College, Fredericksburg, spent the week end at her home here.    Mrs. Margaret Marshall is spending several days with her sister, Mrs. H. B. Pack.    M,r. and Mrs. William M. Thompson, of Richmond, visited friends in Appomattox Tuesday.    Miss Catherine Richardson, a student at Radford College, spent the week end at her home here"}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "with her sister, Mrs. <mark>H</mark>. B. Pack.    M,r. and Mrs. <mark>William</mark> M. Thompson, of Richmond,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "with her sister, Mrs. <mark>H</mark>. B. Pack.    M,r. and Mrs. <mark>William</mark> M. Thompson, of Richmond,"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.44, 1079.55, 821.18, 1673.27], "bbox_id": "f1bd1656d8", "file": "AppomattoxNewspapers_1926-1933a_0540.pdf", "page": 1, "text": "IN THE APPOMATTOX  BUCKINGHAM TIMES August 1, 1906 Parker, Horsley of Bent Creek, died July 21. Buria services were conducted by V S. Reed of the Y. M. C. A. There will be a big circus-in town Saturday. Dr. W. H- Abbitt improves His son, Rev. William Abbitt of Kentucky, is visiting him. Master Braxton Hancock en tertained a number of his lit friends in the celebration of his birthday last Tuesday. Mrs. Sallie Blackwell, wife of Allen O. Blackwell, died at her home yesterday afternoon The deceased was formerly Miss Godsey, of Appomattox County. Sam Thornton of Graham was the guest of his sister, Mrs B- T. Gunter, of Evergreen, last week. Miss Bessie Thornhill of Lynchburg is a guest of Miss Fannie Clement. Lightning struck an old oak tree about forty years old in the yard of Mrs. Hubbard Mar tin and tore it to pieces last Friday evening.  Bob Davis, Squire Womack, and Wells Chittenden of Pamp- lin were in the village Monday on business. I Robert Oder has been visit ing in the county for several days. He haspurchased a nice farm here and will, we hope, again make his home among us. A concert will be given in Smiths Hall next Friday night for the benefit of the Metho dist sidwalk fund. Misses Ethel Calhoun a n d Lucy Gills are visiting in Lynch burg. mss Brown, of Crewe is a guest ot Miss Rosa Paris. --------------- 0 ---------------"}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- Abbitt improves His son, Rev. <mark>William</mark> Abbitt of Kentucky, is"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "town Saturday. Dr. W. <mark>H</mark>- Abbitt improves His son, Rev. <mark>William</mark> Abbitt of Kentucky, is"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1682.38, 508.11, 1847.12, 1727.69], "bbox_id": "279189e2d7", "file": "AppomattoxNewspapers_1915-1918a_0394.pdf", "page": 1, "text": "A bbitt, W i l l i a m Ernest, Agee, Thom as H ancock, Agee, Clarence, Almond, Henry Gul ven, Almond, A rthur Cleve land, Babcock, Bradley W hit ney, Baber, Jam es William, Baber, Hal Thornhill, Bates, A rthur Daniel, Burge, H ar rison Morton, Burke, Jerry Allen, Caldwell, Charles Ran- dolph,Chandler,Chaunoy G ray, Oheatham , Tucker T., Child ress, Thomas Ennis, Cole, John Oscar, Còle, Benjam in Collins, Coleman, John W esley, Cole m an, W illiam Patterson, Gy rus, Newton H ubert, David s o n  Otti L., Day, W illiam Andrew, Dickerson, Charles Daniel, Dinwiddie, Joseph E d win, Diuguid, Connie, Dixon, W illiam Lesilo, Dove, Henry Lee, Durham , W alter Emerson, Durham, Terry Colley, Fergu son, Tommie W iley, Ferguson, Ernest, Fieshm an, A r t h u r , Fore, Jam es A., Fore, Grover Cleveland, Fore, E rnest Solon, Forsyth, Jasper Lyle, Franklin, Marshall H ubert, Franklin, David Ernest, Furbush, Ken neth W elber, Furbush, Law  rence E., G ahliar, Genie, Gal- ier, Archer Wade, Giles, Orson Taylor, Giles, Lewelien, Giles, Robert Terrill, Gills Jam es Pitser, Godsey, W jley Winard, Godsey, Alfonso, Oodsey W hit ney Lee, Goff, Jam es Burton, Goin, Lloyd Frank, G o i n , Leonard H arry, Gregory, Leon ard N athaniel, Batti M o t y Simms, G unter, George Ed die, G unter, W illiam W alter, Hall, Jo h n Cleveland, Hall, Oscar, H ancock, Thomas Roy al, Harris, Eugene W atson, Harvey, W i l l i a m H unter, Howerton, Odell, H unter, O Kendall, !inge, W illis Dennis, Inge, Henry Peyton, Jam es, CharleB Fleetwood, Jam erson, Charles W illiam , Jerrels, Char lie, Johnson, Joe Pitzer, Jones, H erbert Strother, Loomis,Sam uel Lee, Mann, Royal Henry, Mann, Richard E arl, Marshall, Lacy Douglas, M arshall, John W ill, M artin, Norm an Judson, M artin, John David, M artin, Jam es Allen, M artin, Pryor, Martin, Ju lian Paskél, M artin, Henry Franklin, M artin, Ben jam in Courtney, M artin, Chas. Edw ard, Miller, A rthur Joel, M itchell,Emen Talm age,M itch ell, Bernard Julian, Moon, D a vid Pleasant, Moon, Wm. Ar sher, Morgan, W m. Tunstall, Morris, Joseph Wilson, Moses, Don, McCormick, Lewis Saun ders, McFadden, Jack , North, W illiam , Odor, William Pierce, Paris, Charlie W yatt, Paris, Benjamin J o s i a h , Peacock, Julian Baxter, Perdue, Samuel Arlington, Plunkett, Paul Pat- teraon, Pope, Omry Lee, Price, Edw ard Trayham , Pulliam , Charlie Harvey, Pulliam , Her bert Carrington, Reynolds, Os car Allen, Reynolds,W m. Sam uel, Reynolds, Homer A , Rob erte, Jam es W illiam , Sears, Samuel W iltsie, Sears, John Edw ard, Sm ith, Claude W., Sm ith, George Iverson, Sm ith, Essel LeRoy, Spencer, Robert Suppleton, Stanley, Raymond Francis, Stanley,Jam es Henry, jr., Staples, H enry Clay, Sub lett, Richard H enry, Sullivan, Jam es Walter, Thomas, Aubrey McCoy, Thomas, Bernard Dick erson, Tuggle, Edw ard Jam es, W alton, W m. A nthony, W hit aker, H enry Spencer, W hita ker, Percy B , W hitaker, Sam uel David, Williams, Larkin Fester, W illiamson, William Lee, W illiam son, Henry H arri son, W oolridge, W m. B erkley, W oolridge, Ernest Earl, Wool- folk, W illiam Fonrose, Woot- ton, Ellis Peyton."}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "Larkin Fester, W illiamson, <mark>William</mark> Lee, W illiam son, Henry <mark>H</mark> arri son, W oolridge,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "Larkin Fester, W illiamson, <mark>William</mark> Lee, W illiam son, Henry <mark>H</mark> arri son, W oolridge,"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [554.65, 1159.47, 693.45, 1589.01], "bbox_id": "2d5eb1ff33", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "Raym ond Bell W alter W Scott H arrison Morton Burge . Hurley A shby McFadden H allie Dillard Oscar Luther Scheffier John Wesley Coleman Robert Lee Abbott Jack Sears Caldwell Joseph W adsw orth Crews Dudley NcCaw Johnson Everett W ilson Blackwell Robert Terrill Gills Dean Alfred Alpha Pugh Jam es H enry Stanley, jr. W illiam Littleton Cardwell Conrad R Brown Lacy Douglas M arshall H urley Clem Davis John Case Allen W alker H ubert Moore Frank W illiam Fleshm an William Albert Owen Joseph Blanohard Tinsley Thomas E dgar Moore Henry Carl Holesapple Thom as Ennis Childress Calvin Ghanie Woods A lexander Price g erm an H arding abney Clinton Tweedy Philip d a n d e r Paulett Frank Edw ard Jennings Oscar Leonard McCormick Ulyssess Sympson Austin Tomie W iley Ferguson Coeinsco McCoy Charles Douglas Doss Jam es Edw ard Jordon William Walter G unter A rthur Cleveland Almond Alexander Lane Leonard N athaniel Gregory Ailliavm rviI  - I... .  a"}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "ilson Blackwell Robert Terrill <mark>Gills</mark> Dean Alfred Alpha Pugh Jam es <mark>H</mark> enry Stanley, jr. W"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "ilson Blackwell Robert Terrill <mark>Gills</mark> Dean Alfred Alpha Pugh Jam es <mark>H</mark> enry Stanley, jr. W"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [552.5, 745.49, 718.58, 950.38], "bbox_id": "be0c8c5705", "file": "AppomattoxNewspapers_1933-1936a_0045.pdf", "page": 1, "text": "Mrs. W. M.Thompson, Mis ses Virginia Lee Thompson and Virginia Reynolds were visitors  in Amherst Tuesday. 0 0 0 T h e following spent Christ mas in the home of W. P. Gills Mr. and Mrs. S. K. Gills, Richmond Miss Lucy OBrien, Lynchburg and William Cop- enhaver, Marion, Va.    Mr. and Mrs. Calvin Robin son spent the week-end and Christmas day with his parents, the Reverend and Mrs. B. F. 1 Robinson, of Syringa.    Mr. and Mrs. R. V . Harper"}, "highlight": {"text": {"matched_tokens": ["Gills", "William"], "snippet": "and Mrs. S. K. <mark>Gills</mark>, Richmond Miss Lucy OBrien, Lynchburg and <mark>William</mark> Cop- enhaver, Marion, Va."}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "William"], "snippet": "and Mrs. S. K. <mark>Gills</mark>, Richmond Miss Lucy OBrien, Lynchburg and <mark>William</mark> Cop- enhaver, Marion, Va."}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1528.5, 541.08, 1697.91, 1273.51], "bbox_id": "ef2f02b546", "file": "AppomattoxNewspapers_1943-1947a_0008.pdf", "page": 1, "text": "Mrs. David Nicol Twyman and Mrs. Fanny Shipman, of Williams burg are guests in the home of their  sister, Mrs. M. H. Lawson. Mr. and Mrs. Edmund Theodore Gills and daughter, Marianne, are visiting in the home of Miss Mary Louise Gills this week. - Miss Ilah Buchanan, of Washing ton is spending her vacation at her home here. Miss Betty Ferguson, , of Ever green is spending this week with her grandmother, Mrs. Lillie Gre- gy. Mrs. Jack Dickerson, nee Jose phine Jenkins, is visiting her par ents, Mr. and Mrs. Charles Jen kins. Mrs. Daniel Browning, of Rich mond has returned home after spending some time with her sister, Mrs. Harry P. Davis. Mrs. Carolyn, Cates was a visitor in Burlington, N. C. last week. Miss Mary Louise Gills spent sev- rnl days last week in the home of Mrs. Malcolm A. MacLean. Mrs iTicLean has moved back to her home,  Bonniebrae 901 Pershing St., Lynchburg. Mrs. Burke S eele and children, Burke, Jt., and Louise r cott, of Petersburg are spending several days, in the home of Mrs. James B. Abbitt. Mr. and Mrs. Frank Medbury, of Washington, D. C., and Mrs. Fran ces Norin of the same city were guests last week in the home of Mr. and Mrs. R. C. Wagnes. The Rev. and Mrs. W. MThomp- son wave recent guests in the home, of Miss Mary Louise Gills. Billy Carter, of Crewe is spenV ing some time with his grandmother Mrs. William Lawrence Brown. MrS. A. B. Nowlin is recovering from a recent illness at the home of her daughter, M r s . W.W.OBrien. Miss Lucy Etta Austin, of Wash ington is recuperating at the home of Mrs. C. C. Rosser, Pamplin, af ter a recent operation at the Vir ginia Baptist Hospital. Her moth er, Mrs. E. W. Austin, who has been with her is spending This week with her sister, Mrs. W. L. Cole man. Misses Nelwyn a n d Maurie OBrien, Tommy and Dicky OBrien hate returned to their home near here after spending several days wnh the Rev. and Mrs. O. G. Bur nette, of Nathalie. Mrs. A. I. Caudle has returned from a visit with relatives in Keys- ville. Mr. and Mrs. C. E. Kirkwood left"}, "highlight": {"text": {"matched_tokens": ["H", "Gills"], "snippet": "their  sister, Mrs. M. <mark>H</mark>. Lawson. Mr. and Mrs. Edmund Theodore <mark>Gills</mark> and daughter, Marianne, are"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills"], "snippet": "their  sister, Mrs. M. <mark>H</mark>. Lawson. Mr. and Mrs. Edmund Theodore <mark>Gills</mark> and daughter, Marianne, are"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1463.5, 393.76, 1744.92, 899.71], "bbox_id": "666d46fa0d", "file": "AppomattoxNewspapers_1918-1922a_0383.pdf", "page": 1, "text": "llOMlt ft  -r-Jpgelp Wauted w hnav Is your job unssfet, , - I I on Fraact Minnie L tty0t,rt80n Grace 8by, Reg sTSTii yow? b a-i7oubow iti! Stanley.  o k l  urad. l U S i f ! I .France Waguer, Jorm Cheat Oglesoy, Jos- Vorta S ui of Rice,Iiiola Burkwj, Stella tayne Mrs! I Tflir.d YearLydia Rogert, Christine Foster, Marguerit Giiliam, Iva Ferguson, Ray itt Aletbia Doss spent the moud g eae Ray Lde Oolonei tend with her cousin, Mrs. Fourquerlan,Berkley Andrews, Conner, at Evergreen Reid Hatcher, William Burke, r. Robert Jones and A H Rupert Rogers, Earl Carson, iment have returned from a Ned Hancock, Deroy Jennings, lioesstrip to Amherst. Willard Peake. he farmers of Appomattox Second Year-Artie Drink- looking after the sale of GUmly Van Volkenburg, , tobaccoSaturday. oh oR Stanley, Walter Ford, Annie Suell, Clara Caw T L F . Burnett will preach fchor1 ZjU Harper Kennifc otral Baptist church Sun- Qra?jtt Mary Hale, Elsie Halt afternoon, February 18tfc, Eleanor Casey, Dorothy Hund oclock.  ley, Bessie V. Harwood, Alot mto Mr. and Mrs. John D. Street, Virginia Sherer, Hunp ,Jr,at Henderson, N. O , ton Ouster, Myitle Smith, February 2nd, a girlier I Nellie Cawihorn. is is Billie Abbitt Rose. First GradeAlfred Jenning in Ellen Marshall Rugg, France lord a. Carlton Crews representative of the Red Uucy Hale 7ch GradeKennard Gills, Fred Twymaa, Frank Harper, Nathan Goin, Howad Rogers, Harry Puckett, Teddy Gills. 6.h GradeRebecca Martin, Florence Gregory, Frances Up ton, Billy Trent, Vara Smith, Alice Harwood,Catherine Giiie, Neil Oawthorn. 5th Grade"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "at Evergreen Reid Hatcher, <mark>William</mark> Burke, r. Robert Jones and A <mark>H</mark> Rupert Rogers, Earl Carson,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "at Evergreen Reid Hatcher, <mark>William</mark> Burke, r. Robert Jones and A <mark>H</mark> Rupert Rogers, Earl Carson,"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1345.4, 1120.96, 2019.78, 1228.18], "bbox_id": "23f31f58fc", "file": "AppomattoxNewspapers_1912-1915a_0463.pdf", "page": 1, "text": "lit- Some days ago Mr, Mosdk loitM r. John Randolph Oald well. another fin-- mule from some un  Convict8 BnJoy Thanksgiving known disease.  Dinner. It is reported that there are some! convicts enjoyed a Thanks- buiiuafiooiir o V mtsbus in i-istrietN o. losses of hog cholera in the OonntygiTiQg dinner which was prepared! wtaiieriuteudeufot tooFoor w. Lee P at- Jthe first for many years. Onrljjy Mrs, W. P. Gills and Miss Ten- K ltuu, pcstotfiue Maateo H F. JO. 1 - - - 1  tiouuiy Purveyor William Peile postoifi u .setef of -Weights and MeasuresAlfred 1 tive a n d by his p ro m p t efforts th e I ch ick e n w ith d u m p lin g s, o ream ed j th e ir loving k in d n e ss a n d frie n d ly I H taarka. hmisviiln I ........................   I _  I     .  . i J .. a i _ I"}, "highlight": {"text": {"matched_tokens": ["H", "William"], "snippet": "K ltuu, pcstotfiue Maateo <mark>H</mark> F. JO. 1 - - - 1  tiouuiy Purveyor <mark>William</mark> Peile postoifi u .setef"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "William"], "snippet": "K ltuu, pcstotfiue Maateo <mark>H</mark> F. JO. 1 - - - 1  tiouuiy Purveyor <mark>William</mark> Peile postoifi u .setef"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2285.76, 956.35, 2432.51, 1795.33], "bbox_id": "153f6aaff0", "file": "AppomattoxNewspapers_1943-1947a_0225.pdf", "page": 1, "text": "James Carter J r D. Ferguson J. D. Ferguson, Jr. John Hall Elliott Pillow . j Arthur Blackwell Richard F. Burke Carl A. Collins Ned Stanley Thomas Jamerson James E. Cheatham Robert B. Haley, Jr. James E. Cheatham Ray Ferguson Warren Jones Billy Reynolds Curtis Mayberry James Mayberry Edwin Lucado Billy Southall Hubert S. McCormick Robert L. McCormick Otis McCormick Clyde C. McCormick Bates Turner Edward Harvey Herman Harvey Jack Baker Randolph Evans Charlie Smith H. B. Cralle, Jr. Shearer B. Roberta n Lloyd Nolley Lewis Carter Martin C. H. Swing C. G. OBrien Kermit Paulett James Spiggle Ralph Coleman H. B. Cralle, Jr. Charles F. James, Jr. Thomas Kern Russell Martin Ralph Coleman Emory Martin John Moore Herman Harvey Maynard G. OBrien Hiram L. OBrien Charlie Williams Sam Cawthorn Jack Baker Edward Harvey George W. Bass Curtis L. Mitchell Jack Baker Herman Harvey Robert A. Covington, Jr. William J. Covington Curtis W. Harris Norman H. Jones H. B. Cralle, Jr. Jack Baker Hugh Clapip Randolph Evans Daniel A. Clapp W. D. Patterson Jennings Conner William Roy Robertson Herbert Abbitt Kermit Paulett Joe Paulett Rufus Coffey A. R. Harwood, Jr, V. Arnold Godsey John A. Godsey James Perry Burton K. F. Godsey Newton Jennings Lee M. Wright Vincent W. Collins Howard E. Torrence John Will Hamilton Shelby. Kennard Gills Gt orge W. Bas Jack Baker Kenneth L. McClenny Kenneth L. McClenny Jny C. Tashner"}, "highlight": {"text": {"matched_tokens": ["William", "H", "H"], "snippet": "Robert A. Covington, Jr. <mark>William</mark> J. Covington Curtis W. Harris Norman <mark>H</mark>. Jones <mark>H</mark>. B. Cralle,"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H", "H"], "snippet": "Robert A. Covington, Jr. <mark>William</mark> J. Covington Curtis W. Harris Norman <mark>H</mark>. Jones <mark>H</mark>. B. Cralle,"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2100.24, 376.87, 2272.39, 1798.08], "bbox_id": "e318b342bb", "file": "AppomattoxNewspapers_1892-1898a_0111.pdf", "page": 1, "text": "F our M asked Men E n te r th e House of P leasant H endricks N ear Lynchburg, K nock H im In!the H ead and Set F ire to th e House. On Deo. 51st., on the Lynchburg and Durham railroad, about six miles from Lynqhburg, a terrible crime was committed. Some- three weeks prior to the tragedy, the young and attractive daughter of Mr. J. H. White, of Lynchburg, was married to Pleasant Hendricks, of Campbell co.unty. They made their home near Bocock Station shortly afterward, and livedhappily together. On the night of Dep. 21st. between 9 and 10 oclook, Mrs. Hendricks was sitting in her room reading The Chil dren of the Abbeyand Mr.Hendrioks was asleep. There was bnt little flip on the hearth. The door was bolted with an ordinary lock bolt. All at once it was broken down and four masked men rushed into the room. One of them held an axe in bis hand, and rushing to the bed struck Hendricks on the head with the sharp edge. Mrs. Hendricks, over come by the right fainted, and when she became conscious was lying on a hastily improvised- pallet out in the yard, where she supposed she had been taken by the murderers. Thie house was enveloped iiyflames. Many of the neighbors were attracted by the light, but arrived too late to ex tinguish the Are or to rescue the body. er trunk had also been refnpved and was placed so near the burning building that it caught on fire and was entirely consumed. While the crowd stood about the burning house it was whispered around that four negroes from Jaok- son Town, a small suburb of Lynofar burg, bad been seen hunting in the neighborhood. Suspicion being arous ed, parties were immediately dis- latohed to arrest them. A ndthis was accomplished before morningi hree of the negroes were arrested by officers, and the fourth one sur rendered himself. In the meantime, when the flames died down, a search wB instituted tot the murdered man, and after a long hunt they found what was left of the body. The heart, lungs and a few fragments of bones were all that remained of what a few hours before bad been a prosperous,happy human beidg. Mr. Hendricks was an industrious and well-to-do farmer of about forty-five years of age, ahd was not known to have bad an enemy. On the day before, however, be had brought home 200, He had given bis wife 15 and placing the remain der in an oil cloth sack had con cealed it in the bed.. It is thought, that, as Mr. Hendricks had been hauling posts to Jackson Town while he had this money in his pos session, the negroes must have dis covered the fact and planned the robbery. On Dec. 23rd an inquisition was held at the scene of the crime, anc. was adjoqrned to the 27th to the Law Building at Lynchburg. Mr. W. M. Murrell, assisted by Mr. Thos. Whitehead, Jr., conducted the exam ination for tbe commonwealth, while the prisoners were represented by Maj. T. J. Kirkpatrick, Judge H. M. Ford and Mr. James W. Wright. The only witness called was Mrs. Hendricks. She identified the fonr negroes as the persons who entered her house, bnt her testimony die i not 6onvince the coroners jury for they were divided in their opinions as to the guilt of the men arrested who were Commodore Johnson, Rob ert Smith, William Coghill and William Fields. The coroner, Mr. John W. Gills, and three of the jnrors declared the deed to have been perpetrated by tbe prisoners, while the remaining three decided that the fatal blow had been struck by parties unknown. The  murder continues to be the all-absorbing topic of conversation among the county people. Many now believe that the four negroes are the guilty parties, while many others do not think that the right men have been captured and, from the latest reports, we learn that considerable indignation is expressed at the unnecessary detention of the prisoners. ________________ Toga Notes. A gay crowd gathered at Toga,the attractive home of Mr. B. F, Spen cer, on the evening Of Tuesday the 26tb, ult. and were entertained most"}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Smith, William Coghill and <mark>William</mark> Fields. The coroner, Mr. John W. <mark>Gills</mark>, and three of the"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Smith, William Coghill and <mark>William</mark> Fields. The coroner, Mr. John W. <mark>Gills</mark>, and three of the"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [362.64, 615.76, 681.73, 857.9], "bbox_id": "7fc2f75a30", "file": "AppomattoxNewspapers_1926-1933a_0571.pdf", "page": 1, "text": "a n d Midsummer Nights Dream The church will be decorated in Easter lillies, white candles, and evergreens. The bride will be given in mar riage by her uncle,. E- H. Han cock, of Lynchburg. She will be gowned in a white satin Princess with an imported veil of. Brussels lace, ard will wear a single strand of pearls, the gift of the groom. She will carry 1 an arm boquet of Calla Braxton, are visiting Mr. and ! lillies. The maid of honor, Mrs. W. B. Caldwell this week, I Miss Elizabeth Trent, of Black- prior to the Gregory-Trent stone College, will wear pink wedding. satin, with blue accessories    and will carry an arm boquet Miss Christine Caldwell, ofof white rosebuds The brides- Charlotte was a guest of Fran- maids, Misses Virginia Neblett, ces Caldwell last week-end. oi Victoria, Bessie Garrison     and. Anniet Hancock, of Cro- Mrs. William Watson, of zet and Mary Louise Gills, of"}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Hancock, of Cro- Mrs. <mark>William</mark> Watson, of zet and Mary Louise <mark>Gills</mark>, of"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Hancock, of Cro- Mrs. <mark>William</mark> Watson, of zet and Mary Louise <mark>Gills</mark>, of"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [682.81, 200.64, 838.2, 983.23], "bbox_id": "d509582d3b", "file": "AppomattoxNewspapers_1918-1922a_0303.pdf", "page": 1, "text": "The closing exercises of the High. School took place here Tuesday night, June the 1st, when principal Crawley deliv ered diplomas to 21 young ladies and men. The house, as usual, was overtaxed and not half of the crowd could get in the building. The graduates were as follows President Edwin Adams, Halifax Sscre- taryE 1 a i n e McDearmon, Clover Hill Lucile OBrien, Clover Hill Frances Smith, Clover Hill Betty Morris, Clover H i l l  Nettie Moses, Southside Mary Gills, Clover Hill Cornelia Gills, Clover Hill Eloiso At vood, Southside Alice Carsor,Stonewall BettieFrack qr, Stonewall Melville Pitten- ger, Clover Hill Jimmie Con ner, Haifax Charlie Towler, Charlotte William Moorsfield Uilifax Virginia Harvey, Campbell Nannie Harvey, Campbell Davis Street, Stone wall Gladys Woolridge, Bed ford Hudson Aoderson, Hali fax Rheda Drinkard, Clover Hill. A special feature of the com mencement was that it was a special alumni year, and a large number of the old students were present. Mr Walter Durham, an Appomattox boy, delivered the address to the graduates, and it was consider ed a very fine address. Waltei was of the 1912 class and since that time has been to higher institutions and has taught at the V M. I. for several sessions Mr. Jerry Burke, another alum us, delivered the medals in a very pleasing manner. The first honor medal, given by R. F. Burke, wept to Miss.Cornelia Gills Improvement medal,given by i. W. Moses, went to Mat taur Carr Agricultural first- honor went to Berkeley An drews, and a scholarship to Richmond Collage, valued at 75 00, went to Miss Lucile OBrien. A special orchestra from Lybchburg furnished the music The class was in full uniform and presented a very striking appearance. On Monday night the liter ary societies held their annual content and gave a very inter esting program. The program was as follows"}, "highlight": {"text": {"matched_tokens": ["H", "Gills", "Gills"], "snippet": "Hill Betty Morris, Clover <mark>H</mark> i l l  Nettie Moses, Southside Mary <mark>Gills</mark>, Clover Hill Cornelia <mark>Gills</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills", "Gills"], "snippet": "Hill Betty Morris, Clover <mark>H</mark> i l l  Nettie Moses, Southside Mary <mark>Gills</mark>, Clover Hill Cornelia <mark>Gills</mark>,"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [709.89, 235.46, 871.29, 1019.95], "bbox_id": "446842fb25", "file": "AppomattoxNewspapers_1918-1922a_0170.pdf", "page": 1, "text": "The closing exercises of the High 8chool took place here Tuesday night, June the 1st, when principal Crawley deliv ered diplomas to 21 young ladies aud men. The house, aB usual, was overtaxed and not half of the crowd could get in the building. The graduates were as follows President Edwin Adams, Halifax S3Cre- taryE 1 a i n e McDearmon, Clover Hill Lucile OBrien, Clover Hill Frances Smith, Clover Hill Betty Morris, Clover H i l l  Nettie Moses, Southsidej Mary Gills, Clover Hill Cornelia Gills, Clover Hill Eloise At vood, Southsida Alice Carson, Stonewall Bettie Frack er, Stonewall Melville Pitten- ger, Clover Hill Jimmie Con ner, Halifax Charlie Towler, Charlotte William Mborefield, Iiilifax Virginia. Harvey, Campbell Nannie Harvey, Campbell Davis Street, Stone wall Gladys Woolridge, Bed ford Hudson Anderson, Hali fax Rheda Drinkard, Clover Hill A special feature of the com mencement was that it was a special alumni year, and a large number of the old students were present. Mr Walter Durham, an Appomattox boy, delivered the address to the graduates, and it was consider ed a very fine address. Walter was of the 1912 class and since that time has been to higher institutions and has taught at the V. M. I. for several sessions Mr. Jerry Burke, another alum nus, delivered the medals in a very pleasing manner. The first honor medal, given by R. F. Burke, went to. Miss Cornelia Gills Improvement madal, given by T. W. Moses, went to Mat taur Carr Agricultural first- honor went to Berkeley An drews, aud a scholarship to Richmond College, valued at 75 00, went to Miss Lucile OBrien. A special orchestra from Lynchburg furnished the music The class was in full uniform and presented a very striking appearance. On Monday night the liter ary societies hsld their annual contact and gave a very inter esting program. Tbe program was as follows"}, "highlight": {"text": {"matched_tokens": ["H", "Gills", "Gills"], "snippet": "Hill Betty Morris, Clover <mark>H</mark> i l l  Nettie Moses, Southsidej Mary <mark>Gills</mark>, Clover Hill Cornelia <mark>Gills</mark>,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills", "Gills"], "snippet": "Hill Betty Morris, Clover <mark>H</mark> i l l  Nettie Moses, Southsidej Mary <mark>Gills</mark>, Clover Hill Cornelia <mark>Gills</mark>,"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2020.32, 279.15, 2202.63, 877.14], "bbox_id": "6aedbc03ca", "file": "AppomattoxNewspapers_1939-1943a_0216.pdf", "page": 1, "text": "son have returned to their home in Portsmouth after visiting her par ants, Mr. and Mrs. J.N .Fhelps. Mr. and Mrs Binford Phelps and James Phelps hâve retûmed toB al- .imore after visiting Mr and Mrs. J . N. Phelps. Mr and Mrs. A B White, ot Lynchburg  pent C h ô m a s with Mr and Mrs. L. E. Smith. Mr. end Mis. J . H . Luuh and Miss Phoebe OBrien will spend the week end at White Sulphur Springs, W Va They will be accompanied by Mrs, A. B. Nowlin, who will spend some time with her daugh- Jer, Mrs. C. H. Manley. Garland OBrien has returned to Bal.imore after spending the holi days with his parents, Mr.and Mrs. ,V . W . OBrien. Mrs. E W. Austin and son, Harry, of Lynchburg visAed N a  tives here during the holidays. Misses Etta and Wanda Austin, of Lynchburg were recent guests ot Mrs. Monroe Garrett. John Cole, of Norfolk, is visning at his home here. Mrs R F. B. Steele and son, of Petersburg spent Wednesday  with Mrs. W . T . Steele. Guests in the home of M r. and Mrs W P Gills Christmas were M r.and Mrs. R. B. Frazier, Mrs. L B Pittman, of Richmond Mrs. William Copenhaver, of Marion Mr and Mrs. Allen Gills and family of Chatham. Mr. and Mrs. JamesT. Gills and Mrs. John Bell, of Lynchburg. vs- ited Mr. and Mrs. W. P. Gills this week. Miss Mildred McDearmon return ed to Columbia, S.C. last night, after spending Christmas here. Robert Work, of Pennsylvania, I was a guest in the home of Mr.and! Mrs. F.A. OBrien Christmas. Mr. and Mrs. Herman Swiezer will return to Wheeling this week-1 end after visiting Dr. and Mrs . C. G. OIBrien. Miss Elizabeth McDearmon and Ricltard McDearmon . returned to Richmond yesterday after  visiting their parents, Mayor and Mrs. G."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Pittman, of Richmond Mrs. <mark>William</mark> Copenhaver, of Marion Mr and Mrs. Allen <mark>Gills</mark> and family of Chatham."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Pittman, of Richmond Mrs. <mark>William</mark> Copenhaver, of Marion Mr and Mrs. Allen <mark>Gills</mark> and family of Chatham."}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [355.43, 329.23, 518.03, 989.45], "bbox_id": "ce0c830388", "file": "AppomattoxNewspapers_1926-1933a_0504.pdf", "page": 1, "text": "Miss Mandan.i Anderson spent Sunday with Miss Hope Wiley in the home of R. E. Red- ding. Miss Kathleen Wood, Allen Gills and Mr. White, of Lynch burg, were Sunday visitors at W. P. Gills. A. B. Abbitt was robbed of 1,000 worth of cigarettes from his store in Newport News while he Was visiting at Vera recently. Mr. and Mrs. Homesey Smith, Mr. and Mrs. Grover Smith and Mrs. W. H. S. Barlow motored to Roanoke Wednesday. Mrs. Mattie Harwood and Mrs. Lucy Gilliam were visitors at Mrs. N. R. Featherstones Tuesday. Mrs. Bettie Dunahoe and R. J. Dunahoe, of Roanoke, were guests in the home of Mr. and Mrs. Wiley Morris. Mr. and Mrs. R. W. Jamer son spent Sunday with Mr. Ernest Smith, of Concord De pot.Mrs. Ernest Abbitt and chil dren, of Roanoke, are expected to spend this week-end as the guests of Mrs. A. R. Harwood. Miss Kate OBrien and Mary Taylor Gills attended the cen tennial of the University of Richmond last week. Misses Virginia Epps and Catherine Irby were recent guests in the home of John Ed. Sears. While here they were en tertained at a picnic given in their honor. Misses Kate OBrien and El aine McDearmon and Messrs. Harold Spencer a n d William T. Smith vre the dinner guests of Mrs. Heiene Welch on Tues day evening. The Robert Edward Lee chapter of the U. D. C. met here with Mrs. W. P. Gills Sat urday evening. Mrs. Evrod Connor presided. H. W. Kinney and daughter Mrs. H. B. Foster, left recently ior a visit at Snow Camp, N C., after which Mr. Kinney will go to Florida. Miss Sarah Donald Cates and little Miss Betsy Cates, of Burl ington, are spending this week in the home of Mr. and Mrs."}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "with Mrs. W. P. <mark>Gills</mark> Sat urday evening. Mrs. Evrod Connor presided. <mark>H</mark>. W. Kinney and daughter"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "with Mrs. W. P. <mark>Gills</mark> Sat urday evening. Mrs. Evrod Connor presided. <mark>H</mark>. W. Kinney and daughter"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [353.3, 306.43, 515.49, 988.7], "bbox_id": "20c39cd556", "file": "AppomattoxNewspapers_1908-1909a_0504.pdf", "page": 1, "text": "Miss Mandane Anderson spent Sunday with Miss Hope Wiley in the home of it. E. Red ding. Miss Kathleen Wood, Allen Gills and Mr. White, of Lynch burg, were Sunday visitors at W. P. Gills. A. B. Abbitt was robbed of 1,000 worth of cigarettes from his store in Newport News while he Was visiting at Vera recently. Mr. and Mrs. Homesey Smith, Mr. and Mrs. Grover Smith and Mrs. W. H. S. Barlow motored to Roanoke Wednesday. Mrs. Mattie Harwood and Mrs. Lucy Gilliam were visitors at Mrs. N. R. Featherstones Tuesday. Mrs. Bettie Dunahoe and R. J. Dunahoe, of Roanoke, were guests in the home of Mr. and Mrs. Wjley Morris. Mr. and Mrs. R. W. Jamer son spent Sunday with Mr. Ernest Smith, of Concord De- pt.Mrs. Ernest Abbitt and chil dren, of Roanoke, are expected co spend this week-end as the guests of Mrs. A- R- Harwood Miss Kate OBrien and Mary Taylor Gills attendedthe cen tennial of the University of Richmond last week. Misses Virginia Epps and Catherine Irby were recent guests in the home of John Ed Sears. While here they were en ccrtained at a picnic given in their honor. , Misses Kate OBrien and El aine McDearmon and Messrs Harold Spencer a n d William T. Smith vre the dinner guests of Mrs. Heiene Welch on Tues day evening. The Robert Edward Lee chapter of the U, D.,C. met here, with Mrs. W. P. Gills Sat urday evening. Mrs. Evroc, Connor presided. H. W. Kinney and daughter, Mrs. H- B. Foster, left recently tor a visit at Snow Camp, N C., after which Mr. Kinney wil l go to Florida. Miss Sarah Donald Cates anc little Miss Betsy Cates, of Burl ington, are spending this week in the home of Mr. and Mrs. j. LlOyd Cates. I Mrs. Sammie Furr anc"}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "with Mrs. W. P. <mark>Gills</mark> Sat urday evening. Mrs. Evroc, Connor presided. <mark>H</mark>. W. Kinney and daughter,"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "with Mrs. W. P. <mark>Gills</mark> Sat urday evening. Mrs. Evroc, Connor presided. <mark>H</mark>. W. Kinney and daughter,"}], "text_match": 1733921018898022521, "text_match_info": {"best_field_score": "2216192376832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018898022521", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1570.3, 803.87, 1897.63, 987.55], "bbox_id": "53884584c7", "file": "AppomattoxNewspapers_1926-1933a_0519.pdf", "page": 1, "text": "William Fulcher and George  - ------ Abbitt Covington were visitors ing school, in the home of W. H. Seay Sun- Elizabeth Oliver, age day. I four, died on January 2. She Miss Elizabeth Hancock, of was buried at J Huntington, W. V a, was a re- Elizabeth was the daughter of ent visitor at Mrs. Lillie Greg- Mr. and Mrs. R. H. Oliver, 01 orys. Spout Spring. Miss Mary Taylor Gills has j uds0n Kinney, 3r.,J eturned to Bedford to resume Baptist hospital in Lynchburg her duties in the high school where he was operatedpn there  Tuesday. He was taken sick tnere  Friday and his condition is re - N. E. Ridge, of Norton was a ag being serious guest last week-end in thehome  .  vi - a May If Miss Isabelle OBrien, who Little Mi Virginia May jives near Vera. Green, of Burkeville, has re-"}, "highlight": {"text": {"matched_tokens": ["H", "Gills"], "snippet": "Mr. and Mrs. R. <mark>H</mark>. Oliver, 01 orys. Spout Spring. Miss Mary Taylor <mark>Gills</mark> has j uds0n Kinney,"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "Gills"], "snippet": "Mr. and Mrs. R. <mark>H</mark>. Oliver, 01 orys. Spout Spring. Miss Mary Taylor <mark>Gills</mark> has j uds0n Kinney,"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1965.03, 834.93, 2143.97, 990.62], "bbox_id": "6c2b91cd5c", "file": "AppomattoxNewspapers_1947-1949a_0356.pdf", "page": 1, "text": "Mr. and Mrs. T. M. Trent have  returned home after visiting friends  in Texas. II Mrs. W. P. Gills had as guests  over the week-end Mrs. W. H. j Copenhaver, of Richmond and Mrs. j James Connor, of Roxboro, N. C. Mrs. T. C. Harvey, Sr. has re- j turned to her home near here after j recovering from a recent operation j in the Va. Baptist Hospital. William S. Moses, of Roanoke,  spent the week-end in the home of j his mother, Mrs. Don Moses."}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "II Mrs. W. P. <mark>Gills</mark> had as guests  over the week-end Mrs. W. <mark>H</mark>. j Copenhaver, of Richmond"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "II Mrs. W. P. <mark>Gills</mark> had as guests  over the week-end Mrs. W. <mark>H</mark>. j Copenhaver, of Richmond"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1852.29, 774.88, 2025.82, 1519.97], "bbox_id": "51ee5106b7", "file": "AppomattoxNewspapers_1943-1947a_0014.pdf", "page": 1, "text": "er, Batty Burke, of Ralftigh, N. C. ire visiting in the  Burke home. Mrs. H. F. Jones hrs returned !rom a vi f in Clarksville, where he was a guest of her brother, Dr. W. M. Wian.  One of ui - esteemed readers, Miss Jani T Krn. suggests that ongratul-trn should go to John Curtis Caldwell for arranging such n attractive program of Shows at  .he local Lee Theatre. The theatre is an asset to the town, and not nly attracts many people to town but furnishes wholesome amuse ment and entertainment. Mrs. W. M. Thompson, of West Point, is spending this week with Miss Mary Louise Gills.Mrs.Thomp son and Miss Gills were dinner guests last evening in the  Burke homo.  Miss Vay Abbitt has returned fro ma visit at Black Mountain, N. C., where she was a guest of Mrs. John S. McKee. Mrs. McKee and son will arrive the 15th of this month for a visit. Mr. and Mrs. Burvall Temple tnd children, Nancy Winn and Bur veil, Jr., of Kinston, N. C., arj vis iting her parents, the Rev. ani Mrs. H. Frederick Jones. Mr, and Mrs. Eddie Moore re turned today to their home in West Virginia, after visiting his mother, Mrs. Mollie Moore. They were ac companied home by their daughter, who has spent several months here. The Rev. H. Frederick Jones wiT leave Monday to conduct a revval in King William County. Mr. and Mrs. R. B. Hudgins and daughter, Ruby Lee, and Mrs. J. E Terry motored to Richmond Mon day. Miss Elizabeth Cralle will return to Richpiond Sunday after spending two weeks here with her parents, Mr. and Mrs. C. C. Cralle. Miss Fannie Mae Cralle will return with er for a visit. Mrs. J. Raymond Lawson.. will! Tuesday and Wednesday of next! week in Richmond. Miss Elizabeth McDearmon, o f Richmond is spending this_week at her home here. Sgt. S. K. Gills, of Fort Jackson  S. C., Mrs. Gills, of Richmond, Lt. j Allen Gills, of Fort Eustis, and Mrs. Gills and cnildren, of Lynch- burg will spend this week-end in the home of Mrs. W. P. Gills. Week-end guests of Mr. an i Mrs. T. H. Trent were Mrs. N innie Mor gan, of Seattle, Washington, Mr. and Mrs. Berkley Ferguson. Mrs.! Alvin Trent, Mrs. Ottway Martin, j and Miss Christine Blackbourne, all i of Lynchburg. Warren Carter, of Portsmouth is"}, "highlight": {"text": {"matched_tokens": ["Gills", "H"], "snippet": "of Mrs. W. P. <mark>Gills</mark>. Week-end guests of Mr. an i Mrs. T. <mark>H</mark>. Trent were Mrs. N"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills", "H"], "snippet": "of Mrs. W. P. <mark>Gills</mark>. Week-end guests of Mr. an i Mrs. T. <mark>H</mark>. Trent were Mrs. N"}], "text_match": 1733921018763804793, "text_match_info": {"best_field_score": "2216192311296", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018763804793", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2309.2, 838.2, 2479.04, 1362.98], "bbox_id": "c5009e330b", "file": "AppomattoxNewspapers_1952-1954a_0275.pdf", "page": 1, "text": "tatory, using as her subject, Man, the Noblest of Gods Work. Miss Rebecca Babcock will give the Vale dictory, using the subject, Creators of the Future. The speaker of the evening will be introduced by Robert Burkey. Mr. Harry Green, of Lynch burg, will make the address to the Seniors. Principal H. E. Kerr will award diplomas to the graduates. Musical selections will be rendered by the class. Members of the class are Edward Earl Agee Samuel Hendricks Almond Robert Lamont Burkey Francis Frederick Carr, Jr. James Robert Dinkins Henry Allen Do a Jackson Delaware Doss Jesse Payton Harvey Kenneth Warren Jamerson Maymbad L  ter Mitchell Hunter Maraou Moore Richard Eugene Smith David Wilson Spiggle John Henderson Stratton Don Wilson Thornhill Joseph Franklin Vaughan James Ray Wingfield William Carter Woodson Rebecca Lou Babcock Betty Faye Burks Louise Gills Burnett Sallie Lee Campbell Dorothea Minor Meredyth man Sara Ann Cyrus Mattie Lora Fleshman Barbara Anne Gilbert Elizabeth Lena Hanenkrat Norma Christine Herndon Sara Elizabeth Irving Bettie Jane Layne Joyce Irene McCormick Shirley Anne McCormick Mary Anna Megginson Lucy Burns Patteson Frances Viola Ragland Peggy Merle Taylor Mary Elizabeth Trent Bertha Louise Wheeler Margie Ann Woodson."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Vaughan James Ray Wingfield <mark>William</mark> Carter Woodson Rebecca Lou Babcock Betty Faye Burks Louise <mark>Gills</mark> Burnett Sallie Lee Campbell"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Vaughan James Ray Wingfield <mark>William</mark> Carter Woodson Rebecca Lou Babcock Betty Faye Burks Louise <mark>Gills</mark> Burnett Sallie Lee Campbell"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2012.57, 377.23, 2183.38, 917.57], "bbox_id": "c3acbf0aef", "file": "AppomattoxNewspapers_1952-1954a_0202.pdf", "page": 1, "text": "Miss Julia Asher-spent the week end at her home in Brookneal. Mrs. Jennie Johnson, who has been quite ill, is improving. Mrs. L. L. Gayle spent last Thurs day in Richmond. William T. Evans spent the week end in Washington. Mr. Pettus Anderson and son, Chas., of Farniville spent Sunday with his father, Sam Anderson. Mrs. Robert Maloney, of Cullen, visited in the S. G. Anderson home on Tuesday. Miss Ann Evans, of Petersburg, will spend the week-end with rela tives here. Mrs. N. A. Wagers, of Richmond spent the week-end here with her mother, Mrs. S. L. Ferguson. Mr. and Mrs. Alvin Hudson, of Roxboro, N. C., spent Sunday with Mr. and Mrs. J. Lloyd Hudson. Mr. and Mrs. Harry Byrd Stanley and Mrs. Lloyd Hudson will spend Saturday in Greensboro, N. C. Mr. and Mrs. William Austin spent Sunday with relatives in Halifax. Mrs. W. H. Copenhaver was the week-end guest of her mother, Mrs. W. P. Gills, at Locust Grove. Mrn, Lester B. Harvey ?8 recov ering from a recent illness at her home here. The Rev. and Mrs. W. M. Thomp son, of Eagle Eyrie visited friends here last Friday. The Rev. and Mrs. 1?. F . Robinson and Mrs. Sam Anderson visited Mrs W. B. Thomas at Evergreen Mon day afternoon. Mrs. C. Kendall Hunter was host ess this afternoon to the Thursday Bridge Club. Mrs. Mattie Ferguson is recover ing from a recent operation at the Lynchburg General Hospital. Mrs. Rachel Cawthorn and son Ed, spent the week-end in Ports mouth with Mr. and Mrs. Raymond Harris. Mr. and Mrs. Sid Conner and sor of Roanoke spent the week-end her with her mother, Mrs. Talmadge"}, "highlight": {"text": {"matched_tokens": ["William", "H"], "snippet": "C. Mr. and Mrs. <mark>William</mark> Austin spent Sunday with relatives in Halifax. Mrs. W. <mark>H</mark>. Copenhaver was the week-end"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "H"], "snippet": "C. Mr. and Mrs. <mark>William</mark> Austin spent Sunday with relatives in Halifax. Mrs. W. <mark>H</mark>. Copenhaver was the week-end"}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1703.98, 405.48, 1875.34, 1028.96], "bbox_id": "f676fe76af", "file": "AppomattoxNewspapers_1954-1955a_0030.pdf", "page": 1, "text": "gathering of the descendants of the late William Rosser. Mr. Rosser, a native of Fincastle, who had moved to Appomattox, was engaged in mak ing firearms in Richmond for the Confederacy during the War Be tween the States. At the close of hostilities he returned to Appomat tox. During the following years he had many and varied interests, in cluding a mercantile business, oper ating several farms, and serving as United States Postmaster for Appo mattox Court House. A buffet dinner was served in the house and on the lawn. The home was decorated with varigated sum mer flowers. All members of the family and guests registered on a large scroll provided for the occa sion. They wore white caps, with red decorations, on the front of which was inscribed, Rosser Clan. The surviving daughters of Mr. Rosser, Mrs. Clement A. Hancock of Huntington, West Va., and Mrs. Bessie Ferguson, of Roanoke and Appomattox, were crowned Queens for the day. The following descendants and out-of-town guests were present Mr. and Mrs. Guy Littleton Furr, Miss Mary Catherine Furr, Guy Littleton Furr, Jr., of Roanoke Judge Catherine Clement Dellinger. William Rosser Clement, Newport News Mr. and Mrs. James Pitzer Gills, James Pitzer Jr., Mr. and Mrs. Edmond Theodore Gills, Blue- field, West Va. j Miss Mary Louise Gills, Richmond Braxton LeGrand Hancock, Huntington, West Va.  Mr. and Mrs. George Russell Gim- bert, Miss Evelyn Gimbert, London Bridge Lt. H. Clement Hancock Gimibert, of Fort Belvoir Don F. Drake, of Edmond, Oklahoma Mr. and Mrs. Cameron Winston White Clement Hancock White, St. Peters burg, Florida Mr. and Mrs. Charles Allen Carter, Charles Carter, Glad stone, Va. Mrs. Jennie Johnson Appomattox Mr. and Mrs. H. Har old Bendler, Virginia Beach Mrs., W. Daniel Browning, Richmond  Mrs. Harry P. Davis, Mrs. Mildred Alvis, Miss Patricia Alvis, Miss Kate OBrien, Mrs. Leonard McFadden. Randolph McFadden, Miss Opal Smith, Mr. and Mrs. Thelibert M. Trent, Miss Lina Trent, Mrs. William Benjamin Caldwell."}, "highlight": {"text": {"matched_tokens": ["William", "Gills"], "snippet": "Judge Catherine Clement Dellinger. <mark>William</mark> Rosser Clement, Newport News Mr. and Mrs. James Pitzer <mark>Gills</mark>, James Pitzer Jr., Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Gills"], "snippet": "Judge Catherine Clement Dellinger. <mark>William</mark> Rosser Clement, Newport News Mr. and Mrs. James Pitzer <mark>Gills</mark>, James Pitzer Jr., Mr."}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1423.87, 1012.51, 1604.05, 1795.8], "bbox_id": "3f8ddc6afa", "file": "AppomattoxNewspapers_1926-1933a_0049.pdf", "page": 1, "text": "Yellow sweet potatoes, first, M. F. Moon second, CS Coving ton third, J D Childress. Red sweet potatoes, first, Miss Emma Harvey second, Mrs W A Moon third, M F Moon. White potatoes, first, Mrs W A Moon second, T F Paulett third, Clyde OBrien. Black eye peas, first, H ailey  Inge second, Mrs T H Inge. Mixed peas first, S L Ferguson second, Howard Inge third, T H I Inge. Pumpkin, first, Frank Baker second, Mrs C M Stratton third, Homer Babcock. Potato pumpkin, first, G W Reynolds second, R A Jones third, Miss Annie Caldwell. Watermelon, first, L E Smith second, M F Moon. Three squash, first, Mrs Wi P Gills, Egg plants, first, Mrs E L Smith. Navy beans, first, Mrs R F Jamerson second, Ira Burrell, third, C F Moore. Butter beans, first, Mrs Guy Smith second, Ira Burrell third,  Mrs E M Stratton. ! Lima beans, first, Mrs M C  Smith. Sheaf wheat, first, Willie Moon. Irish potatoes, first, J E Bur nett second, Guy Smith third, M C Smith. Green mountain potatoes, first, F T Cawthorn second, BessieI Gunter. Stalks cane, first, M F Moon, second, RC Jones third, C S  Cawthorn.  Sweepstakes, first, W W Far rar, second. W W Farrar, third, Mrs J R Caldwell. Peanuts, first and second none third, George Carson. Buckwheat, first, Mrs. H B Marshall. Celery, first, Mrs C R Cald- I well, second, Mrs. C R Caldwell. Beets, first, Mrs W A Moon, second, Raymond Tinsley Craw ley, third, Guy Smith. Stalks corn, first, Stratton Bros. Sheaf of wheat, first, none, second, William Moon. Bale hay, first, E L Smith. Bunch soy beans, first, Mrs 0 L Scheffler, second Ira Burrell, third, W W Farrar."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Black eye peas, first, <mark>H</mark> ailey  Inge second, Mrs"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Black eye peas, first, <mark>H</mark> ailey  Inge second, Mrs"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [562.12, 1473.62, 720.22, 1867.35], "bbox_id": "a4e214aec5", "file": "AppomattoxNewspapers_1898-1902a_0486.pdf", "page": 1, "text": "were as follows Miss Ella Gaw thorn and Sam Jennings, Miss Mas- sie Caw thorn and Scott Shorter, Mr. and Mrs. Childress and Messrs. John and Willie Caw thorn. Messrs. Austin aud Huddeneli visited the. old surrender grounds at Appomattox on Sunday evening. Miss Sadie Coleman, of West Ap pomattox, was the guest of Miss Mazie McDtfarmou on Wednesday last. - Mrs. Bettie Chism celebrated her 69tii birthday on Friday last. She is well apd strong. She wasnt forgotten on that clay. Misses Willie and Nannie Wool dridge and Nannie Simms and Messrs. Chap Simms and Dabney Inge spent Saturday and Sunday last at Mr. Daniel Fergusons near the Old C. H. , Miss Carrie Cawthorn, who has been ill for the past few days is im proving slowly, we are glad to state. Mr. Ellis Simms, of Roanoke, was the guest of his parents of near here last week. Mr and Mrs. Pfizer Gills were the guests of Mr. nd Mrs. Henry Pitman on Saturday night last. Misses Massie Cawthorn, Mada- line Colemau, Ella Cawthorn, Mazie McDearmou, and Messrs. Johnnie Jennings, Jim Hamilton, Sam Jen nings, Edmond Cawthorn, Hubnard Coleman, and William McDearmon attended the supper and dance given at Mr. Scott Shorters on Saturday"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "near the Old C. <mark>H</mark>. , Miss Carrie Cawthorn, who"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "near the Old C. <mark>H</mark>. , Miss Carrie Cawthorn, who"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [392.12, 342.67, 559.53, 1285.57], "bbox_id": "820e06c64b", "file": "AppomattoxNewspapers_1926-1933a_0512.pdf", "page": 1, "text": "week in Ivor. l The senior class of the local school will sponsor a square dance at the town hall on Wed nesday night, April 27. C. W. Dickerson, state sup ervisor of Public School Libra ries, visited Appomattox high school this week. Miba Frankie McKinney ex pects to return home this week after a visit to relatiyes in Lynchburg. J. E. Dinwiddie and family are moving into one of Mrs. At woods houses this week. Mrs. Sammie Furr, of West Virginia, is visiting her parents at the old court house Mrs. Ola Patterson enter tained at a surprise dinner par ty for her daughter, Earle, Wednesday evening. The din ner guests were Misses Elaine McDearmon, Vara Morris, Kate OBrien and Messrs Cal vin H. Robinson, Harold Spen cer, Willilam T. Smith, Geoirge Abbitt. Mr. and Mrs. C. A Hancock visited Mrs. Lillie Gregory last week. While here, Mrs. Han cock had new lighting fixtures put up in the post office build ing. Several members of Dr- Christians family have b e e n sick during the last week, but are now out again. Mrs. E E. Gills, Mias Louise and brother, Robert, returned with Mr. Jamie Gills to Blue- field for a visit. Miss Bessie Jeter, of Home Economics Department, S. T. C- Farmville, accompanied by her mother, visited Miss Florence Gregory last week-end. Robert Edward Lee chapter of U. D. C. met with Mrs. Kate OBrien on last Saturday night. Mrs. Evrod Connor was elected delegate to district meeting to be held in Chase City. Mrs. Dora Martin, of Farm ville, returned home Friday after spending a few days with Mrs. Charles E. Seay. Mrs. Hallie Ferguson of Vera spent a few days last week with her mother, Mrs. Charles E. Seay. Mrs. W. H. S. Barlow and son, Ralph, have returned home after a pleasant visit to rela tives in Clifton Forge. Mr. and Mrs. J. D. Morris Miss Thelma Morris, Mrs. Flo rence Bingham and William Moore visited relatives in Rich mond last Sunday. The Recreational Club helc its social for the month of Ap ril on Tuesday night. Enter tainment was in the form of a leap-year dance. Little Lester Hudgins enter tained a score of his little friends at his birthday party Tuesday. He was ten years old. Mr- and Mrs. K. O. Reid, of Richmond, stopped by to make a short visit to friends on Wed nesday. See Wilkes plant advertise ment."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [392.62, 319.6, 559.26, 1261.31], "bbox_id": "49af0f2af3", "file": "AppomattoxNewspapers_1908-1909a_0512.pdf", "page": 1, "text": "week in Ivor.   , The senior class of the loteal school will sponsor a square dance at the town hall on Wed nesday-mght, April 27. C. W. Dickerson, state sup ervisor of Public School Libra ries, visited Appomattox high school this week. Miiha Frankie McKinney ex pects to return home this week after a visit to relatiyes in Lynchburg. - J. E. Dinwiddie and family are moving -into one of Mrs. At woods houses this week. Mrs. Sammie Furr, of West Virginia, is visiting her parents at the old court house. Mrs. Ola Patterson enter tained at a surprise dinner par ty for her daughter, Earle, Wednesday evening. The din ner guests were Misses Elaine McDearmon, Vara Morris, Kate OBrien and Messrs Cal vin H. Robinson, Harold Spen cer, Willitam T. Smith, George Abbitt. Mr. and Mrs. C. A- Hancock visited Mrs. Lillie Gregory last week. While here,. Mrs. Han- cock had new lighting fixtures put up in the post office build ing. - Several members of Dr- Christians family have b e e n sick during the last week, but are now out again. Mrs. E E- Gills, Mias Louise and brother,, Robert, returned with Mr. Jamie Gills to Blue- field for a visit. Miss Bessie Jeter, of Home Economics Department, S. T. C- Farmville, accompanied by her mother, visited Miss Florence Gregory last week-end. Robert Edward Lee chapter of U. D. C. met with Mrs. Kate OBrien on last Saturday night. Mrs- Evrod Connor was elected delegate to district meeting to be held in Chase City. Mrs. Dora Martin, of Farm ville, returned home Friday after spending a few days with Mrs. Charles E. Seay. Mrs. Hallie Ferguson of Vera spent a few days last week with her mother, Mrs. Charles E. Seay. Mrs. W. H. S. Barlow and son, Ralph, have returned home after a pleasant visit to rela tives in Clifton Forge. Mr. and Mrs. J. D. Morris, Miss Thelma. Morris, Mrs. Flo rence Bingham and William Moore visited relatives in Rich mond last Sunday. The Recreational Club heli its social for the month of Ap ril on Tuesday night. Enter tainment was in the form of a leap-year dance. Little Lester Hudgins enter tained a score of his little friends at his birthday party Tuesday. He was ten years old. Mr- and Mrs. K. O. Reid, of Richmond, stopped by to make a short visit to friends on Wed nesday. See Wilkes plant advertise ment."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "and Messrs Cal vin <mark>H</mark>. Robinson, Harold Spen cer,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.1, 789.13, 1902.92, 1038.34], "bbox_id": "ce5f23398d", "file": "AppomattoxNewspapers_1943-1947a_0045.pdf", "page": 1, "text": "UCC11 ivc.e ----- - , past session has returned to  home in Pampl.n.  Mrs. Vince LusardI is spending srjme time with her husband in Florida. Miss Harriett Holley, who has been teaching here in the high . school, is spending the summer va- ! cation with relatives in Wisconsin. Mrs. J. E. Morton,of Georgia, Mrg Morgan Gibson, of ,ent several daysjast week Washington are visiting in the. home rs. A. R. Harwo d. Mrs. Gibsons patents, tne-Rev. Mrs Albert Baird and mother, and Mrs. H . Frederick Jones. rs. F B Fitzgeraid, spent Mon- j Conner was a week-end iv in Lynchburg. i  t _ c william xy j..  guest uu tne home Qa mrs. i.vVr. Mrs J. R. Lawson and Mrs.F. Pitzer Gills. . Dresser spent Saturday i n M w D Morris is spending i T   trV .CT tred  m a i  to P   - in amp Peary, after spending sever- Cumberland. I days at his home here. j The many friend? of Mrs. Brax- Mrs S A. Lawson has accept- ton L. Hancock,  fo r m e r ly liv- d a position at the local hardware  nd here,,regret  o w .Va"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "and mother, and Mrs. <mark>H</mark> . Frederick Jones. rs. F"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "and mother, and Mrs. <mark>H</mark> . Frederick Jones. rs. F"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1724.91, 632.24, 1914.74, 1463.41], "bbox_id": "f136b61ee9", "file": "AppomattoxNewspapers_1943-1947a_0273.pdf", "page": 1, "text": "Thursday night. Mr. and Mrs. Ryland Hunter, of Crewe spnt Labor Day week-end at the Robertson home here. Miss Christine Eddins, of Rich mond was home for the week-end. I Misses Dorothy Lee and Rebecca Tohnson, of Lynchburg spent Sun day night with her. Rev. and Mrs. B. F. Robinson, of J llysford, Mr. and Mrs. C.H. Rob- nson and Mrs. Ola Patteson were inner guests Sunday evening of Mr. and Mrs. G. B. Buchanan. I Miss Illah Buchanan, of Wash- I lgton spent Labor Day. week-end  I vith her parents, Mr. and Mrs. G. I B. Buchanan.  Mr. and Mrs. H. Y. Spencer are I occupying an apartment in the I Harwood Apartment house.  Mr. and Mrs. Cliff Thomas and children have returned to Newport News after visiting her parents, Mr. and Mrs. Sam Evans. Friends are glad to hear that Miss Lucy Smith has returned from the hospital, and is recovering at her home here. Mr. and Mrs. Meredith Evans, of I Lynchburg will spend this week end with his grandmother, Mrs. Jennie Johnson. Miss Marian June Evaito has been visiting Mr. and Mrs. Mere dith Evans in Lynchburg. Mrs. E. T. Mitchell spent the I week-end in Newport News with Mr. and Mrs. Vernell Mitchell. Mrs. Martha Guill, Mrs. William Mitchell, Mrs. Archer Thompson, and Mrs. William Bucksey.have re turned home after spending sever al days at Buckroe Beach. Mrs. H. F. Jones, Jr., Mrs, Du laney Foster and son have return ed to Baltimore after visiting m the home of the Rev. and Mrs. H. Frederick Jones. J. Frasia Jones and son, of Portsmouth are visiting Rev. and Mrs. H. Frederick Jones. Mr. and Mrs. Eddie Moore, of Algoma, W. Va., were guests re cently of his mother. Mrs. Mollie Moore. They were accompanied home by their daughter, Mollie Kate, who had been spending sev-  eral weeks here. Mr. and Mrs. Rupert Rogers, of Hopewell were recent guests of Mr. and Mrs. Ernest Rogers. Miss Louise Gills left today to visit in Bluefield and Huntington W. Va., before going to Richmond where she will make her home. Hugh Martin, of Baltimore was home for the holidays. Miss Mary Martin, of Washing ton is spending her vacation with her parents, Mr. and Mrs. F. L. Martin."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Buchanan.  Mr. and Mrs. <mark>H</mark>. Y. Spencer are I"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Buchanan.  Mr. and Mrs. <mark>H</mark>. Y. Spencer are I"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1457.32, 385.05, 1648.05, 1699.23], "bbox_id": "147155d55a", "file": "AppomattoxNewspapers_1922-1923a_0373.pdf", "page": 1, "text": "Thursday at noon at Libe tv Baptist Church here the marriage of Miss Lillie Neal Hancock to Mr. Abner H. Gregory was so len in Z d in tbe presence of a large audeuce. The church was decorated with cedar, chrysanthemums and carna tions and lighted with hundreds of candles. The bride met the groom under a large bell of flowers where her minister, Rev. George S. Ken- naid performed the ceremony in a very impressive manner. Miss Margaret Smith, teacher of music at the Union Acade uy oi Spout Springs, had jchaige of the music and played softly several se lections while the service was being performed. Mr. E. H. Matthew- 6on, who is at the headof the U. S. Experimental Station here, sang very sweetly Loves Old Sweet Song. Mrs. Frank Sheard, of Lynch burg, was matron of honor, and wore pink dress with roses. Miss Maude Gregory, sister of the gr-.om was maid of honor, and wore white net over pink silk and carried white roses. Capt. Nathan C. Hancock, broth er of the bride was best man. The brides attendants were Miss Margurite Marshall with Harry Hancock Miss Emma Smith with Walter B. Ellett Miss Helen Gregory with H. W. McKinney Miss Bertha Caldwell with A. .V. Jones Miss Mattie Jones with R E. Caldwell Miss Mary-Hancock with Joe LeGrande Mrs. Bessie James with Leonard Gregoiy Miss Sallie Goff with V. L. Raby Miss Maty W. Caluweil with John Goff Mies Annie Elliott witn II. C. Steele Mies Kate Cheatham with C. W. Stewart Miss Ossie Agee with William Jones. The brides maids were dressed in .white and carried pink roses. Little Virginia and Annie cock were flower giris and white aud carried pink and carnations. Royal Hancock, Tunstall gun, James Stanley, Janies Gills, Robert Walton, Willie Walton, Ben jamin.Kennard and Braxton Han cock were ribbon boys. The boys wore white suits and held white and pink ribbon. The bride wore white net trimmed in real lace over whine taffeta, and Uer bridal veil was caught with a beautiful brooch set with  tails, a gift from tbe groom, and a diamond pin, an heirloom of the family. She carried in her hand a white ptajer- book. They boarded the wes bound train tor a tiip west and will be at home to their tneuds here after the ,2tn. The bride is the very attractive young daughter of Mr. C. W. Han cock, a popular contractor of Lynchburg aud this place, and is one of the prominent and Highly connected families of the .Kate. The gioom is a fine young man of sterling qualities, a son ot Mr. N. H. Giegory, of this place arid holds a position with the N.  W. Ry. Co where be is highly esteemed by his comrades and employers. The presents presented to tbe bride were of a very high order, among them a deed to tbe hand somer. t home in the county from the father of tbe bride. This home has just been completed here and e healed throughout with generators, lighted,by acetylene gas -iud con tains every modern convenience. Tbe presents number 125 all told, and the bride is extremely happy and appreciative ovarihe thought fulness of her frieuds. RECEPTION. On Wednesday evening the s a- cious and palatial home was opened to the bridal party and an elegant reception was teudered those pres-jent. ent Rev. Mrs. Kennard presided at the table and Mrs. J. R. Atwood at the punch bowl. Mesduins E. W. Taylor, C. A. Hancock and Miss"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Hancock to Mr. Abner <mark>H</mark>. Gregory was so len"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Hancock to Mr. Abner <mark>H</mark>. Gregory was so len"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1861.47, 572.54, 2037.78, 986.69], "bbox_id": "814883d18d", "file": "AppomattoxNewspapers_1943-1947a_0110.pdf", "page": 1, "text": "The regular monthly business meeting of the W. M. S. of Liberty Baptist Churcn was held at r.ho chinch on Wednesday, November l 7, at 230 P. M., when Mrs. Lucy Furney beautifully presented a most interesting program with  Pa ganism as the topic, using a collec tion of idolitrous oojects from Afri ca, exemplifying heathenism, and displaying a hand-made poster de monstrating The way, the truth and the light from  Darkness to Downing. A very impressive Bible Study, subject Friend of Paul, Epistle to Philemon, by Ella Broad- us Robertson, was taught by the societys president, Mrs. H. Freder ick Jones. The following  officers were elected for the coming year President, Mrs. A. I. Caudle 1st vice-presilent, Mrs. W. J. Le Grand 2nd vice-president, Mrs. W. W. Scott 3rd vice-president, Mrs. Lucy Furney Recording secretary, Mrs. George Purdum Assistant recording secretary,Mrs Luther Morris Corresponding secretary, Mrs. W. P. Gills Treasurer, Mrs. Don Moses Assistant treasurer, Mrs. Harry Davis Pianist, Mrs. L. E. Smith Assistant pianist, Mrs. Don Moses Sunbeam leader, Miss Carolyn Smith G. A. leaders, Mrs. William Burke and Mrs. Larry Young R. A. leader, George Abbitt Y. W. A. leader,Miss Louise Gills."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "the societys president, Mrs. <mark>H</mark>. Freder ick Jones. The"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "the societys president, Mrs. <mark>H</mark>. Freder ick Jones. The"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1425.38, 849.86, 1722.16, 1302.52], "bbox_id": "fd4aa1a1e1", "file": "AppomattoxNewspapers_1912-1915a_0490.pdf", "page": 1, "text": "The next regular meeting of ther W. 0. T. U., of Appomattox, wil j be held at the home of Mrs. E. E. I Gills on Wed. afternoon, Jan. 27ih, I jat 230. We hope all members will I be present. I Mr. and Mrs. L. E. Smith an- nonnee the approaching marriage! of their sister, Myrtle Evelyn Inge, I to Mr. John William Hamlet, of! iLynchbiirg, Feb. 3rd, 19l5, at 21 I oclock at their home. Friends in-1 Ivited. J I I Special Agent Joe Funk, of the! I Norfolk  Western Railway on I I Monday arrested Paul Johnson, a I 116-year-old colored boy, at hie I I home hear Elam on the charge of I placing a cross tie on the tracks I near Prospect Sunday afternoon and  attempting to wreck westbound No. 13. The obstruction whs discovered I by the engineer in time and wss re- I moved after a Short delay. The I youth will be given a hearing at I Farmville. I Friday night onr town was again I visited by thieves. This time the  thief known as John Williams, col., or the Peace j . A. ciark, post- 1 Went iu through the glass of the of the Peace-j. s. West, Pt-1 front door of Purdum A Caldwells ie-J. M. Childress, postoffieo New j tore. Operator Neil heard the Stx bit . DisTBioz. Icr h Of the glass and made an in- ior m . u Layne, postoffloe war-1 vestigation. The man was fired on of the pesos d . w Hanooek.  several times, but made good hie rgooitsvi W. ot the P e y e  G."}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "Mrs. E. E. I <mark>Gills</mark> on Wed. afternoon, Jan."}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "Mrs. E. E. I <mark>Gills</mark> on Wed. afternoon, Jan."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1862.95, 567.29, 2028.41, 817.82], "bbox_id": "1b65b9214d", "file": "AppomattoxNewspapers_1949-1952a_0144.pdf", "page": 1, "text": "The guests included Mr. and Mrs. h C. OBrien and Frances Mr. and Mis. Martin Cook and Anne, of Buckingham Mr. and Mrs. Ray Houchens and Jerry, of Petersburg Mrs. Banks Frazier, of Kenbridge Mi. Randolph Wesson, of Lawrenee- viilei Miss Louise Gills, of Rich mond Mrs. Herman Robertson, of Lovingston Mrs. Daniel Jennings, oi Camden and from Appomattox Dr. and Mrs. H. Y. Spencer, Dr. and Mrs. C. G. OBrien, Mr. and Mrs. Herman Schweizer, Mrs. William openhaver, Mr. and Mrs. R. W. Stanley and Jane Miss Caroline Smith, Mr. and Mrt. Sydnor Con ner, Mr. Sam Conner and Faye, Mi. and Mrs. Howard Gilbert, Mrs. ... W. Morris, Mr. D. A. Conner, Mr. and Mrs. W. D. OBrien, Mrs. F. A. OBrien, Mrs Mildred Alvis, Mrs. A. W. Covington, the Rev. and Mrs. J. P. Leitner and granddaugh ters, Mrs. W. J. Covingl, Jr., and Alease and Mrs. Bessie Ferguson."}, "highlight": {"text": {"matched_tokens": ["h"], "snippet": "included Mr. and Mrs. <mark>h</mark> C. OBrien and Frances"}}, "highlights": [{"field": "text", "matched_tokens": ["h"], "snippet": "included Mr. and Mrs. <mark>h</mark> C. OBrien and Frances"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2300.57, 856.33, 2474.28, 1570.83], "bbox_id": "217974bb23", "file": "AppomattoxNewspapers_1960-1962b_0597.pdf", "page": 1, "text": "The following euimmattees have ben announced for the 1962 Ap pomattox Horse Show Ribbon MbrshaU Mrs. JimSmith, i Medical Dr. a G. OBrien, Dr. A. A. Fratrick and Dr. J. A Mpf- hewB. Co. cessions S. A, Lawson, Ch., w- D. Morris, Bob Montgomery C. Poe, Jimmy Drinkard, Van Farij 4 i Rod Jamereon, Ch. Ed Garter, H. C. Pokfem. jm d Ring.-FWL J f M , reoit. Lawson, F. L. Stan, ley and George Abbitt. Photography Jim Redding, Ch., Taylor Mat thews. E tertadnimentt Watt Abbitt, Bob by Lawson, Jim Smith and Bobby MStohell. . Parking Bmiftt McGrow, Ch., Cr R. Thomas, Kenneth Jmerson, C T- Moses, Jr., Red Harvey, John Cole, Scott Moore, Buddy Hem- CR T. Coleman, Jerry George, Cecil Rowe jand Francis Dickie Hamilton. Gate Tickets John Paulett, Ch., Jessie Morton Rosser, Ear Agee, Ed Oawthome, F. Ftasfonan, Dick Wingfield, Jim Woody, H. G. Law- ton and Calvin Tanner. Stalls Dan Moody, Ch., David Qaidweil, Calvin Tanner, John Mc Lean, P. W. George, Stum Davidson, Martin Webb, R. V. Lefifera Tom Patterson, Jerry George and G. B. Parrish. Traffic W. W. Blythe, Ch., and R. G. Netheriandl -1. Ringside Parking Bill Chenault, Ch., Morton Ferguson, Burke Guill, Bill Sperry, W. E. Ctirson, Clyde Childress. - Publicity T. E. Norris, Ch., jBil- ly Conner, Bill Sjperry, C. G. O Brien, Jim Haskett, Jim Redding, Bill Dudley and! Freddie Teddy Moore. Executive J. E. Bearner, Gener al Chairman Jim Cobb, Co-Chair man, Jim Smith and Bobby Mitch ell. Ring Gate Jessie Ostpme, Way ne Lee, Kenneth Coleman, John Hall and William Mann. Money T. D. Evans, Ch., W. W. Burke, A. R. Harwood and Ralph King. Advance Tickets Frank, Chuchek, Ch, Bill Hunter, T. C. Evans, W. W. Burke, Ivey Holland, Ned Le- Grand, Bobby Mitchell, Garland Plunkett, Bill Woody. Telephone, and Lights W. S Gills, Ch, and T. T. Martin. Program Ben Marshall, Oh, Mor ton Ferguson, N. Jennings, Garland Plunkett, Billy Conner, John Grin- els, Bill 8 perry and Calvin Robin son."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Jamereon, Ch. Ed Garter, <mark>H</mark>. C. Pokfem. jm d"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Jamereon, Ch. Ed Garter, <mark>H</mark>. C. Pokfem. jm d"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1564.83, 1103.01, 1733.5, 1478.79], "bbox_id": "dc3e610bc3", "file": "AppomattoxNewspapers_1952-1954a_0587.pdf", "page": 1, "text": "The Appomattox Floyd Ward Dance Revue will be held in the Ap pomattox High School auditorium at 800 P. Bl. Friday, May 28. Under the direction of Miss Edna Gregory, teaccr, and Mrs. William W. Burke manager, a show entitled, The Cir cus Frolic will be presented. In ad dition to the Dancing Glass local children will take the parts of clowns, midgets, side show attrac tions, creating a circus atmosphere. Little Herbie Pulliam will take a leading role with his Jerry Mahony puppet doll. Those taking the part of the chil dren at the circus are Kitty Vaughan Wood, Susan Nell OBrien, James Gurney, Gene Cole, Reggie Speir, Susan Gills, Tommy Ash worth, Jane Abbitt Harvey, and John Evans. Clowns performing in the aud ience and on the stage are Brod Pack, H. T. Wood, Donald Giles Freddie Mitchell, Bill Allen Burke BijQi Cadwell, Kenneth Marshall, Frank Leigh Burke, the Mabley Twins, and Bobby Barger. Girl midgets giving a special num ber are Linda Anderson, Joan Har vey, Nancy Davis, Roby Lou Robert son. Members of the Dancing Class will be Marionette Dolls, Cupi Dolls, Trapeze performers. Pony Riders, Rodeo Girls and Ballet Dancers. Those dancing in these groups are"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "Gregory, teaccr, and Mrs. <mark>William</mark> W. Burke manager, a"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "Gregory, teaccr, and Mrs. <mark>William</mark> W. Burke manager, a"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [976.8, 421.48, 1146.34, 964.52], "bbox_id": "58f09a5b21", "file": "AppomattoxNewspapers_1933-1936a_0118.pdf", "page": 1, "text": "ston and N. the week end Miss Dorothy Evans, of Richmond spent the week end in the home of Mrs. G. W. Smith. Friends are glad to see Rev. W. K. Cunningham out again after his recent iliness. W. M. Abbitt has returned from a vacation spent on the Rappahan nock. river. __________ Misses Margaret and Myrtle Sm- ith returned Friday after a trip to the Worlds Fair. Mr. and Mrs. Ted Gills and da ughter, have returned to Bluefield after visiting relatives here. Mrs. H. D. Flood and children, of Washington, D. C., spent several days last week here. Supt. J. A. Burke returned Fri day night after attending a study course at Charlottesville. Mrs. W. R. Reynolds and daugh ter, Virginia, spent  Tuesday ip Richmond. Mr. nd Mrs. Wilbur McDearmon cent the week end at Fredericks burg. Miss Virginia Rynolds will leave Sunday for Amherst, where she will teach this winter. Mrs. A. B. Ferguson and son, Paul, of Evergreen, spent Sunday with Mrs. A. E. Coleman. William Coleman, of Lynchburg, has returned after an extended visit  in the home of John Hollycross.  Miss Beatrice Coleman, of Wash- j ington, was a guest of Miss Jose- j phine Hollycross Sunday. Mrs. P. B. Carter and children,  of High Point, N,. C. spent last J week with Mrs. W. D. Anderson. ! Mr. and Mrs. Elwood Alvis and  daughter, Jacqueline, spent Sunday  with Mrs. W. D. Anderson. Miss Lottie Moorman and Percy Moorman, of Roanoke, visited re-  latives in Appomattox this week.  Mr. and Mrs. Stanley Moore, of  Crewe, were guests of Mr. and Mrs. ! X. EL Cheatham this week. Misses Frances Wright and Doris j"}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "Mr. and Mrs. Ted <mark>Gills</mark> and da ughter, have"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "Mr. and Mrs. Ted <mark>Gills</mark> and da ughter, have"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [256.8, 597.77, 419.0, 1248.39], "bbox_id": "760a6b79ab", "file": "AppomattoxNewspapers_1926-1933a_0492.pdf", "page": 1, "text": "son.Thomas N. and H. J. Carn- efix and children, of Richmond spent the Fourth of July holi days with relatives near Vera. Little Miss Pauline Jamer- son has been spending some time visiting her grandparents Mr. and Mrs. R. L Godsey. Mr. and Mrs. D. J. .Frank lin visited his sister, Mrs. W. P. Gunter, in Petersburg, Sun day. Mr. and Mils. Finley Doss and son, Junidr, spent the week-end with his parents Mr. and Mrs. Samuel H. Doss. Mr and Mrs. C. A. Hancock and grand-daughter, Jeanette, have returned to Huntington, W. Va., after visiting here. Mr. and Mrs. W. A. Walton have returned to Disputania after visiting Mr. and Mrs. T. A. Walton here. Prof. Fitzgerald Flournoy and Mrs William Cabell Flour noy, of Lexington, were guests last week of Mrs. E. E. Gills. A party of local boys and girls spent Monday, July 4, at Lake Tonawanda, ending With a picnic supper at 6 oclock. The Rev. W. M. Thompson, Miss Virginia Lee Thompson and Jack Scott left this week to attend the Baptist encamp ment at Virginia Beach. Mr. and Mrs. Jay Packard, of Antigo, Wis., left for Rich mond and Washington after visiting Mr. and Mrs. H. C. Babcock here. Mrs. Bezryl Burgardner, of Stoney Bottom, W. Va., and children, have returned home after visiting her aunt, Mrs. H. C. Babcock and others here. Miss Frankie Godsey, of Lynchburg, .returned .home after a pleasant visit in th!e home of Mr. and Mrs. R. L. Godsey. Jones Caldwell, of Lynch burg, Mr. and Mrs. C. D. Lew- is and sons, Clark and Dan, visited their parents, Mr. and  Mrs. M. C. Caldwell, during the week-end."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "son.Thomas N. and <mark>H</mark>. J. Carn- efix and"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "son.Thomas N. and <mark>H</mark>. J. Carn- efix and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.84, 334.12, 1844.74, 857.27], "bbox_id": "854eae4160", "file": "AppomattoxNewspapers_1955-1957a_0147.pdf", "page": 1, "text": "son, Vickie Smith, Kirkie Watson, Anne Crawley. Third grade, Miss Della Inge Neil Conner, Louis Fields, James Gurney, Grey Hesson, Luther Hicks, Ray Hollinsworth, Richard Jones, Eugene Phelps, Eugene Wil liams, Nancy Boney, Kathrine Caldwell, Joan Ferguson, Patricia Ferguson, Donna Guill, Carolyn Hall, Mary Grey Holland, Lois Mays, Patricia Pankey, Anita Richardson, Dianna Rush, Linda Shouse, Katu- raih Smith, Mary Yancy Spencer. Fourth grade, Mrs. Thelma Mar tin  Harold Carter, Earl Day, Tom Evans,. Wayne Ferguson, Douglas Mitchell, Cecil Phelps, Wayne Phelps, David Reed, Lewis Sharp, Richard Smith, Jimmy Torrence, David Wright, Herbert Martin, Carolyn Coleman, Sue Giles, Patricia Hall, Michael Mitchell. Fourth grade, Miss Nola Burkey William Allen Bryant, Lawrence Haley, Joe LeGrand, Wendell Mad dox, Charles Martin, Herbert Pul liam, Herbert Shirey, Joe B. Terry, Thomas C. Torrence, Priscilla Cole, Joyce Edmonds, Barbara Gaines, Carol Justice, Carolyn Keys, Jane H. Stanley, Nellie Ruth Harris. Fifth grade, Mrs. Parris Faye Al mond, Claude Byers, Freddie Car ter, Steve Godsey, Freddie Grishaw, Taylor Mabley, Clifford Pugh, James, Whitehead, Roy Woody, Su zanne Gills, Margaret Johnson, Ju anita Maddox, Mary Lee Mayberry, Phyllis Jane Mayberry, Sue Tuck er, May Woody, Allen Lee May berry. Fifth grade, Mrs. Harriette P. Cunningham Aubrey Evans, Wil liam Ferguson, John Goin, Teddy Moore, Elmer Phelps, Randolph Smith, Patricia Cheatham, Carson Crawley, Mary Ann Franklin, Sue Gilbert, Katherine Lewis, Helen Mann, Jean Page, Juanita Harris, Judith Cocks. Fifth grade, Miss Mamie Cullop Blaine Carter, Robert Goin, G. H."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "grade, Miss Nola Burkey <mark>William</mark> Allen Bryant, Lawrence Haley,"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "grade, Miss Nola Burkey <mark>William</mark> Allen Bryant, Lawrence Haley,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1596.62, 1156.61, 1757.55, 1342.98], "bbox_id": "c7d4bb027e", "file": "AppomattoxNewspapers_1908-1909a_0538.pdf", "page": 1, "text": "SBW- H. S. Barlow has re turned from Clifton Forge af- ter!. weeks .stay with her daughter, Mrs. Albert Brock- well. Mrs. William Cabell Flour- ney and son, Prof. Fitzgerald Flournoy bf- Washington,  i and e University, were guests in the home of Mrs. E. E Gills this week I Dr. and Mrs. James and their S"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "SBW- <mark>H</mark>. S. Barlow has re"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "SBW- <mark>H</mark>. S. Barlow has re"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [461.29, 630.64, 657.32, 1789.97], "bbox_id": "0b716bb7bf", "file": "AppomattoxNewspapers_1939-1943a_0346.pdf", "page": 1, "text": "rr. H. Morris, of Richmond visited his mother, Mrs. Louella Morris, last week. Mis. E. E. Gills was the guest of her sister, Mrs. Bessie Ferguson. Robert Allen Sears, Alfred Le- Urande and Garland Morris have left for V. P. I., and William Moore and. Thomas Jennirgs for Richmond. Dr. and Mrs. D. A. Christian spent Sunday in Richmond, where they visited Miss Agnes Christian, who is a patient in the hospital of the Medical College of Virgin. Douglas McKenzie who has been sick at his home here, Is improving. Marshall Babcock, of Camp Pen dleton, spent the week-end at his home here. rt 1 Mrs. C. T. Moses has returned I home rfter a visit to her daughter, Mrs. Webster Babcock, at Amherst. Miss Rebecca Johnson, of Lynch- burg spent the week-end with Miss Fannie Mae Cralle. Miss Elizabeth Cralle, of Rich mond and Miss Lucille Cralle, of Charlottesville were home for the week-end. Mrs. Carroll Smith spent the week end in Charlottesville. Mrs. Ida Morris and Charlie, have returned ftom a trip to Richmond, Buckroe Beach and Yorktown. Mr. and Mrs. Tommie Harvey and daughter, Mazie Alice, will leave next Thursday to spend the rest ox the week with relatives in Rich- mond. They will attend the State Fair next Friday. Mrs. Ola Patteaon and Mrs. Calvin Robinsn were luncheon guesta of Mrs. Richard Webb, of near Holly wood, Monday. Friends are glad to hear that Mrs. Rosa Webb is improving after a re cent illness. Mrs. J. A. Webb and family and Mr. and Mrs. Albert Jamerson will spend Sunday in Buckingham with Mr. and Mrs. Sylvester Beasley. Mr. and Mrs. William Carter. Mr. and Mrs. W. L. Miller, and Mr. and Mrs. J. Fraaia Jones, all of Balti more, were guesta over the week end of the Rev. and Mrs. H. Fred erick Jones. Mrs. Calvin Robinson and Mrs. Ola Patteaon were dinner guests on Tuesday of Mrs. Grover Beasley, of near Hollywood. Mrs. J. Vance Perkins and child ren, J. Vance, Jr. and Jane Mar shall, of Greenville, are visiting her parents, the Rev. and Mrs. H. Fred erick Jones. Mr. and Mrs. Hornsey Inge, Mrs. Bertha Smith. Wiley Ranson, Mrs. J. P. Johnson and son, Garland, were week-end guests of Mr. and Mrs. Willie Smith, of Ashland. Mrs. J. Vance Perkins and child ren and the Rev. and Mrs. H. Fred crick Jones are spending today in Clarksville. The high school football squad is holding daily practice sessions. Mr. and Mrs. W. W. Burke, Mrs J. F. Harvey and Mrs R. N. Dawson spent lastweek at Camp Douthat. Mrs. D. E. Torrence has returned to her home near here after spend ing several weeks at the Virginia Baptist hospital, where she received treatment.  George Cale, of Fork Union Mili tary Academy, spent the week-end at his home here. Mrs. Richard Nunn, of Farmville spent Friday with Mrs. A. J. Lucas. Mrs. G. F. Abbitt, Jr., spent last week at Altavista with her parents, Mr and Mrs. Emory CundifF. Mr. Abbitt spen the week-end with them. Jennings Conner motored to Rich mond Wednesday. A. F. Godsey spent last week in Roanoke. Mr. and Mrs. A. J. Lucas moved Monday into Die residence formerly occupied by Mr. and Mrs. Herman Ould. Mr. and Mrs. E. G. Owen, who have been living in the Harwood i apartm ent bouse have moved to o-itrt Mrs. Owens sister."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "rr. <mark>H</mark>. Morris, of Richmond visited"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "rr. <mark>H</mark>. Morris, of Richmond visited"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1415.02, 617.67, 1584.74, 966.76], "bbox_id": "4143b58100", "file": "AppomattoxNewspapers_1939-1943a_0008.pdf", "page": 1, "text": "Richard Floyd Burke, III, and Miss Cornelia K. Gills spent Wed nesday of this week in Roanoke and attended a regional conference of insurance agents at Hotel Patrick Henry. i -l r ! MA. William Copenhaver, ioltf Marion, spent the Thanksgiving hol idays with her parents, Mr.and Mrs. W. P. Gills. , Mrs. J. O. OBrien, of Lynch-  burg is visiting Miss Ann OBrien Miss Virginia OBrien spent the holidays in New York city. Miss Florence Caldwell, who- is teaching near Norfolk, spent the week-end at her home near here. Cadet W. Caldwell Cooke, of V. IP, I., and Powell and Randolph Caldwell, of Sweet Briar, spent the week-end at East Ridge Farm. Friends are glad to hear that R. W . Smith, of Spout Spring, who bas been a patient i- a Lynchburg hospital, is convelescing at the home of his son, David Smith. Mr. and Mrs. A. B. White, of Lynchburg, N.H. Bates, of Victoria, find Miss Ilene Smith spent Sunday ft Spout Spring, with Mr. and Mrs. , H. Bates. Miss Elizabeth McDearmon, of Richmond, was home for Thanksgiv- g."}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "and Miss Cornelia K. <mark>Gills</mark> spent Wed nesday of"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "and Miss Cornelia K. <mark>Gills</mark> spent Wed nesday of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1647.83, 221.67, 1807.54, 515.94], "bbox_id": "6bd92f19bf", "file": "AppomattoxNewspapers_1902-1905a_0024.pdf", "page": 1, "text": "R oll o f H onor.   . Apliolnattoxfeglr alioolBessie Coleman, Terry Duifuui, Harry Hancock, Mnry Patti, Eula Burke, Carrie Huuier, Mary Irby, Addie Pace, William Lee, Sofia Williams. Venona Sears. , Intermediate DepartmentMiss E. V. Hardy, teacherCabell Fos ter, Grace Haucock, Lynolee At wood, John D. Ahbitt, Louise Gills, Jerry Burke, Zaida Abbitt, Beldsoe Clelneut, Maggie Fleshman, Russell Ciemeut, Katy Woolridge, May Wal ton, Mace Coleman.  brithajy DepartmentMt 9 e Em ma Smith, teacherCharlie Abbitt, Willie Walton, Gladys Smith, fiobt. Walton, Myra Smith, JatiiBS Chil li rese, Snssie Hancock Ohatliff Paris. . Requirements High School De- paitment 95 per cent, on general average, there 98 per eepfc. , J, G F ishle K ,1 Principal."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "R oll o f <mark>H</mark> onor.   . Apliolnattoxfeglr alioolBessie Coleman,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "R oll o f <mark>H</mark> onor.   . Apliolnattoxfeglr alioolBessie Coleman,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2205.05, 1071.67, 2364.34, 1696.68], "bbox_id": "77fd3b5db9", "file": "AppomattoxNewspapers_1918-1922a_0106.pdf", "page": 1, "text": "R o ll o f H onor, A ppom attox A g ricu ltu ral School Fourth YearEloise Atwood, Gladys Wooldridge, Ma r y Taylor Gills, Nannie Harvey, Iiucile OBrien, Edwin Adams, delville Pittjnger, Jimmie Con ner, William Morefield. Third YearGrace Bagby, vlargaret Chilton, Nola Burkey, Minnie Rob rtson, Stella Payne. Second Yea- Mary Foster, Marguerite GMiaru, Burke teele, Rupert RjgerH, Lydia Rogers. F i r s t .YearAnnie Snell, Odessa Shearer, Virginia Shear , Myrtle Smith, John Carroll Stanley, George Inge. Seventh Gade  Frances Ford,Eleanor Ferguson, Minnie Chockleit, Idelle Ferguson, Nellie Callaham, Peyton 8nell, Lin wood Godsey, Allen Gillp, Lewi McDearmon. Filth GradeCatherine Gill, Oudia OBrien, Alice Harwood, Florence Gregory, Inez Goin. Kernoit Fisher. Fourth Grade  Eva Doss, Annie Doss, Corine Hancock, Joe OBrien, Richard McDear mon, Delphin Godsey, Clyde OBrien, Eugene Carson, Joie Jamerson. Third Grade  Katherine Chocxlette, Eleanor Harwood, fary Jamerson, Lucy LeGrande, Mary Ann LeGranda, Gracie Hubbard, Floyd Diakiu, John Harvey. Second Grade-Edith OBrien, Viola Doss, Thelma Dinkins, Elizabeth Hancock, Virginia OBrien, Ruby Wooldridge, Walter East, Harold Puckett, Willie Guill, Peyton Seay, Wil son Jamerson, Eddie Gallier First GradeMargaret Huod ley, Araie Layne, Byrou Call, Earl Godsev, Lather Godsey, Ned LeGrande."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> onor, A ppom attox"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> onor, A ppom attox"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1613.01, 740.48, 1784.06, 1375.11], "bbox_id": "1449aa45a7", "file": "AppomattoxNewspapers_1912-1915a_0264.pdf", "page": 1, "text": "R o ll o f H on or. Honor roll for November of the Appomattox Agricnltnral High School . 4ch YearEthel Jennings, Kath- reen Carson, Fonnie Woolfolk. 3rd YearAlfred OBrien, Della Inge, Florence Morgan, Virginia Ferguson. 2nd YearRobert Thornhill, I Clarence Pnrdum, Pearl Caldwell, Annie Oder, Emma Hancock, An nie Hancock, Louise Plunkett, Ha- vilah Babcock. 1st Year-Rnth Allen, John Rec,- j tor, Frances McDearmon, 7th GradeJulian Gills, Thomas Tnrnes, Jean Littell, Kate OBrien, Rath Caldwell. 6th GradeCharles Stevens, Louis Doss, Jessalyn Hancock Mildred McDearmon, Geòrgie Wal ton, Shatter Drinkard. 5th GradeEloise Atwood, Lu cile OBrien, Frances Smith, Elaine McDearmon, Aubrey Dosa. 4h GradeReggie Stanley, Hub-1 bard Plankett, Joel Hubbard, Mar tha Goodman, Nettie Moses, Frances Wagner, Mary Gills, Eva Wool- ndge, Alma Piui.kett, Verta Smith, ee Giles, Callie Babcock. 1 3rd GradeVara Mastio, Clem- mie Gunter, Robert Turnes, John Lepps, Nannie Caldwell, Vara Mor ris, Evelena Caldwell, Ora Gilbert, Maud Dove. 2nd Grade nnie Tnrnes. Char lie Upton, Maud Mayberry, Rnby Walton, Myrtle Smith, William Burke, Jnwood Godsey, Berkley Godsey, Chris Gunter, Ned Han cock, Rylund Mann, Burke Steele. 1st GradeWillie Ann Booth, Bessie V. Hirnood, Lencie Martin, Gracie Morris, Ehzibeth Smith, Vivian Woolridie, Sears Booth, Ed ward Blackwell, Jce Ferguson, Ir vin Farrar, Otho Godsey, Dunklev  Gunter, Dallas Meadows, Ralph Saga, Madelin Childress, Marion Wagner."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> on or. Honor roll"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> on or. Honor roll"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1679.75, 268.8, 1852.06, 1396.16], "bbox_id": "ec72b8e466", "file": "AppomattoxNewspapers_1912-1915a_0451.pdf", "page": 1, "text": "R o ll o f H o n o r . The following ie a liât of thorn who are on the honor roll nt the Appomattox Agricultural School let YearJulian Gills, Jean Lit tell, Ruth Caldwell ribbon, Mar gftret Agee, Kathleen Rucker . rib bon, Kate OBrien, Ellen Rodger. 2nd YearBussell Abbitt  rib- ion, Lilt Robertson, Rath Alien, Annie Carson, Clara MoDearmon, Francos MoDearmon, Adam Cle ment ribbon, Rebecca Baboook ribbon, Mary Bjugham ribbon. 3rd Year  Annie Hancock, Emise Plankett, Annie Oder rib- lion, Susie Caldwell ribbon, Em ma Walton ribbon, Joe Leps rib- ion, Robert Wingfield ribbon, Valter Rinq ribbon. 4th YearB ie Stratton rib- 1 ion, Lacie Jameraon ribbon, fiorance E. Caldwell ribbon, Vir- i inia  Ferguson ribbon, Mande Drinkard ribbon, Bessie Thorn ton ribbon, Alfred OBrien rib- ion, Alice Cheatham ribbon, Dry Moaes ribbon, Mildred OBrien ribbon, Havilah Baboook ribbon, Hannah Littell Odelle 1 Foolridge. 5th GradeNettie Mooes, Oallie tabcock, Eva Woolridge, Otway JBrien, Margaret Lepa, Joel Hub ard, John Curtis Caldwell, Julian Morris, Lewis Ferguson, Erie Gal- liher, Reggie Stanley. 6tb GradePrank Inge, Frances Smith, Gladys Agee, Bennie Fer guson, Cornelia Gills, Bheda Drink ard, Eloise Atwood, Betty Morris,. lUcile OBrien, Edward Bates, Fannie Morris, Mattie Shepherd, jizzie Shepherd, Clara Blackwell George Austin, Annie Purdum, 7th GradeEmma Littell, Vir- gie Inge, Gladys Patterson. Mar- aret Corbett, Jessolyn Hancock, faorgie Walton, Suaie Purdum,, ary D. Ferguson, Odelle Morria, Slizabeth Wagner, Mildred Trent, ildred MoDearmon,. Gracie Cold- well, Nellie Pnrdnm, Virginia Han cock, Nellie Robertson. 3rd GradeCrystal Tamer, Myr- tie Smith, Nannie Carter, Baxter Karlin, Both Geissen, Hollie Mit chell, Nannie Caldwell, Loniae Ran some, Ada Patterson. 4th GradeVera Morris, Mattie Gontor, Ruby Walton, Jerry Black well, Olenny Gunter, Evie Lena Caldwell, Ruth Clement, Linwooc Godsey, Verna Harris, Elizabeth Trent, Nannie E. Caldwell, Lanra Mann, Elizabeth Abbitt, Lncy Fore, Elmer Smith, Cbas. Geissen, Ro bert Turner, William Burke, By land Mann, Annie Tomer, David Caldwell, Burke Steele and Ned flanoook. 2nd GradeJohn Carroll Stanley,, Bessie V. Harwood, Virginia Leps, Dnnkley Ganter, Mattie Lena Mitchell, Rachel Sheppard, Vir ginia Smitn, Wellington Conner, Marion Wagner, Sears Booth, Flood Drinkwd, Jimmie Wooldridge, Otho Godaey, Arthur Robertson, Lewie McDearmon, Lyle McDear- mon, Joe Ferguson, Mamie Layne, Vivian Wooldridge, Willie Hester Dafidaon, Ollie Baber, Frances Up ton, Rnby Turner. First Grade Pauline Rucker, Louise Maya, Carrie Giles, Alice Patterson, Margaret Farbnsh, Baby Caldwell, Lee Martin, Marshall Galliher, Walker Btepp, Bebekah Martin, Harry Godaey, Biobard Plankett."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> o n o r"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "o ll o f <mark>H</mark> o n o r"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [2005.45, 1197.49, 2343.58, 1306.19], "bbox_id": "f5f06e77a7", "file": "AppomattoxNewspapers_1939-1943a_0285.pdf", "page": 1, "text": "r H F v M l  M  f All of Mr. GUIs livbg children Bassett Hungry M o r. near Wsr  present Mr. and Mre. Henry ion Seashore, near Cape oe  Pitzer Gills, of Marion, Va., Mr. Staunton R  Montross ,and Mrs. Luther B. Pitman, of Rich- and Westmoreland, near Montross. I , Va Mr and Mrg Alen GUlg Increased patronage is expected I of Chatham, Mr. and Mrs. Shelby particularly at four parks, Douthat, I Kennard Gills, and Mr. and Mrs. Hungry Mother, Fairy Stone and I Banks Frazier, of Richmond, Mrs. Seashore, where new defense in-1 Mary Taylor Gills Copenhaver, of dustries, defense camph, or othr i Marion, wife of the late William new industrial operations have giv-1 Haller Copenhaver, and Miss Cor- en employment to added thousands J nelia Gills, of Appomattox,"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "r <mark>H</mark> F v M l"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "r <mark>H</mark> F v M l"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [976.57, 691.88, 1137.74, 1395.98], "bbox_id": "b1016ecf3e", "file": "AppomattoxNewspapers_1926-1933a_0212.pdf", "page": 1, "text": "Plans for holiday festivitit began last week-end with-th return of young people fror school and college for Christ mas and New Years Day. A week of dances an bridge parties is being plan ned. Invitations to the Dane Club New Years Eve celebri. tion to be held at the Dane Club will soon be sent out. A bout twenty-five couples fror Appomattox and nearby town are being invited. An orchet ra has not yet been secure for the dance. Several dan ces will be given in privat homes during the week. Those who have returnee for the Holidays are Eugen Carlson, A. R. Harwood, Jr. William Ford, Henry Pack and Charles James, who are a tending Virginia Polytechm nstitute a t Blacksburg Mis jucy LeGrand, of Westhamp ton College Charles Crawley Washington and Lee Univers. ty Miss Bessie V. Harwood, o Richmond, Miss Alice Har wood, who has been teachin t Riner Miss Elizabeth Me Jearmon, of the University o iouth Carolina, Columbia,   Eleanor Harwood, Atlantii Jniversity, Virginia Beach diss Annie Hancock, of Cro, et Miss Corrine Hancock Wi iam and Mary College Geo nd Watkins Abbitt, T. C. Wi iiams Law School Holcomb Caldwell, Ferrum Traininj School, Clyde OBrien, Rich mond Medical College Jo Brien, Virginia Military In 3 titute Miss Lucille OBriei who h a s, been teaching at Farmville Miss Florence Gregory, Miss Bessie Gunter Farmville State Teachers Col lege Richard McDearmon University of Richmond, Burke Steele, of Ricmond Miss Vir ginia Reynolds, who has been teaching at Amherst Miss Is abelle OBrien, who has beer, teaching at Stafford and Miss Virginia Lee Thompson, Ran dolph Macon College for Worn en Miss Frances Gordon, Blackstone Miss Mary Tay lor Gills, who has been teach ing at Bedford Miss Marion Wagner, of Harrisonburg. Miss Anna Wilkins, of Texas, will visit at the A. R. Harwood home"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "A. R. Harwood, Jr. <mark>William</mark> Ford, Henry Pack and"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "A. R. Harwood, Jr. <mark>William</mark> Ford, Henry Pack and"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1550.13, 352.51, 1725.68, 896.54], "bbox_id": "a12816820d", "file": "AppomattoxNewspapers_1926-1933a_0230.pdf", "page": 1, "text": "Oct. 26. Mrs. Inez Inge is on a visit fio her daughter, Mrg. Ellis Woolridge, after being con fined to the house for five months with a broken lower limb- Carrier Gills reports the death of two rattlers in the county recently at the hands of two young sons of Mr- W. J- Almond, aged 9 and 11 years. The snakes w e r e about four feet long and each had five rattles and a button- Mrs. W. C. McGill and little daughter, Alice, of Colorado, are visiting at the h o m e of Mrs. McGills father, Mr- F. F. Burke- C. S- McDearmon, the Ever green hustler, unloaded a fif ty-ton car of coal and hauled the same half a m i l e in the same day. H o 11 ywoodMr. Dillard Morris visited his sister, Mrs. Shelton Ferguson, on Sunday last. , . . . HixburgOn Tuesday night ibout nine oclock, the ware house of William Daniel Hix and Company was burned with all of its contents. His two sons were in the store and hap pened to see the light and lab ored hard to extinguish the flames without avail. By hard work the other buildings were 3 aved- No insurance was car ried upon the property. PamplinCards are out for he marriage of Miss Lona El am to Mr- Ernest B. Hunt, at 1 oclock, Nov. 1, at Buffalo Church. The remains of James Dan iel Wilkerson were laid to rest in the family cemetery at the home of Mr. Robert N. Wil- kerson about three miles north of Prospect-"}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "broken lower limb- Carrier <mark>Gills</mark> reports the death of"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "broken lower limb- Carrier <mark>Gills</mark> reports the death of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [150.52, 468.17, 473.43, 1029.75], "bbox_id": "360678ee46", "file": "AppomattoxNewspapers_1908-1909a_0514.pdf", "page": 1, "text": "Mrs. W V. Gills is back from Mr. and Mrs. J. R. Thomas, a recent visit in Lynchburg. of Lynchburg, were the week- Mr. Woodrow Woolridge has. end guests of Miss Bertha Tor- ben sick but is improving now. rence. Alfred OBrien is home from I Jones Caldwell is spending a visit in Roanoke. his vacation here at the Home A. W. Almond is very sick of his parents, Mr. and Mrs. M. with flu at his home here. 1C. Caldwell. - - Miss Florence Gregory Bpent Mr. and Mrs. W. T. Wright Sunday at home. of Lynchburg, were the guests Mrs. William Marshall, of in the home of Mr. and Mrs. W. j Roanoke, has been visiting Mr. H. Wright recently and Mrs. R. E. Caldwell, Sr. I Mrs. Paul Ferguson, of Sta- Miss Mamie Inge, of Red pleton, is visiting her mother, House, visited at home this Mrs. A. H. Gregory, afld ceje- week-end. brating her first wedding an- Ground is broken for the new niversary.  home of Mr. and Mrs. T. W. Jesse Tumee home burned Ferguson, on Lee-Grant Ave. Friday while he was in Lynch- Miss Gracie Hubbard, w ho burg with his wife, who is in has been cik with flu is out again. .  Miss Margaret Pittman, of Richmond, visited friends at Evergreen last week-end. Dick Smith, of Lynchburg, paid a brief visit to relatives here Wednesday. Jack Scott is up again, after being in bed several days with a severalcase of flu. Mr. and Mrs. T. A. Walton left Monday to visit their daugh ter in Disputanta. Mrs. W. M. Thompson spent several days last week with her sister, Mrs. L. L Gayle., Thomas Marks,!, of Lynch burg, has been visiting James Langran. Mr. and Mrs. S. A. Ferguson returned Tuesday from a trip to West Virginia. Mrs. W. R. Reynolds and daughter, Hazel, drove to Rich- , mond Tuesday.  Mrs. Mattie Rudd Harwood visited Mrs. N. R. Featherston a while Monday. Miss Mabel Dulta, of Pamp- lin, visited in the home of Miss Mary Trent last week-end. Senator S. L. Ferguson and Col, Joel W. Flood motored to"}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "Mrs. W V. <mark>Gills</mark> is back from Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "Mrs. W V. <mark>Gills</mark> is back from Mr."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [151.45, 307.66, 468.3, 1097.47], "bbox_id": "c165702e26", "file": "AppomattoxNewspapers_1926-1933a_0536.pdf", "page": 1, "text": "Mrs. IS. E. Torrence recently. Miss Eula Howerton is visit ing her sister, Mrs. H. H. Cald well. Hubert Caldwell is getting on nicely at Virginia Baptist hospital. H. C. Pulliam spent last week-end with friends at Rap- pahanock. Agricultural boys are spon soring a square dance at the hall Friday night. Miss Ocie Hutton, of Lynch- E. A. Cole spent Friday and burg, sent the week-end with Sa-nrday in Roar.vAe. Mrs. W. P. Gills is back from a recent visit in Lynchburg. Mr. Woodrow Wooiridge has been sick but is improving now. Alfred OBrien is home from I a visit in Roanoke. j A. W. Almond is very sick with flu at his home here. Miss Florence Gregory spent Sunday at home. Mrs. William Marshall, of Roanoke, has been visiting Mr. and Mrs. R. E. Caldwell, Sr.  Miss Mamie Inge, of Red House, visited at home this week-end. Ground is broken for the new home of Mr. and Mrs. T. W. Ferguson, on Lee-Grant Ave. Miss Graqie Hubbard, w ho has been cik with flu is out again. Miss Margaret Pittman, of Richmond, visited friends at Evergreen last week-end. Dick Smith, of Lynchburg, paid a brief visit to relatives here Wednesday. Jack Scott is up again, after being in bed several days with a severalcase of flu. Mr. and Mrs. T. A. Walton left Monday to visit their daugh ter in Disputanta. Mrs. W. M. Thompson spent several days last week with her sister, Mrs. L. L. Gayle. Thomas Marks, of Lynch burg, has been visiting James Langran. Mr. and Mrs. S. A. Ferguson returned Tuesday from a trip to West Virginia. Mrs. W. R. Reynolds and daughter, Hazel, drove to Rich mond Tuesday. Mrs. Mattie Rudd Harwood visited Mrs. N. R. Featherston a while Monday. Miss Mabel Duliil, of Pamp- lin, visited in the home of Miss Mary Trent last week-end. Senator S. L. Ferguson and Col, Joel W. Flood motored to Richmond Tuesday. Adfleld McCain, of Lynch burg, was a visitor here Tues day.Miss Phoebe OBrien spent last week-end with her sister,"}, "highlight": {"text": {"matched_tokens": ["H", "H"], "snippet": "ing her sister, Mrs. <mark>H</mark>. <mark>H</mark>. Cald well. Hubert"}}, "highlights": [{"field": "text", "matched_tokens": ["H", "H"], "snippet": "ing her sister, Mrs. <mark>H</mark>. <mark>H</mark>. Cald well. Hubert"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [199.9, 345.35, 370.46, 1404.65], "bbox_id": "25fa6c2666", "file": "AppomattoxNewspapers_1926-1933a_0498.pdf", "page": 1, "text": "Mrs. H. C. Aimond is sick. Misses Phoebe and Isabelh OBrien entertained the Pamp lin faculty and friends at a din ner-bridge party Friday. Miss Bernice Leuhr has beer visiting here as a guest of Pro fessor W. T. Smith. Llittle Murriell Ferguson cel ebrated his sixth birthday Sun day.Mrs. W. E. Smith continue very sick, but can have visitors Miss Virginia Reynolds it home for the summer. J. L. Cates had an automo bile accident while in North Carolina last week. The car was completely wrecked, bul Mr. Cates escaped serious in jury. Mr. and Mrs. Dottridge Mar tin have moved into Mr. Har woods cottage on Richmond highway. Mr. and Mrs. T. W Ferguson are moving into their new home tl !s week. Mrs. Flippo of Leesburg, is visiting her parents, Mr. and Mrs. E. L. Upton. Mr. and Mrs. Jim Stanley and family, of Richmond, spent Sunday with Mrs. J. H. Stan ley. K Mrs. Allen Carter, of Tower Hill, returned with her sister, Mrs. G. L. Furr to Bluefield, on a visit. Mr. and Mrs. Ernest Smith, of Charlottesville, spent the week-end with Mr. and Mrs. M. C. Smith. i Miss Virginia Smith, of Rich mond, spent a week of her va cation fwith home people here. Mrs. L. B. Plittman, of Rich mond, spent several days with her parents, Mr. and Mrs. W. Pitzer Gills, recently. Mr. Pitzer Gills is visiting his son, Henry P. Gills, of Marion for ten days.  Mrs. !E. LeiRoy Smith, who has been visiting her mother Mrs. Pace, o f Halifax, who is critically ill has returned home Miss Gladys Inge, of Phila delphia is home for her sum mer vacation. Miss Alice Harwood and A R. Harwood ,Jr., are home for the summer. Miss Annie Hancock, Ned and Miss Lillian Caldwell go to FYanklin Wednesday to bring Miss Corinne Hancock home for the summer. Adiield McCain spent Sunday with his sister, Mrs. Dotteridge Martin. Mrs. E. T. Price spent sever al days last week in the home of Mrs. Walter Scott. T. A. Walton received news today that Billy Walton, Jr, has broken his arm. Mrs. Ida Morris, of Vera is visiting Mrs. H. M. Welch. Mrs. Shipman, of Williams burg, is visiting her sisters Mrs. D. N. Twyman and Mrs M. Lawson. Mr. and Mrs. J. A. Burke Miss Eula Mae Burke, Mrs. J B. Abbitt and Miss Venue Odor of Norfolk, attended the grad uation exercises of Miss Vay Abbitt, at Farmville Tuesday Mr. and Mrs. Joe LeGrand attended the graduation exer cises at West Hampton, .Tues day, where their daughter, Lu cy, received her degree. Mr. and Mrs. R. L. Burke will go to Charlottesville this week to see their son, William, finish his law course at U. of Va. J. S. McKenzie, of Doleware, Ohio, is visiting hiis daughter, Mrs. Wiley Morris."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Mrs. <mark>H</mark>. C. Aimond is sick."}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Mrs. <mark>H</mark>. C. Aimond is sick."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1717.91, 291.68, 1891.69, 1151.76], "bbox_id": "c23e28625b", "file": "AppomattoxNewspapers_1955-1957a_0300.pdf", "page": 1, "text": "Mrs D. G. Trent is spending some time in Williamsburg, with her son-in-law and daughter, Mr, and Mrs. John Tabb. John D. Littell returned to his home in Pittsburgh, Penna., Tues day after spending the summer with his brother-in-law and sister, Mr. and Mrs. J. Berkley Drinkard. Mr. and Mrs. Robert D. Almond, John T. Hall, Mrs. Eppes Johnson and daughter, Sarah Jane, and Mrs. B. S. Stewart were week-end guests of Mr. and Mrs. Charles Compton, in Ohley, West Virginia. Miss Mary Louise Gills, who re cently underwent an operation at Johnston-Willis Hospital, has re covered sufficiently to return to her home at 218 South Blvd., Rich mond. Mrs. Joel W. Flood, president of the Alice Kyle District, Virginia Federation of Womens Clubs, at tended a meeting of the board of directors of the Virginia Federation at the Cavalier Hotel in Virginia Beach last week. Miss Edna Gregory, a student at the College of William and Mary, Was home for the week-end to at tend the George - Stanley wedding. Miss Gregory had as her house guest, Miss Elizabeth Hix, a senior at Westhmpton College. Mrs. Irvin C. Moses visited her son-in-law and daughter, Mr. and Mrs. Spencer Garrett Jr. in Balti more for the week-end. Also Mrs. C. B. Page, son and daughter-in- law visited her son-in-law and daughter, Mr. and Mrs. Kent Guth rie in Baltimore over the week-end. Mary Alice and Peggy Henry, daughters of Mr, and Mrs. Walter Henry have entered Longwood Col lege. Mary Alice, a junior, is study ing to be an elementary teacher, while Peggy is majoring in journal ism. Mrs. Alpha Higginbotham return ed home .Saturday, after spending several weeks in Norfolk with her daughter, Mrs. Robert A. Elliott. Mr. and Mrs. Elliott and daughter, Susann accompanied her home and spent the week-end. Mr. and Mrs. J. D. Childress, of Lynchburg, are announcing the birth of a son, J. D. Jr., born at the Virginia Baptist Hospital Oct. 6. Mrs. Childress will be remembered here as Miss Shirley Mitchell, the daughter of Mr. and Mrs. Curtis Mitchell. William Childs Martin, son of Mr. and Mrs. Howlette Burge Martin, of Spout Spring, has returned to Hampton-Sydney College, where he is a member of the junior class Hampden-Sydney is now in its 180th session. Mrs. M. T. Shipman and daugh ter, Mrs. Gardner Tyler Brooks, of Williamsburg spent the week-end with Mrs. Shipmans niece, Mrs. Watt H. Stanley. They were here for the George - Stanley wedding on Saturday evening. Miss Rosa Mae Wooldridge, Mists Laura McFadden and Mrs. Stanley C. Boyce, as members of the board of directors of the new Lynchburg General Hospital, motored to Lynch burg Monday afternoon, where they joined other directors in making a"}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "Virginia. Miss Mary Louise <mark>Gills</mark>, who re cently underwent"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "Virginia. Miss Mary Louise <mark>Gills</mark>, who re cently underwent"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.03, 348.17, 1571.34, 1768.65], "bbox_id": "9df558f790", "file": "AppomattoxNewspapers_1926-1933a_0240.pdf", "page": 1, "text": "Mr. Edward Coffman is visit ing his parents here. Mr. and Mrs. C. W. Potts, of Lynchburg, spent the week-end at the home of A. H. Clement. Mr. A. B. Torrence of Prince ton, W. Va., is spending a few days with home folk here. Miss Eula Mae Burke has returned from a visit to Nor folk. I Miss Alice Harwood has ac cepted a position as teacher in a school rear ChrisLansburg. Misses Sadie Re  toldb and Frankie McKinney were visi tors in Farmville last week. Appomattox lost in a game of golf with Crewe, played at the last named place. Mrs. Charles Weaver, of Ok lahoma City, is visiting her sis ter, Mrs. Edward OBrien. Dr. D. N. Twyman visited his brother, Mr. Fred Twyman in Charlottesville this week. Sow rye and turnips now and get the land ready for oats and wheat. Mr. and Mrs. Walter Bryant, of Charlotte, were visitors here yesterday.  Messrs. Crews and Goodman of Hot Springs were business visitors here yesterday. Rube Hudgins and Senator Ferguson are disbursing 2,000 to those who need it for seed. Mr. Harry Hancock, of Lynchburg, was in town Mon day. Mrs. Louella Morris has re turned from a trip to Coving ton. Mrs. C. A. Anderson re turned yesterday from an ex tended visit to her daughter, Mrs. Crabtree, at Tazewell, Va. Appomattox will be able to feed herself and poor old Unc le Sam cant do a thing before Congress meets if then. Dont forget the sale of Le- lia B. Inge property, Saturday, Sept. 27, at 3 P. M. C. W. Smith, Executor. 2t Mr. Harvey Morris, of Rich mond, was a guest this week of his mother, Mrs. Louella Morris. Mr. William Burke, who is studying law at the University of Virginia, left Thursday to take up his work for the year. Mr. Lee Agee and daughter, Miss Marion, have been on a visit to Mr. and Mrs. Whit Agee.. Mrs. Raymond Lawson, Mis- les Hazel and Marion Elliot vere recent guests in the home f Seitator S. L. Ferguson. Mrs. Anna Flood and child ren, Bolling and Eleanor, of Washington, D. C., spent the week-end in Appomattox. Mrs. L. W Bryant and child ren have returned home after ivisiting friends and relatives in fRoanoke, Dublin. and Pulaski. 1 Mr. Allen Gills, of Cleve- larid, Ohio, is spending his vta- ctionwith his parents, Mr nd Mrs. W. P. Gills. Miss Gladys Inge leaves this week for Philadelphia, where ffcrill study to fit herself for Service work. Mrs. Sally Genheimer, of Roanoke, was a recent guest jjn the home of Dr. D. N. Twy- fuan. Miss Mary Grey Sears leic Tuesday for Lynchburg, where ne has enrolled as a freshman it RandolphMacon. Miss Lucy LeGrand left this week for Richmond, where she Iwill resume her studies at IWesthampton college.,- M i s s Eleanor - Harwood leaves this week to enroll as a student in the Atlantic Univer sity at Virginia Bepch. Mr. and Mrs. T. A. Walton have returned home after visit- ing their daughter, Mrs. W. S. Green, at Burkeville. . Mr. and Mrs. W. A. Trent, Mr. and Mrs. Justin Burkey and Mrs. Alma Beatty visited relatives in Buckingham Sun day. Miss Elizabeth McDearmon left Sunday for Columbia, S C., where she will enroll as ta student at the University of South Carolina."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "the home of A. <mark>H</mark>. Clement. Mr. A. B."}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "the home of A. <mark>H</mark>. Clement. Mr. A. B."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1397.03, 329.5, 1566.28, 1456.94], "bbox_id": "435ad4304d", "file": "AppomattoxNewspapers_1908-1909a_0240.pdf", "page": 1, "text": "Mr. Edward Coffman is visit ing his parents here. Mr. and Mrs. C. W. Potts, of Lynchburg, spent the week-end at the home of A. H. Clement. Mr. A. B. Torrence of Prince ton, W. Va., is spending a few days with home folk here. Miss Eula Mae Burke has returned from a visit to Noif- olk. I Miss Alice Harwood has ac cepted a position as teacher in a school rear Christiansburg. Misses Sadie Reiolds and Frankie McKinney were visi tors in Farmville last week. Appomattox lost in a game of golf with Crewe, played at the last named place. Mrs. Charles Weaver, of Ok lahoma City, is visiting her sis ter, Mrs. Edward OBrien. Dr. D. N. Twyman visited his brother, Mr. Fred Twyman in Charlottesville this week. Sow rye and turnips now and get the land ready for data hnd wheat. - j  Mr. and Mrs. Walter Bryant, of Charlotte, were visitors here y e s t e r d a y .  i it  Messrs. Crews and Goodman of Hot Springs were, business visitors here yesterday. Rube Hudgins and Senator Ferguson are disbursing 2,000 to those who need it for seed. Mr. Harry Hancock, of Lynchburg, was in town Mon day.  Mrs. Louella Morris has r- turnedC from a trip to Coving ton. Mrs. C. A. Anderson re turned yesterday from an ex tended visit to her daughter, Mrs. Crabtree, at Tazewell, Va. Appomattox will be able to feed herself and poor old Unc le Sam cant do a thing before Congress meets if then. . of Le- lia B. Inge property, Saturday, Sept. 27, at 3 P, M. C. W. Smith, Executor. 2t Mr. Harvey Morris, of Rich mond, was a guest this week of his mother, Mrs. Louella Morris. Mr. William Burke, who is studying law at the University of Virginia, left Thursday to take up his work for the year. Mr. Lee Agee and daughter, Miss Marion have been on a visit to Mr. apd Mrs. Whit Agee.. Mrs. Raymond Lawson, Mis ses Hazel and Marion Elliot pere recent guests in the home of Senator S. L. Ferguson , Mrs. Xnna Flood and child ren, Bolling and Eleanor, of ashington, D. C., spent the eek-end m Appomattox. Mrs. L. W. Bryant and child en have returned home after siting friends and relatives in Jtoanohe, Dublin, and .Pulaski. Mr. Allen Gills, of Cleve- njpfet, Ohio is spending his vta- rtitiorTVith his parents, Mr md Mrs. W. P Gills. Miss Gladys Inge leaves this iweek for Philadelphia, where hSitFiH study to fit herself for Service work Mrs.Sally Genheimer, of m oke, waa ft recent guest .the home of Dr. P. N. Twy- an. Miss Mary Grey Sears left"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "the home of A. <mark>H</mark>. Clement. Mr. A. B."}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "the home of A. <mark>H</mark>. Clement. Mr. A. B."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1837.18, 312.84, 2009.53, 1197.38], "bbox_id": "7669b7fe16", "file": "AppomattoxNewspapers_1939-1943a_0478.pdf", "page": 1, "text": "Mr. and Mrs. J. C. Caldwell spent Friday night in Roanoke, where they attended a district Lions Club con vention and dance. They motored to Radford Saturday. Mrs. Frances Cheatham, who is attending summer school at S- T. C., Farmville, spent the week-end with her parents, Mayor and Mrs. C. S. McDearmon. Neta Thomas, of Lynchburg spent last week with her grandmother, Mrs. Jennie Johnson. Mr. and Mrs. H. G. Johnson and family, of Lynch burg were dinner guests Sunday in the same home. Mr. and Mrs. G. F. Abbitt, Jr., and daughter, Penny, Mrs. Evrod Conner and daughter, Otway, and Mr. and Mrs. Watt Abbitt and daugh ter, Ann, spent Sunday at Vera, with Mr. and Mrs. G. F. Abbitt Sr, Rev.- B. F. Robinson, of Syringa, spent Monday and Tuesday with Mr, anti Mrs. C. H. Robinson. Mrs. B. F. Robinson accompanied him home after spending several days here. Mr. and Mrs. J. P. Bell and child ren, of Roanoke spent the week-end with Mrs. W. P. FerrelL Joe Ferrell, who is attending summer school at V. P. I., Blacksburg, was home for the week-end. Mrs. W. H. Copenhaver, of Mar ion is visiting her mother, Mrs. W. P. Gills. Mrs. L. B. Pittman, of Richmond has arrived to spend three weeks in the same home. Misses Helen West and Winifred Bailey, of Richmond, and Miss Doro thy West, of Blackstone were week- end guests of Mrs. H. B. West. They motored to Charlotte Court House Saturday and attended the wed ding of Miss Catherine Williams and Charles West. Mr. and Mrs. Watson Major, of Buena Vista, Miss Naomi Major, of Clifton Forge and Pvt. R. L. Burke, Jr., of Camp Lee, spent llie week end with Mr. and Mrs. R. L. Burke. Mrs Arthur Irby and daughter, Miss Virginia Epps Irby, of Farm- vitte spent Tuesday with Mrs. W. T. Steele and Mrs. J. A. Burke. Mrs. Lee Covington and daughter, Jetty Burke, of Winston-Salem, N. C., Mr. and Mrs. C. D. Staples and daughter, Priscilla Ann, of Rich mond Kirill arrive Saturday to spend some time with Mrs. James B. Ab bitt. 1 Mrs. Lewis Dahl and son, Farmville, are spending this week with her mother,1 Mrs. F. A. OBrien. Mr. Dahl spent the week-end in the same home.  Edd Schauback, of Blackstone and Mrs. Lewis Winters spent Sunday in Roanoke with Mrs. Schauback, who is recovering from a recent op eration. Mrs. Ben F. Saunders, who has been in Portsmouth, New Hamp shire is visiting her parents, Mr. and Mni. C. C. Cralle. Dr. C. F. James left Monday for Livingston, Alabama. Jessie Morton Rosser is recover ing nicely from a tonsil operation. Mrs. Robert Sancton, of Montreal Canada is visiting M. and Mrs F. C. Dresser. Mrs. Susie B. Christian is attend ing summer school at William and Mary Cbllege."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "Johnson. Mr. and Mrs. <mark>H</mark>. G. Johnson and family,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "Johnson. Mr. and Mrs. <mark>H</mark>. G. Johnson and family,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [253.43, 327.34, 416.06, 1224.9], "bbox_id": "ee8a14a089", "file": "AppomattoxNewspapers_1908-1909a_0492.pdf", "page": 1, "text": "Mr. and Mrs. Duval Caw- thorne, of Princeton, W. Va., visited this week in the home of C- S. McDearmon. Mrs. R. A. Steffans and three children, of Meanie, Florida, are visiting Mr. and Mrs. J. S. Kenney. . BL W. E. Abbitt, of Roanoke, and J. R. Abbitt, of Sweet Briar, spent Wednesday .in the home of A. R. Harwood. Mr. and Mrs. J. W. Scott, of New York have returned home after visiting Mr. and Mrs. W. W. Scott and Mrs. Tad Sears. Eddie, Betty and Jim Stan- of Virginia Beach are visiting their grandmother, Mrs. J. H. Stanley. Mrs. Helen Hicks, of Lynch burg, spent the week-end with her mother, Mrs. Cora John son.Thomas N. and H. J. Cam- efix and children, of Richmond Client the Fourth of July holi days with relatives near Vera. Little Miss Pauline Jamer- son has beensp ending some time visiting her grandparents Mr. and Mrs. R. L. Godsey. Mr. and Mrs. D. J. Frank lin visited his sister, Mrs. W. P. Gunter, in Petersburg, Sun day. Mr. and Mrs. Finley Doss and son, - Junior,spent the week-end with his parents Mr. and Mrs. Samuel H. Doss. Mr and Mrs. C. A. Hancock and grand-daughter, Jeanette, have returned to Huntington, W. Va., after visiting here. Mr. and Mrs. W. A. Walton have returned to Disputania after visiting Mr. and Mrs. T A. Walton here. Prof. Fitzgerald Flournoy and Mrs William Cabell Flour noy, Of Lexingtoh, were guests last week of Mrs. E. E. Gills. A party of local boys and girls spent Monday, July 4, at Lake Tonawanda, ending With a picnic supper at 6 oclock. The Rev. W. M. Thompson, Miss Virginia Lee Thompson and Jack Scott left this week to attend the Baptist encamp ment at Virginia Beach. Mr. and Mrs. Jay Packard, of Antigo, Wis., leftIor Rich mond and Washington after visiting Mr. ahd Mrs. H. C. Babcock here. . Mrs. Bezryl Burgardner, of Stoney Bottom, W. Va., and children, have returned home after visiting her aunt, Mrs. H. C. Babcock and others here. Miss Frankie Godsey, Of Lynchburg, .returned .home after a pleasant visit in the home of Mr. ahd Mrs. R. L. Godsey. i  Jones Caldwell, Of Lynch burg, Mr. and Mrs. C. D. Lew- jis and sons, Clark and Dan, visited their parents, Mr. and i Mrs. M. C. Caldwell, during the week-end."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "their grandmother, Mrs. J. <mark>H</mark>. Stanley. Mrs. Helen Hicks,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "their grandmother, Mrs. J. <mark>H</mark>. Stanley. Mrs. Helen Hicks,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [458.92, 716.74, 605.12, 1197.87], "bbox_id": "4efb4d0cf2", "file": "AppomattoxNewspapers_1974-1975a_0027.pdf", "page": 1, "text": "Mr. and Mrs. Bill Senger were Sunday visitors of Mr. and Mrs. Paul Lunford in Crewe Friday visitors of Mr. and Mrs. R. L. Harris were John H. Chernault of Rich mond, and Mrs. Neal Chernault and Brandon of Prospect. Sunday visitors of Mr. and Mrs. C. H. Morris were Walker Webb of Appomattox, Mr. and Mrs. Carl Glover of Hixburg. Mr. and Mrs. Don Morris and boys, Mr. and Mrs. Roger Morris and girls attended the Agee-Cook Reunion Sunday at the home of Mr. and Mrs. William Agee of Dillwyn. Mr. and Mrs. Clyde Dowdy of Powhatan, Mrs. Jackie OBrien and Patsy OBrien both of Richmond, visited Mr. and Mrs. .Berkley OBrien Sunday.    Mrs. Ruth Beasley was Sunday dinner guest of Mr. and Mrs. Odell Kirby of Farmville. The Rev. and Mrs.DottBryan visited in Gloucester Thursday. Wayne Cook of Richmond spent Sunday with Mr. and Mrs. W. T. Cook. Mrs. Joe L. Harris and Bonita visited Mr. D. A. Manis at Liberty House  Nursing. Home in Lynchburg Friday. Mr. and Mrs. K. M. Beasley, Jr. and Kathy visited Mrs. Katherine Carson at Spout Spring Sunday. Sympathy is extended to the family of Mr. Henry Gills who passed away Saturday. Mr. and Mrs. Arils Maxwell and girls of Hixburg visited Sunday with Mr. and Mrs. C. W. Morris. j"}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "L. Harris were John <mark>H</mark>. Chernault of Rich mond,"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "L. Harris were John <mark>H</mark>. Chernault of Rich mond,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1730.11, 758.53, 1902.89, 926.23], "bbox_id": "b92314af6c", "file": "AppomattoxNewspapers_1943-1947a_0574.pdf", "page": 1, "text": "Miss Virginia Bingham, of Roan oke was home last week-end. i R. B. Hudgins and N. R. Feaith- erston spent Thursday in Rich- mond.They were accompanied home by R. B. Hudgins, Jr., wiho spent the week-end at his home here. Mr. and Mrs. Banks Frazier, of Lawrenceville and Mrs. William Copmhaver, of Richmond spent the week-end with Mrs. W. P. Gills. Miss LaFerne Doss, a student at Mary Washington College, Fred ericksburg, will spend the week-end with h r parents, M  ana Mrs. G. i L. Doss."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "of Lawrenceville and Mrs. <mark>William</mark> Copmhaver, of Richmond spent"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "of Lawrenceville and Mrs. <mark>William</mark> Copmhaver, of Richmond spent"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [433.69, 292.49, 604.83, 910.63], "bbox_id": "0d1838d663", "file": "AppomattoxNewspapers_1939-1943a_0005.pdf", "page": 1, "text": "Miss Mary Louise Gills was re cently awarded a prize for writing the best essay on Charleston, South Carolina. The award was made at the general convention of tho U. D. C. last week in Charleston. W. P Gills is visiting his daugh ter, Mrs. L.B. Pit.nan, in Rich mond. Miss Beulah Ferrell will spend Thursday in Roanoke with friends, and attend the fooshall game there. Lawrence Moore, Gailand Morris and William Moore are attending the football game today in Roanoke. Buck Ferrell and W. P. Ferrell spent Sunday in Bedford. The contract bridgi club will meet Friday evening with Mrs. George F. Abbitt, Jr. Mr. and Mrs. Ben Snead, of Lynchburg spent the week-end with her parents, Mr. and Mrs. George F. Abbitt, Sr., at Vera. Mrs. L. L. Gayle is spending the holidays in Richmond. Charles A. Hilt motored to Rich mond Friday. Miss Ayleen Dresser, of Montreal Canada, is visiting in the horre of Mr. and Mrs. F .C . Dresser. Misses Lucy LeGr.md, Violet Ram sey, Virginia Christian and Kate OBrien are attending the teachers meeting in Richmond. Mr. and Mrs. Calvin H. Robinson, Dr. C .F . James and CoL and Mrs. Joel W. Flood are in Richmond to day. Mr. iwnd Mrs. W.W.Burke mov ed Saturday into their new residence on Wembly Lane. Mr. and Mrs. C. Lewis McDear- mqn will spend Thursday in Roan oke. Mr. and Mrs. J. C. Caldwell were in Richmond last Friday. Mias Viola Paulette spent several days this week at her home near Pamplin. Mr. and Mrs. M. T. Parrish, and daughter, Barbara Eakin, spent the week-end in Richmond. They were accompanii i home by his moth er, who wiU spend some time here. Vincent Collins, of Richmond"}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "Miss Mary Louise <mark>Gills</mark> was re cently awarded"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "Miss Mary Louise <mark>Gills</mark> was re cently awarded"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1616.16, 527.2, 1778.75, 970.69], "bbox_id": "da9e0625a6", "file": "AppomattoxNewspapers_1908-1909a_0262.pdf", "page": 1, "text": "Miss Mary Featherston visi ted her aunt, Mrs. Joel .Wat kins, ,iii Farmville last week and is now spending some time visiting relatives at Hix- burg. Mr. and Mrs. J. P. Gills and son, Julian, of Bluefield, are visiting Mrs, E. E. Grills. Mr. Gills is beginning the study of a Special bourse at Harvard this week.  - The public will have a chance to bid on school trucks bis time. See Supt. Burkes notice in this issue. Great cart Ahold be observed in awarding ipntracts especially with ref- erence to drivers. Mr. and Mrs, W. L. William- iQii kind family. Mr. and Mrs. Claud Jennings and family, Mr. and Mrs. R. A. Wootton and ion, Williamson, father, grand father, and great grand father, W. H. Williamson, motored to Farmville Sunday tb see their sick aunt, Mrs. W. P. Man. Mrs. Schuyler Marshall and sons, Douglas Madison and Benfamih -Hunter of Charles ton, W. Va., are here to spend a while with the former pa rents, Mr. and Mr. M. C. Cald well.  They are accompanied by Mrs. B, H. White and daughter, Ms Evelyn, also of Charleston. Miss Elizabeth Mctearmon"}, "highlight": {"text": {"matched_tokens": ["Gills"], "snippet": "and Mrs. J. P. <mark>Gills</mark> and son, Julian, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Gills"], "snippet": "and Mrs. J. P. <mark>Gills</mark> and son, Julian, of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1605.35, 953.0, 1767.24, 1593.07], "bbox_id": "2b3d6891be", "file": "AppomattoxNewspapers_1926-1933a_0538.pdf", "page": 1, "text": "Miss Madian Lee is staying with Miss Lillie Gilliam while she is convalescing. We a r e glad she is improving. Mr. and Mrs. J. R. Thomas of Lynchburg, were guests of the latters parents, Mr. and Mrs. S. E. Torrence last week, end- June Dillon, Tom Dillon, Darlington Heights, and Phil and JacuilinErute, of.Lynch burg are vjMtibg Joe and Ro berta Dinwuidie- Miss QaroìyruWalker, of So- Boston ahd Mrs. Robert Thomp sòia, of Alexandria, have been visitingr Mr. and Mrs. W. M. Thompson. MrsfoW- H. S. Barlow has re turned from Clifton Forge af ter a weeks stay with her daughter, Mrs. Albert Brock- well. Mrs. William Cabell Flour ney and son, Prof. Fitzgerald Flournoy, of Washington, and L ee University, were guests in the home of Mrs. E. E- Gills this week. Dr. and Mrs- James and their son, Charles, and Mr. and Mrs. Dotridge Martin are back from IJivmgston, Àia-, where they hdjbeen visiting Mrs. James mother, Mrs. McCain. Mr. Doss, formerly of Ken tucky, has become a resident of our town, and is now associat ed with Appomattox Hardware Co. We are glad to add him to the citizenship of our town. - Mrs. C. F. James got up a big picnic at Spout Spring lake -Tuesday night. The rain put a cloud over things for a while, but it didnt hurt the swimming any- Mr. and Mrs. O. R. Turns and daughters, Nellie and Lou ise, Mrs- Ola Patterson, Mrs. L. D. Puckett, Mrs. Lewis Doss and daughter, Mary LaFern, have returned from a stay at Virginia Beach and Ocean View."}, "highlight": {"text": {"matched_tokens": ["H"], "snippet": "W. M. Thompson. MrsfoW- <mark>H</mark>. S. Barlow has re"}}, "highlights": [{"field": "text", "matched_tokens": ["H"], "snippet": "W. M. Thompson. MrsfoW- <mark>H</mark>. S. Barlow has re"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1420.8, 321.79, 1602.82, 1744.04], "bbox_id": "a5c7a553b0", "file": "AppomattoxNewspapers_1908-1909a_0268.pdf", "page": 1, "text": "Miss Edith OBrien, of Rich mond, is visiting relatives here Pr. Sffth left Aesday fer his home in Drewyville. Rev. J. J. Clarke has tareated himself to a new car. Miss. Awis Brown is spend ing a week in Richmond. Mr. Holcomb Caldwell has accepted a position with Mont gomery. Ward at Lynchburg. Miss Jane Burke is visiting Miss. Carolyn Willis, tot her home in Fredericksburg. Mr. .and Mrs Will Jones, Mr and Mrs. Harrison Hancock were Sunday visitor in town. Mrs. Jacquelin Newbitl is on a visit to her sitter, Mrs. L. L. Gayle,. .. . Mr. and Mrs. T.iA. Walton were visitors in Disputanna this toreek. Mr. William Carroll,1 of Campbell County was itt town yesterday on business. Our teachers are leaving fdr their respective homes find we shall miss them.  Mr. JE, T., Pricp ,r o  Brook- neal, hasbeeh on a vittt to Mr. Allred, tifarwood. Mr. and Mrs. Fonrose Wool- fork were s recent visitors 4n Richmond. Mr. Earl Carson has re turned J,o his home in Steelton, Pa., alter a visit here.  Mrs. Neal Poore, of Lynch burg, is spending a week with relatives here. Miss Cornelia Gills is spend ing some time in Richmond and Alexandria.- i f    Mrs. Frank Dresser Vwas operated on at the Baptist hos pital .Tuesday,,, ,a , 2  Miss Florence Caldwell Will attend the summer, school at East Radford. Miss .Frances Caldwell is a patient in the .Shrinflis. hos pital at -Greenvilie, S. C. .,,,j Mrs. JJoe LeGrand, who has -jbeen qtrite- siek--with grippe -ie- improving , L Miss Ella Burke, hf Roan oke, is spending- some time with relatives here. Mrs. Kathleen Williamson, of Huntington, West,Virginia, is on a visit to her sister, Mrs, Erie Glenn.   Mrs. Mollie Collins and Mrs. Paul Harris, of Edst Radford are guests of Mr. Dillard Mor ris and Mrs. Callie Moore. Mr. and Mrs. jB. W. Scott, of New York, are spending some time -at their country home near here. Mrs. H- M. Burge Mr. Reg gie Stanley and Miss Verta Smith weVd recent visitors in Smithfield. Mr, Ervine Watson, who re- sides near Vera is in hospital at Lynchburg suffering with throat, trouble. Mrs. Twyman has returned from Williamsburg, acc.om- paniediby her sister, Mrs. Ship- a man. ,  . T A   f jg ?Prof. B.-L. Hummel  fam ily, efacksburg visited Mr. and Mrs. R. B. Hudgins Sun- -eto------- Attentionis-caBedtoantaTti- in this tpfiup . hy Prai. jHutCheson on -Catch Crons W W i   Mr. Allen Mitchell and Miss k Mays were idhmed here .lägt B week.  They reiide in K Lynchburg.    I  Miss Mary Ann LeGrand is I to spending her vacation with her, f parents here  She I in teaia- ing for a nurse in Roanoke. B  Miss Annie Hancock is on a I., visit to Norton, She received m her diploma from the Unlyer-  iiy of Virginia this week.  Mrs. W. M. Hancock, Mis- to ses Annie and Jessalyn Han- m cock visited Mrs. Douglas Ma- W son in Rice last week.  William Albert Chistinn, iq- gi fant son of Dr. and Mrs. D. A. Christian, who has been quite I ill is much better.  Mrik Lloyd Cates and sons, r- of Burlington, N, C., have re-. turned to their home. after a  visit in the heme of Mrs. H. C.  .BbefliÜ    ,f -"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "Disputanna this toreek. Mr. <mark>William</mark> Carroll,1 of Campbell County"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "Disputanna this toreek. Mr. <mark>William</mark> Carroll,1 of Campbell County"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
