{"document": {"bbox": [769.9, 773.21, 927.31, 1301.33], "bbox_id": "fb98b35034", "file": "AppomattoxNewspapers_1971-1973a_0037.pdf", "page": 1, "text": "j Bloxton, Reedy Spring Charles T . Moses, Nebraska commun-  ity of present day Appomattox . . . . the  Depot. There were nine attorneys within the county at that time T. S. Bocock, Tower Hill J . P. L. Fleshman, Chap W. C. Fra nklin and E . R . Woodson, Pam plin City and in the village of Appomattox Court House H.D. Flood, H. T. Parish, R. B. Poore and C. H. Sackett. An iron mine at Nutall was listed and the Merrill  Ford concern in Pamplin City, as  Pipe Manufacturers - Smok ing. Looking out for the peoples health w ere physicians  A through W Drs. W.H. Abbitt H. C. Babcock, E. H. Grigg, W. N. Horsley, C . S. Morton, R. A. North, J . Randolph, D. Mott Robertson, D. P. Robert son, B. S. Vawter and William Wliite. Three gentlemen were listed as saddle and harness makers Edward Mayberry at S p r in g I Mills Peter Pendleton, Pam plin City and Thomas A. Smith I Appomattox C. H. For supplies of  Sassafras Oil there were R . F . Burke and Co., Nebraska John P. Hughes, Oakville and J . B. Mer- ryman, Appomattox C. H. Miss Bettie Johns, Hixburg, was listed under  Schools, Col leges, Etc. together with the notation that  there are 26 white and 15 colored public -schools in this county with C. H. Childton, Spout Spring, as superintendent. Two tanners plied their trade John W. Harwood, Pamplin City and Henry Layne, Tower Hill. Four undertakers were listed as"}, "highlight": {"text": {"matched_tokens": ["N", "Horsley"], "snippet": "E. H. Grigg, W. <mark>N</mark>. <mark>Horsley</mark>, C . S. Morton, R."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Horsley"], "snippet": "E. H. Grigg, W. <mark>N</mark>. <mark>Horsley</mark>, C . S. Morton, R."}], "text_match": 1733921019837546617, "text_match_info": {"best_field_score": "2216192835584", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019837546617", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [462.74, 418.58, 628.21, 791.03], "bbox_id": "fef78c6998", "file": "AppomattoxNewspapers_1908-1909a_0191.pdf", "page": 1, "text": "Evelyn Dickerson, Myrtle Din kins, Lucille Cralle, Addie Lena Ferguson, Josephine LeGrand, Margaret Caudle, Mary Strat ton, Joe Gallier, Horace Shirey, William Jobe, Horsley Harris, Lawson Lee, Frank Cawthorne, Clyde Thomas, Vernon Ragland. 7th grade  Billy Hubbard, Garland Plunkett, Mandane An Hilda Eloise OBrien, Mary Smith. 6th gradeMarshall Habcock, James Guill, Lawrence Moore, Elliott Torrence, Elizabeth Crai le, Eleanor Carson, Mary Clarke, Ruby Cole, Leilas Davis, Mable Hall, Thelma Morris, Mary Me Nally,  Frances Torrence, Mar garet Carter, Katherine Irby. 5th grade-Havilah Guill, Ola Goin, Evelyn Stewart, Virginia Christian, E r n a Dickerson, Geneva Wingfield, Mamie Smith, Elna Smith, Willie Guthrie An derson. v  v j- 4th grade - Edith Lucado, Katherine Twéedy, Sara Rode, Helen Smith, Nettie Davidson, Anna Carter, Thelma Torrence,"}, "highlight": {"text": {"matched_tokens": ["William", "Horsley"], "snippet": "Joe Gallier, Horace Shirey, <mark>William</mark> Jobe, <mark>Horsley</mark> Harris, Lawson Lee, Frank"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Horsley"], "snippet": "Joe Gallier, Horace Shirey, <mark>William</mark> Jobe, <mark>Horsley</mark> Harris, Lawson Lee, Frank"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [466.11, 267.61, 639.47, 1229.71], "bbox_id": "b86c89d1b9", "file": "AppomattoxNewspapers_1926-1933a_0191.pdf", "page": 1, "text": "2nd year Mary Grey Sears, i Lottie Lucado, Bertha Rogers, Mildred Marshall, Thelma Dink ins, Gertrude Stewart, Virginia Carson, Ethel A1 vis, Gladys Inge, Virginia Bolt, Virginia Chick, Frances Coleman, Fay Babcock, Mary Woodson, John Hesson, Alfred Harwood. Charles James, Billy Dickerson, Charles Crawley, Henry Pack, Samuel Ford, James Morris. 1st year  Ruby Woolridge, Alice Burge, Mamie Cawthorn, Evelyn Dickerson, Myrtle Din kins, Lucille Cralle, Addie Lena erguson, Josephine LeGrand, Margaret Caudle, Mary Strat ton, Joe Gallier, Horace Shirey, William Jobe, Horsley Harris, awson Lee, Frank Cawthorne, Clyde Thomas, Vernon Ragland. 7th grade  Billy Hubbard, Garland Plunkett, Mandane An derson, Carrie Jamerson, Hilda Moore, Claudine OBrien, Eloise OBrien, Mary Smith. 6th gradeMarshall Habcock, James Guill, Lawrence Moore, Elliott Torrence, Elizabeth Cral le, Eleanor Carson, Mary Clarke, Ruby Cole, Leilas Davis, Mable Hall, Thelma Morris, Mary Mc Nally, - Frances Torrence, Mar garet Carter, Katherine Irby. 5th grade-Havilah Guill, Ola Goin, Evelyn Stewart, Virginia Christian, E r n a Dickerson, Geneva Wingfield, Mamie Smith, Elna Smith, Willie Guthrie An derson. 4th grade  Edith Lucado, Katherine Tweedy, Sara Rode, Helen Smith, Nettie Davidson, Anna Carter, Thelma Torrence, Olla Mae Dinkins, Frances Smith, Hattie Guill, Dorothy Sears, Scott Sears. 3rd grade-Bessie Christian, Elizabeth LeGrande, Caroline Moses, Eunice Smith, Marie Stewart, Kathleen Trent, Rachel Trent, Virginia Almond, Alfred Torrence, Calhoun Moore, Dick Dickerson. 2nd grade  Virginia Cralle, Elizabeth Doss, Lucy Crooks, Rachel Moon, Elsie Christian, Doris Lucado, Rachel Mayberry, Ruth Handy, Mildred Carter, Carrie Guill, Marie Mays, Kath erine Woolridge, Gladys Mays, Leslie Gordon, Vernell Mitchell, 1 B gradeKatherine Jones Virginia Smith, Elizabeth Farrar Jessie Mays, Dorothy Godsey, Frances Mays, Eleanor Burge, Virginia Moses, Alpha Higgin botham, Julian Guill, Berkley Guill, Earl Guill, Richard Burke 1 A grade  Lorene Godsey Marjorie Evans, Naomi Reed, Orwilda Carter, Hilda Carter, Virginia Gordon, Pauline May berry, Merdice Dinkins, Gertrude Mitchell, Clorene Doss, Maxine Glenn, Hilda Wagers, Alfred LeGrand, Allan Reed, Raymond Davidson, Robert Burks, Frank Blackwell, John Torrence."}, "highlight": {"text": {"matched_tokens": ["William", "Horsley"], "snippet": "Joe Gallier, Horace Shirey, <mark>William</mark> Jobe, <mark>Horsley</mark> Harris, awson Lee, Frank"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Horsley"], "snippet": "Joe Gallier, Horace Shirey, <mark>William</mark> Jobe, <mark>Horsley</mark> Harris, awson Lee, Frank"}], "text_match": 1733921019703328889, "text_match_info": {"best_field_score": "2216192770048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019703328889", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1690.05, 1099.92, 1833.15, 1328.3], "bbox_id": "a1d01407f7", "file": "AppomattoxNewspapers_1974-1975a_0248.pdf", "page": 1, "text": "Area students named to the Deans List were Hubert W. Carson, Clifton D. Compton and Ronald D. Fauber all of Concord Francis N. Hamilton, Martha A. Harvey, William L. Harvey, and William C. Hubbard, Jr. all of Appomat tox Jacqueline A. Horsley of Gladstone William E. Lewis, Appomattox Karen E, Mar shall, Spout Spring Delores E. Snell, Evergreen Linda K. Sullivan, Appomattox Fay M. Torbert, Concord and Myralyn B. Tutwiler and Susan A. Weatherly of Appomattox. Students named to the Deans List must Require a grade point average of 3.2 or better for thirty quarter hours or more."}, "highlight": {"text": {"matched_tokens": ["Horsley", "William"], "snippet": "Appomat tox Jacqueline A. <mark>Horsley</mark> of Gladstone <mark>William</mark> E. Lewis, Appomattox Karen"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley", "William"], "snippet": "Appomat tox Jacqueline A. <mark>Horsley</mark> of Gladstone <mark>William</mark> E. Lewis, Appomattox Karen"}], "text_match": 1733921019569111161, "text_match_info": {"best_field_score": "2216192704512", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019569111161", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["N", "Horsley"], "snippet": "L. E. Smith, C. <mark>N</mark>. Abbitt, J R <mark>Horsley</mark>, J. E. Chick, W."}}, "highlights": [{"field": "text", "matched_tokens": ["N", "Horsley"], "snippet": "L. E. Smith, C. <mark>N</mark>. Abbitt, J R <mark>Horsley</mark>, J. E. Chick, W."}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1665.59, 267.55, 1830.08, 1488.14], "bbox_id": "e67e15c991", "file": "AppomattoxNewspapers_1926-1933a_0525.pdf", "page": 1, "text": "ARVONIA,Mrs. L. O. Pierce and daughter, accompa nied by Mrs. Margaret Cham berlain, were visitors in Rich mond line day last week. Welford Jeffrey, little son of Mr. and Mrs. Stanley Jeffrey, is quite ill with double pneu monia. t Mrs. Mary Snoddy and Miss Nellie Jeffrey, who were visi tors in Richmond last week, have returned to their hotnes. Miss Mary Bersch, who is a student at V. P. I., will arrive Friday for the Christmas hol idays. Mr. and Mrs. E. E. Roberts were Richmond visitors recent ly. Mr. and Mrs. H. M. Duval and children, accompanied by Mrs. Mary Hughes! motored to Farmville Sunday and were the guests of Mr. and Mrs. R. B Hughes, Jr. Quite a number of the young people from Arvonia attended the dance at Dillwyn Lake Fri day night. Miss Edith Piitts a n d Miss Alice Horsley motored to Rich mond one day last week. Mr. and Mrs. Morgan Jones have moved into their new home. Mrs. Lucy Leedy is nursing Mr. Profit, of Now Canton, who was paralized several days ago. Mrs. Earl Daden a n d son, and Mrs. Willie Johnson and ion were visitors in Richmond recently. Mrs. L. M. Jones, whcTh a s been confined o her home for several weeks due to an opera tion, is able to be out again. Miss Janes Broadus Jeffrey of St. Catherines School, Rich mond, had as her guest Satur day her parents, Mr. and Mrs. Owen Jeffrey. Mr. and Mrs. David David son, of Bremo, were the guests of her parents, Mr. and Mrs. D. L. Jones Sunday. E. B. Pankey is now making his home with his sister, Mrs. Jake Jones, of this place. Dr. Perkins Glover is able to be out again after being sick for several days. Mr. and Mrs. William A. Le- Suieur, of Tuckahoe Apt., Rich mond, spent Friday in the home of their niece, Mrs. Alfred Seay. T h e Marshall District high school patrons league held its monthly meeting last week Miss Pearl Martin h a s re turned home fro mRichmond where she was the guest of her brother. Mrs. Hamden Seay and son, if Fork Union were the recent quests of her parénts, Mr.1 and Mrs. W. P. Davies. Dr. E. J. Haden was a visitor .n Richmond recently. Miss Judson Jones, of Grav ai Hill, spent the past week end in her home here. Mrs. Nannie Senger, who broke her arm several weeks ago is reported as getting along nicely. Miss Dorothy Bagwell, of Buckingham C. H., was th e past week-end guest of Misses Elizabeth and Edith Pitts. Miss Julia Fuqua was a visi tor in Richmond Saturday. The choir practice was held in the home of Mrs. White Hughes Tuesday night. Mrs. Rofe Connor, of Dillwyn and Mrs. Wingfield, of Penn., were the recentguests of Mrs. D. P. Morgan. Miss Dorothy Deane and Miss Maude Alma Deane, of In- ermont College, will arrive in a few days for the Christmas holidays. Mr. and Mrs. Jack Snoddy and family, of Dillwyn, were the guests of her parents, Mr. and Mrs. Reuben Nicholas, re cently. There will be preaching ser vices in the Arvon Presbyterian church Sunday morning, at 11 oclock, By the Rev. P. F. Jones Mrs. Fountain LeSueur motored to Richmond Saturday"}, "highlight": {"text": {"matched_tokens": ["n", "Horsley"], "snippet": "Miss Edith Piitts a <mark>n</mark> d Miss Alice <mark>Horsley</mark> motored to Rich mond"}}, "highlights": [{"field": "text", "matched_tokens": ["n", "Horsley"], "snippet": "Miss Edith Piitts a <mark>n</mark> d Miss Alice <mark>Horsley</mark> motored to Rich mond"}], "text_match": 1733921019434893433, "text_match_info": {"best_field_score": "2216192638976", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019434893433", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1668.23, 411.75, 1809.16, 842.88], "bbox_id": "0ff8ad7959", "file": "AppomattoxNewspapers_1971-1973a_0167.pdf", "page": 1, "text": "M rs. Minnie Burks Boat wright, 71, of New Canton, a nat ive of Bedford County, died at 1210 a.m . Friday, Dec. 24th at the home of her daughter, M rs. Frank Pflueger of Rich mond, after a short illness. She was the widow of J . J . Boat wright. She was the daughter of Ed ward M. Burks and Emma Cole man Burks. In addition to her daughter, she is survived by two sons, Jam es J . Boatwright, J r . of Phoenix, A riz. and Frederick W. Boatwright of Powhatan four other daughters, M rs. Mildred Lawrence of Memphis, Tenn., M rs. William T . Johnson of Eden, N .C ., and M rs. Shirley Smith and M rs. Monroe Mar shall of Richmond two broth e rs, WiUiam H. Burks of Rich mond and Edward M. Burks, J r . of Lynchburg three sisters, M rs. J . Horsley Putt of Lynch burg, M rs. Gordon Millner of Appomattox and Emma Burks of Buckingham 17 grandchil dren and nine great grandchil dren. Funeral services were con ducted at 2 p.m. Sunday at the Presybterian Church in Arvon- ia. Burial took place in Buck ingham Baptist Church Ceme tery. Smith Funeral Home in Bre- mo Bluff was in charge of ar rangements."}, "highlight": {"text": {"matched_tokens": ["William", "N"], "snippet": "Memphis, Tenn., M rs. <mark>William</mark> T . Johnson of Eden, <mark>N</mark> .C ., and M rs."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "N"], "snippet": "Memphis, Tenn., M rs. <mark>William</mark> T . Johnson of Eden, <mark>N</mark> .C ., and M rs."}], "text_match": 1733921019300675705, "text_match_info": {"best_field_score": "2216192573440", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019300675705", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1517.09, 238.29, 1604.29, 1732.12], "bbox_id": "5480afa0c4", "file": "AppomattoxNewspapers_1974-1975a_0215.pdf", "page": 1, "text": "Thelma S. James M. Mrs. Mary Coleman M. Elmo Earle B. Hunley M. H .H . John R. Ralph Lee Ruby H. Sara A. Wayne L. Lillie Jessie, Jr. Lola A. Lucille Akers Alfred Leola Mary Bell Wilma Jean Edythe J. D. Aster Edna Mary Helen William C. Mamie Marion E. Mary Leavie Horsley M. Clinton W. Elma M. William John, Jr. Jean P. Elsie Marie Harry Elmo Jack B. Willie H., Jr. Arwilda J. Dorothy M argaret A. Ruth W. H. Ray Audrey W. Clara B. Duval F. Harry, Jr. Helen D. Hubert Scott Joyce M. Katurah Lewis H. Lewis J. Lucy Wilson Majorie Coffey M artha Raye O .L. O. L., Mrs. OscarD. Phyllis Ann John Kemper Randolph Samuel W., Jr. W alter S. Robert Lewis Barbara Ann C.C. -Doris Estelle L. Eva Celeste Flossie E. Lillian H. Melvin A. Thomas E. W arren H. M artha Patricia T. Elsie Phelps Clyde S. Virginia Geneva S. H .C . Henry Barbara B. Baxter C. Cecil W. Clara Lee Edla Edward A. Frank L. James Robert, Jr. Juanita N. L. E. Linda M. Phyllis B. Randall W. Richard Allen Ronald N. Roy M. Ruby W alter B. Arthur T., Sr. James D. James, Mrs. Baxter W. Verna Virginia Eleen Mae GailD. Grace M. James E. Jasper J. John A., Jr. Kirby H. Mabel Margaret S. Richard Eugene Rothwell L. Rothwell L. Mrs. Virginia A. MazieD. C.H . Mabel C. W. Burl Nancy B. Wallace D. W. E. Mrs. Ann J. Lewis Donald Lee . Estell Phelps Herbert Wayne Charlie C. JohnW . Sterling L. Gloria Marie Jack William Vivacacious Royal W Jr. Harrison B., Jr. Agnes Page E. LeRoy Patsy M. Samuel T. Avis L. Stanley"}, "highlight": {"text": {"matched_tokens": ["Horsley", "William"], "snippet": "Marion E. Mary Leavie <mark>Horsley</mark> M. Clinton W. Elma M. <mark>William</mark> John, Jr. Jean P."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley", "William"], "snippet": "Marion E. Mary Leavie <mark>Horsley</mark> M. Clinton W. Elma M. <mark>William</mark> John, Jr. Jean P."}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1622.41, 1200.15, 1954.21, 1496.87], "bbox_id": "7a5d277a97", "file": "AppomattoxNewspapers_1905-1912a_0275.pdf", "page": 1, "text": "H. K. AdagmaJ3herliI of the County of Cum berland and as such Admr. of T. H. Wood- son, deed., the said H. K. Adams. BherW as aforesaid and as such Admr. of John E. Harris, deed., the said H. K. Adams, Sheriff and as such Admr. of John B. Robinson, decd?,8the said H. K. Adam. Sheriff and as such Admr. of Miller Woodson, deed., the said H K. Adams, Sheriff and as such  A dm r of Willis Sanderson, deed., the said H. K. Adams. Sheriff and as O1 Admr. of William K. Crowder, deed., the said H. K. Adams. 8herlff and as such A dm r.d.l . n. of Samuel BooKer, deed., and William T. Robinson ............................... Defendant. The object of this suit Is to subject the tract?of about two hundred acres of land, spending buuuj win. o-vi called HioXorv Hall, formerly owned by ter Mrs. A. C. Horsley, after a veryU e severe spell of typhoid fever.  g f e 01W t f n i a , t for S M Miss Fannie E. Horsley, of Tra- 1 County, Virginia cent thereon from the 2nd velers Rest, is spending the inter tsw W covTre y  oSSSSwiit- with her uncle, Dr. John W. Stagg,, M  t of Alabama. I other lands owned by any of thesald de- Miss Ida Horsley spent last week d visiting friends and relatives near I And an affidavit having been made and lea 6, ... I that the defendants are not resi- Howardsville. I dents of the State of Virginia, _ It is ordered Our friends on both sides have   sympathy in the closing Of the Lov- benecf f l  project teeir interest lnythU ingston and Dlllwyn banks. It 1S I polished once a week for four weeks In the hard luck or the lack of luck, and it I  seems like a shame that they had to 1 posted at the front door of the tt0se19101  - I this county on the 2nd day of January, Suffer for the sins OI Others. I that being the next succeeding rnle day after The commercial men of Richmond I this order was entered. A say it has been 15 years since eggs  Wm. m . smith, p. q w84t were as plentiful in January and"}, "highlight": {"text": {"matched_tokens": ["n", "William"], "snippet": "such A dm r.d.l . <mark>n</mark>. of Samuel BooKer, deed., and <mark>William</mark> T. Robinson ............................... Defendant. The"}}, "highlights": [{"field": "text", "matched_tokens": ["n", "William"], "snippet": "such A dm r.d.l . <mark>n</mark>. of Samuel BooKer, deed., and <mark>William</mark> T. Robinson ............................... Defendant. The"}], "text_match": 1733921019166457977, "text_match_info": {"best_field_score": "2216192507904", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019166457977", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [494.38, 636.85, 640.86, 1098.23], "bbox_id": "e79706aae9", "file": "AppomattoxNewspapers_1971-1973a_0290.pdf", "page": 1, "text": "M r. and M rs. Charles Farrar and children, from Amherst, Miss Nellie Quinn, from Lynch burg, spent the week end with M r. and M rs. William Quinn. M rs. Mildred Jo h n s o n , of Clifton Forge, spent last week in the home of her parents, M r. and M rs. Burke Smoot. M rs. Anne Carter, of Crewe, spent the week end, also. Mr. Bill McGrath was in Lyn chburg General Hospital over the week end. M rs. Lewis Harris has been ill at her home for several days. She will go for a checkup Tues day in Lynchburg. Rev. and M rs. Washburn and M rs. W. E . Akers attended the Executive Committee meeting at Bethlehem Church on Monday night. There will be a Bible and Life Seminars for young people this week Tuesday through Friday night at Liberty Chapel Church. All young people from Glad stone Memorial Church will join the young people of Liberty Cha pel Church for these services this week. M rs. Vernon Horsley contin ues a patient at Lynchburg Gen eral Hospital. She is improving and hopes to be home soon. M r. Sam Thornhill is still a patient at Lynchburg General Hospital. Friends are glad to know he is much better. We were sorry to hear of Mr. R . C . Stephens accident this week. He had a severe cut by a power saw. Friends hope he may"}, "highlight": {"text": {"matched_tokens": ["William", "n", "n"], "snippet": "r. and M rs. <mark>William</mark> Quinn. M rs. Mildred Jo h <mark>n</mark> s o <mark>n</mark> , of"}}, "highlights": [{"field": "text", "matched_tokens": ["William", "n", "n"], "snippet": "r. and M rs. <mark>William</mark> Quinn. M rs. Mildred Jo h <mark>n</mark> s o <mark>n</mark> , of"}], "text_match": 1733921019032240249, "text_match_info": {"best_field_score": "2216192442368", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921019032240249", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [436.29, 607.27, 614.24, 1808.6], "bbox_id": "36a11ee64b", "file": "AppomattoxNewspapers_1954-1955a_0095.pdf", "page": 1, "text": "By order of the Electoral Board of Appomattox County, Virginia, all Registration Books in Stonewall Dis trict shall be purged as of October 4, 1954. The names as listed below have been removed from the Regis tration Books, Stonewall Precinct, Stonewall District, Appomattox County, Virginia for reasons of death, transferred or moved. This action is provided for and ordered under Sections 24-94 through 24- 107 of the Virginia Election Laws as amended. Any one who can prove conclus ively that any of the names listed below have a right to be on the Re gistration Books of said county of said district, they shall make such information available to the under signed registrar. J. OWEN CARSON, REGISTRAR. Abbitt, W. F. Akers, Mrs. Pearl R. Alvis, J. P. Sr. Alvis, Mrs. Lucy W. Alvis, J. K. Alvis, W. S. Anderson, S. E. Alvis, Virginia Bagby, S. P. Barnard, B. S. Blankenship, J. B. Blackwell, Mrs. Mattie B. Brown, W. W. Burnett, J. R. Button, Jos. Button, Mrs. Anna D. Blankenship, J. P. Caldwell, Doris Cardwell, C. W. Cardwell, W. L. , Cardwell, C. E. Carson, E. H. Carson, Mrs. Sallie L. Carson, Mrs. Sara E. Cabell, Guy Sr. Cheatham, Geo. W. Cheatham, Mrs. Ruth D. Carwile, Arthur Christian, Mrs. Agnes Christian, Miss Agnes Crews, J. W. .. Crews, Charlie . . Crews, W. J. . Cyrus, G. P. w Cox, Mrs. Agnes Caldwell, Elvin ... Carson, J. E. Jr. Campbell, Harold E. Drinkard, C. W. Sr.  Drinkard, C. W. Jr. Drinkard, H. A. Drinkard, C. M. Drinkard, E. C. Drinkard, G. P. Drinkard, M. M. Drinkard, W. E. Drinkard, Mrs. Lillie E. Drinkard,-Willie M. Drinkard, Evie Drinkard, Colenna Drinkard, Susie M. Davidson, Mrs. Minnie Dunn, L. D. Drinkard, Fleming Eagle, David Eagle, R. G. Eagle, Mrs. Lula Eagle, Mrs. T. E. Eagle, Cleveland Eagle, Richard Jr. Eagle, Walter L. Eagle, Russell H. Eagle, Coles Fracker, D. G. Fracker, N. K. Fracker, Mrs. Susie Ferguson, O. W. Ferguson, Tony Ferguson, J. R. Franklin, Joe Fisher, John G. Foster, Eddie S. Fulcher, J. G. Foster, David Green, W. L. Green, Mrs. iSallie E. Goodman, R. J. Gunter, R. D. Garner, J. C. Garrett, William S. Gunter, Eddie Grow, Mrs. Alice Grow, Julian B. Horsley, J. R. Horsley, Mrs. Annie D. Harding, C. J. Harding, C. W. Harding, Lyle Harding, Mrs. Mary J. Harding, Mrs. C. W. Harding, Miss Verna W. Hamilton, B. W. Hamilton, Mrs. Ruby Hawes, Mrs. Bessie Hawes, Miss Harriet A. Hamilton, Elkin R. Hamilton, Frances B. Hughes, Geo. E. -j"}, "highlight": {"text": {"matched_tokens": ["William", "Horsley", "Horsley"], "snippet": "Garner, J. C. Garrett, <mark>William</mark> S. Gunter, Eddie Grow, Mrs. Alice Grow, Julian B. <mark>Horsley</mark>, J. R. <mark>Horsley</mark>, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["William", "Horsley", "Horsley"], "snippet": "Garner, J. C. Garrett, <mark>William</mark> S. Gunter, Eddie Grow, Mrs. Alice Grow, Julian B. <mark>Horsley</mark>, J. R. <mark>Horsley</mark>, Mrs."}], "text_match": 1733921018629587065, "text_match_info": {"best_field_score": "2216192245760", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1733921018629587065", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1726.08, 915.87, 1894.38, 1740.21], "bbox_id": "e1af8c101e", "file": "AppomattoxNewspapers_1902-1905a_0205.pdf", "page": 1, "text": "with Miss Mary Elizabeth Paris Mr. William Price with Miss Lucy Smith Mr. Tom Steele with Miss Maude Gregory. The ushers were Messrs. John Rolfe Horsley, B. Watkins Nowlin, John Overton and lampton Steele. The little ribbon- bearers were Jerry Burxe and Jao- queline Atwood Curtis Taylor and Fraces Abbitt Kendall Huuter and Katie Woolridge, and James Stanley and Mattie Sears. Before thp bridal party entered one verse of O Promise Me was softly-sung by Miss Eula Burke ac companied by Mrs. J. R. Atwood. At the conclusion of the solo follow ed the strains of Lohengrins wedding march. The bridesmaids entered from the left wing of tbe church near the altar and passed in front of the altar and down the right aisle. The male attendants entered the left aisle at the front of the church and marched down the right aisle while the bridesmaids passed up the left, forming a semi-circle around the al tar. Following the attendants the groom on the arm of the best man en tered the right aiale, while the bride on the arm of her father, Mr. H. F, Burke, appeared in the left aisle, and proceeded to the alter. The bride was preceded by the maid of honor and followed by her colored maid, Sarah. The bride was attired in a hand some traveling dress of broad-cloth with hat and gloves to matcl. She carried in her hand a small white bible and a white rose-bud. The maid of honor wore a gown of cream crepe cloth, with trimmings of pearls and chiffon, and carried in her hand a large bunch of white chrysanthemums. Tfie bridesmaids wore dresses of white silk mull wearing aigrettes in their hair, and each carrying a white rose iu her hand. After lunching at the brides home they happy pair left on the 130 oclock train for a tour through the West, followed by the best wishes of a host of friends. The groom is a son of Mr. John Steel, of Concord, and bolds the re sponsible position of Agent at Spout Springs of tbe N.  W. By., and is a young man highly esteemed and very popular wherever known. He  has for his young bride a daughter I of Mr. B. F. Burke, cashier of our bank. She is attractive popular, j and highly accomplished. She is  an expert at the telegraph key and Mr. Steele will have a help mate ca pable as be. The presents were  costly and beautiful."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "Mary Elizabeth Paris Mr. <mark>William</mark> Price with Miss Lucy"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "Mary Elizabeth Paris Mr. <mark>William</mark> Price with Miss Lucy"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1803.34, 1035.8, 1947.69, 1713.99], "bbox_id": "13c39d4aaa", "file": "AppomattoxNewspapers_1915-1918a_0420.pdf", "page": 1, "text": "W illie David OKeefe George W esley Powell Norm an Baker Elm ore Wilkereon W illiam W alker McCormack Sam uel Lee Loomis Van Buren Webb Claude W Smith L arkin Foster W illiam s Alex Robertson Jerry Allen Burke W illie H unter Bradley Whitney Baboook Corie Cabel Baldwin N athan Fleshm an Lewis Saunders McCormick W alter Allen Heflin Edw ard Tray ham Price George W esley Phelps Norm an W att Page Jam es Burton Goff Terry Colley Durham Samuel Joel H arvey Edw ard Irving Bingham H enry Alvin D rinkard W ade Hampton Ferguson H arry Leonard Cumby Joseph Edwin Dinwiddie Eddie C arter Thom as Homer Babcock H unter MarshallJMcCoy Winden Blackwell Bernard Dickerson Thom as Charles Clarence Thomas Ju lian Deleware Pugh F ran k Snyder H arry Mickle William A nthony Jones Russell Mack Charles Davis Aubrey McCoy Thom as David Grover Pugh Em m ett W arren Oakes W illiam John Johnson Joseph Preston Coleman H erbert H arris William Tunstall Morgan Charley W ashington Tanner William Fletcher G arrett H enry Harrison Williamson Edw ard W atson W illie Wesley M itchell Ciaude Davidson George Elliott Cheatham Allen Thornhill John Wiley Davis H arry Leonard Doss Jam es Clarence Horsley Ewell Ferguson Rexford Lion M artin Alfonso Godsey Hal. Thornhill Baber H ow ard Thomas Williams Thom as Talm age Phelps Jam es Tazewell Jones Samuel Boyd Johnson Colonel Oscar Patterson W ilm er I. Smith Willie Alvin T rent George H arrison White"}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "Baboook Corie Cabel Baldwin <mark>N</mark> athan Fleshm an Lewis"}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "Baboook Corie Cabel Baldwin <mark>N</mark> athan Fleshm an Lewis"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [516.52, 651.12, 658.92, 1026.15], "bbox_id": "ed143adb91", "file": "AppomattoxNewspapers_1971-1973a_0210.pdf", "page": 1, "text": "Thought for the week Every kindness done to others in our daily walk. Every attempt to make others happy. E v e r y prejudice overcome. Is a step nearer to the life of Christ. Mrs. Bell Mundy is a patient in the Lynchburg General Hos pital. We wish her a quick re covery. Mr. Otto Casey is in the in tensive care unit in Emmett Memorial Hospital, Cl ift on Forge, Va. Friends wish him a quick recovery. Mrs. Ann Carter has return ed to her home in Crewe. She spent several days here visiting friends. Nellie Quinn, of Lynchburg, spent the week end with her par ents, Mr. and Mrs. William Quinn. Rev. Billy Washburn brought us a wonderful messageon The Prayer of Faith at Gladstone Memorial Church last Sunday. Mr. and Mrs. Jerry Hansen, of Lovingston are spending this week with his mother, Mrs. Nellie Hansen. Janet Horsley spent the week eeck with Bonnie Balton.  Mr. and Mrs. Edwin Wallace and Mrs. Clara Hanenkrat, of Appomattox, were S u n d a y"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "ents, Mr. and Mrs. <mark>William</mark> Quinn. Rev. Billy Washburn"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "ents, Mr. and Mrs. <mark>William</mark> Quinn. Rev. Billy Washburn"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1560.94, 515.23, 1726.12, 1043.96], "bbox_id": "db4a416d92", "file": "AppomattoxNewspapers_1902-1905a_0323.pdf", "page": 1, "text": "Slian kl i n - S c o t t . Miss Annie Landon Scott, daughter of Mr. and Mrs. Charles A. Scott, of Monmouth, .Bucking ham countjy was married at noon Wednesday, to Dr. Richard V.Shan- klin, of Gay W. Va. The marriage was very quiet owing to the recent I bereavement in the family of the bride. Miss Juliet Scott was maid of honor. Dr. William H. Young, a prominent physicist! of Charleston, W. Va., was best man. Miss Mary and Katie. Scott, sis ters of the bride, and Misses Louis Scott, Mary Scott and Sallie Brady, i her cousins, and Miss Nellie Shank- lin, sister of tlie groom, were brides maids. Mr. Sam Scott and Mr. A. F. Brady, Jr., of Wheeling, W. Va act ed as ushers. I Deorations in the. parlors were pink and greon. Crimson ramblers lavishily adorned the dining room The bridesmaids and ina.ds of hon or carried bouquets of pink carna tions,and the bride a sho wer bouq et  of white roses. Rarely has a more beautiful tableau been seeu than tha which was presented when the younj couple stood beneath the marriage bell. The presents were numerous aud handsome. The guests from a die tance were Mr. and Mrs. J. It, Shanklin, of Cincinnati Mrs. W. C Bentley and Miss Elizabeth Bentley of Richmond, Messrs C. L. Scott, S C. Scott aud C.L. Scott, Jr., of Am burst Miss Julia Scott,of Powhatan Mrs. H. Benton Taylor and Miss Mildred Horsley, of Warminster Dr. and Mrs Shankliu will visit Saratoga and the Lakes before go ing to their home in West Virginia"}, "highlight": {"text": {"matched_tokens": ["n"], "snippet": "Slian kl i <mark>n</mark> - S c o t"}}, "highlights": [{"field": "text", "matched_tokens": ["n"], "snippet": "Slian kl i <mark>n</mark> - S c o t"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "W. Abbitt, John Rolfe <mark>Horsley</mark> and Claude W. Smith."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "W. Abbitt, John Rolfe <mark>Horsley</mark> and Claude W. Smith."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1947.34, 151.91, 2116.46, 1433.25], "bbox_id": "c0603861d2", "file": "AppomattoxNewspapers_1908-1909a_0334.pdf", "page": 1, "text": "L. Brown,4 2nd Mrs. John D. Johnston, 2. White Leghorn Cock 1st, Horace Shirey, 2 2nd Horace Shirey, 1. Cockrel 1st, Miss Emma Ransom, 2 2nd Shirey Bros., 1. Hen 1st Mrs. Dud ley Johnston, 2 2nd, Horace Shirey, 1. Pullet 1st, Emma Ransom, 2 2nd Shirey Bros., 1. Pen 1st, Emma Ransom, I 2nd Shlrêÿ Bros., 2. Brown Leghorn Cock 1st, E. K. Martin, 2. Cockrel 1st, , B. G. Anderson, 2 2nd, Al bert OBrien, 1. Hen 1st, R. L. OBrien, 2 2nd, E. K. Mar tin, 1. Pullet 1st, H. A. Turnes, 2  2nd, Albert O Brien, 1. Pen 1st, E. K. Mar tin, 4  2nd, R. L. OBrien, 2. Plymouth Rock--Cock 1st, Mrs. John Turnes, 2 2nd, William Moon, 1 - ___ Cockrel 1st, William Moon, 2  2nd, Mrs. Johin Turnes, 1. Hen 1st, Shirey Bros., 2  2nd Mrs. Jqhn Turnes, 1. Pullet 1st, William Moon, 2  2nd, Shirey Bros., 1. Pen list, Mrs. John Turnes, 4 2nd B. G. Ander son, 2.  Buff Orpingtons, Best pair 1st A. R. Harwood, Jr., 2. Brahmas Best pair 1st, Grace Caldwell, 2. Indian GamesBest pair 1st R. W. Babcock, 2 2nd, Mrs. W. P. Gills, 1.  AnconasBeat pair 1st, Mrs. Maude Lucado, 2. Bronze Turkey Best pair 1st W. J. Smith, 2 2nd Mrs. W. T. Childers,  t GeeseBest pair 1st W. J. Smith, 1. DucksBeat pair 1st, Lenn Smith, Jr., 1 2nd James Dor- ton, .50.v  BantansBeat pair, 1st Jer ry Burke, Jr., 1. PigeonsBest pair, 1st Len Smith, Jr., 1. Department E Agricultural Products Class 1 Individual Farm Exhibit 1st, Mrs. Li. P. Mo?n, 25  2nd Mrs. W. A. Moon, 15. Best Garden Collection - 1st Mrs. O. L. Scheffler, 4 2nd, Mrs. Elizabeth Ford, 2. TobaccoBest 5 lbs. ship- p in g 7 let.T .m n d era 4  2nd, Stratton. Bros. 2 3rd, Arthur Booker, ribbon. Best 5 lbs Filler, 1stStratton Bros. 4 2nd, W. J. Wilkerson 2 3rd, Arthur Booker, ribbon. Best 51bs. Black wrappers, 1st Stratton Bros. 4  2nd,. W J. Wilkerson 2 3rd, Robert son Neighbors, ribbon. Best 51bs. Mahogany wrappers, 1st Stratton Bros. 4  2nd, W J. Wilkerson 2 3rd, Stratton Bros, ribbon. Best 51bs Bright Tobafcco, 1stC. R. Ferguson 4 2nd, E. R. Ferguson 2 3rd, Obie Myers ribbon. Class 2Corn Best ten gars Boone County White, 1st- H. Ç. Babcock 3 2nd, J, R Horsley 2 3rd, J. R. Horsley 1. Best ten ears Colliers Ex celsior 8rd, W. L. Coleman I 1. Best ten ears Caseys Pure red 1st J. R. Webb 4 2nd, ! Byron Cole 2  3rd, John Turnes 1. Best ten ears Yel- ow Corn, 1st H. C. Babcock 4 2nd, J. O. Davidson 2 3rd, B. G. Anderson 1. Long-  ear corn shown, 1st ---- J Loyd Lewis 1. F am and Garden  Best gollon wheat, 1st W. C. Har vey 2 2nd, M. m . V7. J. Cov-"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "John Turnes, 2 2nd, <mark>William</mark> Moon, 1 - ___ Cockrel 1st,"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "John Turnes, 2 2nd, <mark>William</mark> Moon, 1 - ___ Cockrel 1st,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [494.63, 245.1, 663.13, 524.84], "bbox_id": "6b737d32be", "file": "TimesVirginian_1983a_0212.pdf", "page": 1, "text": "Jesdte Floyd McFadden GLADSTONE - Jessie Floyd M cFadden, 74, of Route 2, Gladstone, died Wednesday, June 8, 1983, in Lynchburg General Hospital. He was born in Buckingham County, a son of the late John William and Ella Marshall McFad den. He was a member of Gladstone Baptist Church and at one time worked for the Charles Russell Brown store in Gladstone. He is survived by five sisters, Mrs. Anna Proffitt, Mrs. Margaret Horsley, and Mrs. Mary Reed Turner, all of Gladstone, Mrs. Belle Woody, Goochland, and Mrs. Ida Sink, Bedford County. Funeral services were conducted at 3 p.m. Friday from Robinson Funeral Home, Appomattox, by the Rev. Jam es N. Williams, with burial in the McFadden family cemetery at Gladstone. Robinson Funeral Home was in charge of arrangements."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "of the late John <mark>William</mark> and Ella Marshall McFad"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "of the late John <mark>William</mark> and Ella Marshall McFad"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [655.44, 1079.55, 821.18, 1673.27], "bbox_id": "f1bd1656d8", "file": "AppomattoxNewspapers_1926-1933a_0540.pdf", "page": 1, "text": "IN THE APPOMATTOX  BUCKINGHAM TIMES August 1, 1906 Parker, Horsley of Bent Creek, died July 21. Buria services were conducted by V S. Reed of the Y. M. C. A. There will be a big circus-in town Saturday. Dr. W. H- Abbitt improves His son, Rev. William Abbitt of Kentucky, is visiting him. Master Braxton Hancock en tertained a number of his lit friends in the celebration of his birthday last Tuesday. Mrs. Sallie Blackwell, wife of Allen O. Blackwell, died at her home yesterday afternoon The deceased was formerly Miss Godsey, of Appomattox County. Sam Thornton of Graham was the guest of his sister, Mrs B- T. Gunter, of Evergreen, last week. Miss Bessie Thornhill of Lynchburg is a guest of Miss Fannie Clement. Lightning struck an old oak tree about forty years old in the yard of Mrs. Hubbard Mar tin and tore it to pieces last Friday evening.  Bob Davis, Squire Womack, and Wells Chittenden of Pamp- lin were in the village Monday on business. I Robert Oder has been visit ing in the county for several days. He haspurchased a nice farm here and will, we hope, again make his home among us. A concert will be given in Smiths Hall next Friday night for the benefit of the Metho dist sidwalk fund. Misses Ethel Calhoun a n d Lucy Gills are visiting in Lynch burg. mss Brown, of Crewe is a guest ot Miss Rosa Paris. --------------- 0 ---------------"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "August 1, 1906 Parker, <mark>Horsley</mark> of Bent Creek, died"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "August 1, 1906 Parker, <mark>Horsley</mark> of Bent Creek, died"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1214.32, 420.04, 1373.67, 1449.98], "bbox_id": "d29b28d4f7", "file": "AppomattoxNewspapers_1918-1922a_0386.pdf", "page": 1, "text": "Governor Appoints 100 Delegates. Richmond. One hundred commissions to prom inent Virginians in various parts ot the State were issued by Colonel B. O. James, Secretary of the Common wealth, on the order of Governor West moreland Davis, to represent the State at the annual convention of the South ern Commercial Congress. Chambers of Commerce in almost every section of Virginia are repre sented in the list of delegates, which includes Peyton Giles, secretary of the Richmond chamber, and presidents of the chambers of Alexandria, Hopewell, Newport News and Winchester. The convention will be held March 1 to 3, in Washington. Delegates appointed Include J. Y. Williams, president of Cham ber of Commerce, Alexandria F. H. LaBaume, secretary and manager of Chamber of Commerce, Charlottes ville Andrew Bell, secretary of Cham ber of Commerce, Harrisonburg I. M. Warren, president of Chamber of Commerce, Hopewell D. B. Ryland, business manager of Chamber of Com merce, Lynchburg J. A. Massie, pres ident of Chamber of Commerce, New port News W. A. Cox, secretary of Chamber of Commerce, Norfolk C. p. Stranley, Eggleston Samuel BoW man, Boone Mill J. R. Blanton, Me Duff W. S. Mett, Dlxondale A. J MoMath, Onley H. S. Bowen, Wit tens Mill T. M. Gathright, Coving ton C. N. Hoover, New Market Dr P. Hundley, Center Cross R. Hutch inson, Oceana H. H. Blackwell, Wi comico Church C. H. Kincheloe Dumfries F. A. Hill, Rectory Wis ter Anderson, Cartersville C. J Schuster, Spring Grove H. H. Car roll, Waverly R. Lee Chambliss Lawrenceville John E. Walker, Sa lem Bruce Bowe, Richmond George W. Barbour, Somerset J. Clifton Miller, Brandy Station W. J. Crank, Louisa James T. Rutberfoord, Rock Castle J. L. Vaughan, Shawsville James L. Phillips, Linden Colonel T. Gilbert, Roanoke W. W. Barnes, Amelia Charles Macgill, Pulaski Langhorne Putney, Dumbarton E. B. Craddock, Cluster Springs Fred Driver, Waynesboro Dr. Ashby Tur ner, Harrisonburg I. B. Bryant, In dependence J. R. Horsley, Stapleton J. C. Curtis, Denbigh W. M. Martin, Chamber of Commerce, Petersburg T. Peyton Giles, Chamber of Com merce, Ricbmond John Wood, sec retary of Association of Commerce, Roanoke Hunter H. McGnire, presi dent of Chamber of Commerce, Win chester J. B. Debnam, secretary of Chamber of Commerce, Fredericks burg Benjamin Speigle, Church Street, Norfolk C. H. Shipman, Lees burg John J. Miller, State Senator, Washington W. S. Embrey, Jr., Fredericksburg J. V. Martindale, Sweet Briar Dr. F. F. Davis, Sassa fras E. H. Rowe, Archilles Alfred Purcell, Norfolk George T. Bridge- forth, Kenhridge C. W. DeShazo, Martinsville Allen Smith, Dogue Dr. G. W. Beale, Hague W. L. Foy, Ash land J. D. Webb, Disputanta D. H. Norman, Chatham R. H. Lee, Hamp ton H. L. Petty, Union Level Robert S. Carr, Pennington Gap E. W. Jones, Woodlawn Paul McElroy, Hicks Wharf George H. Kent, Kents Store B. C. Garrett, King Williams J. William Chowning, Bertrand Robert T. Rives, McKenney A. Dick erson, Massaponax A. G. Garrett, Jr., Buckingham A. R. Holliday, War minster W. C. Slate, South Boston J P. Alexander, Fairfield J. W. Gaw- thon, Evergreen S. C. Freeman, Oak Ridge Howard M. Taylor, Hanover A. P. Rowe, Fredericksburg Thomas P. Jeffress, Drewrys Bluff Dr. T. S Hening, Jefferson A. G. Burnett, Charlottesville John W. Chalkley, Big Stone Gap J. Townsend Burwell, Millwood C. J. Jehne, C.  O., Rich mond Lynn Copenbaver, Marion S M. Slausson, Williamsburg Mitchell Harrison, Nokesville M. M. Jarman, Elkton T. U. Dudley, Mlddleburg J. N. Ranes, La Crosse J. O. Gather, Winchester C. N. Huff, Troutville J. A. Nolen, Buffalo Ridge M. L. Faison, Sebrell C. A. Truslow, Flamouth S. E. Stafford, Trigg Colonel Carroll Menefee, Spervllle."}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "Gathright, Coving ton C. <mark>N</mark>. Hoover, New Market Dr"}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "Gathright, Coving ton C. <mark>N</mark>. Hoover, New Market Dr"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1188.91, 414.33, 1345.52, 1443.81], "bbox_id": "f2b0d66e42", "file": "AppomattoxNewspapers_1918-1922a_0387.pdf", "page": 1, "text": "Governor Appoints 100 Delegates. Richmond. One hundred commissions to prom inent Virginians in various parts ot the State were issued by Colonel B. O, James, Secretary of the Common wealth, on the order of Governor West moreland Davis, to represent the State at the annual convention of the South ern Commercial Congress. Chambers of Commerce in almost every section of Virginia are repre sented in the list of delegates, which includes Peyton Giles, secretary of the Richmond chamber, and presidents of the chambers of Alexandria, Hopewell, Newport News and Winchester. The convention will be held March 1 to 3, in Washington. Delegates appointed Include J. Y. Williams, president of Cham ber of Commerce, Alexandria F. H. LaBaume, secretary and manager of Chamber of Commerce, Charlottes ville Andrew Bell, secretary of Cham ber of Commerce, Harrisonburg I. M. Warren, president of Chamber of Commerce, Hopewell D. B. Ryland, business manager of Chamber of Com merce, Lynchburg J. A. Massie, pres ident of Chamber of Commerce, New port News W. A. Cox, secretary of Chamber of Commerce, Norfolk C. f. Stranley, Eggleston Samuel Bow man, Boone Mill J. R. Blanton, Me- Duff W. S. Mett, Dlxondale A. J. MoMath, Onley H. S. Bowen, Wit- tens Mill T. M. Gathright, Coving ton C. N. Hoover, New Market Dr. P. Hundley, Center Cross R. Hutch inson, Oceana H. H. Blackwell, Wi comico Church C. H. Kincheloe, Dumfries F. A. Hill, Rectory Wis- ter Anderson, Cartersville C. J. Schuster, Spring Grove H. H. Car- roll, Waverly R. Lee Chambliss, Lawrenceville John E. Walker, Sa lem Bruce Bowe, Richmond George W. Barbour, Somerset J. Clifton Miller, Brandy Station W. J. Crank, Louisa James T. Rutherfoord, Rock Castle J. L. Vaughan, ShawsviUe James L. Phillips, Linden Colonel T. Gilbert, Roanoke W. W. Barnes, Amelia Charles Macgill, Pulaski Langhorne Putney, Dumbarton E. B. Craddock, Cluster Springs Fred Driver, Waynesboro Dr. Ashby Tur ner, Harrisonburg I. B. Bryant, In dependence J. R. Horsley, Stapleton J. C. Curtis, Denbigh W. M. Martin, Chamber of Commerce, Petersburg T. Peyton Giles, Chamber of Com merce, Richmond John Wood, sec retary of- Association of Commerce, Roanoke Hunter H. McGuire, presi dent of Chamber of Commerce, Win chester J. B. Debnam, secretary of Chamber of Commerce, Fredericks burg Benjamin Spelgle, Church Street, Norfolk C. H. Shipman, Lees burg John J. Miller, State Senator, Washington W. S. Embrey, Jr., Fredericksburg J. V. Martindale, Sweet Briar Dr. F. F. Davis, Sassa fras E. H. Rowe, Archilles Alfred Purcell, Norfolk George T. Bridge- forth, Ken-bridge C. W. DeShazo, Martinsville Allen Smith, Dogue Dr. G. W. Beale, Hague W. L. Foy, Ash land J. D. Webb, Disputanta D. H. Norman, Chatham R. H. Lee, Hamp ton H. L. Petty, Union Level Robert S. Carr, Pennington Gap E. W. Jones, Woodlawn Paul McElroy, Hicks Wharf George H. Kent, Kents Store B. C. Garrett, King Williams J. William Chowning, Bertrand Robert T. Rives, McKenney A. Dick erson, Massaponax A. G. Garrett, Jr., Buckingham A. R. Holliday, W ar minster W. C. Slate, South Boston J P. Alexander, Fairfield J. W. Gaw- thon, Evergreen S. C. Freeman, Oak Ridge Howard M. Taylor, Hanover A. P. Rowe, Fredericksburg Thomas P. Jeffress, Drewrys Bluff Dr. T. S- Hening, Jefferson A. G. Burnett, Charlottesville John W. Chalkley, Big Stone Gap J. Townsend Burwell, Millwood C. J. Jehne, C.  O., Rich mond Lynn Copenhaver, Marion S. M. Slausson, Williamsburg Mitchell Harrison, Nokesville M. M. Jarman, Elkton T. U. Dudley, Middleburg J. N. Ranes, La Crosse J. O. Cather, Winchester C. N. Huff, Troutvllle J. A. Nolen, Buffalo Ridge M. L. Faison, Sebrell C. A. Truslow, Flamouth S. E. Stafford, Trigg Colonel Carroll Menefee, Sperville."}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "Gathright, Coving ton C. <mark>N</mark>. Hoover, New Market Dr."}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "Gathright, Coving ton C. <mark>N</mark>. Hoover, New Market Dr."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1170.5, 432.94, 1329.33, 1481.59], "bbox_id": "3f2340663a", "file": "AppomattoxNewspapers_1918-1922a_0583.pdf", "page": 1, "text": "Governor Appoints 100 Delegates. Richmond. One hundred commissions to prom inent Virginians in various parts ol the State were issued by Colonel B. O. James, Secretary of the Common wealth, on the order of Governor West moreland Davis, to represent the State at th annual convention of the South ern Commercial Congress. Chambers of Commerce in almost every section of Virginia are repre sented in the list of delegates, which includes Peyton Giles, secretary of the Richmond chamber, and presidents of the chambers of Alexandria, Hopewell, Newport News and Winchester. The convention will be held March 1 to 3, in Washington. Delegates appointed Include J. Y. Williams, president of Cham ber of Commerce, Alexandria F. H LaBaume, secretary and manager ot Chamber of Commerce, Charlottes ville Andrew Bell, secretary of Cham- ber of Commerce, Harrisonburg I. M. Warren, president of Chamber of Commerce, Hopewell D. B. Ryland business manager of Chamber of Com merce, Lynchburg J. A. Massle, pres ident of Chamber of Commerce, New- port News W. A. Cox, secretary of Chamber of Commerce, Norfolk C. F, Stranley, Eggleston Samuel Bow man, Boone Mill J. R. Blanton, Me Duff W. S. Mett, Dixondale A. J MoMath, Onley H. S. Bowen, Wit tens Mill T. M. Gathright, Coving ton C. N. Hoover, New Market Dr P. Hundley, Center- Cross R1. Hutcb inson, Oceana H. H. Blackwell, Wi comico Church C. H. Kincheloe, Dumfries F. A. Hill, Rectory Wis- ter Anderson, Cartersvllle C. J. Schuster, Spring Grove H. H. Car- roll, Waverly. R. Lee Chambliss, Lawrenceville John E. Walker, Sa lem Bruce Bowe, Richmond George W. Barbour, Somerset J. Clifton Miller, Brandy Station W. J. Crank, Louisa James T. Rutberfoord, Rock Castle J. L. Vaughan, Shawsville James L. Phillips, Linden Colonel T. Gilbert, Roanoke W. W. Barnes, Amelia Charles Macgill, Pulaski Langhorne Putney, Dumbarton E. B. Craddock, Cluster Spring FYed Driver, Waynesboro Dr. Ashby Tur ner, Harrisonburg I. B. Bryant, In dependence J. R. Horsley, Stapleton J. C. Curtis, Denbigh W. M. Martin, Chamber of Commerce, Petersburg T. Peyton Giles, Chamber of Com merce, Richmond John Wood, sec retary of Association of Commerce, Roanoke Hunter H. McGuire, presi dent of Chamber of Commerce, Win chester J. B. Debnam, secretary of Chamber of Commerce, Fredericks burg Benjamin  Speigle, Church Street, Norfolk C. H. Shipman, Lees burg John J. Miller, State Senator, Washington W. S. Emibrey, Jr., Fredericksburg J. V. Martindale, Sweet Briar Dr. F. F. Davis, Sassa fras. E. H. Rowe, Archilles Alfred Purcell, Norfolk George T. Bridge- forth, Kenbridge C. W. DeShazo, Martinsville Allen Smith, Dogue Dr G. W. Beale, Hague W. L. Foy, Ash land J. D. Webb, Disputanta D. H. Norman, Chatham R. H. Lee, Hamp ton H. L. Petty, Union Level Robert S. Carr, Pennington Gap E. W. Jones, Woodlawn Paul McElroy, Hicks Wharf George H. Kent, Kents Store B. C. Garrett, King Williams J. William .Chowning, Bertrand Robert T. Rives, McKenney A. Dick erson, Massaponax A. G. Garrett, Jr., Buckingham A. R. Holliday, War minster W. C. Slate, South Boston J P. Alexander, Fairfield J. W. Gaw- thon, Evergreen S. C. Freeman, Oak Ridge Howard M. Taylor, Hanover A. P. Rowe, Fredericksburg Thomas P. Jeffress, Drewrys Bluff Dr. T. S. Hening, Jefferson A. G. Burnett, Charlottesville John W. Chalkley, Big Stone Gap J. Townsend Burwell, Millwood C. J. Jehne, C.  0 Rich mond Lynn Copenhaver, Marion S. M. Slausson, Williamsburg Mitchell Harrison, Nokesville M. M. Jarman, Elkton T. U. Dudley, Middleburg J. N. Ranes, La Crosse J. O. Cather, Winchester C. N. Huff, Troutville J. A. Nolen, Buffalo Ridge M. L. Faison, Sebrell C. A. Truslow, Flamouth S. E. Stafford, Trigg Colonel Carroll Menefee, Sperville."}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "Gathright, Coving ton C. <mark>N</mark>. Hoover, New Market Dr"}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "Gathright, Coving ton C. <mark>N</mark>. Hoover, New Market Dr"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [354.72, 660.31, 509.87, 1209.04], "bbox_id": "eeb8098d40", "file": "AppomattoxNewspapers_1902-1905a_0265.pdf", "page": 1, "text": "F re e L an ce. I had hoped to come with mes sages of warmth today, but winter lingering in the lap of spring, gives us the cold and ice, and the air is not yet laden with the breath of flowers, or with the cheering voice of birds. Our Charlie has killed the ground hog, and the sun shines bright over the body of the great weather prophet. May this be a harbinger of brighter and better times. Mr. and Mrs. William P. Hall left for Nortn Carolina on Monday for an extended stay. Mrs. Hall is visiting relatives in the south. Mr. and Mrs. R. S. Ellis have gone to Atlanta, Ga., on a visit to Dr. James N. Ellis. Mr. 8 . R. Bondurant has gone to West Virginia hoping to obtain a lucrative pos . turn in that state. Mr. R. A. Hull, who has bad a short stay at home, will resume his traveling work this week. M i  b . M. M. Rogers expects to re turn very Boon to her old home, Serchon. She will be welcomed back by her many friends in this community. Prof. Mack, accompaniel by his friend, Mr. John Horsley, paid the neighborhood a flying visit last week. I hear that the public schools will be extended a month longer in this county. I hope this is true, as too much attention cannot be given to education. Rev. C. M. Barrell paid his mem bers in this community a visit last week. He is doing a good and ac ceptable work among his people in and around his cbnrch at Bucking ham."}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "times. Mr. and Mrs. <mark>William</mark> P. Hall left for"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "times. Mr. and Mrs. <mark>William</mark> P. Hall left for"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1861.12, 1333.73, 2021.61, 1519.94], "bbox_id": "50e59653a8", "file": "AppomattoxNewspapers_1918-1922a_0024.pdf", "page": 1, "text": "f N the Clerks Office of the Circuit Court I tbe County ot Appomattox on tbe 8th day of February, 1919 William A W rig h t ................... ...........Plaintiff against Lydia Frances W righ t ................... Defendant The object o f this suit is for tbe plaintiff, w m iam A Wright, to obtain from tbe de fendant, Lyola Frances Wrtgbt, a divorce, 1 vinculo matrimonii, on the grounds o f adul tery. And an affidavit having leen made and filed that the defendant Lydia Frances Wright is not resident o f the State o f Vir ginia. it is ordered that she do appear here within Ufteen days after due publication hereof, and do what may be necessary to pro tect her interest In this suit. And It Is fur ther ordered that a copy hereof be publish ed once a week for four w eeks In the Tlmes- Vlrglm an, a newsraper published In the county ol A ppom attox, and that a copy bo posted at the front door of the oourtnouse of this county on the 17th day o f Feb, 1919, that being the next succeeding rule day af ter this order w as entered. A cop yTeste J. R. HORSLEY, Clerk by C W Smith, D C S L Ferguson, p q 212 4t"}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "f <mark>N</mark> the Clerks Office of"}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "f <mark>N</mark> the Clerks Office of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1698.48, 671.98, 1856.82, 859.94], "bbox_id": "93ff79ebe8", "file": "AppomattoxNewspapers_1918-1922a_0022.pdf", "page": 1, "text": "f N the Clerks Office of tb e Circuit Court of 1 the County of Appomattox on tb e 8th day of February, 18W William A W rig h t...................- .......... Plaintiff against Lydia Frances W rlgut .................. Defendant The object of tbia suit Is for the plaintiff, w uiiam A W right, to obtain from tbe de fendant, Lydia Frances Wright, a divorce, a vinculo matrimonii, on tho grounds of adul tery Aud an affidavit having I an made and filed th a t the defendant Lydia Frances Wright is not resident of the State of Vir ginia. It is ordered th at she do appear here within fifteen days a fte r dae publication hereof, aud do w nat may be necessary to pro tent her interest in tb it suit. And it is fur ther ordered th at a copy hereof be publish ed once a week for four weeks in th e Tiraes- Vlrglnian, a news, aper published in the county or A ppom attox, and th at a copy be posted at tbe front door of the courthouse of tbia county on the 17tli day of Feb, 1919, that beiDg the next succeeding rule day af ter this order was entered. A copy -Testes J. R. HORSLEY. Clerk by C W Smith, D C S L Ferguson, p q 212 it"}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "f <mark>N</mark> the Clerks Office of"}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "f <mark>N</mark> the Clerks Office of"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1569.61, 219.73, 1730.62, 1237.51], "bbox_id": "73bf69ecf5", "file": "AppomattoxNewspapers_1905-1912a_0547.pdf", "page": 1, "text": "Democratic Mass Meeting. . There was a largely attended mass meeting of the Democra 8 of Appomattox at the. Courthouse Wednesday, for the purpose of electing six delegates to the Norfolk State Convention. Gapt. T. J. Stratton was made permanent chairman of the meeting he appointed W. A. Moes, S. C Stratton and E. E. Chism a com rnittee to nominate delegates to the Convention. The committee nomi nated and tbe meeting elected the following delegatee H. D. Flood J. R. Horsley, S. L. Ferguson, D.. J. B. Abbitt, R. H. Browning, W. T. Marshal alternates N. R. Featheratone, H. B. Jennings, R. C Mann, T. A. Caldwell, J. W. Caw- thorn Jr., C. W. Smith. The chairman then appointed the following committee on resolutions S. L. Ferguson, J. R. Horsley and L. E. Smith. The following resolutions were offered and adopted By S. L. FergusonResolved that it is the sense of this Demo cratic Mass Meeting, assembled at Appomattox Court House on May 1st. 1912, for the purpose of se lecting delegates aud alternates to the Democratic State Convention, which meets in Norfolk May 23rd, 1912, that the delegates and alter nates which have been elected, go to said Convention utunstructed, vote as a unit, and those who are present at said Convention, cast the vote of said delegation as a unit. By Dr. J. B. AbbittResolved that the course of our Unied States Senators, Hon. Thomas S Martin and Hon. Claude A. Swanson, in the Congress of the United States, Oas been nch as to commend it self to the people of Virginia, and we heartily endorse each of them as able and faithful representatives of the people and of Demncatic prin ciples. ByL, E. S.rithResolved that it is the sense of this Democratic mass meeting assembled that the administration of William Hodges .Mann, Governor of Virginia has oeen able and conservative. Resolved, That he has shown him self especially the friend of the farmer in advocating and securing special legislation in tfie interest of the agricnltnrai classes and the bet terment of the agricultural interests of Virginia. By J. R. HorsleyResolved, That Hon. J. Taylor Ellyson has served the Democratic party of Virginia ar chairman of the State Democratic Committee with unselfish z al and ability. Resolved, That, we hear ily en dorse Mr. Ellyson for re-election as chairman of the State Democratic committee and also as a member of the National Democratic committee By. J. IV. CawthomRes lived, That we, the Democratic voters of Appomattox county in mass-meet ing assembled heartily endorse Hon H. D. Flood for re-election to Con gress from the Tenth Virginia Dist rict. Resolved, That this District never had a more able and faithful representative in Congress, or one who has been more active or anc- cessful in representing the interests of his oonstionents. The meeting was a very harmoni ous affair and there was no attempt to instruct the delegates, and it is felt that all the delegates desire to be for the man who can win a Democratic victory."}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "D. Flood J. R. <mark>Horsley</mark>, S. L. Ferguson, D.."}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "D. Flood J. R. <mark>Horsley</mark>, S. L. Ferguson, D.."}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [137.99, 328.11, 289.81, 821.93], "bbox_id": "a28eb1ac13", "file": "TimesVirginian_1981a_0386.pdf", "page": 1, "text": "Dedication ceremonies, of Monroe Lodge 301 A.F. A M. weie held on October 4. Mt. Wor. Spender McMath Rogers, Grand Master of the Grand Lodge of Virginia was speaker. A note burning ceremony was held declaring Monroe Lodge 301 free of debt. Monroe Lodge 301 was namfed in honor of James Monroe, the fifth President of the United States, who was initiated in Williamsburg Lodge 6 while a student at William  Mary. Monroe Lodge was instituted on April 11,1908 by Joseph W. Eggleston. Appointed officers were R. F. Burke, Worshipful Master J. R. Atwood, Senior Warden T. A. Smith, Junior Warden. The following were elected at the first stated meeting J. C. Jones, Treasur er J. R. Horsley, Secretary. J B. Abbitt, Senior Deacon J, C. Shearer, Junior Deacon. Those . appointed were J. C. Martin, Tiler W. L. Murphy, Chaplain H. C. Babcock and C. N. Abbitt, Stewards. The first petition of record for degrees was presented at this meeting by C. S. McDearmon. Pursuant to a charter dated February 11, 1909, Monroe Lodge was assigned No. 301 and duly constituted on April 30,1909. Meetings were held in a building on the south side of the Norfolk-Western Railroad, opposite the Railroad Station. The rent at this time being 36.00 a year. This building was shared by the Woodmen of the World. Meetings were held in. this"}, "highlight": {"text": {"matched_tokens": ["William"], "snippet": "while a student at <mark>William</mark>  Mary. Monroe Lodge was"}}, "highlights": [{"field": "text", "matched_tokens": ["William"], "snippet": "while a student at <mark>William</mark>  Mary. Monroe Lodge was"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [629.78, 427.43, 791.87, 741.77], "bbox_id": "6390655462", "file": "AppomattoxNewspapers_1915-1918a_0396.pdf", "page": 1, "text": "cature, Davidson, T h o m a s Braxton, Drinkard, Clarence Davis, Drinkard, Marven Mad ison, Doss, Harry Leonard, Does, Charles Douglas, Does, Lewis Lafayette, Guill, Will iam Herman, Guill, Fletcher Taylor, Guill, John Samuel, Harding, Herman, Harvey .Les ter Benjamin, Horsley, James Clarence, Kyle,Robert Thomas, Lefew, DeWitt Talmage, Luca do, J o h n Willard, Lucado, James, Marsh, Thomas Gordon, Martin, Ashby Carroll, Martin, Thomas Raymond, Megginson, John William, Moore, Hubert, Moore, John Munday, Moore, Conrad, Moore, Nowlin, Moore, Hunter Milton, Moore, Wiley Floyd, McCormick, John, Mc Cormick, William Douglas,Me Cormick, Oscar Leonard, Mc Cormick, Frank Cable, Owen, William Albert, Page, Robert Meredith, Page, John Edgar, Philps,"}, "highlight": {"text": {"matched_tokens": ["Horsley"], "snippet": "Harvey .Les ter Benjamin, <mark>Horsley</mark>, James Clarence, Kyle,Robert Thomas,"}}, "highlights": [{"field": "text", "matched_tokens": ["Horsley"], "snippet": "Harvey .Les ter Benjamin, <mark>Horsley</mark>, James Clarence, Kyle,Robert Thomas,"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [1630.55, 739.54, 1798.53, 1838.46], "bbox_id": "af31facc47", "file": "AppomattoxNewspapers_1922-1923a_0449.pdf", "page": 1, "text": "B u c k i n g h a m . The peaches seem to be killed, but the apple blooms are, most of them alive at this writing. Mr. Jas. Murphy says when the fruit year is at hand there will be fruit no matter how cold it gets. A writer in a recent number of an agricultural paper claims that his boy raised 5 per cent, out of 60 tnrkeys, but I can go him two bet ter than that, one of Buckinghams noted turkey raisers raised 74 out of 75 in one flock, and this spring she has 15 turkey hens laying and I shouldnt wonder if she raises 200 head this time. Mrs. Wiley Mornss and Mrs. William Horner have been on a visit to their parents, Mr. and Mrs. L D. Jones at New Store the past week. Judge John R. Moss attended Cumberland court looking after his political fences. All ladies are allowed to change their minds and the date for hold ing the High School final has been changed to the 9th of May. The pupils have been well drilled in the parts they are to take and unless some of them are Stage Struck we are to have a nice entertainment. The Ladies Aid Society and the Junior Society of the Presbyterian Church will serve refreshments, and the whole entertainment will be in the conrt house building. Mrs. LewiB Cabell continues with her mother at Rock Cliff, and it is thought that Mrs. Eliza Horsley is improving. Judge Horsley is probably back from his European trip as he was to sail last week.  . The two colored men in jail here charged with setting fire to Elcan and Smiths houses claim that there can be no evidence against them, and that they made no admissions to the negro detective, who caused their arrest. The crime of arson is one that oft n goes unpunished in this county. We read of new potatoes, toma toes, squash, and other vegetables on the Norfolk market, but when we read of 7.50 a barrel for pota toes we only wish we had them to sell. I paid 50c. a bushel for some old ones. The daily papers say board at the hotels and boarding houses at and adjacent to Jamestown is from 3.50 to 20 a day, or rather the expenses one may readily incur in a day there would reach 20. Tiieee near  M o furnish provisions should reap iiUvest this summer. Eggs went up to 19c. a dozen in one day when the great gnn boats anchored in Hampton Roads. There was a killing in Campbell one week and not many days later a killing in Nelson, and a writer in one of the city papers asks,  What is the matter. There is  a heap  in the papers now about the  un written law, and in a St. Louis conrt a Judge discharged a panel of 50 men who were summoned for jury service, becanse they said if the accused should plead the un written law they would acquit him. I dont know whether when this un written law is written, it will be to license men to slay their fellows or not, bat if this so called unwritten law is as variously defined as seems to have been the case in the courts"}, "highlight": {"text": {"matched_tokens": ["n"], "snippet": "u c k i <mark>n</mark> g h a m"}}, "highlights": [{"field": "text", "matched_tokens": ["n"], "snippet": "u c k i <mark>n</mark> g h a m"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
{"document": {"bbox": [577.5, 1794.28, 727.09, 2003.08], "bbox_id": "fdb5e56d12", "file": "AppomattoxNewspapers_1898-1902a_0190.pdf", "page": 1, "text": "_ C O U N T Y O FFICER S, treasurer- D. Mott Robertson, 733.  AttocV. for the CommonwealthH. e A y P. Coleman, 761. Jgk of County and Circuit Courts EPeers. 42 J . K. Horsley. 13. JBpmmissioner o f the RevenueL , E. , 47Y H . C. Babcock, 404. D IST R ICT O F FIC E R S. S o u t h s id b D is t r ic t . PJr SupervisorJ . O. Jones. 229. For ConstableA . H . Abbitt, 232. For justicesJ . T .A ee, 187 Lantech Jones,-  j . R. H ill, 82 S. E . Howorton, 74 E. G. vey, 180, C 1 .OVKR--H 11 .L D is t r ic t . Ir SupervisorW . H . logon. 233. Er Constable-C. W. Inge, 126 for W. B. EfjustlcesP. M. Hannah. 167 William J. it 188 J- H. Forbes, 69 P. H. Fore, 184. overseerof PoorJ. W. Wright, 224. S t o h b w a ia , D is t r ic t . SupervisorS. c. Stratton, 234. fonstableH. C. Doss, 127 J. E. Chick, JusticesA. B. Thornhill, 141 J. C. 1 160- W C. Abbitt, 170 N. W. Owen, Vi! Stratton, 39 J. H. Thornhill, 38 kidson, 23."}, "highlight": {"text": {"matched_tokens": ["N"], "snippet": "C O U <mark>N</mark> T Y O FFICER"}}, "highlights": [{"field": "text", "matched_tokens": ["N"], "snippet": "C O U <mark>N</mark> T Y O FFICER"}], "text_match": 1731669220158079097, "text_match_info": {"best_field_score": "1116681273344", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1731669220158079097", "tokens_matched": 3, "typo_prefix_score": 0}}
