{"document": {"bbox": [1910.42, 952.24, 2069.3, 1069.8], "bbox_id": "c3aa8e1c9b", "file": "AppomattoxNewspapers_1902-1905a_0468.pdf", "page": 1, "text": "you long, as 1 havent muoh to say. What are we to do now for amuse ment ? Tbe snow and ice have al gone hi id the little buds are giving us t 1 eir signal that Spring time L fust approaching. Miss Effie Wingfield visited ht i hor-.e people last Friday aud Siitur day, accompanied by little Dunnavant."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "fust approaching. Miss Effie <mark>Wingfield</mark> visited ht i hor-.e"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "fust approaching. Miss Effie <mark>Wingfield</mark> visited ht i hor-.e"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1597.79, 620.58, 1795.08, 1764.11], "bbox_id": "d5c9631de0", "file": "AppomattoxNewspapers_1905-1912a_0243.pdf", "page": 1, "text": "Yet wbil I am writing this, with I the beautiful flakes of snow fast carpeting the earth, l behold per -1 sons, all covered with the falling I flakes hauling wood for fires. Wei do not all heed the admonition pre- pare for war in time of peac. I  From appearances, at this writing,! by morning next, we will have a I deep snow. A very uncalled for difficulty oc-  enrred between two colored men in this village last Monday morning,! and came near being a very serious affair, as far as the two participants, are concerned. George Jenkins, the I blaeksmith here, complained of his I idmghter, who married Buck ! Neighbors, a driver for Mr. A. O.J Garnett, Jr., for not giving him hie I share in a hog which he claimed to I be the owner of, but which was ini the pen at the home of said Neigh-j I bora, and which Neighbors had I butchered, along with a hog of his I own, about which there was no dia- I pnte, and Jenkins daughter, the I wife of Neighbors, became very I much incensed with her father on I account of hie remonstrance with I 1 her for the way in which she andl I her husband had treated him in rei I I garif to the hog, and sent in postl I b wte over to the home of A. C.l I Garnett, Jr., where Neighbors was! I at work, for him to come and resent I I the wrong. Neighbors undertook j I to take Jenkins to taw, for the way I he talked to his wife, when they Lot into a fiht. Neighbors got se- I verely beat about the head with a 1 pair of horse shoes in the hands of Jenkins, and after being separated bv E. 8 . Lomax, Jenkins threw  rock at Neighbors, striking him over the eye, which pnt him out of I it for a while, although it did not! knock him down. Neighbors swore 1 lout a warrant against Jenkins, ttael result of which Jenkins was fined 10 00 and sentenced to 30 days inj jiil. He app aled to the Circuit Court. Neighbors was incapacitat- I cd for work for several days. I The deer season is over, ard not many pelts are to the credit of tie I hunters hereabouts. Mr. Branch I Rosen and Mr. Charley Rosen, the j two sons of Mr. C. R. Rosen, sac-1 I ceeded in slaying one a piece during! I the season. Mr. Branch Rosen kil-l I ied quite a nice doe on Thanksgiv-1 ling D a y  and Mr. Charley Rosen 1 killed a small fawn several days thereafter. Mr. W. H. Miles killed one and the oldest son of Mr. Willie Sprouse killed one some weeks ago. Theee are all we have heard of be ing killed in this neighborhood. I Rev. John J. Spencer performed the marriage ceremony for the fol lowing parties very redently On Dc. 2nd at Buckingham he united!  Mr. Wingfield A, Hopkins, of  Prinoe Edward Coonty, and Miss  Ethel Harvey on the 4th inst. he  joined Mr. D. P. Harris, of Appo mattox, and Miss Minnie A. Carter, the daughter of the late J. E. Car ter, at Buckingham, and in the evening of the same day he married I ttt the home of the brides parents, near Toga, Va., Mr. Van B. Day I land Miss Nannie L. Bryant, the daughter of Mr. W. J. B yant. I Tmiy these are days like onto those I of the time of the ark building. I They are still marrying and giv- ling in marriage. And it will still I be so when time is merging into I eternity. I Xrs. Dr, Nowlin is making pre- iparaUoos te remove te Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Buckingham he united!  Mr. <mark>Wingfield</mark> A, Hopkins, of  Prinoe"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Buckingham he united!  Mr. <mark>Wingfield</mark> A, Hopkins, of  Prinoe"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1416.47, 1195.62, 1520.9, 1205.12], "bbox_id": "6e47120e1b", "file": "AppomattoxNewspapers_1954-1955a_0021.pdf", "page": 1, "text": "ye Wingfield of Richmond"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "ye <mark>Wingfield</mark> of Richmond"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "ye <mark>Wingfield</mark> of Richmond"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1403.54, 911.39, 1838.37, 965.54], "bbox_id": "09d07053ac", "file": "TimesVirginian_1978_0292.pdf", "page": 1, "text": "YANKEES OF THE DIXIE YOUTH BASEBALL, MAJOR LEAGUE team are shown in above ttjioto. Team members include, front, row, left to right, Thomas Doss, Todd Thompson, Mike frguson, Jesse Johnson, and Edguardo Garcia second row, left to right, Jay Wingfield, Charles Opmpbell, Billy Hopkins, Walter Haskins, and Jay Whitehead and on back row, is Harvey Campbell, coach. Not available for the picture was Mike Roach."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "left to right, Jay <mark>Wingfield</mark>, Charles Opmpbell, Billy Hopkins,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "left to right, Jay <mark>Wingfield</mark>, Charles Opmpbell, Billy Hopkins,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1269.85, 265.2, 1443.44, 767.23], "bbox_id": "24750c4f86", "file": "TimesVirginian_1983a_0077.pdf", "page": 1, "text": "y M a ry bagby Thus said Jesus, Father, forgive them, for they know not what they do. Luke 2334 Mr. Berkley Cabaniss of Rt. 4, Appomattox, brought a good message to the Hollywood Church people Sunday. Our get well wishes and prayers are with Mr. Henry Earl Covington who remains a patient in the University Hospital in Charlottes ville. Mrs. Edna T. Covington will enter the Lynchburg General Hospital Monday, March 14, for a check-up. Our sincere love and prayers are with her and bar love ones. Our thoughts and prayers sre with all the .sick and tout-in, ones in the hospitals and hones. May each one soon be feeling better. Mr. David Cawthorne, of San Diego, Calif., spent the week end with his parents, Mr. and Mrs. Rufus Cawthorne, of R t. 2, Appomattox. M rs. Thomas Woodall and daughter, Lisa, spent the week end with her  parents Mr. and Mrs. Clarence Coffey, of Covington. Mrs. Lave Torrence spent the week end with Mr. and Mrs. James Conner. Mr. and Mrs. Elliott Tonenee were week end guest of their son, Mr. Larry Torrence and family of Woodbridge, Vs. Mr. George Wooten and daughter and Mr. Calvin Smith visited Mr. and Mrs. Robert Coleman Sunday. Mr. Martin Webb visited Mrs. Madeline Inge Monday. Mr. Samnde Inge, Mrs. W. H. Wingfield and Miss Julia W ingfield were visitors Sunday of Mrs. Inge. Messers Walker and Richard Webb visited Mr. Bruce Morris, of"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Inge, Mrs. W. H. <mark>Wingfield</mark> and Miss Julia W"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Inge, Mrs. W. H. <mark>Wingfield</mark> and Miss Julia W"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1850.4, 950.55, 2022.47, 1108.2], "bbox_id": "fa9c62c6a0", "file": "AppomattoxNewspapers_1943-1947a_0173.pdf", "page": 1, "text": "wy man Wingfield, of Appomattox, with a -birthday sent were Mrs. S. E. West, of Olarkton, Va., Mr. and Mrs. W. T. Mayberry, Sonnie, Marshall and Jackie Mayberry, T. A. Mayberry and Miss Edith Woody, of Lynch burg, L. M. Guthrie, Mr. and Mrs. F. E.Guthrie and daughters, Joyce and Clara Mae, of Burlington, N. O., Mr. and Mrs. R. T. Guthrie, Gladys and Lennfa . Guthrifc, of Harrisonburg, Va., Mrs. Robert Thomas, Jackie Mrs. Norbert Rey nolds and Miss Dot Smith, of Alta vista, Va."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "wy man <mark>Wingfield</mark>, of Appomattox, with a"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "wy man <mark>Wingfield</mark>, of Appomattox, with a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [421.91, 203.42, 566.9, 1161.13], "bbox_id": "1aa6b80fc7", "file": "TimesVirginian_1976_0245.pdf", "page": 1, "text": "Worship services will be at Hollywood Baptist Church Sunday morning July 4 at 9 a.m. Sunday School will follow at 10 oclock. Rev. Paid Balthaaer deliver ed a good message at Hollywood Sunday morning. Friends were deeply grieved to hear of the death of Rev. and Mrs. Clarence Davis infant son. We extend to them our love and deepest sympathy. Deepest sympathy is extend ed the families of Mr. John Ferguson and Mr. Curtis Blackwell. Mrs. Kenneth Deaner and daughters, Delorious Ann and Dawn spent the week end in Newport News with Mrs. loan Mayberry, Mr. and Mrs. Ryland Mayberry and Mrs. Lucy Deaner. Mrs. loan Mayberry accompanied them home for a visit. Mrs. David Austin and Janet were visitors Wednesday mor ning of Mrs. Thomas Woodall and Lisa. Mr. Frank Covington visited Mrs. M. L. Covington and Mrs. W. T. Covington Friday afternoon. Mr. and Mrs. L. L. Webb and Miss Odell Webb called in the W. H. Wingfield home Satur day afternoon. Mr. and Mrs. Twyman Baldwin visited in this home of Mrs. Mary Bagby Saturday night. Visting Mrs. C. R. Ban ton Sunday night were Mr. and Mrs. R. G. Austin and Tom. Mr. and Mrs. H. D. Webb, of Richmond, were guests Sunday of Mr. and Mrs. K. M. Webb and family. Among others visiting Mr. and Mrs. Thomas Woodall and family Sunday were Mr. and Mrs. L. H. Watson, Mr. and Mrs. Scott Sheets and Mr. and Mrs. Alfred Almond. Mr. and Mrs. J. L. Torrence had their children and grand children with them for Fathers Day. Relatives and friends are so glad to hear Mrs. Frank Woodall is home from the hospital. We pray she may soon be well. Miss Joyce Webb spent a few days last week in Lynchburg with Mr. and Mrs. Lawrence Woodson. Visting Mr. and Mrs. L. H. Watson Saturday were Mrs. Lee Smith and Mr. and Mrs. Larry Sexton and son. We are very sorry to hear Mr. Bennett Gilliam is back in the Lynchburg Hospital. Rev. and Mrs. Otis Sndtb and Mrs W. T. Covington visited him Sunday afternoon. We wish for him a speedy recovery. Mrs. Ruby Woodson, Lisa and Mrs. M. L. Covington visited Mrs. W. T. Covington last week. Visiting Mr. Frank Coving ton and Mrs. Mary Bagby last week were Mr. and Mrs. James Bartlett, of Texas, Mrs. E. T. Ponton of Roanoke, Rev. Paul Balthaser, David Daniel and Andy Balthaser, Mr. H. W."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "in the W. H. <mark>Wingfield</mark> home Satur day afternoon."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "in the W. H. <mark>Wingfield</mark> home Satur day afternoon."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [697.91, 205.91, 866.78, 1180.74], "bbox_id": "465da6f0e2", "file": "AppomattoxNewspapers_1915-1918a_0550.pdf", "page": 1, "text": "work begin. With Ur. C. P. Marshall, president Miss Es telle Thornton, secretary, we I are going  over the top in buying Stamps. And then, too, the Red Cross work must go on. Our people are patriotic to the hearts core, and would be demonstrative, if we knew exactly how. Little Dan Kesler has a cute little sister, just one week old Mr. Harry Jennings is im- proving rapidly. Mr. Preston preached at Con- cord on Sunday afternoon. Mrs. Chris Jackson has been sick but is improving now. Her sister, Mrs. Wingfield, of Phe- x, spent Sunday with her. Dr. H. G. Chalmers visited friends in the neighborhood Sunday  Mrs. H. C Chalmers is visit ing friends in Farmville. There is something that makes us real glad when we think of it, and it is that MisB Estelle Thornton is at home. We dont want our teachers to seek government positions. Is it not better to raise their salaries? I heard aunt Patsy say  Heres yo ole bullet. Josh ef yer wants it come an git it, dont I gine fling it erway, nothin but cuisness nohow,sav in dat thing. You does de cu- isest doics I ever knowed any nigger ter do. Aunt Patsy was cutting some meat and she found a bullet in it. Uncle Josh said  Hole on dar, Patsy, doan fling dat thing erway, ceze date de very bullet me an Marse John used ter kill all ole Marsters hogs wid, an I alius got hit out each hog an kill tothers wid it die time I shot hit little too hard, buc I knowed we would fine hit when we out dat shoulder. I saw the bullet and it really looked battered and worn, but how much of Uncle Joshs sto ry was true I dont know. He took the bullet, wrapped it carefully in a piece of tinfoil and put it in a little bottle and stopped it up and put it away saying  You njay do yer gruntin out dar now, but I sav in dis bullet.1 An old white hog was out in a pen olose by. Uncle Josh said I mighty feard Mary Anns little gal is gwine have rheumatiz or sumthin wusser caze I seed her asettin on er rock, an dat brings bad luck, knows dat  Little Folks, did you ever see a chicken with three feet? An old hen hatched out a brood of little chicks and among them was one with a club foot with one toe,and the other foot good the third foot had just one toe. Its tail was flat like a ducks tail. During a thunder storm it got out of the hovel and was"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "now. Her sister, Mrs. <mark>Wingfield</mark>, of Phe- x, spent"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "now. Her sister, Mrs. <mark>Wingfield</mark>, of Phe- x, spent"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2306.32, 160.64, 2460.86, 686.92], "bbox_id": "28657553df", "file": "TimesVirginian_1978_0367.pdf", "page": 1, "text": "work a week with his back. Mr. Richard Webb visited Mr. H. W. Jenkins Monday. Mr. and Mrs. Rufus Wing field, of Roanoke, spent the week end in Appomattox. They visited in the homes of Mr. and Mrs. W. H. Wingfield and family, Mr. and Mrs. Bill Watson and family and Mrs. Mary Bagby. Mr. Harry Randall has returned to her home in I Douglas, Wy after visiting her mother, Mrs. Iva Covington  and family. Mr. and Mrs. Dennis Torrence, Zane and little friend I visited Mrs. J. L. Torrence j Sunday afternoon. Visiting Mr. and Mrs. Robert j Coleman last week were Mrs. , Janie Chernault and daughter, Evelyn, and Mrs. Annie Garrell. Mr. Bobby Smith visited in this home Saturday night. Mr. and Mrs. L. L. Webb and Miss Joyce Webb were visitors Thursday night of the W. H. Wingfields and Mrs. Mary Bagby. Mr. and Mrs. Raymond Franklin and Mr. and Mrs. Dillard Franklin visited their mother, Mrs. Mattie C. Franklin at the Camelot Hall Home in Lynchburg Sunday. Visiting Mrs. Mary Bagby Sunday afternoon were Mr. and Mrs. James Woodall, Mr. and Mrs. Thomas Woodall and Lisa and Walter Wingfield. Others calling in this home during the week were Mrs. M. L. Covington, Katherine and Julia Wingfield, Mr. and Mrs. Alfred Almond and Mrs. Delorious Deaner."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family, Mr. and"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family, Mr. and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [579.36, 359.15, 724.35, 660.29], "bbox_id": "499283d94a", "file": "TimesVirginian_1976_0295.pdf", "page": 1, "text": "Woodson for her birthday Saturday. Mr. and Mrs. R . G. Austin and Tom visited Mrs. C. R. Banton Sunday evening. M rs. Raymond Franklin visited in the home of M r. and Mrs. Thomas Woodall and family Thursday. William Wat son was a supper guest of T.ufl Woodall one night last week. Mr. and Mrs. Roy Williams of Lynchburg visited Mr. and Mrs. W. H . Wingfield and family Sunday afternoon. Mr. and Mrs. Kenneth Deaner called in this home Sunday night. Mrs. Mattie C . Franklin returned home last week after spending some time with her daughter, Mrs. Sam McFall and family, of Lynchburg. Each of us are praying Mrs. Franklin may soon be feeling better. M r. and M rs. Kenneth Deaner and fam ily have returned home after thejy"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H . <mark>Wingfield</mark> and family Sunday afternoon."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H . <mark>Wingfield</mark> and family Sunday afternoon."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [293.05, 815.85, 440.37, 1112.43], "bbox_id": "a664228883", "file": "TimesVirginian_1978_0008.pdf", "page": 1, "text": "Woodalls parents, Mr. anl Mrs. Clarence Coffey, of Covington. Mr. Woodall was a patient in the Emmett Memor ial Hospital in Clifton Forge for several days for examinations and test. We pray he may soon be feeling better. Mrs. loan Mayberry, Mrs. Kenneth D eaner, Delorious Ann, Dawn and Stuart Deaner, Mr. and Mra. Bill Watson, William and April Watson, Kenqeth Wingfield were sup per guests of Mrs. Mary Bagby Monday night. Calling in this bongo. Monday w ereM r. fgd Mrs Twyman Ba0pjtau8A Mrs.Itfgrkm Arth M r. and Mrs. w . H. Wingfield and family had as their dinner geusts Monday night Mr. and Mrs. Billy Inge. -R ev. and Mrs. W. H- Elder and Miss Patrick Elder visited in the homes of Mrs. Mary Bagby and Mr. and Mrs. W. H. Wingfield and family last week."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and April Watson, Kenqeth <mark>Wingfield</mark> were sup per guests"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and April Watson, Kenqeth <mark>Wingfield</mark> were sup per guests"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2020.08, 195.81, 2170.01, 618.39], "bbox_id": "63d5ff89b4", "file": "AppomattoxNewspapers_1971-1973a_0402.pdf", "page": 1, "text": "Woodall wedding at Chestnut HiU Baptist Church in Lynch burg Saturday afternoon. Mrs. Sadie Beard of Bedford,  is spending some time with Mr. and Mrs. H. W. Jenkins. Mr. and Mrs. W. H. Wing field and Miss Julia Wingfield spent Tuesday night and Wed nesday with Mr. and Mrs. James Waldron and family, of Bedford. The family of the late Mr. and Mrs. Ernest Smith held their family reunion Sunday with Rev. and Mrs. Otis Smith. Visiting Mrs. C. R. Banton Sunday afternoon were Rev. and Mrs. J. R. Darden and two chil dren, of Lyndhurst, Va., Mrs. Peggy Hartness and Mrs. Vir ginia Shaw and daughter, of Phe- nix. Mr. and Mrs. Carlton Smith and family, of Richmond, and Mr. and Mrs. Calvin Smith and am ily, of Charlotte, N.C., were week end guest of their parents, Rev. and Mrs. Otis Smith.The Calvin Smiths are spending this week in this home. Mrs. Richard Thorman, Mrs. Raymond Franklin, Wesley, Ri cky and Pam and Mr. and Mrs. Ronnie Woodall called in the home of Mrs. Charlie Bagby Monday. The groups providing special music at the Hollywood revival were a quartet from Spout 3Pring. A quartet from Memor-"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "field and Miss Julia <mark>Wingfield</mark> spent Tuesday night and"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "field and Miss Julia <mark>Wingfield</mark> spent Tuesday night and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2353.46, 233.74, 2503.99, 719.42], "bbox_id": "1bbb176e33", "file": "TimesVirginian_1981a_0066.pdf", "page": 1, "text": "Woodall. Mrs. Woodall, Lisa and M s. Bagby called in the home of Mr. and Mrs. Andy Davis and Robin Sunday night. Mrs. Delouris Deaner, Delo rious Ann, Dawn and Kenneth Deaner visited Mrs. W. H. Wingfield and Miss Julia Wingfield Sunday night. Mr. and, Mrs. Monroe Webb and Keith visited Mr. and Mrs. Willie Craft and family Sunday afternoon. They were supper guest Sunday night of Mr. and Mrs, Jim Webb and family of Pamplin. Were sorry Mathew Webb, son of Mr.- and Mrs. Donald Webb Has been on the sick list but glad he is feeling better.- Mrs. Jessie Coles of Lynch burg and Mrs. Loveline Scruggs of Cullen recently spent sometime with their sister, Mrs. Shirley Carson. Mr. Ryland Mayberry of Newport News visited his sister, Mrs. Kenneth Deaner and family Saturday. He and Mrs. Mayberry spent the week end with Mr. and Mrs. Roy St. John of Charlotte Court House, Lisa Woodall celebrated her 10th birthday the 8th of Feb. and not the 18th birthday as was stated in last weeks paper. Visiting Mr. and Mrs. Robert Coleman during the week were Mrs. Janice Chernault,- Mrs. Evelyn McCormick, Mrs. Edna  Anderson, Mrs. Frank Han cock, Mrs. J. L. Torrence and Mr. and Mrs. Calvin Smith. Mrs. W. T.. Covington and Mrs. D.. R. Turns were luncheon guest Thursday of Mr. and Mrs. ElliottTorrence and"}, "highlight": {"text": {"matched_tokens": ["Wingfield", "Wingfield"], "snippet": "visited Mrs. W. H. <mark>Wingfield</mark> and Miss Julia <mark>Wingfield</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield", "Wingfield"], "snippet": "visited Mrs. W. H. <mark>Wingfield</mark> and Miss Julia <mark>Wingfield</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1837.9, 1620.32, 1958.49, 1717.17], "bbox_id": "85a6952fc2", "file": "AppomattoxNewspapers_1892-1898a_0195.pdf", "page": 1, "text": "Wood, J. .. .................................... .. W alker, Wms E state ........................ W right, P ry o rs E state ..................... W orsham, Lewis.................................. W atkins, Jo h n ............... . ....................  W hitem an, Geo. W. and w ife .......... W ebb, Nancy M................... . ............... W ebb.M erry and S. H. G oin ............ W athall, H. A ....................................... Wingfield. Wm. A ............................... W atkins, Macca        t v  W right,B.F Tr. lor K. H u rt  chn W atson, M eredith............................... W heeler, C. . ...................................... . W heeler, J. .. ........................................ W atkins. Jas. and w ife......................"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "W athall, H. A ....................................... <mark>Wingfield</mark>. Wm. A ............................... W atkins,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "W athall, H. A ....................................... <mark>Wingfield</mark>. Wm. A ............................... W atkins,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [901.46, 981.04, 1041.61, 1159.28], "bbox_id": "68f5caa49e", "file": "AppomattoxNewspapers_1974-1975a_0036.pdf", "page": 1, "text": "womanless beauty contest, carnival, camp Olympics, best dressed tribal chiefs, and best tribal songs and years. In addition, each afternoon cam pers took part in games and sports as they competed with members of opposing tribes. Campers are assisted by teen 4-Hers designated as Junior Leaders at 4-H Lamp. Junior Leaders assisting with the 1974 camp were Cynthia Hix, Lisa Dickerson, Pam Moore, Donna Paulette, Mike Hancock, Bax ter Parris, Ricky Wingfield and Joe Ford."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Bax ter Parris, Ricky <mark>Wingfield</mark> and Joe Ford."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Bax ter Parris, Ricky <mark>Wingfield</mark> and Joe Ford."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [471.41, 672.49, 1943.5, 885.77], "bbox_id": "5b93e5da06", "file": "AppomattoxNewspapers_1952-1954a_0484.pdf", "page": 1, "text": "Wo regret to hear of the illness of Mr. Andrew Wingfield. He is at the home of his daughter in Rich mond. The address is 615 Idlewood Ave., Richmond, Va. Benson as the first witness called. But, here again, the road to agree ment on specific changes m existing laws appears to be a rocky one, with members of the Presidents own par ty immediately indicating their lack of agreement either with him or with each other. When I addressed several farm groups in Virginia last fall I pointed out that in spite of all that has been done to allow farm ers to obtain so-called parity prices, their income level never has been as high as the average for the nation as a whole. Last year, for example, the 20 per cent of our population which is directly depen dent on agriculture, received only 6.3 per cent of the total national"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "illness of Mr. Andrew <mark>Wingfield</mark>. He is at the"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "illness of Mr. Andrew <mark>Wingfield</mark>. He is at the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2345.73, 1588.73, 2520.73, 1645.53], "bbox_id": "5aaf299bde", "file": "AppomattoxNewspapers_1943-1947a_0376.pdf", "page": 1, "text": "with the colors of El Club Espanol. Joyce Wingfield and James Hall were awarded prizes as being the most gayly dressed señorita and señor in the fiesta.  Phylicita Carter, reporter."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "with the colors of El Club Espanol. Joyce <mark>Wingfield</mark> and James Hall were awarded prizes as being the most gayly dressed señorita and señor in the fiesta.  Phylicita Carter, reporter."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "with the colors of El Club Espanol. Joyce <mark>Wingfield</mark> and James Hall were awarded prizes as being the most gayly dressed señorita and señor in the fiesta.  Phylicita Carter, reporter."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [287.05, 235.52, 422.66, 468.96], "bbox_id": "db61e78386", "file": "TimesVirginian_1980a_0289.pdf", "page": 1, "text": "with Mrs. loan Mayberry and Mr, and Mrs. Ryland Mayberry The Mayberrys celebrated Mrs. Delorious Ann Winfgield birthday Saturday night. Mr. L. H. Watson and Mr. Alfped Almond visited Mrs. Estelle Johnson and son, Bertman of Vernon Hill Friday. s  Mr. and Mrs. Bill Watson William and April Wateon were dinner guest of Mr, and Mrs WVH. Wingfield and family Sunday. Mrs. W. E. Inge visited in this home in the afternoon. Mr. and Mrs. Elliott Torrence visited Mrs. A. B. Torrence of Eikton, Va. and Rev. and Mrs. Otis Smith of Ruckersville Saturday."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr, and Mrs WVH. <mark>Wingfield</mark> and family Sunday. Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr, and Mrs WVH. <mark>Wingfield</mark> and family Sunday. Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1879.18, 624.46, 2028.13, 1007.2], "bbox_id": "73a2a02742", "file": "TimesVirginian_1981a_0331.pdf", "page": 1, "text": "with Mrs. Hancocks mother, Mrs. J. L. Torrence. Mrs. Thomas Woodall. and daughter, Lisa spent Friday night and Saturday with her parents, Mr. and Mrs. Clarence Coffey of Covington. Mrs. Kenneth Deaner and Miss Dawn Deaner visited Mr. and Mrs. L. L. Webb and Miss Joyce Webb Saturday after noon. . Mr. and Mrs. Donald Webb visited Mrs. Earl Beasley in the Baptist Hospital recently. We are so glad to hear Mrs. Beasley has returned home. We wish her a speedy recovery. Mr. and Mrs. Webb also visited Mr. H . W. Jenkins while he was in the hospital. Mr. Walker Webb and Mr. Richard Webb were visitors Wednesday afterboon of Mr. H. W. Jenkins at his home. Mrs. Madeline Inge and Mrs. W. H. Wingfield visited Mr. Jenkins Tuesday. Mr. and Mrs. Alex Adamccyk of Pennsylvania spent the weekend of Sept. 27 with their children, Mr. and M ia Terry Brennen and family. They aU visited Mr. and Mrs. Monroe Webb Sunday.. night...  Mr. Walker Webb visited in the Monroe Webb home last"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> visited Mr. Jenkins Tuesday."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> visited Mr. Jenkins Tuesday."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [722.63, 429.3, 862.38, 754.14], "bbox_id": "90dc46a1df", "file": "AppomattoxNewspapers_1974-1975a_0267.pdf", "page": 1, "text": "with Mr. and Mrs. W. H. Wingfield and family. Supper guest of Rev. and Mrs. Otis Smith Sunday night were Mrs. J. L. Torrence, Mrs. James Conner, Mr. and Mrs. Bennett Gilliam, Mrs. W. T. Covington and Mr. and Mrs. Robert Coleman. Mr. and Mrs. Thomas Woodall and Lisa were supper guest Sunday night of Mrs. Mary Bagby. Mr. and Mrs. Alfred Almond called in this home last week. Mrs. Margaret OBrien and Mrs. Emma Lemon called in the home of Mr. and Mrs. Jenkins Sunday evening. Mr. and Mrs. Jean Deaner, of Lynchburg, were visitors Sat urday night of Mr. and Mrs. Kenneth Deaner and family. Dinner guest Sunday of the H. W. Wingfields were De- lorious and Dawn Deaner, Kenneth Wingfield, Mr. and Mrs. Bill Watson and family and Mrs. Mary Bagby. Mrs. M. L. Covington spent Tuesday in this home."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family. Supper guest"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family. Supper guest"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2309.25, 194.2, 2442.68, 996.9], "bbox_id": "55e848cb5f", "file": "TimesVirginian_1980a_0208.pdf", "page": 1, "text": "with his father, Mr. L. H. Watson, Sr. on Fathers Day week end. Miss Jane Irby spent Saturday in thishome. Mr. Walker Webb visited Mr. and Mrs. W. H. Wingfield and Mrs. Mary Bagby Monday. Mi, and Mrs. Whit Woodall were visitors in these homes Tuesday. Mr. and Mrs. Rufus Wingfield of Roanoke spent a few days in Appomattox last week they visited the W. H. Wingfields and Mrs. Mary Bagby. Visiting the W. H. Wingfields last week were Mr. and Mrs. L. L. Webb, Mr. Andy Davis, Mrs. Paul Franklin and children, Mr. and Mrs. Sammie Inge, Mrs. W. E. Inge, the Kenneth Deaners, Thomas Woodalls and Mr. and Mrs. Bill Watson and children. - Were so happy Mrs. J. L. Torrence, Sr. is home from the nospital and improving nicely. Visiting Mrs. Tor rence since her return home were Mr. and Mrs. Jessie Torrence, Jr. and grandchild of Richmond, Rev. Whitie Davis, Mrs. Mabel Fergu son, Mrs. Bill Conner, Mr. Housily Inge. Mr. Larry Inge and Mr. Allen Tor rence. Visiting Mrs. W. T. Covington last week were Mrs. Russel Conner, Mrs. Robert McWilliams, Mrs. M. L. Covington, Mrs. Thomas Woodall and Lisa. Wyirouo glad Mr. Robert Coleman isgetting stronger all the while. Visiting him and Mrs. Cpleman were Mrs. Janie Chernault, Mrs. Jen- uette Burge, M r Tom Edd Woodson, Mr. and Mrs. Calvin Smith, Bobby and Tommie Smith. Mr. H. W. Jenkins was a dinner guest Sunday for Fathers Day of Mr. and Mrs. Tim Carter of Madison Heights. Mr. and Mrs. Elliott Torrence were served a delicious meal fpr Fathers Day on Saturday night by all their children Mr. and Mrs. Monroe Webb and Keith were dinner guest Sunday, Fa-  thers Day of Mr. and Mrs. Marshall Goin and family. Visiting Mr. and Mrs. Webb last week were Mr. Scott Sheets, Mr. Walker Webb and Mr. j. W. Jenkins.  Miss Dawn Deaner re turned home Saturday after spending a week in Newport News with her grandmother Mrs. loan Mayberry."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and Mrs. Mary Bagby"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and Mrs. Mary Bagby"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1611.34, 612.5, 1759.29, 1040.83], "bbox_id": "6f8b0a7f08", "file": "AppomattoxNewspapers_1971-1973a_0620.pdf", "page": 1, "text": "with her mother, Mrs. Anne C. Smith. Visitors in town for the Williams-Savitz wedding last Saturday night were Mrs. Nancy T. Williams and Em- mette, Richmond, Mrs. Jane Wingfield, Lynchburg, Mr. and Mrs. Bob Perrin and family of Feasterville, Pa., Mr. and Mrs. John Earl Wood and family, Colonial Heights, Va., Mr. Malcolm Inge and Mr. Cliff Welch, V.P.I. Blacksburg, Miss Sally Farrar, Mary Baldwin College, Staunton, Miss Anne Farrar, Stratford College, Danville, Mr. Richard F. Williams, Jr., Newport News, Mr. and Mrs. Isaac Savitz, Mr. Isaac Savitz, Jr., Mr. Ken- Savitz, Columbia, S. C., Mr. and Mrs. Robert Williams, Randalltown, Md., Mr. Charles Abbitt, V.P.I., Mrs. John Rush, Kenbridge, Mr. Gary Lyons, Richmond, Mr. Norman Walk er, W.M. Grandmother Ear- heart, Columbia, S. C. Miss Mary Kinzie, Bridgewater, Va., and Mr. and Mrs. Fred Garick, Columbia, S. C. and Mr. and Mrs. S. Savitz, St. Matthews, S. C. Mr. and Mrs. A. B. Bryant of Severena Park, Md. and their son from V.P.I. spent the week end with her mother, Mrs. C. I. Harvey, Darlington Heights."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "mette, Richmond, Mrs. Jane <mark>Wingfield</mark>, Lynchburg, Mr. and Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "mette, Richmond, Mrs. Jane <mark>Wingfield</mark>, Lynchburg, Mr. and Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2277.38, 165.28, 2419.19, 284.8], "bbox_id": "1d76743b21", "file": "TimesVirginian_1978_0506.pdf", "page": 1, "text": "with her grand mother Mrs. Phyliss Davis of Scottsville. Among those nalHng last week in the home of Mrs. Mary Bagby were Rev. Dan Menser, Mrs. Shirley Carson, Shirley Franklin, R oberta A ustin, Katherine and Julia Wingfield and Delorioua and Dawn Deaner. _______ 1"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "ustin, Katherine and Julia <mark>Wingfield</mark> and Delorioua and Dawn"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "ustin, Katherine and Julia <mark>Wingfield</mark> and Delorioua and Dawn"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2372.6, 226.43, 2516.34, 957.37], "bbox_id": "27db21583e", "file": "AppomattoxNewspapers_1962-1965a_0088.pdf", "page": 1, "text": "with a Bill pf Complaint in a Chancery Suit in the style of Fannie Bigbie and others vs George C. Bigie and others, in the Circuit Gout of .the County of Appomattox, State of Virginia, which parcel of land is situated in Cloverhill Magisterial District of Appomattox County, Virginia and lies about four miles west of the village of Vera in the said County, and which parcel of land contains 132 acres. 3 rods and 20 poles and being the identical property that was deeded unto tlie said John R. Bingham by Thomas D. Christian, Commis sioner, by a deed dated Decem ber 7,1899 of record In the Clerks Office of theCircuit of Appomat tox County in Deed Book No. 5 at page 410 thereof. Reference is expressly made to the above mentioned plat of survy for a more complete and accurate de finition of the parcel of land hereby conveyed. SECOND All of that certain tract and parcel of land contain ing 147 acres, more or less with improvements thereon, which parcel of land is situated in Clov erhill Magisterial District of Ap pomattox County, Virginia and is situated about seven miles north east of the court house and ad joins the above described tract of land on which Morgan place and others, and being the same tract of land Hi which one A. S. Wingfield died and which the said A. S. Wingfield owned at the time of his death many years ago, and which was conveyed to the said A. S. Wingfield by A.H. Clement, Commisioner, and F. F. Atwood, by a deed dated Aug- gust 6, 1912 of record in the Clerks Of ice of Appomattox County in Deed Book No. 13 at page 452 and being the same parcel of land that was convey ed unto the said R. J. Bingham by H. B. Totty and others, by a deed dated September 14, 1921, of record in the Clerks Ofice of Appomattox County, Virginia in Deed Book No. 21 at page 435 thereof. Reference is expressly made of each instrument herein mentioned for a more complete and acurate definition of the 147 acres hereby conveyed. The two above described tracts being the real estate that was owned by the said J. R. Bing ham at the time of his death on June 1, 1938. The above described tracts of real estate each have situated thereon dwellings in good condit ion. Each of the said tracts have val uable Umber standing thereon. FOR INFORMATION AS TO HOW TO REACH THIS PRO PERTY, CONTACT GEORGE"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "which one A. S. <mark>Wingfield</mark> died and which the"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "which one A. S. <mark>Wingfield</mark> died and which the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1232.9, 597.84, 1418.03, 790.28], "bbox_id": "734b1941f3", "file": "TimesVirginian_1984a_0151.pdf", "page": 1, "text": "with 89 votes and T.C. Ugdn, retired merchant, was re-elected with 37 votes, .  ,V  o .  J.A . W illiams, form er Pamplin Mayor, recefyuda sent on council with 15 voids Jane Wingfield, retired from the Williams home in Lyachbing, was elected to council frith 45 votes, and EstherPrice, Amelia Dress Company employee, won n seat on council with 87 votes Erma M. Collin and Margaret Payne were defeated in their bid for seats on Pamplin Tpfrn CouncU. Mrs. Payne was an incumbent. Approximately 120 Pamplin resi- dents w e Registered to vote in Tuesdays election."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "with 15 voids Jane <mark>Wingfield</mark>, retired from the Williams"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "with 15 voids Jane <mark>Wingfield</mark>, retired from the Williams"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2073.08, 378.43, 2232.76, 1539.76], "bbox_id": "7a28bc806b", "file": "AppomattoxNewspapers_1902-1905a_0283.pdf", "page": 1, "text": "winter has disappeared and nature has commenced her work. Spring has returned. Onr neighborhood has been made very sad by deaths both young and yonug and old. Last week there were two burials within a mile of each other and both within three days. Mrs. Peniok and Mrs. Pugh, of whom we speak, were the same age and spsr.t their young days to gether, then after long separation by marriage, a to., we laid to rest near each other. Every one oi Mrs. Pen- ioks grand-children except one fam ily have lost a grandparent on both both their mothers and fathers side, within a year, and there were six families. Mr. Chap Sims, of Roanoke, vis ited his hoipe last week. Mr. A. S. Woolridge spent a few days in Roanoke last week, also vis ited his brother, Mr. G. W. Wool ridge, at Lowry, while he wm gone. Mrs. Archer Woolridge has just finished a quilt oontaiuing 2,818 pieces. She must have a lot of pa tience. New Light school has olosed. Tbe entertainment was held at Evegreen, in Thornti ns hall, on Friday-night, April 1st., with great success. The hunse was decorated with white and evergreens, and ere the time appoint ed for tbr exc eWs v begin th bouse was c owded. 1 ue . grauii e was as follow Welcome Add teeJ-e- e Xt-ples.! Trouble With Opening Pi e. .ity 2 girls. Somebodys F uhh . Earl Kiumr. Courtship under Dillcult. .2 gills 1 buy. At School and at Home.Walter Harvey. Recitations bv 7 children. Little Feilnw.ticker Cheatham. Japanese Parasol Drill,By II girl, Papas Calendar.Beatrice Inge. Will Winter Never Be 0 er?r-Eliza Sullivan. Big Holler School.By 7 boys and 8 girls. Gods Eye.Ruth Hirvey. Speaking Pieces.Bernice Rutledge. Pitiful Cry of Nobodys Child. Myrtioe Cawtliorii. Solo, Nobodys Child.  Mazie Cawborn. The Other Train.Alma McDear- mon. Doll Drill.By 10 little girls. Take a Taler and Wait.Henry Staples. How She Cured Him.2 girls and 1 bpy. Little Gerald. Mary Lou Wingfiela. What Ill Be.By 7 boys. House Cleaning.Tellie Johnson. Fortune Telling.By 3 girls. Smack in School.Loraine LeGrand. Jesus, Lover of My Soul.Annie Ragland. Sermon.By Sam Staples. Flag Drill.By 6 boys and 6 girls. Annt Mandy.Bill Wingfield, tin School Days.Sadie Snell. Seed Babies.By 5 girls. Little Teacher.Earl Farrar. Making an Editor Outen Him.2 boys 1 girl. Learning to Sew.Nora Johnson. 13 United Colonies.By 18 girls. Goodby to School.Beatrice Inge Chorus, God be With you.By School. All separated and went to their homes hoping to meet again. The teacher, Miss Bertha Woolridge, thanks ths patrens through the col umns of this paper, for their co-op eration in tne school work the past winter. Also thanks the pupils for their kindness and obedience. Annie Cheatham was present 100 days and Annie Ragland 99. Success to your paper. L. M April 9."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "6 girls. Annt Mandy.Bill <mark>Wingfield</mark>, tin School Days.Sadie Snell."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "6 girls. Annt Mandy.Bill <mark>Wingfield</mark>, tin School Days.Sadie Snell."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2287.41, 154.46, 2429.9, 282.3], "bbox_id": "26bdd8b0f3", "file": "TimesVirginian_1978_0117.pdf", "page": 1, "text": "winners are Shelia Mullins, Lisa Williamson, Emify Shfea, Susan Booker, David Short, Pam Scruggs, Brett Marston, Ada Hunter, Sherry Wilcox, Cherryl Auston, Janet Smith, Darrell Conner, Janice Foster, Russel Walton, Alex Almond, Carter, Lisa Harrison, Wingfield and Jeffrey Williams. Brett Marston and Janet"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Almond, Carter, Lisa Harrison, <mark>Wingfield</mark> and Jeffrey Williams. Brett"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Almond, Carter, Lisa Harrison, <mark>Wingfield</mark> and Jeffrey Williams. Brett"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [904.09, 177.67, 1044.88, 284.16], "bbox_id": "ed9250c094", "file": "TimesVirginian_1978_0488.pdf", "page": 1, "text": "Wingfield were visitors Sun say of Mr. and Mrs. James Waldron and family, of Bedford. Visiting Mrs. Mary Bagby Sunday were Mr. and Mrs. Thomas Woodall and Lisa, Mrs. M. L. Covington, Mrs. Mary Woodall, Mr. and Mrs. Bobby Wilson, Mr. and Mrs. Steve Wilson and Mr. and Mrs. John"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> were visitors Sun say"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> were visitors Sun say"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2580.71, 1192.23, 2722.81, 1277.13], "bbox_id": "3a4212fcd6", "file": "AppomattoxNewspapers_1962-1965a_0649.pdf", "page": 1, "text": "Wingfield. Three other residents have filed for places on the six-mem ber council, R. L. Bass, E. T. Mitchell, and Harry G. Johnson. Election for town officials is set for Tuesday, June 8, with the gubernatorial election set for July."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>. Three other residents have"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>. Three other residents have"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1747.85, 1394.88, 2063.34, 1474.03], "bbox_id": "eab8a36369", "file": "AppomattoxNewspapers_1915-1918a_0528.pdf", "page": 1, "text": "Wingfield, Ruby Gilbert, Law son Fore. Second GradeJosie Jamer- son, Joe OBrien, C o r r i n n e Hancock, Haiiie Day, Clyde OBrien, Florence Gilbert, ver nie Oden, Richard McDearmon, nate enough to catch a nice I Frankie McKinney, Lticy Oald-"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, Ruby Gilbert, Law son"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, Ruby Gilbert, Law son"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1877.05, 1542.74, 2087.46, 1578.69], "bbox_id": "768ce4908a", "file": "TimesVirginian_1983a_0136.pdf", "page": 1, "text": "Wingfield Real Estot 465231 Rt. 29N Madison Haights AUCTION SIRS alON AUCTION AUCTION AUCTION"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Real Estot 465231 Rt. 29N Madison Haights AUCTION SIRS alON AUCTION AUCTION AUCTION"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Real Estot 465231 Rt. 29N Madison Haights AUCTION SIRS alON AUCTION AUCTION AUCTION"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1906.82, 774.61, 2044.37, 816.76], "bbox_id": "553bb67750", "file": "AppomattoxNewspapers_1974-1975a_0379.pdf", "page": 1, "text": "Wingfield of Lynchburg visited relatives last week end. Our sympathy is extended to the family of Mr. F. M. Alley."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> of Lynchburg visited relatives last week end. Our sympathy is extended to the family of Mr. F. M. Alley."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> of Lynchburg visited relatives last week end. Our sympathy is extended to the family of Mr. F. M. Alley."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [483.88, 1495.82, 626.96, 1505.32], "bbox_id": "c0ce83a1b5", "file": "AppomattoxNewspapers_1905-1912a_0574.pdf", "page": 1, "text": "WINGFIELD NAMED SENATOR."}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark> NAMED SENATOR."}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark> NAMED SENATOR."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1768.54, 456.69, 2245.16, 495.69], "bbox_id": "817d7ab90f", "file": "AppomattoxNewspapers_1955-1957a_0384.pdf", "page": 1, "text": "Wingfield Named Postmaster"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Named Postmaster"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Named Postmaster"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1287.59, 515.78, 1406.68, 532.43], "bbox_id": "f6b50ff33c", "file": "AppomattoxNewspapers_1912-1915a_0229.pdf", "page": 1, "text": "WINGFIELD. LTiwor sena m h 6me."}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark>. LTiwor sena m h 6me."}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark>. LTiwor sena m h 6me."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2353.41, 529.32, 2462.49, 572.4], "bbox_id": "a6abe8d1e1", "file": "AppomattoxNewspapers_1962-1965a_0183.pdf", "page": 1, "text": "Wingfield Is New Member"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Is New Member"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Is New Member"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1404.24, 1346.92, 1451.6, 1382.62], "bbox_id": "4db8927880", "file": "AppomattoxNewspapers_1974-1975a_0278.pdf", "page": 1, "text": "Wingfield ICH CRUSADE"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> ICH CRUSADE"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> ICH CRUSADE"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1641.59, 1786.53, 1787.14, 1825.12], "bbox_id": "1e731aeeb4", "file": "AppomattoxNewspapers_1918-1922a_0504.pdf", "page": 1, "text": "Wingfield I S P l a c e   ham bou8 hk iLkdden  i?630 and Eia"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> I S P l a c e   ham bou8 hk iLkdden  i?630 and Eia"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> I S P l a c e   ham bou8 hk iLkdden  i?630 and Eia"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1421.99, 514.21, 1562.58, 533.21], "bbox_id": "adda801a12", "file": "TimesVirginian_1981a_0244.pdf", "page": 1, "text": "Wingfield heads"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> heads"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> heads"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2107.18, 176.77, 2250.9, 327.09], "bbox_id": "0f6e25d59f", "file": "TimesVirginian_1976_0465.pdf", "page": 1, "text": "Wingfield had 6, James Robinson had 5, Gerald Booker had 4,,Ken Belter had 2, and Bill Shorter and Tony SneD had leach. A proof of the pressure the Raiders applied shows in the 21 for 73 shots that Nelson had. The Raiders made 15 for 45. In foul shots, Appomattox made 60 to a Nelson 26. Nelson had 22 turnovers, the Raiders only 1.5. If you missed the game"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> had 6, James Robinson"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> had 6, James Robinson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [914.9, 1332.98, 1248.68, 1455.26], "bbox_id": "2205d16d10", "file": "AppomattoxNewspapers_1902-1905a_0157.pdf", "page": 1, "text": "Wingfield, deceased, to his five daughters, charged with the payment of said debt and to have said real estate sold, and the proceeds properly disposed of. And an affidavit having been made and filed that the residences of the defendants Charles LL Wingfield son of Thos. H.j. Toreosa Wing- tiiild, Sarah F. Blake, John W. Wiilgfield, and G. A. Wingfield are unknown, after due dili- ge nee on tue part o f the complainant io as certain the same, it is ordered that said de fen. fonts do appear here within fifteen days l alto.- due publication hereof, and do what ii , . _ may .ho necessary to protect their interest in j Ask any Southern Railway Agent for Sum this saiit. And it is further ordered that a t mer-Homts Folder desoi-inHv .. _ ____ copy ,hereof be published once a week fo r i   oroestolaer, descriptive of the many four successive weeks in the Appomattox E Delightful Resorts reached by the Soutnern and Bi ickingham T imes , a newspaper pub- I Ron lished i a this State, and that a copy be posted1 at the .front door of the courthouse on the"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, deceased, to his five"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, deceased, to his five"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [704.38, 949.27, 1859.48, 1083.8], "bbox_id": "e549b9dae1", "file": "AppomattoxNewspapers_1939-1943a_0047.pdf", "page": 1, "text": "WINGFIELD BOBBITT was i. Hops and friends in ihrAT CHEVROLET s  í f DEALERS"}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark> BOBBITT was i. Hops and friends in ihrAT CHEVROLET s  í f DEALERS"}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark> BOBBITT was i. Hops and friends in ihrAT CHEVROLET s  í f DEALERS"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2280.62, 1445.6, 2425.61, 1498.3], "bbox_id": "9613faabaa", "file": "AppomattoxNewspapers_1949-1952a_0010.pdf", "page": 1, "text": "Wingfield Baseball Mgr."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Baseball Mgr."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> Baseball Mgr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [667.71, 1238.89, 817.78, 1248.39], "bbox_id": "95d35faf62", "file": "AppomattoxNewspapers_1918-1922a_0589.pdf", "page": 1, "text": "Wingfield and Raph Adams, of"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> and Raph Adams, of"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> and Raph Adams, of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1166.4, 286.5, 1346.4, 503.84], "bbox_id": "f467a7c76a", "file": "AppomattoxNewspapers_1960-1962b_0059.pdf", "page": 1, "text": "Wingfield, and Plans fo r My F uture Home, by Nancy Chandler. Wednesday evening, My Church was the topic fox discussion a t the Prayer  Meeting hour. Four partici pants discussed the values they have received from the various organizations of the church, and made suggestions Cor strengthening these th at they might help the in dividual grow spiritually. Thiursdlay evening, the W. M. U, m eeting will be u-ndler the direction of Mngg Audrey Evans, w ith the young ladies carrying on- the busi ness meeting and the program o f the evening. Friday evening, the Youlth Ban quet will be held, with Maytime in the Beautiful Garden as the theme. Randy Almond will be m aster of"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, and Plans fo r"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, and Plans fo r"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1621.2, 214.2, 1754.36, 540.33], "bbox_id": "033261c6cf", "file": "TimesVirginian_1980a_0304.pdf", "page": 1, "text": "Wingfield and Mrs. W. E. Inge visited Mr. Walker Webb- at the hospital in Lynchburg Monday. Among those visiting Mrs. C. B. Banton and Mr. and Mrs. Grover Smith during the week end were Mrs. Mildred Smoot, Mrs. June Wood and two sons of Amherst, Mr. and Mrs. John Goin, Bev. Dan Menser, Mr. and Mrs. Joe Goin and Mr. and Mrs. Grover Beasley Jr. Mr. and Mrs. Grover . Smith and Mrs. C. B. Banton visited Mr. and Mrs. B. G. Austin and Tom last week. Visiting Mrs. Mary Bagby last week and Sunday were Mr. and Mrs. Grover Smith, Mr. and Mrs. Richard Webb,  Mrs. June Fisher, Mr. L. H. Watson, Mr. and Mrs. Alfred Almond, Mrs. W. E. Inge, Mrs. Kenneth Deaner, Miss Dawn Deaner, Mr. and Mrs. W. H. Wingfield and Julia, Mr. and Mrs. Thomas Woodall and Lisa, Mr. Jim Woodall and Mrs. Raymond Franklin."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> and Mrs. W. E."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> and Mrs. W. E."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2164.55, 217.53, 2291.73, 278.43], "bbox_id": "375d4b9d48", "file": "TimesVirginian_1980a_0105.pdf", "page": 1, "text": "Wingfield and Miss Julia Wingfield spent he week end in Roanoke with Mr. and Mrs. Rufus Wingfield and family. Mr. and Mrs. George Inge,"}, "highlight": {"text": {"matched_tokens": ["Wingfield", "Wingfield", "Wingfield"], "snippet": "<mark>Wingfield</mark> and Miss Julia <mark>Wingfield</mark> spent he week end in Roanoke with Mr. and Mrs. Rufus <mark>Wingfield</mark> and family. Mr. and Mrs. George Inge,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield", "Wingfield", "Wingfield"], "snippet": "<mark>Wingfield</mark> and Miss Julia <mark>Wingfield</mark> spent he week end in Roanoke with Mr. and Mrs. Rufus <mark>Wingfield</mark> and family. Mr. and Mrs. George Inge,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1848.45, 531.46, 1994.58, 892.59], "bbox_id": "529fc7ff47", "file": "AppomattoxNewspapers_1971-1973a_0448.pdf", "page": 1, "text": "Wingfield and Miss Julia Wingfield called in the home of Mrs. M. L. Covington Sunday afternoon. Mr. Thomas Woodall spent the week end with Mrs. Charlie Bagby. Others visiting Mrs. Bagby Saturday were Mrs. M. L. Covington and Mr. and Mrs. Dallas Mangus. Mrs. W. T. Covington, Mrs. Robert Coleman, Mrs. J. L. Torrence, Rev. and Mrs. Otis Smith, Mr. and Mrs. Leslie Turns and Mr. and Mrs. Bennett Gilliam were supper guest Wednesday night of Mr. and Mrs. Raymond Turns of Rustburg. The occasion was Mr. Turns birthday. Mr. and Mrs. Cliff Wood of Richmond spent Saturday afternoon with Mrs. Woods aunt Mrs. C. R. Banton. Miss Julia Wingfield was a dinner guest Wednesday of Mrs. W. T. Covington. Mr. and Mrs. L. D. Flick and Mr. and Mrs. Bill Watson visited Mrs. Charlie Bagby Sunday afternoon. Mr. and Mrs. Joe Goin were visitors of Mrs. C. R. Banton Sunday afternoon."}, "highlight": {"text": {"matched_tokens": ["Wingfield", "Wingfield"], "snippet": "<mark>Wingfield</mark> and Miss Julia <mark>Wingfield</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield", "Wingfield"], "snippet": "<mark>Wingfield</mark> and Miss Julia <mark>Wingfield</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [705.09, 222.39, 834.95, 284.23], "bbox_id": "f2aced985e", "file": "TimesVirginian_1980a_0183.pdf", "page": 1, "text": "Wingfield and family. Mrs. MU Watson and April were luncheon guest of Mrs. Mary Bagby Wednes day. Miss Alease Covington of Richmond and Mrs. Lou"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> and family. Mrs. MU Watson and April were luncheon guest of Mrs. Mary Bagby Wednes day. Miss Alease Covington of Richmond and Mrs. Lou"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> and family. Mrs. MU Watson and April were luncheon guest of Mrs. Mary Bagby Wednes day. Miss Alease Covington of Richmond and Mrs. Lou"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1102.81, 174.01, 1469.8, 204.01], "bbox_id": "6f7cc83dd0", "file": "AppomattoxNewspapers_1974-1975a_0066.pdf", "page": 1, "text": "Wingfield All-Around Atlilei"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> All-Around Atlilei"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> All-Around Atlilei"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2281.31, 1589.72, 2448.64, 1657.41], "bbox_id": "45368b1cee", "file": "AppomattoxNewspapers_1949-1952a_0010.pdf", "page": 1, "text": "Wingfield, a native of Appomat tox, Va., played football and base ball while attending Appomattox High School. Later he attended Hargrave Military Academy, where he won the school letter in base ball."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, a native of Appomat"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark>, a native of Appomat"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1396.09, 557.57, 1588.67, 567.57], "bbox_id": "64d55c288c", "file": "AppomattoxNewspapers_1974-1975a_0404.pdf", "page": 1, "text": "Wingfield - Vera, Hollywood  Buckingham"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> - Vera, Hollywood  Buckingham"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "<mark>Wingfield</mark> - Vera, Hollywood  Buckingham"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1977.82, 678.33, 2084.44, 688.83], "bbox_id": "54ee946c86", "file": "AppomattoxNewspapers_1947-1949a_0430.pdf", "page": 1, "text": "WINGFIELD - TERRY"}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark> - TERRY"}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark> - TERRY"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [695.77, 617.71, 824.28, 627.21], "bbox_id": "390759a0d1", "file": "AppomattoxNewspapers_1943-1947a_0068.pdf", "page": 1, "text": "WINGFIELD  MOORE"}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark>  MOORE"}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "<mark>WINGFIELD</mark>  MOORE"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1567.35, 993.52, 1716.57, 1262.01], "bbox_id": "7a8b0826f2", "file": "TimesVirginian_1981a_0283.pdf", "page": 1, "text": "Willie Craft and family last week. Miss Becky Webb was real sick a few days last week with  virus, but were glad to hear she is all right now. Mr. W alker Webb visited Mr. Monroe Webb Thursday mor ning. Calling in the Mary Bagby v house last week were Mr. and Mrs. Jam es Maxwell and Becky, Mrs. Andy Davis, Mrs. Monroe Webb, Becky Webb, Walker Webb,- Jimmie Drink ard, Jim Webb, Thomas Woodall Katherine and Julia Wingfield, Miss Dawn Deaner, Mr. and Mrs. Bill  Watson, William and April Watson. Miss Dawn Deaner carried her grandmother, Mrs. loan R. Mayberry to see Mrs. Mae Slough nd family Sunday afternoon and Wednesday they visited relatives and friends in Lynchburg and Concord."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Woodall Katherine and Julia <mark>Wingfield</mark>, Miss Dawn Deaner, Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Woodall Katherine and Julia <mark>Wingfield</mark>, Miss Dawn Deaner, Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1299.83, 943.84, 1445.3, 1018.94], "bbox_id": "9ba8697948", "file": "AppomattoxNewspapers_1912-1915a_0263.pdf", "page": 1, "text": "William Rush and Miss Loveiane f Harvey, of Appomattox county, were lurried in Lynchburg by the Rev. R, iM, Chandler, of Centenary Methodist Church. Miss Louise Wingfield, of rCharlotte county, was the maid cf honor, and Oscar Baker, of Lynch- i burg, best man."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Methodist Church. Miss Louise <mark>Wingfield</mark>, of rCharlotte county, was"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Methodist Church. Miss Louise <mark>Wingfield</mark>, of rCharlotte county, was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1791.34, 535.33, 1962.53, 1730.97], "bbox_id": "8717d70ffa", "file": "AppomattoxNewspapers_1939-1943a_0358.pdf", "page": 1, "text": "William Pitzer Gills, who died at his home, Locust Grove, Friday morning, was the son of James Thomas and Cornelia Terri 1 Pitzer Gills. Though jiorn in Buckingham county, he moved to Appomattox in his boyhood on account of the death of his father. He then made his home with his uncle, the late Will iam Gills, who for many years was treasurer of the the county. He at tended the first public school evei taught in this county, Judge David A. Christian being the teacher. Mr. Gills engaged in various aeti- ties until the infirmities or age made, it necessary for him to retire from, public life. He was a senool trus.et of Appomattox county also serving as clerk to the school board, man carrier on R. F. D. No. 2, employed at one time by the Norfolk and Wes tern Railway, besides managing his arm near Appomattox. He was a iason and a Woodman of the  orld, and a Democr t who was un- werving in his par loyaly. Fii nany-lyears he was a faithful dea- on of Liberty Baptist church and teacher in the Sunday School. The deceased was a man whose lie was marked by fidelity to prin- ple. His was a goodly heritage of u ture and Godliness from an an cestry distinguished in the early history of America. Those who came in con4act with him were impressed by the deep spirituality of his nature. t  The funeral took place Sunday afternoon at Liberty Baptist church The Rev. H. Frederick Jones, the pastor, and the Rev. William May- field Thompson, a former pastor, conducting the services. The choir ,f the church sang Mr. Gills favor ite hymn, Rock of Ages. Tenny sons immortal poem, Crossing the Bar, was read and played on the pipe organ as a processional. Inter ment took place in the family plot in Liberty Cemetery, that part of the service. being conducted by the Masonic order. A host of friends and acquaintances, with many beautifa floral tributes attested to the love and high regard in which Mr. Gills was held in Appomattox and through out the state. Ihe active pallbearers were A. T. Inge, C. S. McDeormon, R. L. j Burk?, A. R. Harwood, J. C David son, N R. Featherston, B. G. An derson, Luther J. Morris. Honorary pallbearers included R. B. Hudgins, J. H. Lucado, T. W. Moses, Charles T. Moses, Pat Chand ler, L. Crawley, C. W. Smith, W. Stratton Taylor, Jennings Ferguson. T. Ed Owen, W. J. LeGrand, Dr. D. A. Christian, Dr. C. G OBrien, S L. Ferguson, Jr., J. H. OBrien, W. B. Caldyell, F. L. Murphy, E. VR-y Smith, Andrew Wingfield, H. C. Pul iam, Uoel Flood, Don Moses, John T. Cole, J. W. Caw son, John A. Iweedy, R. W. S an- ey, H. M. Burge, R. Travis Lee, F. A. OBrien, R. Edward OBrien, VV. W. OBrien, T. H. Inge, M. C. Imith, S. Guy Smith, R. C Wagner, J. A. Burke, Charlie Johnson, Pit zer Johnson, William Burke, D. A. Conner, D. E. Turnes, Jesse L. Tumes, James W. Caldwell, Harry Jenkins, Leonard Carter, E. Percy Sea, Odel! Howerton, Edmund H. Cawthorn, O. Cleveland Paulette. T. Morton Rosser, R. W. Smith, Leslie N. Ligon, L. E. Smith, C. N. Abbitt, J R Horsley, J. E. Chick, W. L. Brown, L. F. Ferguson, O P. Farrar, J. H. Cheatham, Dr. L L. Gayle, Dr. C. F. James, Robert Hubbard, Fitz Martin, Calvin H. Robinson, George F. Abbitt, Jr., T. W. Ferguson, Lester B. Harvey, J. D. Plunkett. Mr. Gills was first married to Miss Ella Pittman, who died some years ago. Two of the children of this union survive him, Henry Pitzer Gills of Marion, Virginia, and Mr 3 . Luth er B. Pittman, of Richmond. His second wife, who survives him, was Miss Albertha OBrien Of this mar riage, six children wire torn, James, passing away in inf.-ncy. The five living are Professor Allen Gils, of Clarksville Miss Cornelia Kyle Gills, of Appomattox Shelby Ken- nard Gills, of Richmond Mrs. Will iam Haller Copenhaver, of Marion Mrs. R. Banks Frazier, of Richmond. He also leaves five grandchildren, Mrs. R. S. Simpkins, of Chrisians- burg, Va. Mrs. Allen B. Pearcy, of Bristol, Penn. Joseph Pitzer Gills, of Pulaski, Va., Eloise Ogden, and Mary Joan Gills, of Clarksville, Va., and one brother, James T. Gills, of Lynchburg, his only other brother being the late Edmond Ernest Gills, of Appomattox.  And death itself, to him, was but The wider opening of the door Tha had been opening, more and more, Through all his life, and nevei as stiut. . . ."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "E. VR-y Smith, Andrew <mark>Wingfield</mark>, H. C. Pul iam,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "E. VR-y Smith, Andrew <mark>Wingfield</mark>, H. C. Pul iam,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1645.88, 635.79, 1822.06, 953.03], "bbox_id": "59a6b9281b", "file": "AppomattoxNewspapers_1955-1957a_0589.pdf", "page": 1, "text": "William Hunter Simms, of Tole do, Ohio, is spending a two week vacation with his brother, Mott Simms, of Richmond. He is also visiting another brother, Robert Simms, of Spout Spring. iMr. and Mrs. Robert Terat and Bobby, Mr. and Mrs. James Gowin and. children, Ronnie and Cathy Mr. and Mrs. E. T. Layne, Sr., Ted and Miss Louise Wood, Mr. and Mrs. Joe Lewis and son, and Miss Nancy OBrien spent the week-end at Virginia Beach. James D. Hall has returned home from Duke Hospital, Durham, N. C., where he was a patient several months. Louis Giere, of Cold Wa ter, Ohio, with whom he was in service in Korea, motored to Dur ham and accompanied him Home for a visit. Those visiting Mr. and Mrs. Mun dy Moore and Mr. and Mrs. Watts Moore over the week-end were Mr. and Mrs. Bradley Wingfield Mrs. Jennie Howerton and Sharon Kemp, of Richmond, and Mr. and Mrs. Isaac Parson, Rickey, Arthur and Diane, of Capital Heights, Md."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Bradley <mark>Wingfield</mark> Mrs. Jennie Howerton and"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Bradley <mark>Wingfield</mark> Mrs. Jennie Howerton and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [438.24, 411.21, 576.23, 665.25], "bbox_id": "6a953c95a6", "file": "TimesVirginian_1976_0389.pdf", "page": 1, "text": "William B. Totty SPOUT SPRING - William 1 Benjamin Totty, SI, of Spfiut Spring, died at 4.-S0 p.m. Tues day at Concord. He wu the husband of Hazel Dunn Totty. Born in Appomattox County, he was a son of the late Harry  B. Totty and Mattie Wingfield Totty. He wu a member of Emanuel Baptist Church of Rustburg and was a retired  m echanic for Myers and Rhodes Equipment Co. Jnc. In addition to his wiferhe is fc survived by a daughter, Mrs. ? Edward Bettie Hicksof. J Dillwyn two grandsons, Edward Dwayne Hicks and  Robert Kevin Hicks of Dillwyn i four brothers, James Edward f Totty and Leslie E. Totty of t Spout Spring, Robert A. Totty . of Appomattox and Douglas H.  Totty of Roanoke, and two sis- j ten, Mn. Mildred T. Broom-"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "B. Totty and Mattie <mark>Wingfield</mark> Totty. He wu a"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "B. Totty and Mattie <mark>Wingfield</mark> Totty. He wu a"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2488.78, 224.62, 2649.29, 1193.24], "bbox_id": "f43200f14b", "file": "TimesVirginian_1981a_0111.pdf", "page": 1, "text": "William and April Watson spent the week end with their grandm other, Mrs. W. H. Wingfield and family. Mr. Jackie Woodall and Mr. and Mrs. Bill Watson visited in this home Sunday. Mrs. M. L. Covington visited Mrs. Wing field Monday afternoon. Mr. Jim Woodall and Mr. Roger Pillar called in this , home Wednesday. Thé L. H. Watsons, Sr. were in W aynesboro over .the weekend. Mr. and Mrs. Andy Davis and Robin visited relatives in Cumberland Saturday. Mr. and Mrs. L. L. Webb and Miss Joyce Webb were dinner guest Sunday of Mr. and Mrs. David Nash and family. Visitors of Mr. and Mrs. Robert Coleman were Mrs. . Orie M illner, Mrs. James Conner. Mrs. Janie Chernault Mrs. Wiley McCormick, Mr. and Mrs. John Tweedy, and Mr. and Mrs. Calvin Smith. Mr. Coleman hasnt been feeling to well for several days but were glad hes feeling better. Visiting Mr. Walker and Richard Webb and Mr. and Mrs. David Repass and family  during the week end were Mr. and Mrs. Martin Webb, Mrs. Jane Speck and daughter, Elizabeth, Miss Pam OBrien and Mr. Monroe Webb. Mrs. J. L. Torrence, Sr. speht Saturday night with Mr. and Mrs. Vernon Torrence. Mr. and Mrs. J. L. Torrence, Jr. and grandson, Todd of Richmond, Mr. and,Mrs.-Elliott Torrence and Mrs. James Conner were dinner guest Sunday of Mrs. J. L. Torrence, Sr. Visi rs of Mr. and Mrs. Monroe Webb were Mrs. Scott  Sheets, Mrs. Marshall Goin, DeWitt and Beverly Goin and Mr. Walker Webb. Among those calling in the home of Mrs. Mary Bagby were Mrs. M. L. Covington, Mrs. Lula Almond, Mr. and Mrs. Andy . Davis and Robin, Katherine and Julia Wingfield, Rev. Earnie Lucas, and the Thomas Woodalls. Mr. and Mrs. George, Inge of Chester, Va. visited th e ir. sister, Mrs. Virgie Beasley Wednesday.- Mrs, Beasleys daughter, Dorothy visited her Monday. Mr. Grover Beasley, Jr. visited his mother last week. Mr. and Mrs, Arron Wilson of Darlington Heights and Mrs,  Thom as W oo4ILyM at nesday in Covington with their parents, Mr, and Mrs. Clarence Coffey and family. The occasion being Mrs.  Wilsons birthday which they all enjoyed very much. Mrs. Madeline Inge was a luncheon guest Monday of her - brother-in-law and sister, Mr. and Mrs. Arnold Childers of Lynchburg. We were very sorry to hear of the death Tuesday of Mr. W. O. .Slagles mother, Mrs. Elsie Slagle of Mars Hill, N. C. Our deepest sympathy is extended her family and love ones. Tour"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "other, Mrs. W. H. <mark>Wingfield</mark> and family. Mr. Jackie"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "other, Mrs. W. H. <mark>Wingfield</mark> and family. Mr. Jackie"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1668.27, 1350.46, 1785.76, 1360.46], "bbox_id": "a99c18adf3", "file": "AppomattoxNewspapers_1933-1936a_0114.pdf", "page": 1, "text": "WILKERSON 1 WINGFIELD"}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "WILKERSON 1 <mark>WINGFIELD</mark>"}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "WILKERSON 1 <mark>WINGFIELD</mark>"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [270.76, 997.91, 411.76, 1170.44], "bbox_id": "fad465f593", "file": "TimesVirginian_1976_0012.pdf", "page": 1, "text": "who arlt having- odds are Pam Mrs. Mary Bagby, H. Wingfield, Mrs. Thomas Woodall and Lisa, Mrs. W. T. Covington, William and April Watson. Callers in the home of Mrs. Mary Bagby last week were Mr. and Mrs. Rufus Wingfield, Mrs. James Maxwell, Mrs. William Light and daughter, Michale, Mrs. Delorious Deaner and Dawn, Leslie Goin, Mrs. Thomas Woodall, W. H. Wingfields and Bill Watsons."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mrs. Mary Bagby, H. <mark>Wingfield</mark>, Mrs. Thomas Woodall and"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mrs. Mary Bagby, H. <mark>Wingfield</mark>, Mrs. Thomas Woodall and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [631.7, 202.61, 778.2, 425.4], "bbox_id": "415c75f8ee", "file": "AppomattoxNewspapers_1971-1973a_0344.pdf", "page": 1, "text": "While there Mr. and Mrs. Smith and Mrs. Banton visited Mr. Smiths mother, Mrs. G. C. Smith and his sister of Wil liamson, W. Va. several days. Mr. and Mrs. L. L. Webb, Miss Joyce Webb and Miss Odell Webb were visitors Sun. after noon of Mrs. Robert Morris and  family. Mr. and Mrs. W.H. Wingfield and grandson William Watson  visited Mr. and Mrs. Willard  Johnson and family Saturday I night. Mr. and Mrs. Allen Jones re- j cently of St. Paul, Minnesota  are now making their home in j Anchorage, Alaska. Mrs. Jones is a daughter of Mr. and Mrs. 1 James E, Maxwell. ______"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. W.H. <mark>Wingfield</mark> and grandson William Watson"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. W.H. <mark>Wingfield</mark> and grandson William Watson"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1482.71, 338.58, 1646.9, 1568.93], "bbox_id": "0852108a90", "file": "AppomattoxNewspapers_1905-1912a_0482.pdf", "page": 1, "text": "While a number of women are lob bying for the equal suffrage bill, it is said that at the public hearing Fri day afternoon a petition, signed by many prominent women,, was present ed, urging the committee not to rec ommend the measure for passage. Bills prohibiting the manufacture or sale of other than safety matches, to tax automobiles for county road purposes, to create a department of mines, to amend tax laws, reducing assessments on the first 1,000 of household goods from 35 cents to 10 cents to amend the code, and to prescribe order of procedure In court cases, were introduced. The Senate resolution, offered - by Senator Echols, of Augusta, for the formal election of United States sena tors at noon on Tuesday, January 23, and a joint election on Wednesday, the 24th, was concurred in by the House. The Senate concurred In a House resolution to arrange a joint session for February 22, when the State of Texas will present a portrait of Gen. Sam Houston to Virginia. Democratic Floor Leader Martin Williams, of Giles county, is strenu ously opposing the proposed tax com mission bill in Its present form, averr ing that it is not fair to Giles and other southwestern counties of the State rich in mineral deposits and other natural resources. Another measure which will meet with oppo sition is the Stenbenson bill to abol-, lsh gambling. Delegate Banks, from Norfolk, says the bill will mean the death of horseracing and bookmaking at the Jamestown racstrack. The Senate and House held a joint session and unanimously elected W. D. Saunders State dairy and food com missioner, and J. Richard Wingfield member of .the State Corporation Com mission. The House concurred in the Senate resolution to do away with the pres ent system of leasing convict labor, and calling upon the joint committees on roads to consider the Governors message relative to roads and work ing convicts thereon. Bills were introduced in the House to prohibit treating in saloons to place local milk inspectors under juris diction of the State Dairy and Pure rood Commission to compel State employes to work from 9 to 5 oclock each day. The Senate concurred iu the House rneasuYe to close the hunting season at once to protect game. One bill of State-wide interest in the Senate makes it necessary to se cure a State license to carry deadly or dangerous weapons. -Senator Paul, of the Republican mi nority, is working in the interest of a measure to have at least one Repub lican on every electoral board throughout the State. The bill for a change in the city charter of Richmond for the creation of an administrative board, previously passed by the House, was passed in the Senate under a suspension of the rules, and now goes to Governor Mann for his signature. Delegate Cox, of Richmond, intro duced a resolution providing that Gov ernor Woodrow Wilson, of New Jer sey, be invited to address  joint ses sion of the legislature and of the Rich mond City Council on Thursday night, February 1, at 8 oclock. The resolu tion was unanimously passed, and when sent to the Senate was concur red in. One of the most Important bills in troduced in the House was presented by Delegate Harwood, of Richmond, providing for the amendment to the section of the code governing the state tax on corporations for the sup port of free schools, pensions and liquidation of the public debt. The present law provides a maximum fee of 600, imposed upon a company with a capital of 1,000,000, while on a company capitalized at 999,000 the tax is 199.80. It was announced in both Houses that the joint committee on roads would have a public hearing on the questions of roads and workirfe con victs thereon, according to the recom mendations of Governor Mantl, on Monday, January ?9. One of the provisions of the charter amendment bill for the city of Rich mond, which has passed both Houses of the legislature and is now in thte hands of Governor Mann for his signature, reads that the city has the right to erect and maintain, in con nection with the city prison, if the I Council so determines, a suitable  workhouse and a bouse of correction, to compel and require all able-bodied i adult prisoners confined to perform anual labor in such workhouse and to  employ all youthful prisoners in the house of correction. Many representatives of the south west section of the state were here t,o oppose any changes in the redistrict ing of the Ninth district, the Dem ocrats believing that if the district is left undisturbed they have an excel lent chance to elect a successor to Congressman Bascom Slemp, the in cumbent, in the coming November election. , ."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "missioner, and J. Richard <mark>Wingfield</mark> member of .the State"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "missioner, and J. Richard <mark>Wingfield</mark> member of .the State"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [240.51, 310.05, 401.94, 598.03], "bbox_id": "7d9a6e332d", "file": "AppomattoxNewspapers_1908-1909a_0548.pdf", "page": 1, "text": "wheré he has been doing sSme work for the government,  Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday. Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Geneva Wingfield visited Mrs. Ernest Smith Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were tfie guests ,-of Miss Florence, Smith Sunday. Mr, and Mrs. Robert Frank lin and little son, Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Geneva <mark>Wingfield</mark> visited Mrs. Ernest Smith"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Geneva <mark>Wingfield</mark> visited Mrs. Ernest Smith"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [344.4, 362.84, 501.5, 661.13], "bbox_id": "7700f10fdb", "file": "AppomattoxNewspapers_1926-1933a_0502.pdf", "page": 1, "text": "where he has been doing some work for the government. Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday. Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Geneva Wingfield visited Mrs. Ernest Smith Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were the guests of Miss Florence Smith Sunday. Mr. and Mrs. Robert Frank lin and little son, Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden. Mr. and Mrs. J. L. Guill and"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Geneva <mark>Wingfield</mark> visited Mrs. Ernest Smith"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Geneva <mark>Wingfield</mark> visited Mrs. Ernest Smith"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [243.09, 332.59, 403.71, 621.08], "bbox_id": "fed12197e5", "file": "AppomattoxNewspapers_1926-1933a_0548.pdf", "page": 1, "text": "where he has been doing some work for the government. Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday. Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Geneva Wingfield visited Mrs. Ernest Smith Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were the guests of Miss Florence Smith Sunday. Mr. and Mrs. Robert Frank lin and little son, Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Geneva <mark>Wingfield</mark> visited Mrs. Ernest Smith"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Geneva <mark>Wingfield</mark> visited Mrs. Ernest Smith"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [343.44, 338.59, 500.99, 636.93], "bbox_id": "5a502a4e78", "file": "AppomattoxNewspapers_1908-1909a_0502.pdf", "page": 1, "text": "where he has been doing some work for the government. Mr. and Mrs. Thomas Mc Fadden and Miss Emily Smith were guests in the home of Wil liam Fulcher Sunday.  Mrs. Vermont Allen and ba by returned to their home in Lynchburg Saturday after visit ing Mrs. W. W. Godsey. Misses Rachel and Hattie Guill and Gfeneva Wingfield visited Mrs. Ernest Smith. Fri day. Misses Hallie and Louise Bryant and James and Wesley Franklin and Bill White were the guests of Miss Florence Smith Sunday. Mr. and Mrs. Robert Frank lin and little son Clarence Hen ry, visited in the home of Wil liam Fulcher Sunday. Mr. and Mrs. C. C. Wooten and daughter, Florence spent last week-end with Mr. and Mrs. T. L. McFadden. Mr. and Mrs. J. L. Guill and"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Gfeneva <mark>Wingfield</mark> visited Mrs. Ernest Smith."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Hattie Guill and Gfeneva <mark>Wingfield</mark> visited Mrs. Ernest Smith."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [381.09, 770.48, 544.15, 825.08], "bbox_id": "e4017fa6d5", "file": "AppomattoxNewspapers_1933-1936a_0152.pdf", "page": 1, "text": "When you are ready to have your home, store, office or factory paint- ed, decrated or remodeled,, call J. J. WINGFIELD Appomattox, Va General contractor, paper hanging, and painting."}, "highlight": {"text": {"matched_tokens": ["WINGFIELD"], "snippet": "When you are ready to have your home, store, office or factory paint- ed, decrated or remodeled,, call J. J. <mark>WINGFIELD</mark> Appomattox, Va General contractor, paper hanging, and painting."}}, "highlights": [{"field": "text", "matched_tokens": ["WINGFIELD"], "snippet": "When you are ready to have your home, store, office or factory paint- ed, decrated or remodeled,, call J. J. <mark>WINGFIELD</mark> Appomattox, Va General contractor, paper hanging, and painting."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [407.02, 1182.0, 557.83, 1331.74], "bbox_id": "d9633e2584", "file": "AppomattoxNewspapers_1922-1923a_0124.pdf", "page": 1, "text": "Whats the matter with Di lector Wingfield, he cant get L started in the tobacco buBi- Lee before Nov. 7tb? Much of he tobacco is going to Lyncta- jburg and members want some ash. Wanted Walnut logs, I am giiakiDg up a shipment, if yPJ1 have one or more logs can hand lie them. Write for priceB de livered at Appomattox- O J. Webb, Vera, Va."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "matter with Di lector <mark>Wingfield</mark>, he cant get L"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "matter with Di lector <mark>Wingfield</mark>, he cant get L"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [139.45, 232.18, 283.65, 1426.57], "bbox_id": "32a87891d0", "file": "TimesVirginian_1980a_0289.pdf", "page": 1, "text": "Wf MARY BAGBY But t say unto you, love your enemies, bless them that curse you, do good to them that hate you, and , pray for them which despltefully use you, and persecute you Matt 544. Friends are better than enemies, a sure way to destroy an enemy is to make him a friend. Rev. Dan Menser preach ed a fine sermon Sunday morning at Hollywood Chur ch, his text was taken from John 12 20-36. We Would See Jesus was the topic. Our hearts were saddened when word came early Sunday morning that Bever ly Ann Coleman, daughter of .Mr. and Mrs. M. J. Coleman of Rt. 2, Appomattox had been killed in a car accident. Our deepest sympathy, love and prayers are with her family and love ones. We are so glad to hear Mrs. Johnnie Bryant . is home from the hospital. We wish her a very speedy recovery. ,w. There will be a Sunday School picnic at Hollywood Church Saturday evening, Sept. 13 at 5 oclock. Come and bring a picnic basket and lets have a good time together. Mr. W. H. Wingfield goes báek to his doctor In Lynchburg today Monday for a check-up. We pray he may soon be feeling better. Mr. and Mrs. Thomas Woodall and Lisa and Mrs. Mary Bagby were visitors Thursday night of Mr. and Mrs. Andy Davis and Robin. Mr. and Mrs. Davis were in Farmvillé Friday night. The occasion was to celebrate Mrs. Davis birthday. Mr. and Mrs. Timothy Rawsdell and son, Jason entertained in honor of Mrs. Rawsdell parents, Mr. and Mrs. Alfred Almond ann iversary Thursday night with a dinner at Long John Silver fish house. Mr. and Mrs. Richard .W ebb and Mr. Walker Webb  were supper guest Sunday night of Mr. and Mrs. David Repass and family,jjiven in honor of Mrs. Repass father, Mr. Richard Webb. Mr. and Mrs. Roger Garlick and family of Arvada, Colorado Mrs. Samada 1 Ingie.. spent SJast week at Emerald Isle, HJC. Visiting Mr. and Mrs. Robert Coleman last week were Mr. Myrt Mann of Gretna, Mr. Calvin Smith and son, Bobby. Mrs.  Mike Lewis was given  stork shower Sunday- afternoon in the home of Mr. and Mrs. James. Conner. She received a lot of nice and useful gifts. Mr. Grover Beasley Jr. visited his mother, Mrs. Virgie Beasley Sunday Visiting in the home of Mr. and Mrs. Monroe Webb and family were Mr. and Mrs. L. L. Webb, Miss Joyce Webb, Mr. Scott Sheets and Mr. and Mrs. Willie Craft and Kristie. Mr. and Mrs. Thomas Woodall and Lisa were over night guest of Mr. and Mrs. Aaron Wilson of Richmond Friday night. They enjoyed the day Saturday at Kings Dominion. Mr. and Mrs. Alfred Almond and Mr. and Mrs. Wayne Smith and family spent Sunday with Mr. .Almonds sister, Mrs. Alma Fortune of Ashland, Va. They also visited Mr. and Mrs. Elwood Smith and family. Mr. and Mrs. Tim Carter and Mr. Myrt Mann visited Mr. W. H. Jenkins Monday. Mr. and Mrs. Kenneth Deaner and family spent the weekend in Newport News"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "together. Mr. W. H. <mark>Wingfield</mark> goes báek to his"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "together. Mr. W. H. <mark>Wingfield</mark> goes báek to his"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [693.08, 374.35, 858.55, 748.15], "bbox_id": "c617461226", "file": "AppomattoxNewspapers_1933-1936a_0250.pdf", "page": 1, "text": "W...F. Collins and daughter Mary, vi?ited Mrs Mollie Collins lfat week. Mr. and Mrs R A. Browning and family, of Richmond were guests of Mrs. R. T. Lee and Mrs R N Daw- n July 4.    Mr. and Mrs. W. A. Wingfield and family of Richmond were the guest of Mr. and Mrs. A. C. Wingfiedl the fourth of July ar-1 r  instil Sat urday. 4f On Wednesday euun of last week Misses Ruby and Edna Wool- ridge, Ethelyn Lee and Mrs Ran dall Woolridge were hostesses at a shower in honor of Mrs Otis Dayis in the home of Mrs Floyd Woolridge     Professeur R. W, Wilkins calls all F. F. A. Members attention to the picnic and swimming party to be held at Tonawanda Lake Friday after noon and evennig., This is a county wide affair and all F. F. A. members are urged to attend. m m m Miss Jane Burke entertained at several tables of bridge Friday After noon in honor of Miss Caroline Wil lis of Fredericksburg and Miss Fran ee,s Scott Walker of Blacksburg. Tho 30 plajung were Misses Dot and Pat scars, Ellen Ann and Polly Furbush Virginia and Caroline Moses, Frances Smith,, Berta Dinwiddle, Eloise Ab bitt Elizabeth Cralle, Dot and Ailene Shirlsy. Prizes went to Beth Cralle l Berta Dinwiddle Dot Shirley Caroline Willis and Frances Walker."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. A. <mark>Wingfield</mark> and family of Richmond"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. A. <mark>Wingfield</mark> and family of Richmond"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1867.91, 699.57, 2033.99, 904.87], "bbox_id": "afe15f215b", "file": "AppomattoxNewspapers_1922-1923a_0184.pdf", "page": 1, "text": "West Appomattox, Va., Sept. 1,1905. Mr. W. H. Camp, Petersburg, Va. Dear Sir Yours to hand and noted, and in reply will say I purchased two barrels of Camps Prepared Chemicals from your agent at. this point, Mr. Wingfield. I intend ed using it on corn, but as Commissioner of Revenue, I had lots of riding to do about that time and overlooked it. So when I came to plant tobacco I was iu a burry and did not tkc the time to mix it, but drilled it along side of a 3. 9. 8. guano, same proportion, 500 1 bs. to the acre, and I have never beeu able to tell the difference, It is ail fine tobacco. There is in experimenting station ou my farm, run .by the Bureau of Soils, and the Manager made considerable fun of me using Chemicafs. He seemed to doubt that it contained the ingredients it claimed to, so we drew a sample and he ook it to Washington and had it analysed. It ran 1 per cent higher on ammonia than you claimed and about the same ou potash. T know several parlies tha did use your chemicals according t. your directions this year with flue results. Very respectfully, II. C. BABCOCK"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "at. this point, Mr. <mark>Wingfield</mark>. I intend ed using"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "at. this point, Mr. <mark>Wingfield</mark>. I intend ed using"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1884.02, 689.01, 2049.14, 895.06], "bbox_id": "585f356277", "file": "AppomattoxNewspapers_1922-1923a_0179.pdf", "page": 1, "text": "West Appomattox, Va., Sept. 1, 1905. Mr. W. H. Camp, Petersburg, Va. Dear Sir Yours to hand and noted, and in roplv will say I purchased two barrels of Camps Prepared Chemicals from your agent at this point, Mr. Wingfield. I intend ed using it. nn corn, but as Commissioner of Revenue, I bad lots of riding to do about that time and overlooked it. So when I came tupian tobacco I was in a hurry and did not take the time to mix it, but drilled it along side of a 3. 9. 3. guano, same proportion, 500 lbs. to tbe acre, and I have never been able to tell the difference, it is all fine tobacco. There is an experimenting station on my farm, run by the Bureau of Soils, and the Manager made considerable Iuu of me using Chemicals. He seemed to doubt that It coutaiued the Ingredients it claimed to, so we drew a sample and he ook it to Washington and had it analysed. It ran 1 per cent higher on ammonia than you claimed and about tlie same ou potash. I know several parlies tba did use your chemicals according to your directious this year with fine results. Very respectfully, H. C. BABCOCK"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "at this point, Mr. <mark>Wingfield</mark>. I intend ed using"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "at this point, Mr. <mark>Wingfield</mark>. I intend ed using"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [387.33, 695.11, 568.88, 1670.83], "bbox_id": "ffd7552000", "file": "AppomattoxNewspapers_1926-1933a_0105.pdf", "page": 1, "text": "WESLEY CHAPEL 1st grade, Ryland Trent. 2nd grade, Louie Mann. 5th grade, Louise Lewis, tis Cawthorn. 6th grade, Coy Mae Mann. MT. COMFORT 6th grade, Gladys Page. 4th grade, Ethel Gardner, zabeth Gardner. 2nd grade, Edythe Martin, James Martin, Allen Gardner, Garland Harding. 1st grade, Mabel Martin, Ola I Harding, Inez Harding. GOLD HILL 6th grade, Dolly Carson. 4th grade, Edward Webb. 3rd grade, Billy Inge. Donald Webb. 2nd grade, Malcolm Coleman, Charlie Carson. 1st grade Primer Lizzie Webb, Carl Carson. A ppomattox A. H. S. 4th year, Lucille Joy, Corine Hancock, Lucille Joy, Richard Jenkins, Josie Jamerson. 3rd year, Lucy LeGrand, Mary I Jamerson, Louise Scruggs, I Floyd Dinkins. I 2nd year. Verta Simms, Hallie I Chilton, Kathleen Paulette, Dora I Abbitt, Virginia Puckett, Louie Cawthorn, Annie Giles, Saman tha Pippin, Homer Babcock, Edith OBrien, 1st year, Bertha Rogers Fay Babcock, Virginia Holt, Lottie Lucado, Gladys Inge, Mary Woodson, Gertrude Stewart, Virginia Carson, Mary Grey Sears, Frances Coleman, Eliza beth Robertson, Nollie Lewis, Samuel Ford, Billy Dickerson, Alfred Harwood, Charles Craw ley, John Hesson, James Morris, Charles James, Holcomb Cald well. 7th grade, Lucille Crailt, Eve lyn Dickerson, Adelina Fergu- Ison, Josephine LeGrand. j 6th grade, Mandane Anderson, Nellie Bloxton, Carrie Jamerson, I Hilda Moore, Eloise OBrien, I Claudine OBrien, Mary Smith, I Elizabeth Trent, Billie Hubbard, I Garland Plunket. 5th grade, Ruby Cole, Marion Agee, Margaret Carter, Eliza beth Cralle, Mary Clark, Leilas Davis, Mabel Hall, Thelma Mor ris, ary McNally, Annie Mar shall, Mabel Smith, Dorothy Tweedy, Elliott Torrence, Ray mond Jamersoh, Lawrence Moore, Harry Lee. 4th grade, Geneva Wingfield, Willie Guthrie Anderson, Erna Dickerson, Loraine Handy, Christine Caldwell, Roberta Dinwiddle,  Edith Franklin, Cecil Torrence, Billy Smith, John Cole, Charles Guill, Davie Carter. . 3rd grade, Anna Carter, Yir- I ginia Christian, Edith Cole, Net- I tie Davidson, Olla May Dinkins, Hattie Guill, Virginia Epes Irby, I Edith Lucado, Susie Plunkett,"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Lee. 4th grade, Geneva <mark>Wingfield</mark>, Willie Guthrie Anderson, Erna"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Lee. 4th grade, Geneva <mark>Wingfield</mark>, Willie Guthrie Anderson, Erna"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [422.41, 259.05, 577.66, 980.67], "bbox_id": "c6694364ef", "file": "TimesVirginian_1981a_0229.pdf", "page": 1, "text": "Were very sorry to bear Mr. Evrod Conner Is a patient in the hospital. Wa pray hell have a speedy recovery. Were happy to hear Mrs. Murim Fraaknn came home lait week from the hospital. We wiah her a very speedy recovery. Rev. Dan Menser and family visited Mrs. Franklin hi the hospital last week. We are venr sorry to hear Mr. Clarence Coffey of Coving ton is a patient in the hospital there, w e prgy hell have a speedy recovery. Mr. Grover Beasley, Jr. spent some time with Mr. and M rs. Vernon Beasley of Glendale Heights, DL We are happy to bear Mrs. Vernon Beasley in improving mealy after a recent operation. Mr. Graver Beasley Jr. and Mbs. Claude Hamlett visited th e ir m other, M rs. V irgie Beasley last week.. Mr. and lira. Larry Torrence aiM foaify of Woodbridge spent . the 4th of July weekend with Mr. sad Mrs. EDiott Torrence add other relatives. VMHngMr. and Mrs. Robert Coleman last weak were Mrs. Bessie OBrien, Mr. add Mrs. Calvin Smith and son, Bobby. M r. and M rs. Law rence Wdbdeon and Mr. and Mrs. Monroe Webb visited Mr. and Mrs. L. L. Webb and Miss Joyce Webb Tuesday. Mr. and Mrs. Wallace Jacobs ,of Roanoke were guest last week of Mr. and Mrs. L. H. Watson Sr. Mrs. M artha J. H enderson and son, Carol Taylor and Mrs. Betty Lueslow were sapper guest Sunday night of Mr. and Mrs. Watson. Mrs. Head Fleming and son spent the 4th of July in this  dome. Mr. W elker and Richard I Webb were visitors last week of Mr. and Mrs. Monroe Webb. H r, and Mrs. Jim Wooden were visiters Sunday afternoon of Mrs. W. H. Wingfield And family and Mr. and Mrs. Thomas Woodall and family. Mr. and Mrs. WMt Wooden visited in the Wingfield home Tuesday Mr. and Mrs. Sammie Inge were week-end guest the 4th of July H hie mother, Mrs. Madeline Inge. Mrs. Andy Davis aad Robin visited Mr. and Mrs. Thomas JKopdaR end U se Sunday"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "of Mrs. W. H. <mark>Wingfield</mark> And family and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "of Mrs. W. H. <mark>Wingfield</mark> And family and Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1765.15, 197.15, 1896.65, 490.34], "bbox_id": "59326ab2a3", "file": "TimesVirginian_1980a_0266.pdf", "page": 1, "text": "were, tod Mrs. Vernon Childs, Mrs. Catherine Fra zer, Mr!. Isabella 0. Raug. Miss Edith OBrien, Mrs. Alfred Jamerson, Mrs. Aud rey Webb Fox, Mrs. Morris Ferguson and grandson, Ray Ferguson, Miss Marie Cullop and Mrs. W. E. Inge. Mr. and Mrs. Thomas Woodall and Lisa called in the homes of Mr. and Mrs. R. G. Austin and Tom, Rev. and Mrs. Dan Menser and family, Mr. and Mrs. W. H. Wingfield and family and Mr. and  Mrs. LeGrande Webb and Miss Joyce Webb. Mr. and Mrs. Robert Coleman, Mr and Mrs. D. R. Turns, Mrs. W. T. Covington and Mr. and Mrs. Leslie Turns spent Tuesday in Farmville with Mr. and Mrs. Bennett-Gilliam. They cele brated Mrs. W. T. Coving tons birthday. We wish for h tfr many more happy birthdays."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family and Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family and Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1639.49, 228.33, 1771.96, 719.75], "bbox_id": "e4e588c725", "file": "TimesVirginian_1980a_0166.pdf", "page": 1, "text": "were Mrs. J. L. Torrence, Mrs. Frank Hancock, Mra. Sam Ferguson, Mr. and Mrs. Elliott Torrence, Mr. and Mrs. Mike Torrence and family, Mr. and Mrs. M3u Lewis, Mra. Don Thornhill and Mr. and Mra. Buddy Conner and family. Mr. and Mrs, Andy Davis and Robin spent Sunday with his mother, Mrs. Phyliss Davis, ft Scottsville. Mr. and Mra. Roger Ramsdell ft North East, Penna., are visiting their son and family, Mr. and Mrs. Timothy Ramsdell. Mr. and Mra. Alfred Almond were supper guests in this home Saturday night- Mr. and . Airs. Richard Webb visited Mr. and Mra. Harold Morris Sunday after noon. Mr. and Mrs. David Repass were supper guests Sunday night ft Mr. and Mra. Webb. We are very sorry to hear ft the death ft Mr. Merlin Maxwell ft Magna, Utah. Our Sincere sympathy ia ex tended his family and loved ones. Visiting Mra. Mary Bagby during the week were Mrs. W. E.- Inge, Mr. Jim Woodall, Mrs. Kenneth Deaner, Mr. L. H. Watson, Mrs. Andy Davisand Robin, Miss Julia Wingfield and Mr. Walker Webb. . Dinner guests on Sunday ft Mra. W. E. Inge were Mrs. John Inge, Mr. and Mrs. Edwin Schampel and Mr. and Mrs. Frank Inge and daughter, Dana."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Davisand Robin, Miss Julia <mark>Wingfield</mark> and Mr. Walker Webb."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Davisand Robin, Miss Julia <mark>Wingfield</mark> and Mr. Walker Webb."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1774.54, 1147.32, 2103.05, 1170.07], "bbox_id": "94f4bbb058", "file": "AppomattoxNewspapers_1912-1915a_0273.pdf", "page": 1, "text": "were Miss Louise Wingfield, yjfgii jarson, who made a yield ol an old B. F. L room-mate of"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "were Miss Louise <mark>Wingfield</mark>, yjfgii jarson, who made a yield ol an old B. F. L room-mate of"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "were Miss Louise <mark>Wingfield</mark>, yjfgii jarson, who made a yield ol an old B. F. L room-mate of"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [564.94, 597.91, 716.82, 1013.74], "bbox_id": "1f6246d551", "file": "TimesVirginian_1978_0019.pdf", "page": 1, "text": "were given in honor or their mother, Mrs. J. L. Torrences j 83rd birthday which is today  January 9th. Congratulations 1 Mrs. Torrence and may you have many more happy birthdays. Mr. and Mrs. Richard Webb 1 were visitors Saturday after noon of Dr. and Mrs. Tom Shoemaker and family and Mr. and Mrs. Billy Inge. Mr., and Mrs. Frank Hancock of Richmond spent the week end with Mrs. J. L. Torrence, Sr.  Mrs. M. L. Covington visited Mrs. Nathlie Robertson last week. Mr. Kenneth Wingfield of Roanoke spent the week end in Appomattox with relatives and friends. Julia Wingfield and Mrs. Thomas Woodall called in the home of Mrs. Mary Bagby Sunday. .   Mr. and Mrs. Raymond Franklin and family amon others were dinner guest New  Years Day of Mr. and Mrs. Sam McFall and family of Lynch burg. They, visited Mr. Frahk-  lins mother, Mrs. Mattie C. , Franklin at the Medical Care Center while there. We pray Mrs. Franklin may soon be feeling better. Mr. Vernon Torrence will enter the hospital today for an"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "last week. Mr. Kenneth <mark>Wingfield</mark> of Roanoke spent the"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "last week. Mr. Kenneth <mark>Wingfield</mark> of Roanoke spent the"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1960.29, 235.35, 2099.28, 435.39], "bbox_id": "023c652bb5", "file": "AppomattoxNewspapers_1971-1973a_0013.pdf", "page": 1, "text": "were dinner guests Wednesday of Mr. and Mrs. F. 0 . Coving ton and family, of Lynchburg. Mr. and Mrs. Elmo Banton, Tommie Gene and Wayne Ban- ton and Miss Eurbank of Rich mond, visited Mrs. C. R. Ban- ton Saturday. Mr. and Mrs. Jim Webb and family visited Mr s . V i r g i e Beasley last week. Mrs. W. H. Wingfield, Miss Julia Wingfield, Mrs. M. L. Covington, Mrs. Edna Coving ton and Mrs. Charlie Bagby visited Mrs. Lucy Deaner and Mr. and Mrs. W. F. Woodall Wednesday afternoon. Mr. and Mrs. W. H. Wingfield"}, "highlight": {"text": {"matched_tokens": ["Wingfield", "Wingfield"], "snippet": "week. Mrs. W. H. <mark>Wingfield</mark>, Miss Julia <mark>Wingfield</mark>, Mrs."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield", "Wingfield"], "snippet": "week. Mrs. W. H. <mark>Wingfield</mark>, Miss Julia <mark>Wingfield</mark>, Mrs."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [601.9, 477.31, 764.55, 506.01], "bbox_id": "d7db1651c8", "file": "AppomattoxNewspapers_1952-1954a_0096.pdf", "page": 1, "text": "Welcome to Rev. F. J. Wingfield, who has been returned to Appo mattox Circuit for another year."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Welcome to Rev. F. J. <mark>Wingfield</mark>, who has been returned to Appo mattox Circuit for another year."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Welcome to Rev. F. J. <mark>Wingfield</mark>, who has been returned to Appo mattox Circuit for another year."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [705.08, 235.15, 836.97, 509.51], "bbox_id": "4199634f80", "file": "TimesVirginian_1980a_0326.pdf", "page": 1, "text": "weekend with his parents, Mr. and Mrs. Ed Davis. The Pamplin Chapter of AARP will meet Thursday October 9 at the Pamplin United Methodist Church in the friendship hall at 730 p.m. Susan Bailey of the personnel departm ent of Thomasville Furniture Co mpany w ill show color pictures and also give a talk on the operation of the company. Refreshments will be served and the public is .invited. Mrs. C. V. Wingfield returned home Saturday after spending some time in Norfolk with her sister and brother-in-law, Mr. and Mrs. Harold Southern. They attended the funeral Satur day of their cousin, Mrs. Mary Williams Bonwèll Brown in Keysville on Saturday."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "invited. Mrs. C. V. <mark>Wingfield</mark> returned home Saturday after"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "invited. Mrs. C. V. <mark>Wingfield</mark> returned home Saturday after"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [816.66, 1117.37, 984.19, 1176.55], "bbox_id": "7f90046438", "file": "AppomattoxNewspapers_1952-1954a_0595.pdf", "page": 1, "text": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. Pat Robinson and children, of Charlotte Court House Mr. and Mrs. Herman Wingfield, of Appomattox, and H. T. Terry, Jr., of N, J."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Herman <mark>Wingfield</mark>, of Appomattox, and H."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Herman <mark>Wingfield</mark>, of Appomattox, and H."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [539.27, 594.62, 709.36, 624.07], "bbox_id": "1508afedaa", "file": "AppomattoxNewspapers_1960-1962b_0404.pdf", "page": 1, "text": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. H. C. Wingfield of Richmond."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. H. C. <mark>Wingfield</mark> of Richmond."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. H. C. <mark>Wingfield</mark> of Richmond."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [421.45, 497.69, 593.26, 547.79], "bbox_id": "56156d7e42", "file": "AppomattoxNewspapers_1954-1955a_0373.pdf", "page": 1, "text": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. B. A. Chandler and children, of Portstnouth, and Mr. and Mrs. Her man Wingfield ,of Richmond."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. B. A. Chandler and children, of Portstnouth, and Mr. and Mrs. Her man <mark>Wingfield</mark> ,of Richmond."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Week-end visitors in the home of Mrs. H. T. Terry were Mr. and Mrs. B. A. Chandler and children, of Portstnouth, and Mr. and Mrs. Her man <mark>Wingfield</mark> ,of Richmond."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [763.2, 849.82, 932.5, 935.22], "bbox_id": "00c9674ce0", "file": "AppomattoxNewspapers_1954-1955a_0387.pdf", "page": 1, "text": "Week-end visitors in the home of Mr. and Mrs. L. L. Dickerson were Mr. and Mrs. Robt. Butler, of Rich mond. Mrs. Vest Wingfield, of Milan, Tenn., was a recent guests of Miss Flora Belle Williams and other rela tives."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Rich mond. Mrs. Vest <mark>Wingfield</mark>, of Milan, Tenn., was"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Rich mond. Mrs. Vest <mark>Wingfield</mark>, of Milan, Tenn., was"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2203.64, 1005.85, 2544.85, 1093.85], "bbox_id": "697a44aa7b", "file": "AppomattoxNewspapers_1960-1962b_0317.pdf", "page": 1, "text": "Week-end guests in the home, reasonthe of Mrr. H. T Terry were Mr. MO ards too, is the Mrs. Irving W. Linderiblad, ot. are , re ottt of Alexandria Mr. and Mrs. H. C.1 Richards can get re o Wingfield, of Richmond Mrs. B. A. young pihera than anyone i toe Chandler, of Portsmouth? Mr. and league. . _ f Mrs. Chat Terry and children, of It would be a good f o r  e Critz Mr. and Mrs. J. B. Terry, league M there is a pennant roc. and ohildren, of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "can get re o <mark>Wingfield</mark>, of Richmond Mrs. B."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "can get re o <mark>Wingfield</mark>, of Richmond Mrs. B."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1671.1, 747.18, 1840.2, 806.13], "bbox_id": "9736bb0acd", "file": "AppomattoxNewspapers_1955-1957a_0192.pdf", "page": 1, "text": "Week-end guests in the home of Mrs. H. T. Terry were Mr. and Mrs P. A. Robinson and children, of Charlotte Court House, and Mr and Mrs. H. C. Wingfield and Miss Ann Terry, xf Richmond."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. H. C. <mark>Wingfield</mark> and Miss Ann Terry,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. H. C. <mark>Wingfield</mark> and Miss Ann Terry,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2047.7, 438.33, 2216.38, 579.63], "bbox_id": "1083af7abd", "file": "AppomattoxNewspapers_1954-1955a_0194.pdf", "page": 1, "text": "Week-end guests in the home of Mrs. H. T. Terry were Mr. and Mrs. A. B. Chandler and son, Ter ry, of Portsmouth, and Mr. and Mrs. Herman Wingfield, of Rich mond. Mr. and Mrs. Stuart Farrar and Mr. and Mrs. Earl Smith attended the Ice Follies in Richmond last week. Miss Ann Terry visited in the home of Mr. and Mrs. Herman Wingfield, of Richmond last week."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Herman <mark>Wingfield</mark>, of Rich mond. Mr."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Herman <mark>Wingfield</mark>, of Rich mond. Mr."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1938.95, 944.53, 2111.94, 974.97], "bbox_id": "e7c75f2fc4", "file": "AppomattoxNewspapers_1960-1962b_0094.pdf", "page": 1, "text": "Week-end guests in the home of 1 Mrs. H. T. Terry were Mr. andi Mrs. H. C. Wingfield, of Richmond. I"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Week-end guests in the home of 1 Mrs. H. T. Terry were Mr. andi Mrs. H. C. <mark>Wingfield</mark>, of Richmond. I"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Week-end guests in the home of 1 Mrs. H. T. Terry were Mr. andi Mrs. H. C. <mark>Wingfield</mark>, of Richmond. I"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [134.65, 1309.79, 275.3, 1482.28], "bbox_id": "6464a9c30e", "file": "TimesVirginian_1976_0427.pdf", "page": 1, "text": "Week of Prayer program for Foreign Missions Lottie Moon Christmas Offering was observ ed last week at Hollywood Baptist Church with a good attendance. Taking part on the program were Mrs. Shirley Franklin, Mrs. Annie Webb, Mrs. Delorious Deaner, Miss Odell Webb, Mrs. Betty Webb, Mrs. Ruth Watson, Miss Julia Wingfield, Miss Joyce Webb and Mrs. Mary Bagby. Mrs. Mattie C. Franklin is a patient in the Lynchburg General Hospital with a broken"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Ruth Watson, Miss Julia <mark>Wingfield</mark>, Miss Joyce Webb and"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Ruth Watson, Miss Julia <mark>Wingfield</mark>, Miss Joyce Webb and"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1495.72, 412.43, 1638.07, 509.53], "bbox_id": "01a4523332", "file": "TimesVirginian_1976_0463.pdf", "page": 1, "text": "week of Mr. and Mrs. L . H, Watson. M r. and M rs. Coleman and Mrs, Covington called in tl Mrs. Mary Bagby Sui Emma Lemon and Mrs. W . H. Wingfield ate lunch with Mrs, Bagby Friday. __"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W . H. <mark>Wingfield</mark> ate lunch with Mrs,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W . H. <mark>Wingfield</mark> ate lunch with Mrs,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2032.08, 237.58, 2176.99, 558.29], "bbox_id": "9a73b10f8f", "file": "TimesVirginian_1981a_0331.pdf", "page": 1, "text": "week. Mr. and Mrs. Monroe Webb were supper guest Wednesday night of Mr. and Mrs. Willie Craft and family. They visited Mr. and Mrs. L. L. Webb, and family last week. Mr. Donald Webb was a visitor in the-homes of Mr. and Mrs. Thomas Woodall and family and M rs. W. H. Wingfield and family recently. Callrng in the home of Mrs. Mary Bagby last week were Mr. and Mrs. L. H. Watson, Sr., Mrs. M. L. Covington, Mre. Andy Davis and Robin, Mrs. Madeline Inge, Mr. and Mrs, Monroe Webb, Miss Dawn Deaner, Katherine and Julia Wingfield, the Thomas Wood- alls, Mr. Alfred Almond and Jason Ramsdale. Jordan news"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "M rs. W. H. <mark>Wingfield</mark> and family recently. Callrng"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "M rs. W. H. <mark>Wingfield</mark> and family recently. Callrng"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [580.28, 633.41, 731.26, 1200.48], "bbox_id": "42bbdf90bb", "file": "TimesVirginian_1976_0232.pdf", "page": 1, "text": "week end with Mrs. Mary Bagby. They visited Mr. and Mrs. W. H. Wingfield and family, Mrs. W. T. Covington and Mrs. M. L. Covington while here. Mr. Frank Covington and Mr. and Mrs. James Bondurant visited Mr. and Mrs. Cecil Sells and family, of Princeton, W. Va., Saturday morning. We are so glad to hear Mrs. Sells is improving after a recent operation. Mr. and Mrs. Robert Coleman, Mrs. W. T. Coving ton, Mrs. Otis Smith and Mrs. James Conner spent Saturday in Farmville with Mr. and Mrs. Bennett Gilliam. We are glad Mr. Gilliam is home from the hospital and is improving nicely. Mr. and Mrs. Garland W. Banton, of Ashland, Ky., spent several days last week with Mr. antons mother, Mrs. C. R. Banton. Mr. Banton attended his Class of 1936 reunion Saturday night at Appomattox Senior High School. Mr. Elmo Banton and Mr. and Mrs. Tommie Banton, of, Mechanicsville, Vi.? 1 1 urday o f ? Kfray Banton. Mrs. Peggy Hartness, of Phenix, visited Mrs. Banton Sunday afternoon. Visting Mrs. Mary Bagby during the week were Mr. and Mrs. James Maxwell, Kern Hodges, Becky And James Cook, Mr. and Mrs. Rufus Wingfield, Mrs. Deiorious Deaner, Delorius Ann and Dawn Deaner, Mr. and Mrs. Frank Schampel, Mr. and Mrs. W. H. Wingfield and Julia, Mr. and Mrs. Thomas Woodall and Lisa, Mr. and Mrs. Arron Wilson and son and Mrs. Annie Webb."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family, Mrs. W."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and family, Mrs. W."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [276.5, 257.71, 420.25, 325.05], "bbox_id": "1530520f91", "file": "AppomattoxNewspapers_1962-1965a_0217.pdf", "page": 1, "text": "Week end guests of Mrs. H. T. Terry were her daughter and son- in-law, Mr. and Mrs. Herman Wingfield, of Richmond They ac cepted the invitation to be Sat urday night dinner guests of Mrs. P. A. Robinson, of Charlotte C. j"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Herman <mark>Wingfield</mark>, of Richmond They ac"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. Herman <mark>Wingfield</mark>, of Richmond They ac"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [450.7, 258.91, 595.69, 1024.15], "bbox_id": "80875201a5", "file": "AppomattoxNewspapers_1962-1965a_0624.pdf", "page": 1, "text": "Week end guests of Mr. and Mrs. C. E. Ramsey were Camp-j bell Ramsey and son, Tommy, from Charlotte, N.C. Mr. and Mrs. Eddie Cyrus, from Lynch-! burg Mr. and Mrs. Raymond j Price and son, Gene, of Appo mattox. Mr. and Mrs. Ernest Baldwin and three children recently visit-1 ed the latters parents and sis- ter, Mr. and Mrs. J. E. Letter- man, and Mrs. Ryland Elder in Brookneal. Mrs. Lulu Simpson, of Salis-1 burg, Maryland, is visiting her j daughter and family, Mayor and i Mrs. Richard Williams. She ex pects to spend the summer here. Mr. and M,rs. Clayton Beale went to see Mrs. Beales sisters,  Mrs. Annie Orange and Mrs. Lucy Goin, in Prospect. Tuesday night dinner guests of Mr. and Mrs. Clayton Beale were Mr. and Mrs. Barry Beale, of Appomattox, and Miss Virgin ia Harvey, of Lynchburg. Mrs. Z. T. Moran and Mrs. C. H. McCall spent Tuesday in Lynchburg shopping. Mr. Jack Price stayed with Dr. McCall and,Mr. Moran while they were gone. Mrs. Ruth Eaton spent the day Wednesday in the McCall home. Miss Flora Belle Williams and Mrs. Thomas Caldwell spent several days in Richmond with their brother and family, Mr. and Mrs. Bascom Williams, laist week. Mr. and Mrs. C. V. Wingfield and Mrs. Oscar Pond, of Lynch burg, were callers in the home of Mr. and Mrs. Thomas Cald well Sunday. Mr. R. R. Davis and Mrs. E. N. Cunningham are still patients in the Farmville Southside Com munity Hospital. Miss Flora Belle Williams at tended Founders Day exercises at L o n g w o o d College in Farmville on Saturday. Mr. and Mrs. Wesley Hamlett, James, and Patricia visited Mrs. Hamletts parents, Mr. and Mrs. R. V. Barbour in Gretna Sunday afternoon. Mrs. Alice Marshall is con valescing nicely in her h o m e here now after having been a patient in the Virginia Baptist for sometime. Mr. and Mrs. Lacy Dickerson went to Burkeville to a supper sponsored by a Land Co. in Florida Tuesday night, March 16. Guests inthe home of Mr. and Mrs. R. k . Fore through the week were Coley Ramsey. Wav- erly Foster, Wesley Hamlett, Alex Rosser, Mr. and Mrs. Aus tin Goode, of Dillwyn. Mr. Fore is improving slowly. Mr. and Mrs. G. C. Maxwell visited Mr. and Mrs. Hunter Martin in Evergreen Sunday afternoon. M,r. Martin is improv ing."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. C. V. <mark>Wingfield</mark> and Mrs. Oscar Pond,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. C. V. <mark>Wingfield</mark> and Mrs. Oscar Pond,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [543.87, 438.02, 826.66, 676.8], "bbox_id": "d8377253cc", "file": "AppomattoxNewspapers_1962-1965a_0098.pdf", "page": 1, "text": "Wednesday. We are hoping and I iW sAr? l u r  Mrs. praying he may soon be well. I ard Nash and Brenda Nash. Mrs  IT H Formicon Uontn Miss Dorothy Beasley and 1 Claude Hamlett, of Lynchburg, visited Mi, and Mrs. Grover Beasley, Thursday night. Mrs. Emma Lemon and Mr. j and Mrs. Charlie Bagby were in Lynchburg, Friday. Even though the weather and roads were bad there was a very good crowd at Hollywood Sunday night. Rev. Elder preached a sermon. Mr. and Mrs. Charlie Bagby called ip the homes of Mrs. Joe Slough and family and Mr. and Mrs. Robert Smith and family Sunday. Mr. and Mrs. Ted Moore visit- ! ed Mr. and Mrs. Robert Smith and family Sunday night. Mr. and Mrs. W. H. Wingfield and daughters, cf Lynchburg, were Sunday guests of Mr. anc"}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and daughters, cf Lynchburg,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "and Mrs. W. H. <mark>Wingfield</mark> and daughters, cf Lynchburg,"}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [1766.15, 1101.55, 1928.97, 1164.8], "bbox_id": "9515298771", "file": "AppomattoxNewspapers_1905-1912a_0086.pdf", "page": 1, "text": "WEDDINGS. Lynchburg. At the parsonage ol Centenary Methodist Church Misi Ella Wingfield, daughter of Mr. and Mrs. William Wingfield, was married to Mr. Raymond Vlar, of Madisor Heights."}, "highlight": {"text": {"matched_tokens": ["Wingfield", "Wingfield"], "snippet": "WEDDINGS. Lynchburg. At the parsonage ol Centenary Methodist Church Misi Ella <mark>Wingfield</mark>, daughter of Mr. and Mrs. William <mark>Wingfield</mark>, was married to Mr. Raymond Vlar, of Madisor Heights."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield", "Wingfield"], "snippet": "WEDDINGS. Lynchburg. At the parsonage ol Centenary Methodist Church Misi Ella <mark>Wingfield</mark>, daughter of Mr. and Mrs. William <mark>Wingfield</mark>, was married to Mr. Raymond Vlar, of Madisor Heights."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
{"document": {"bbox": [2280.19, 176.63, 2423.66, 263.92], "bbox_id": "3d6def41dc", "file": "TimesVirginian_1978_0202.pdf", "page": 1, "text": "Webb and Mr. and Mrs SCdtt Sheets visited Mr. and Mrs. H. Wingfield and family Sunday night. v  . . Mr. and Mrs. Elmo Smith were visitors Sunday night of Mr. and Mrs. Richard Webb and family."}, "highlight": {"text": {"matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. H. <mark>Wingfield</mark> and family Sunday night."}}, "highlights": [{"field": "text", "matched_tokens": ["Wingfield"], "snippet": "Mr. and Mrs. H. <mark>Wingfield</mark> and family Sunday night."}], "text_match": 578730123365187705, "text_match_info": {"best_field_score": "1108091338752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "578730123365187705", "tokens_matched": 1, "typo_prefix_score": 0}}
