{"document": {"bbox": [1764.56, 333.48, 2123.21, 1437.5], "bbox_id": "72bd2d5fea", "file": "AppomattoxNewspapers_1943-1947a_0205.pdf", "page": 1, "text": "sister Southern States, which had already seceded. The call went out for volunteers to defend the firesides of the Old Do minion. Appomattox County responded nobly. A Cavalry Company was formed under the command of Capt. Joel W. Flood, becoming Co. H of the 2nd Va. Cavalry. A Company of Heavy Artillery was formed under Capt. James Robertson. A Company of Infantry under Capt. Thos. P. Mat thews, and another Company was formed under Capt. Wm. H. Abbitt, and quite a number of Appomattox citizens living near the rim of the county joined companies from adjoining coun ties. With hearts aflame and bodies dedicated to the Cause they held dear, they went to the front and shared the destiny of the heroes in Gray. Weakened by casualties, new calls came for volunteers, and long after the war, there was a scarcity of able bodied men in the County. Then came April 9, 1865, and the hand of destiny wrote finis across the scroll of four mighty years of struggle Destiny selected Appomattox for one of the major events oi history. Today there is hardly a town- or village in America, that has not heard of Appomattox. Thus ended in this Coun ty, one of the greatest Civil Wars ever chronicled in the files of Time, and at Appomattox began a new page in the history of America. Military rule was established shortly after April 9, 1865. Al county officers were replaced by military appointees. These were men who were selected upon the recommendation of the incumbents, and were willing to take the Iron Clad Oath. In the fall of 1866, an election was held under the Under wood Constitution, which put into effect the 13th and 14th Amendments to the Constitution of the United States, and a new slate of officers were named. Geo. T. Peers became Clerk Wm. T. Johnson Sheriff W. J. Collins, Commissioner of the Revenue the Office of County Treasurer was created Supervisors were provided for, and the ounty Government, practically as we have it now was estab lished. The ravages of four years of war were apparent, and Ap pomattox along with her sister counties, began to repair the wounds. The following years called forth the character and ability of her people, and the present institutions of our Coun- -y are but a tribute to their untiring labor and foresight. From 1870 to the present has been a period of rebuilding and achievement. From its creation the County has been served until now by the following Officers CIRCUIT JUDGESJudges G. A. Wingfield, J. D. Hors- rv, Sam Coleman, George J. Hundley, Robt. F. Hutcheson and Joel W. Flood. COUNTY JUDGESLewis Daniel Isbell, Henry T. Par-  rish and David A. Christian. TRIAL JUSTICEST. R. Horseley and L. F. Ferguson. COUNTY CLERKSJohn T. Bocock, Henry F. Bocock, Geo. T. Peers, Geo. W. Abbitt, John Rolfe Horsley and Claude W. Smith. , COMMONWEALTHS ATTORNEYSThos. S. Bocock, L. D. Isbell, Crawford Jones, Edward Woodson, T. J. Thornhill, David A. Christian, W. C. Franklin, H. D. Flood, Samuel L. Ferguson, Joel W. Flood and W. M. Abbitt. SHERIFFSJoel Watkins, Geo. T. Peers, William Paris, Wilson Hix, W. T. Johnson, Wm. H. Gills, Cooch Plunkett, T. B. Bryant, S. P. Coleman, Frank W. McKinney and H. W. Mc Kinney. COMMISSIONERS OF THE REVENUEThos W. Johns, Isaac Adams, Andrew B. Baker, John W. Gilliam, Geo. W. Ab bitt, Van Gilliam, Wm. Statham, L. E. Smith, H. C. Babcock, E. R. Abbott and J. H. OBrien. COUNTY TREASURERSWm. H. Gills, Cooch Plunkett, S. R. Franklin, D. Mott Robertson, R. F. Burke and R. L. Burke. SUPERINTENDENTS OF SCHOOLSC. H. Chilton, J. B. Bristow, J. K. Hannah, N. R. Featherston and J. A. Burke. STATE SENATORSThe County has furnished the fol lowing State SenatorsCol. Wyatt Elliott, Col. Samuel D. Mc Dearmon, Col. Robt. B. Poore, H. D. Flood, Samuel L. Ferguson and Chas. T. Moses. HOUSE OF DELEGATESThe following citizens of the county have served in the House of Delegates Col, Samuel D. McDearmon, Zachariah Cheatham, Crawford Jones, R. P. Poore, Joel W. Flood, Thos. S. Bocock, James Watkins, D. Mott Robertson, W. C. Franklin, H. D. Flood, J. W. Harwood, Ster ling C. Stratton, Willis H. Ligon, J. R. Horsley, J. C. Jones, A. B. Thornhill, T. J. Stratton, J. W. Cawthorn and R. L. Burke. The Constitution of 1902, abolished the County Court, the duties of which were transferred to the Circuit Court, the County Clerk and the Board of Supervisors."}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "fol lowing State SenatorsCol. <mark>Wyatt</mark> <mark>Elliott</mark>, Col. Samuel D. Mc"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "fol lowing State SenatorsCol. <mark>Wyatt</mark> <mark>Elliott</mark>, Col. Samuel D. Mc"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [917.75, 336.57, 1065.17, 965.04], "bbox_id": "ba9ae9cb01", "file": "AppomattoxNewspapers_1971-1973a_0077.pdf", "page": 1, "text": "Mr. and Mrs. R. C. Moore, Jr. of Fairfax are spending a j few days with Mrs. T. N. Saul, i Mr. and Mrs. T. C. Beasley of Roanoke spent the week end I in the home of Mr. and Mrs. Kemper Beasley, Sr. Recent visitors in the home of Mr. and Mrs. Raymond G. Barr were Mrs. Rutha Barr, Mrs. Grover Barr, Mrs. Etta Riddle, Mr. and Mrs. Joe Barr all of Farmville, Mr. and Mrs. Ray L. Duty, Karla Lea of An- dersonville. Sunday visitors of Mr. and Mrs. A.N. M orris were Mrs. Curtis Nester and daughter of Lynchburg. Mr. and Mrs. W. A. Haver and family of Dillwyn were Sun day visitors of Mr. and Mrs. Roger M orris. Mr. and Mrs. Bennie Wil liams and M rs. Ruth Beasley spent the week end with Mr. and Mrs. Sam Baldwin at Rust- burg. Mr. and Mrs. Kelly Branch and family of Buckingham visit ed Mr. and M rs. Kemper Beas ley, Sr. Saturday night. The community was saddened last week by the death of the Rev. Keith Whitehead at New Market, Tenn. Mr. and Mrs. Bob Bryan, Phillip and David attended the funeral there F ri day. Sunday visitors of Mr. and Mrs. Rice Seay at Anderson- ville were Mr. and Mrs. Roger Morris and family. The Youth Group of the Chest nut Grove Baptist Church at tended a Billy Graham Movie at Lynchburg Saturday night. Mrs. Lucy Glover has re  turned to her home after visit ing Mr. and Mrs. Kermit Cook in Richmond. Mr. and Mrs. Robert Glover of Lynchburg vi sited his mother Sunday. Mr. and Mrs. Kemper Beas ley, Sr. visited in the Wyatt Elliott home at Curdsville Sun day. The regular W.M.S. Meeting will be held in the home of Mrs. Carrie Senger Friday, Nov. 15,"}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "Sr. visited in the <mark>Wyatt</mark> <mark>Elliott</mark> home at Curdsville Sun"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "Sr. visited in the <mark>Wyatt</mark> <mark>Elliott</mark> home at Curdsville Sun"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [565.19, 519.87, 707.59, 834.2], "bbox_id": "1e50ba24ae", "file": "AppomattoxNewspapers_1974-1975a_0303.pdf", "page": 1, "text": "E. Cheatham 2. This person helped design the Countys coat of arms a. Hezetine Foster b. Reubin Palmer c. Thomas Cardwell d. Helen Harvey 3. In 1845, he had to collect the county tax a. Sheriff b. Commonwealth Attorney c. Storekeeper d. Judge 4. Appomattox Countys first state senator a. S. L. Ferguson b. Wyatt Elliott c. R. B. Poore d. Henry Pannell 5. She also helped to unveil the Conf. Monument in 1906 a. Lynolee Atwood b. Annette Williams c. Mary Bartelt d. Frances Verna Questions taken from Vara Stanleys A History of Appo mattox County ANSWERS 1. c 2.  d 3.  a 4.  b 5.  a"}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "S. L. Ferguson b. <mark>Wyatt</mark> <mark>Elliott</mark> c. R. B. Poore"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "S. L. Ferguson b. <mark>Wyatt</mark> <mark>Elliott</mark> c. R. B. Poore"}], "text_match": 1157451471441100921, "text_match_info": {"best_field_score": "2211897868288", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471441100921", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1417.2, 660.05, 1576.4, 706.05], "bbox_id": "9b04410976", "file": "AppomattoxNewspapers_1902-1905a_0185.pdf", "page": 1, "text": "Mr, Willie Moseley and brother, of Jackson, Miss., nephews of Genl Wyatt M. Elliott, deceased, are visit ing the oil homestead in this county."}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "Mr, Willie Moseley and brother, of Jackson, Miss., nephews of Genl <mark>Wyatt</mark> M. <mark>Elliott</mark>, deceased, are visit ing the oil homestead in this county."}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "Mr, Willie Moseley and brother, of Jackson, Miss., nephews of Genl <mark>Wyatt</mark> M. <mark>Elliott</mark>, deceased, are visit ing the oil homestead in this county."}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1822.2, 445.39, 1983.98, 931.22], "bbox_id": "15de4695d2", "file": "AppomattoxNewspapers_1902-1905a_0007.pdf", "page": 1, "text": "-iM Puro- Dr. Lacy prawned again on Sai- rday and Sunday last fit. Curds- ville Episcopal -church. No preach- of any denomination dyfWfl,larger crowds at any church in Sonthside Buckingham thhn does Dr. Lacy. The church was crammed to over flowing on Sunday. H ia theme was, The Son of Man came to seek and and to save those which were lost. Amongst those from  distance, we noticed Mr. and Mrs. Price Glover, of Camm. Dr. Yonng, who has located at this place, had an urgent call on Sunday night to visit Mrs. A rthur Hackett, who had been suddenly seized with convulsions. She is tp- day resting easier. Mrs. Hebditch is ktill in Ports mouth, visiting her daughter, Mrs, Newsom. Mr. John Cook has sold his farm Tthe former home,of the late Ander son W right to  negro, and has bought a farm near Gardenia, in Prince Edward. There are a dozen negro freeholders within two miles of Lock Mills, owning from 40 to 200 acres each. Messrs. John and Ed. Garnett and Garnett Elliott a grandson of your fine old conntyman, General Wyatt M. Elliott are making the welkin ring with their horns and foxhounds, Foxhunting is, ppr excellence, the gentlemans sport, and ttie music of pack in full cry is exhilarating in the extreme. November 24, 1902."}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "fine old conntyman, General <mark>Wyatt</mark> M. <mark>Elliott</mark> are making the welkin"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "fine old conntyman, General <mark>Wyatt</mark> M. <mark>Elliott</mark> are making the welkin"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [200.92, 231.1, 534.09, 805.49], "bbox_id": "9b67e2f0fe", "file": "AppomattoxNewspapers_1892-1898a_0386.pdf", "page": 1, "text": "General Wyatt M. Elliott, clerk of the United States Circuit and District courts died in Lynchburg at his home after a brief illness j Thursday 25th, ult. General Elliott was born in Campbell conntv, Febru ary 25,1823. A t an early age, being only 8 years old he removed to Buckingham county where he re ceived his earliest education, at the age of 16 he was sent to the Virginia Military Institute after which course he taught school, then taking up t course of law, he then became asso dated in the publication of tin Richmond W hig until the first year of the late war, in which he figured as a man, soldier, lieutenant, colonel and general, his deeds of daring aud adventure were many aud thrilling. After the war he resumed the pub lication of the W hig he then in 1866 removed with his family to Appomattox county here he pursued the occupation of farmer for a number of years in 1871-72 and Now if these parties desire their l be represented Appomattox papers stopped it i 3 a very easy 1 0011,1  in the House of Delegates matter for them to tell how much anin 75 was chosen State Senator they owe this office from Oct. 1 , 1 rora the district composed of the 1896 to date, any upon the pavrnen I counties of Appomattox,Buckingham o f same we shall be glad to stop the   d Fluyanna, where lie served paper. It costs money- to run a f,wo terms. General Elliott was newspaper -antfwhile we do not wisl i  un eider in the Presbyterian church to eejkrthe paper to people who d o and was ru lin g elder in the old flt .want it we must adhere to the Koncord church. He was twice mar aud request that in all cases l red bis filst wife was Miss Maria bscribers will remit what is d u e  ose  Appomattox county us before their paper is discon -1 tbree his children survive him, tiuued. We expect every subscriber I Horace B ., E lla V., William Arthur, to pay for this paper. So while u 89 he married Miss Elizabeth your account fa small, if yon really I rent, of Cumberland who surviyes do not think your couilty paper is  bID On Saturday morning his ie- mams were conveyed over the C. worth one dollar per year to your home, settle up and then order it stopped. Be sure that you settle j county where they were laid to rest befoie you ask U 6 to stop your pa -1  Hie old home place of Colonel per."}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "General <mark>Wyatt</mark> M. <mark>Elliott</mark>, clerk of the United"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "General <mark>Wyatt</mark> M. <mark>Elliott</mark>, clerk of the United"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1599.88, 688.82, 2105.93, 1173.89], "bbox_id": "3759cd7aa4", "file": "AppomattoxNewspapers_1905-1912a_0085.pdf", "page": 1, "text": "day. Mr. Elliott was the son of thh j this place od the I9h of -March, late Genl Wyatt M. Elliott of Apr I And the Boys Corn Club will meet pomattox Gonnty, who at the time! here on the same day. of his death, was Gerk of the Unit-1 It seems more thau probable that them to stay on the farms, and as led States Oircnit Court at Lynch I Buckingham Connty will bo again I g0me one has aptly said, make two  burg. He was the sonin-law of the I placed in the jndoial. distriot over blades of grass grow where one I late A. 0. Garnett -He died at the I which Judge Hundley presides as  grows now. May their labors be I home of his son, W, Garnett Elliott,  OirouitCourt Judge, as a bill to crowned with ever increasing sue- I near Ourdsville, Va. on the night of I this effect has passed the House, I cess. Commence early and train  Wednesday, March 2nd. J and was favorably reported by the  the boys that farm work is to be  We see upon the streets this J Senates Committee,on Courts oftheirlifew orkandthatitianotde-  morning, Mr. J. W. Word, who wasjnstic?. If this measure is passed gracing as some aeem to think, slightly stricken with paralysis J by the Senate it will become opera-1 And by the way there is a little boy some week or more since. M i.tive in three months-from-tbe datejin this neighborhod who tied np  Word seems to be fast , recovering j of its passage. Bnokingham people  two hundred bundles of tobacoo in  from his attack. J have a warm welcome in store fo r0neday. Now where-is tho little We hear many compliments paid I Judge Hundley should he again ap-1 7 .yWP. 0 ld-boy, who can beat litth the Sir Knights, who matched pear here as their Judge. They Hubbard PlnnkettP Let ns hen  lances at the tournament which gave him up with relnotance, when  came off near Enonville, Va. on this County was plaoed ih the new ! Saturday the 5th of Maroh. There  district, and while Judge Gordon f were four that tied for the firsthas made many friends and no EI honor. Numerous rerides had to  enemies th aU know of. yet we v had  be taken ere the victorious kmght learned to look upon Judge Hand- f was known. When the smoke of  ley aa citisen of this County and  battle had cleared away, it was j one who had a love for, and kindly I found that the Night of the Silver interest in the people among whom Lance R. L. Gillispie was declar-jhe had lived so many years. Not èd the conqueror Mr..S. E. Donna- that we like Gordon less, bat tfaut vant, the winner of the first honor we like Hundley morels our reason Mr. Richard Dnnnavant, that of the I for being gratified if the change second honor and Mr. Herman J should be made.  Price the third honor. Who the I was on the Dillwyn tobacco! Queen and Maids of Honor were, wejmaiket on the 5th and saw a load of have not learned. It is presumed tobacco taken off of a  wagon that I however that the entertainment will  had on 3 grades on which the owner I be more fully reported by the At-1 set a price of 6, 9 and 11, and I canum correspondent, who we learn when it was sold eaoh grade brought wa present, and delivered the I more than was asked for it. The"}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "of -March, late Genl <mark>Wyatt</mark> M. <mark>Elliott</mark> of Apr I And"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "of -March, late Genl <mark>Wyatt</mark> M. <mark>Elliott</mark> of Apr I And"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1823.48, 443.45, 1984.18, 931.42], "bbox_id": "c4435a73e1", "file": "AppomattoxNewspapers_1902-1905a_0006.pdf", "page": 1, "text": "am ,ed again on Sa- nrday aud Siioday last ft. Curds- ville Episcopal church. No preach er of any denomination dffwl larger crowds at any churoh in Southside Buckingham thin does D l Lacy. The church was crammed to over flowing on Sunday. His theme was,  The Son of Man came to seek and and to save those which were lost. Amongst those from a distance, we noticed Mr. aud Mrs. Price Glover, of Camm. Dr. Yonng, who has located at this place, had an urgent call on Sunday night to visit Mrs. Arthur Haokett, who had been suddenly seized with convulsions. She is tp- day resting easier. Mrs. Hebditch is fctill in Ports mouth, visiting her daughter, Mrs. Newsom. Mr. John Cook has sold bis farm the former home, of the late Ander son Wright to a negro, and has bought a farm hear Gardenia, in Prince Edward. vThere are a dozen negro freeholders within two miles of Rock Mills, owning from 40 to 200 acres each. Messrs. John and Ed. Garnett and Garnett Elliott a grandson of your tine old county man, General Wyatt M. Elliott are making the welkin ring with their boms and foxhounds. Foxhunting is, pyr excellence, the gentlemans sport, and the music Of a pack in full ory is exhilarating in the extreme. November 24, 1902."}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "old county man, General <mark>Wyatt</mark> M. <mark>Elliott</mark> are making the welkin"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "old county man, General <mark>Wyatt</mark> M. <mark>Elliott</mark> are making the welkin"}], "text_match": 1157451471306883193, "text_match_info": {"best_field_score": "2211897802752", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471306883193", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1057.89, 718.38, 1194.59, 802.07], "bbox_id": "ea20f89423", "file": "AppomattoxNewspapers_1974-1975a_0251.pdf", "page": 1, "text": "University of Virginia. He is married to the former Patricia Carroll Davis of Newport News and they have a young son, Carrington Wyatt, age 17. Elliott practices law in Rust- burg and they live at Winfall Farm south of Rustburg."}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "a young son, Carrington <mark>Wyatt</mark>, age 17. <mark>Elliott</mark> practices law in Rust-"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "a young son, Carrington <mark>Wyatt</mark>, age 17. <mark>Elliott</mark> practices law in Rust-"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1090.57, 247.59, 1235.81, 902.21], "bbox_id": "a75c244d49", "file": "AppomattoxNewspapers_1971-1973a_0321.pdf", "page": 1, "text": "T will sing at mercy and jud-  gement unto thee, O Lord, will I sing. Psalms 1011 The appreciate service for the Pastor Rev. C. L. Elliott and wife were a successful one. Called Elliotts night. The M.C. was Rev. H. O. Flood. Open song by the choir,  Pass Me Not. Prayer by Deacon Wyatt Vernable and scripture reading by William Haskins, taken from Psalm 1011-5. Song by church choir We are March ing  lead by Leon Wesley. Welcome address Mrs. Alice Moore, response by one Rev. Elliott family from Pilot Mt. Baptist Church. Church paper read by Mrs. Catherine Has kins. Three letters meaning so much We Thank You. Guest minister was Rev. James Mil ler sermon  Hold On. Every one enjoyed the wonderful mes sage. Special song by choir Hold On Just A Little While Longer. Offering lifted by Dea. L. M. Harvey, Dea. Woodrow Haskins, and Dea. Eddie Han cock. A lovely offering was lifted. A corsage of white carn ations were pinned on Mrs. Ida Elliott by Mrs. Minerva Vena ble also a cake was given with 12 candles representing 12 years of service, baked by Mrs. Bertha King. A crown was placed upon Rev. Elliotts head consisting of 120.50 . Mrs. Catherine Haskins, members of the church and friends gave donations for the crown. A special solo was sung by mem bers of Elliott family  Give Me My Flowers . Remarks by Mrs. Catheine Haskings Mrs. Lessie Thompson, Mrs. Elliott. A book was given to Rev. Elliott by Dea. Wyatt Venable. Remarks by pastor Elliott. A song was lead  Somewhere Around God Throne. Closing remarks Rev. James Miller at the close of the sermon photos were taken by Rev. Elliotts son, Mr. Ray mond Elliott and William Has kins. Mrs. Haskins wishes to thank everyone for their pre sent and their kind ways and actions to make this program a success. Thank you again."}, "highlight": {"text": {"matched_tokens": ["Elliott", "Wyatt"], "snippet": "was given to Rev. <mark>Elliott</mark> by Dea. <mark>Wyatt</mark> Venable. Remarks by pastor"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott", "Wyatt"], "snippet": "was given to Rev. <mark>Elliott</mark> by Dea. <mark>Wyatt</mark> Venable. Remarks by pastor"}], "text_match": 1157451471172665465, "text_match_info": {"best_field_score": "2211897737216", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471172665465", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1967.02, 452.79, 2119.68, 967.52], "bbox_id": "a799f10d71", "file": "TimesVirginian_1976_0214.pdf", "page": 1, "text": "And I looked, and lo, a Lamb stood on the Mount Sion and with him and hundred forty and four thousand having bis Fathers name written in their foreheads. Rev. 141 The regular Drenching serv- i ice will be held at the Alabama - Baptist Church, Pastor, Rev. Curtis Elliott, pulpit guest, Rev. Wyatt T. Venable, Pastor New Store Baptist Church in Buckingham. Prayer service will be lead by Miss Pearl Moore and Miss Ruth Jackson. The scriptures and prayer in morning service read by Rev. Venable. A large crowd attended morning serv ice. It was enjoyed by all. A love offering was lifted for Mrs. Ida Daniel. We thank each visiting person who attended our services, visiting deacons from Mt. Lyle, St. Louis, White Oak Grove and Mt. Pleasant. The third Anniversary of Gospel Quintet of Pamplin, Va. was a great success an over flow crowd gathered to hold the celebration. M. C. Freddie Munford of Richmond, Devo tion lead by Young Adult Junior Choir of White Rock Baptist Church, Lynchburg, Va. Opening song - Leaning on His Everlasting Arm, Scripture Miss Ruth Jackson, Prayer by Deacon Arther Watkins, song by choir, Christ Is All, Welcome given by Mrs. Linda Watkins and response by Mrs. Mattie Lawson. Guest evening Spirit ual Traveleers of Keysville, Va. Buckingham Choriis, Dillwyn, Va. Miss Gladys W alker, _ Pamplin, Jordanaires of Appo-"}, "highlight": {"text": {"matched_tokens": ["Elliott", "Wyatt"], "snippet": "Church, Pastor, Rev. Curtis <mark>Elliott</mark>, pulpit guest, Rev. <mark>Wyatt</mark> T. Venable, Pastor New"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott", "Wyatt"], "snippet": "Church, Pastor, Rev. Curtis <mark>Elliott</mark>, pulpit guest, Rev. <mark>Wyatt</mark> T. Venable, Pastor New"}], "text_match": 1157451471038447737, "text_match_info": {"best_field_score": "2211897671680", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451471038447737", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [440.63, 241.81, 581.24, 862.13], "bbox_id": "5b3d3f6a77", "file": "AppomattoxNewspapers_1974-1975a_0466.pdf", "page": 1, "text": "A very large crowd of ministers, deacons and friends attended the ordination of two young men to the Deacon Board of the Zion Baptist Church last Sunday evening at 330. The pastor of the church. Rev. L. E. Hankins, led the devotionals and extended a cordial welcome to all who came. After the welcome the clerk, Mrs. 0. W. Smith, called the list of ministers and churches invited. After direc tions from the pastor the following council was formed as follows Moderator, Rev. R. Q. Lawing Clerk, Deacon Frank Johnson Ordination sermon, Rev. C. L. Elliott Charge to the Church, Rev. Wyatt Venable Charge to the candidates, Rev. Jordan Presentation of the Bible, Rev. Carmore Presenta tion of the hymn book Rev. Richardson Ordination prayer, Rev. Roy Wood Right Hand of Fellowship, Deacon Otis Scott Offering, the Candidates, Dea cons Lawson and Toney Ferguson. The service was very impressive and every one was spiritually feed. A large crowd attended the regular preaching service at the Zion Baptist Church Sunday morning at 11 a.m. The pastor Rev. L. E. Hankins delivered an inspiring sermon on the subject On the Other Side of the Road. There were visitors from the Morning Star Baptist Church present. Beauti ful music was rendered by the Senior Choir under the direction of Mrs. Grace Wormack. All present were uplifted. The offering was great. Impressive services were held at the Galilee Baptist Church Sunday morning at 11 a.m. with the pastor Rev. Lawing in charge. Special music was rendered by the Junior and Senior Choirs. The right hand of fellowship was given to five new members. After the fellowship the holy"}, "highlight": {"text": {"matched_tokens": ["Elliott", "Wyatt"], "snippet": "sermon, Rev. C. L. <mark>Elliott</mark> Charge to the Church, Rev. <mark>Wyatt</mark> Venable Charge to the"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott", "Wyatt"], "snippet": "sermon, Rev. C. L. <mark>Elliott</mark> Charge to the Church, Rev. <mark>Wyatt</mark> Venable Charge to the"}], "text_match": 1157451470770012281, "text_match_info": {"best_field_score": "2211897540608", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470770012281", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1680.0, 209.67, 1825.94, 540.06], "bbox_id": "66611e2fca", "file": "TimesVirginian_1978_0005.pdf", "page": 1, "text": "Blessed in the man that walketh not in the counsel of the ungodlynor standeth in the way of sinners, nor sitteth in the seat of the scornful. Psalms 1L Prayer Service at 1130. Mrs. Alidfe Moore and Mrs. Cather ine Haskins were in charge. Everyone joined in the service. Happy New Year to every one is extended from the pastor and members of the Alabama Church. Regular preaching service was held at the Alabama Baptist Church with our pastor Rev. Elliott in charge. Script ure reading was by Rev. Wyatt T. Venable. Prayer by Rev. Howard 0. Flood. Music was furnished by the Adult and Junior Choirs. Rev. Elliotts text was taken from Ezekiel 3626-27. Theme, GodjskNjOYear Gift. A splendid message was preach ed. Everyone seem to enjoy the sermon. A large crowd attend ed the service the first Sunday in the New Year."}, "highlight": {"text": {"matched_tokens": ["Elliott", "Wyatt"], "snippet": "with our pastor Rev. <mark>Elliott</mark> in charge. Script ure reading was by Rev. <mark>Wyatt</mark> T. Venable. Prayer by"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott", "Wyatt"], "snippet": "with our pastor Rev. <mark>Elliott</mark> in charge. Script ure reading was by Rev. <mark>Wyatt</mark> T. Venable. Prayer by"}], "text_match": 1157451470367359097, "text_match_info": {"best_field_score": "2211897344000", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1157451470367359097", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [438.7, 194.86, 580.2, 1146.36], "bbox_id": "ac2c65461a", "file": "AppomattoxNewspapers_1974-1975a_0474.pdf", "page": 1, "text": "The annual Freedom Fund Rally will come to a close this Sunday evening at 730 at the Galilee Baptist Church. The guest speaker will be Mr. Joseph F. Lewis, a former teacher in Appomattox and now a worker in the State Correctional System. The devo tional will be conducted by the pastor of the church with music furnished by the Galilee Senior Choir. All contestants are asked to report their monies to the finance committee between 7 and 720. Mrs. Annie Mae Humbles is chairman of the program committee. Each church in the county has been asked to cooperate. The rally is sponsored by the local branch of the NAACP. The general public is cordially invited to be present. The Mount Shiloh Baptist Church Usher Board will celebrate its anniversary on the first Sunday in November at 3 p.m. Local Usher Boards have been invited to take an active part. The Rev. Roger Ford has been invited to be the guest speaker. The talent program sponsor ed by Miss Evelyn Wright of the First Baptist Church last Sunday at 3 p.m. was enjoyed by all. The pastor of the church. Dr. K. W. Davis, conducted the devotions. He was assisted in the service by the Rev. R. Q. La wing. Music was furnished by the First Baptist Church gospel chorus under the direction of Mrs. H. P. James. Among the talents were the following A paper, Miss Evelyn Wright Duette, Mrs. Ora McCoy and son Reading, Mrs. Sally Reid Solo, Mr. Jam es Reid Solo, M aster Edward McCoy A dramaza- tion, Mary Had a Little Lamb by Mrs. Lillie Stevens Offering by Deacons Solomon and Edward McCoy Deacon Percy Johnson of Mount Airy gave the opening prayer. Mrs. Evelyn Berry rendered a solo. The offering was very good. Words of appreciaiton were given by the pastor and the benediction was given by Rev. La wing. The Rev. Wyatt Venable and his musical group will render a special service at the Promise Land Baptist Church on the second Sunday evening in November at 3 p.m. The officers, members and friends nyited to attend.. The Rev. Edward McCray f gpfappe of hwchoin will render service at the Galilee Baptist Church on the third Sunday evening in November at 730. Members and friends are asked to attend. A large crowd atten- od the regular preaching service at the Mount Shiloh Baptist Church last Sunday morning. The Rev. C. L. Elliott deliver! the morning message. Mrs. Eva C. Morgan, Mrs. Belle Terry and Mr. Thomas Patterson of Roanoke, were guests in the Howard Stevens home over the week end, also attending the Mount Airy Homecoming services in Appo-"}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "La wing. The Rev. <mark>Wyatt</mark> Venable and his musical"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "La wing. The Rev. <mark>Wyatt</mark> Venable and his musical"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1639.39, 1104.42, 1775.45, 1268.96], "bbox_id": "c0baa441d8", "file": "TimesVirginian_1980a_0241.pdf", "page": 1, "text": "speaker. Several visitors attended the service. A large crowd attended the regular preaching ser vice Of the Chestnut Grove Baptist Church last Sunday. A special love offering was lifted during the offering period in honor of the Rev. R. Q. Lawing. Sr. The pastor - is the Rev. Wyatt Venable The Morning Sun Baptist Church reported a success ful revival last week. The evangelist. was Rev. Philip Elliott of Lynchburg."}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "pastor - is the Rev. <mark>Wyatt</mark> Venable The Morning Sun"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "pastor - is the Rev. <mark>Wyatt</mark> Venable The Morning Sun"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [518.11, 1079.11, 689.02, 1579.29], "bbox_id": "86e832fe62", "file": "AppomattoxNewspapers_1892-1898a_0298.pdf", "page": 1, "text": "PRIVATES. Abbett Geo. Dallas Alvis Ed ward, died in hospital at Mt. Jack- son, 1862 Alvis Wm. M., wounded Bagby Luke, discharged Banton James Bell Wyatt H . Bingham, Jno. S., discharged Bocock, Jno, T., deserted in December 1863 Bragg, Jno. J., transferred Bran ham, George W., from Albemarle county Brown, C. C. Carson, Jno, J. Carson, M. J. Carson M. W. j Cawthorn, Hudson  Cheatham, R, H., wounded at 2nd Manassas, Sept. 22nd 1862 Chick, J. J., captured wounded at Hanes Shop, May 28th, 1864 Chick, E. A . Clock, Cotton  Clock, William Clarke Henry Clarke William Coleman Drury  Coleman Henry, died in hospital Coleman, J. A., captured at Toms Brook, Oct. 9th, 1864 Colemtn Madison Coleman, Schuyler, died pt home 1862 Connelly, Warner Geo. Conner Allen, discharged lb overage Crawley, Richd, trans ferred  Crenshaw, Jno J., captured u Ilanes Shop. May 28th, 1864. Crumby, Frank, died in hospital in Richmond 1862 Davidson Jas II., died Diggs, John Doss, Jos. E. Dunn,put in substitute Elliott, Jno W. died at home in service Elli ott, Thos. wounded at Toms. Brook, Oct. 9th, 1864 Featherston, Jas. H. detailed with Hills, A. P. Signal j corps Ferbush, Henry discharged f Furbush, J. D. killed at Fort Ken- i"}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "discharged Banton James Bell <mark>Wyatt</mark> H . Bingham, Jno. S.,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "discharged Banton James Bell <mark>Wyatt</mark> H . Bingham, Jno. S.,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1832.99, 1038.11, 1998.01, 1529.78], "bbox_id": "772b216247", "file": "TimesVirginian_1983a_0139.pdf", "page": 1, "text": "Prayer is the key to the kingdom. Faith unlocks the door. The regular preaching service was held at Gravel Hill Baptist Church this Sunday with the Rev. James Miller in charge. The message V was excellent, and enjoyed by .!!. The Adult Choir rendered beautiful music, accom panied by Mrs. Mattie Watson at piano. We were happy to welcome visitors from New Store, Peaks, Mt. Pleasant and Morriing Star Baptist Churches. The Spring revival was a great success. Participating ministers included The Rev. James Miller, Monday night, accompanied by his Adult Choir and pianist, Mattie Watson the Rev. Wyatt Venable, Tuesday, accompanied by the New Store Choir The Rev. Earl Jones, Wednesday, accompanied by the Jones Family The Rev. Earnest Humbles, Wednesday, accompanied by the Jordan Junior Choir, with Roberta Womack at piano the Rev. Curtis Elliott aided pastor Hum bles The Rev. Warren Napier, Friday, accompanied by the Mt. Pleasant Senior Choir, with Mr. James Moore at the piano. We wish to thank all who took part in the service. The Rev. William Venable and the Bobber Sisters will render the service at Gravel Hill Baptist Church the first Sunday in May at 3 p.m. Mrs. Elnora Woolridge is sponsor. The great evangelist, Mrs. Odell Johnson of Maryland will preach at Gravel Hill the third Sunday in May at 4 p.m. You are invited. Our prayers go out to the sick and shut-in."}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "Mattie Watson the Rev. <mark>Wyatt</mark> Venable, Tuesday, accompanied by"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "Mattie Watson the Rev. <mark>Wyatt</mark> Venable, Tuesday, accompanied by"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2034.74, 622.39, 2161.97, 764.14], "bbox_id": "ce053ed93e", "file": "TimesVirginian_1980a_0277.pdf", "page": 1, "text": "Pat and Mike Torrence. Micah and Wyatt happily announce the arrival of thé newest member of their family, Brady Kipp. Born September 1- at Virginia Baptist Hospital, he weighed 9 lbs. 5 ozs. at birth. Maternal grandpa r e n t s are Jane and Jimmy Tibbs of Spout Springs. Paternal grandparents aré Lorraine and Elliott Torrence of Appomattox."}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "Mike Torrence. Micah and <mark>Wyatt</mark> happily announce the arrival"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "Mike Torrence. Micah and <mark>Wyatt</mark> happily announce the arrival"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1460.14, 1194.65, 1619.71, 1776.66], "bbox_id": "821afcd007", "file": "AppomattoxNewspapers_1892-1898a_0364.pdf", "page": 1, "text": "Our correspondent from Spanish Oaks writes Mr. James Shearer, one of our. most respected citizens lias been critically ill for move than a week and is hardly expected to recover, lie was found in an un conscious conditiou and has never fully regained consciousness since akeu. His trouble is thought to be heart disease. Later.Since the above was writ ten we learn that Mr. Shearer died yesterday. ..We are also very sorry to report the death of Kendrick Stratton, one of the oldest aud most highly re spected colored men of this com munity. Everybody knew Kendrick and he knew everybody in several counties around. lie was respected and trusted by all, and many will be truly sorry to hear of his death. He died from the effects of a neglected cold. Dr. Bice was called to see him when it was too late to do him any service. Dr. George B. Taylor is stirring up the Baptists before he takes his leave of absence. lie organized Monday night at Kirklea a C. C. C. class with the following enrolled as members Wyatt Abbitt, Mrs. Wyatt Abbitt, Miss Annie Abbitt, B. L. Burke, Miss Lacy Caldwell. Miss Dawson, Miss Mattie Jones, Prof. J. B. Loving, Geo. T. Peers. Miss Macca Sims, Geo. B. Taylor. Others will probably join the class. On the same day a Junior Bible Readers Class was started, with the following members Mattie, Lucy and Ethel Fleshman, Mary and Lula Irby Vara, Alice, Bet.tie and Eula May Burke, Helen Gregory, Mary Lizzie Paris, Becky Pnrdum, Walter Elliott, Elliott Tanner, Harry Han cock, Nathan Hancock, John Ab bitt and Evant Hunter. _______"}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Wyatt"], "snippet": "following enrolled as members <mark>Wyatt</mark> Abbitt, Mrs. <mark>Wyatt</mark> Abbitt,"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Wyatt"], "snippet": "following enrolled as members <mark>Wyatt</mark> Abbitt, Mrs. <mark>Wyatt</mark> Abbitt,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1610.41, 552.97, 1741.67, 920.35], "bbox_id": "624d3b703d", "file": "TimesVirginian_1980a_0270.pdf", "page": 1, "text": "On Sunday, August 17, the Torrence family as sembled at the Woodman of the World Building in Appomattox for the seven teenth consecutive family reunion. It was a most enjoyable day for. those who could attend. Attending and registering were Mrs. J. L Torrence, Elliott and, Lorraine Tor rence, Dennis, Pat and Zane, Larry, Gloria, Matt and Kim, Mike, Pat Ann, Micah and Wyatt, and Sheila and Mike Lewis. Thelma Conner, Cheryl, Carrell, Todd and Pam, and June Thornhill with Donnie and Ronnie. Also, Alpha Mae and Frank Hancock, Steven and Chip. Also, Uarles and Minerva Torrence, David, Becky. Sherri, Burt and Gene. Aileen Timberlake, James, and Carla .Torrence, Frances and Russell Conner, Russell A. Sambo and Wanda, and Mary C. Garris, Bryant and Kay. Also, Louise T. and Monroe Foster, Garland and Ruby Torrence, Garland Torrence Jr. and Karen, Lorene T, Richardson. Ber-"}, "highlight": {"text": {"matched_tokens": ["Elliott"], "snippet": "Mrs. J. L Torrence, <mark>Elliott</mark> and, Lorraine Tor rence,"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott"], "snippet": "Mrs. J. L Torrence, <mark>Elliott</mark> and, Lorraine Tor rence,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1347.1, 155.43, 2095.27, 639.43], "bbox_id": "9088d14957", "file": "TimesVirginian_1980a_0157.pdf", "page": 1, "text": "news news Again, the Kingdom of and response, Mrs. Eliza- heaven is Ilk unto á bath Evans, pulpit guest, m erchant man, seeking! Rev. James Miller, guest goodly pearls. The regular minister, Rev. Wyatt T. preaching service were held Venable, scripture reading, at the Alabama Baptist St. John 882, St. John 146. Church with the pastor in Subject Know the Truth, charge, Rev. Elliott. Everyone enjgyed the mea- Pray Service were lead by sage. A request for Rev. Mrs. Pearl Bailey and Miss Muter to sing a song. Ruth Jackson, ovoryone A pillow was given to Rev. joined in. and Mrs. Elliott for a gift, Rev. Elliott read Matthew covered with 1-5-20 dollar 1844-45. Theme Hidden bills. Ones donated money, Treasure. Everyone enjoy- Jr. Choir, Dos. and Mrs. ed the message from Pastor Roger Jackson-2.00, Mrs. Elliott. Leasts Thompson-3.00, A large crowd turned out M rs. B ertha King-5.00, to the service. We welcome Mrs. Mary Marsh from aU visitors and friends for W ashington, D.C.-25.00, coming out to help in the Mrs. Hfida Jones-1.00, Mrs. service. V isiting deacons Lucille Anthony, Washing- from Roanoke Baptist, Wb ton. D. C.-26.00, Den. and its Oak Grove, Mt. Lyle. One Mrs. Jasper Lmbert-2.00, friend joined in with the M rs. W yeonia Randolph- Alabama B aptist Church 2.00, Mr. and Mrs. Hylner Christian experience. Mrs. Haakins-5.00, Rev. and Nadine Dianne Johnson Mrs. W yatt Venable-5.00, from Appomattox, Va. 1 Deacon and Mrs. James Remember the rick every- Moore-2.00, Rev. H. O. where. F1ood-10.00, Mr. Linburg Rev.. Elliotts 20th Aimi- Bolden-1.00, Mr. and Mrs. versary was a success. Wo Paul Burrel-1.00, Mr. Is- were so happy to have Mrs. acca Watkins-2.00, Mrs. Elliott at the service. The- Ruth W heeIer-2.00, Mr. program as following The and Mrs. Eddie Bailey-i.00, M. C. was Rev. H. O. Flood. M rs. Pearl Bailev-1.00, The music was rendered by  Deacon and Mrs. Woodrow the New Store B aptist Haakina-5.00. Chprch, with Mrs. Catherine We thank each and every b ik in i a t the piano, one. Pastor tribute given by Scripture reading, Mrs. Mrs. Catherine Haskins. Mary Bailey, prayer, by May God bless each and Dea. James Moore, welcome everyone of you. See you address, Mrs. Alice moore, next time!"}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "The regular minister, Rev. <mark>Wyatt</mark> T. preaching service were"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "The regular minister, Rev. <mark>Wyatt</mark> T. preaching service were"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2034.89, 247.52, 2176.09, 804.7], "bbox_id": "8705317933", "file": "AppomattoxNewspapers_1962-1965a_0197.pdf", "page": 1, "text": "Mr. and Mrs. B. T. Blanks, of Richmond, arrived today to visit Mr. and Mrs. James Crawford.    Miss Dorothy Sears, of Peters burg, is spending the summer months with her mother, Mrs. J. E. Sears. 9 9 9 The Applewhite Circle of the W.M.U. of Liberty Baptist Church will meet with Mrs. G. L. Doss Monday, July 8 at 730 p.m.  9  Mrs. Clarence Franklin and children have returned from a weeks visit in Warrenton. Mrs. R. N. Ashworth and son, Tommy, are on a plane trip to California.  9 9 Miss Claudioe OBrien left Sat urday for New York from where she sailed Tuesday for a six week tour of Europe. She was accompanied to New York by Miss Kate E. .OBrien, of Farm ville, and Mr. and Mrs. Wyatt OBrien, of Chase City.    Miss Ginger Prieto, of St. Petersburg. Fla., is visiting her cousin. Miss Lina Trent.  9  9 Mr. and Mrs. Hugh Martin and Josie Ferguson and daughter, Joella, are on a motor trip through the New England States and Canada. 9 9 9 Mr. and Mrs. Glenn Elliott and two daughters, of Danville, and Mr. and Mrs. Sam Joe Paulette and daughter. Betty, of Halifax, visited Misses Ora and Phyllis Paulette for the week end. 9 9 -. Mr. and Mrs. Ben Wheeler and family are visiting Mr. and Mrs. Elmer Smith at Breaks, Va.    Mr. and Mrs. David M. Trent and two daughters, Brenda and Betty, are spending this week at Williamsburg, with Mr. and Mrs. John Tabb. 9 9 9 Mr. and Mrs. R. S. Dicky OBrien and son, Richard, Jr., of Key West, Fla., are spending several weeks in the hpme of his parents, Mr. and Mrs. J. H. OBrien."}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "and Mr. and Mrs. <mark>Wyatt</mark> OBrien, of Chase City."}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "and Mr. and Mrs. <mark>Wyatt</mark> OBrien, of Chase City."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2127.85, 186.63, 2280.45, 865.75], "bbox_id": "af3bbc5efc", "file": "TimesVirginian_1976_0288.pdf", "page": 1, "text": "God f is our refuge and strength, a very present help in , trouble Pslam 461 -  v The regular preaching ser- , vice - was held at the Alkbama, Baptist Church first Sunday at 1145. Prayer service was lead by Mrs. Alice Moore, and 1 MrS. Joyces Walker f 130 Ovfr pastor, Rev. C. L. Elliott preached A wonderful, t f ify o tg .  SundyYJhe, suhiect Vas  Inii  Pressing On. Everyone seem ed to enjoy tV ,ervi3?ha 1 Senior choir inspiration song j was Bun and See What fend Will Re ,  the Jr. Choir song  was Something Got a Hold of  Me. Everyone joined in  the  spirit was very high. Visting I deacons were from White Oak j Groves- Roanoke Baptist, Mt. ! Lyle.Mulphur Spring. A large  crowd attended the service, j Remarks came from Mrs. Tillie I Berryihan and Mrs. Lillian  Jordan, Sulphur Spring Church i and- Mrs. Ollie Wright, Peaks  Church, Miss Grace Phinous ! and Miss Vetta Bolden, and  Miss Maggie E. Wades adopted ! son, Washington, D.C. We wish  to thank Miss Grace from D.C. ! for her large donation she j brought for building fund. We j thank ?ach and everyone for  coming out to make our service a successful one on the first i Sunday. Prayer goes out to the ! sick,whenever they might be.  Satyrday night, August 14, i 1976 aC 730 there will be a ! 3-way sermon. The speakers j will bp Rev. Wyatt Venable of  Pamplin, Rev. Robert Haskins 1 of New Jersey and Rev. Curtis i Eiliott of Spout Spring. Music j was furnished by the Gospel ! Quintet, Holiness Singers and j i Gospel-No-Names. The pro- j gram was sponsored by Mr. ! Hylner, Haskins. Come out and  enjoy Gods works and songs. Revival will be at the  Alabama Church last week in  August on Monday night. Rev. i C. L. Elliott will be the speaker ! of wek. I Homecoming will be the 1st ! Sunday in September. In the  afternoon the Holiness Singers  and Gospel Quintet will sing. ! Looking to see you there. ?"}, "highlight": {"text": {"matched_tokens": ["Elliott"], "snippet": "pastor, Rev. C. L. <mark>Elliott</mark> preached A wonderful, t"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott"], "snippet": "pastor, Rev. C. L. <mark>Elliott</mark> preached A wonderful, t"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1001.0, 722.64, 1140.88, 900.18], "bbox_id": "10bf5fe1ba", "file": "AppomattoxNewspapers_1974-1975a_0388.pdf", "page": 1, "text": "Fund. Homecoming will be held at Alabama Church on the 5th Sunday in August. Morning service will be preached by Pastor Elliott. Revival will begin Monday night following service by pastor. Rev. Wyatt Venable will preach at Mt. Lyle Church on the 5th Sunday in August. Rev. Venable held his first revival last week at the Mt, Zion Baptist in Green Bay, Va Eleven souls were saved. Remember the sick where ever they might be."}, "highlight": {"text": {"matched_tokens": ["Elliott"], "snippet": "be preached by Pastor <mark>Elliott</mark>. Revival will begin Monday"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott"], "snippet": "be preached by Pastor <mark>Elliott</mark>. Revival will begin Monday"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1961.75, 536.22, 2102.75, 1162.74], "bbox_id": "21fd30c5b2", "file": "AppomattoxNewspapers_1971-1973a_0008.pdf", "page": 1, "text": "f oll owi ng organizations and persons Golden Trumpetters, 10 Holiness Si ngers, 10 Pamplin Little League Baseball Team, the Rev. James Frank lin, Manager, 10. Also Mr .and Mrs. Lander Carr, 3 Mrs. Zena Jeffress, 2 Mrs. Eliza beth Wade, 5 Mr. Richard Calham, 1 Mrs. Bessie Rob inson, 1 Mrs. Annie Wheel er, 1.50 Kyanite Mine of Cul len, Va. 16.50 Mr. and Mrs. Tom Haskins, 10 Mr. Billy Ford, Madisonville, Va. 1 Mrs. R i c h a r d Williams, 5 Mrs. Hazel Burrel, 1 Mr. Jessie Foster, 2 Mr. and Mrs. Milton Berry, 1,25 Mr. and Mrs. James Panell, 2 Elder Elizabeth Freeman, 1 Deacon Earnest Wesley, 2. Mrs. Susie Randolph, 50? Mr. Billy Harvey, 1 Mr. and Mrs. Woodrow Williams,2Mr. Les lie Bolden, 1 Mrs. Eunice Garry, 1 Mr. Phony Ham- lette, 1 Mr. and Mrs. Dayton Dunovant, 1 Mr. and Mrs. Howard Williams, 50? Mr. and Mrs. Stanhope Allen, 2 Mrs. Mary Haskins, 1 Mr. and Mrs. Wyatt Venable, 15 Mrs. Marie Ligon, 1 Brought in by Mrs. Lillie Wiley, 7 Friendly Echo es, 12 Deacon Booker Martin, 1 Mr. Clyde Clark, l.Brought in by Mrs. Eugie Hendericks, 8.75 Deacon Charlie Carring ton donated a jar of money con taining 12 or 13. Holiness Singers donated 10 on a tree. We wish to express thanks again to everyone who helped the Holi ness Singers on this program and thanks to Triumph Baptist Church, Deacons, Pastors and the members and friends. We had an over crowd at the church. Visiting ministers were as fol lows The Rev. James Frank lin, the Rev. James Miller, the Rev. Curtis Elliott. Total of money collected at the church was 476.92. Mrs. Catherine Haskins thanks everyone. On Sunday evening donations to Mrs. Haskins included 25 from  Daughters of the Elks in Farmville and 2 from Mr."}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "1 Mr. and Mrs. <mark>Wyatt</mark> Venable, 15 Mrs. Marie"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "1 Mr. and Mrs. <mark>Wyatt</mark> Venable, 15 Mrs. Marie"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [572.64, 571.23, 719.51, 893.97], "bbox_id": "de8cb68a8e", "file": "TimesVirginian_1976_0171.pdf", "page": 1, "text": "choir Scripture Reading, Mrs. Alice Moore Prayer, Rev. Wyatt Venable Special Song, Hes Sweet I Know by choir Welcome Address, Mrs. Linda Watkins Response, Deacon Hudson Tribute to Pastor, Mrs. Catherine Haskins Motto of Church to our pastor What can we say but thank you Master for our pastor To Mrs. Elliott We thank you Introduction of Guest Minister, Rev. H. 0 . Flood Guest Minister, Rev. James Miller, Service in Charge, Deacon Archer Watkins. Rev. Millers theme was Surrender Yourself to God. V Presentation Gift, Mrs. Bai ley, pinned a corsage on Mrs. Elliott, given by Mrs. C. Haskins. A cake, by Mrs. Mineva Venable, given from Deacon and Mrs. Jessie King. Mrs. Alice Moore, cake given from Deacon and Mrs. Archer Watkins and family. A Bicennt- tennial layer cake, given from Woodrow"}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "Alice Moore Prayer, Rev. <mark>Wyatt</mark> Venable Special Song, Hes"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "Alice Moore Prayer, Rev. <mark>Wyatt</mark> Venable Special Song, Hes"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [528.25, 1156.69, 853.99, 1652.15], "bbox_id": "ccaefa1547", "file": "AppomattoxNewspapers_1918-1922a_0504.pdf", "page": 1, "text": "Cheatham ---- Jen k in s The Crewe Baptist church was the scene of a very pretty wedding Saturday evening, September 10 th, when Miss Mary Esther Jenkins, daughter of Mr. Joseph Phillip Jenkins, became the bride of Mr. George Elliott Cheatham, of Spout Spring, Va. The ceremony was. perform ed by the Rev. W. H. Carter, pastor of the church, assisted by the Rev. J. W. Kincheloe, a former pastor. The church was beautifully decorated in cut flowers, ferns and cathedral candles. Mrs. L. G. Chappell rendered the wedding music, and Mrs R. E. Bacchus, of Norfolk, Va., a cousin of the bride, sang At Dawning. The bride entered with her father, who gave her away. Her wedding gown was made of white georgette, trimmed with silver lace, and the veil was caught with a spray of orange blossoms and she car ried a shower bouquet of brides roses and lillies of the valley. Miss Janet Wyatt, of Richmond, was,the brides maid of honor. She wore a pink taffeta dress trimmed with lace and carried rnssell roses. The matron of honor was Mrs. R. L. Ashburn, Jr., of Norfolk,I-r i , -n Va., another cousin, of the RuiiaboutjRGg. 3251 bride who wore a French dress"}, "highlight": {"text": {"matched_tokens": ["Elliott"], "snippet": "bride of Mr. George <mark>Elliott</mark> Cheatham, of Spout Spring,"}}, "highlights": [{"field": "text", "matched_tokens": ["Elliott"], "snippet": "bride of Mr. George <mark>Elliott</mark> Cheatham, of Spout Spring,"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [2407.86, 164.63, 2552.07, 314.44], "bbox_id": "724aa836fa", "file": "TimesVirginian_1978_0039.pdf", "page": 1, "text": "CANAAN BAPTIST On the first Sunday, Feb. 5, at 3 p.m. The Youth Club will sponsor a program. The guest speaker will be Rev. Wyatt Venerable and a ringing group of his choice. Mrs. Mary Randolph will be in charge. Regular preaching service, IFeb. 12. 1130 a.m. Rev. C. L. Elliott, pastor in charge. The Junior Choir will render the music. Please come and worship with us."}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "speaker will be Rev. <mark>Wyatt</mark> Venerable and a ringing"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "speaker will be Rev. <mark>Wyatt</mark> Venerable and a ringing"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [288.71, 219.27, 422.05, 634.4], "bbox_id": "7df12f9180", "file": "TimesVirginian_1980a_0369.pdf", "page": 1, "text": "and Gospel Q uintet , of PampHn, Va. Thanksgiving night at 7 00 there will be a prayer service and Revi Wyatt Venable willpreach. Deacon William Venable preached his trial semton at White Oak Grove Baptist Sunday night. A large crowd turned out to the service and music was rendered by the Holiness Singers and Mr. Joyce Walker and Mrs., Mary Bailey. 1 Rev. Wyatt Venable was in charge of devotions. Rev. Waiter Singletary gave the prayer, scripture was given by Rev. Me, Johnson II Timothy 4-8 verse. Dedica tion prayer was offered by Rev. H. 0 Flood, special song. Rev. Curtis Elliott, Wont Have- To Cry No More, Rev. John Edwards was  present also. Rev. William Venable offered encouraging words. Rev. William Venable preached a splendid sermon. It was nronderful. Scripture was taken from Matthew 26 fel- 22  II Cor. 13-5 verse. Subject Look and Examine Yourself. Donations were good. Rev. Venable thanked each and everyone for coming out. MC. pastor Hendericks. See you next time! I-- i"}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "prayer service and Revi <mark>Wyatt</mark> Venable willpreach. Deacon William"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "prayer service and Revi <mark>Wyatt</mark> Venable willpreach. Deacon William"}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [1980.66, 140.64, 2133.55, 919.69], "bbox_id": "94adbef55b", "file": "TimesVirginian_1976_0017.pdf", "page": 1, "text": "Alabama Baptist Church yf m4 - And if I go and prepare a place for you.,1 will come again, and receive you unto myself, that where I am,, there ye may be also. Happy New Year To Everyone. The Alabama Baptist Church greets each and everyone in the name of Jesus, In the New Year 1976. We were happy to have Service the first Sunday in the New Year. With our pastor On duty, a large crowd attended our church service in the new. year. Our service began with prayer. Deacon James Moore, from Mt. Lyle Baptist Church read the scripture Prayer by Deacon Archer Watkins Spec ial song lead by Sister Alice Moore, Prayer Wheel Keep on Turning, song by Senior and Junior choir of church. Rev. E lliott opened the morning service with Rev. Wyatt Venable reading the scripture. Deacon Eddie Han cock with prayer, Special song lead by Mrs. Haskins, Some body Touch Me. Rev. Elliotts subject was If Jesus Go With, Me I Will Go., taken from 13 chap. St. John 14-16-33 verse 14 chap. St. John - 3 verse. Everyone really enjoyed the sermon. The offering was very good. Visiting deacons from following  churches Roanoke Baptist, Mt Lyle, White Oak Grove.. Special prayer went out to all the sick members and specicial prayer for Emmanuel Venable, Isaac Watkins and Deacon Levi Harvey. We thank each and everyone for coming out, to make a service a success. The Holiness Singers render ed a program at New Store Baptist Church at 4. And it was a great _ success. Rev. W yatt Venable, pastor, visiting minis ters were Rev. Curtis Elliott and JVfr-s. Elliott of Alabma Baptist Church"}, "highlight": {"text": {"matched_tokens": ["Wyatt"], "snippet": "morning service with Rev. <mark>Wyatt</mark> Venable reading the scripture."}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt"], "snippet": "morning service with Rev. <mark>Wyatt</mark> Venable reading the scripture."}], "text_match": 1155199671761633401, "text_match_info": {"best_field_score": "1112386306048", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199671761633401", "tokens_matched": 2, "typo_prefix_score": 0}}
{"document": {"bbox": [271.7, 1187.87, 412.07, 1251.92], "bbox_id": "224c12c1bc", "file": "TimesVirginian_1976_0245.pdf", "page": 1, "text": "Sunday morning. On Sunday, July 4, at 330 p.m. Rev. Wyatt Venable and the Alabama Choir will be our guest as we celebrate Rev. C. L. Elliotts anniversary. Plan"}, "highlight": {"text": {"matched_tokens": ["Wyatt", "Elliott"], "snippet": "Sunday morning. On Sunday, July 4, at 330 p.m. Rev. <mark>Wyatt</mark> Venable and the Alabama Choir will be our guest as we celebrate Rev. C. L. <mark>Elliott</mark>s anniversary. Plan"}}, "highlights": [{"field": "text", "matched_tokens": ["Wyatt", "Elliott"], "snippet": "Sunday morning. On Sunday, July 4, at 330 p.m. Rev. <mark>Wyatt</mark> Venable and the Alabama Choir will be our guest as we celebrate Rev. C. L. <mark>Elliott</mark>s anniversary. Plan"}], "text_match": 1155199637401895033, "text_match_info": {"best_field_score": "1112369528832", "best_field_weight": 15, "fields_matched": 1, "num_tokens_dropped": 0, "score": "1155199637401895033", "tokens_matched": 2, "typo_prefix_score": 1}}
